{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "782594 56, Ingredients : Aqua / Water, Glycerin, Homosalate, Octocrylene, Ethylhexyl Salicylate, Alcohol Denat., Butyl Methoxydibenzoylmethane, Hydrogenated Polyisobutene, Bis-Peg-18 Methyl Ether Dimethyl Silane, Dimethicone, Cetearyl Alcohol, Peg-100 Stearate, Peg-20, Petrolatum, Cetyl Alcohol, Tuber Aestivum Extract, Butyrospermum Parkii Butter / Shea Butter, C13-14 Isoparaffin, Saccharomyces/Xylinum/Black Tea Ferment, Glyceryl Stearate, Tuber Melanosporum Extract, Dimethiconol, Dimethyl Isosorbide, Cetearyl Glucoside, Neohesperidin Dihydrochalcone, Sodium Citrate, Sodium Cocoyl Glutamate, Sodium Hyaluronate, Sodium Hydroxide, Cyclodextrin, Adenosine, Vigna Aconitifolia Seed Extract, Mannitol, Disodium Edta, Disodium Succinate, Propylene Glycol, Hydrolyzed Cicer Seed Extract, Hydroxyethylcellulose, Capryloyl Salicylic Acid, Citric Acid, Laureth-7, Xanthan Gum, Biotin, Faex Extract / Yeast Extract, Polyacrylamide, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Octyldodecanol, Bht, Tocopherol, Tocopheryl Acetate, Potassium Sorbate, Sodium Benzoate, Sodium Dehydroacetate, Sodium Salicylate, Phenoxyethanol, Ci 14700 / Red 4, Ci 19140 / Yellow 5, Linalool, Geraniol, Alpha-Isomethyl Ionone, Limonene, Hydroxycitronellal, Citronellol, Hexyl Cinnamal, Benzyl Alcohol, Benzyl Salicylate, Parfum / Fragrance. (F.I.L. B204837/1). Please be aware that ingredient lists for the products of our brand are updated regularly. Please refer to the ingredient list on your product package for the most up to date list of ingredients to ensure it is suitable to your personal use."
    },
    {
      "name": "Size",
      "value": "50mL"
    },
    {
      "name": "Unit Price",
      "value": "$50.00 per 100mL"
    },
    {
      "name": "Country Of Origin",
      "value": "Imported"
    }
  ],
  "brand": "L'Oreal",
  "createdAt": "2022-11-24T22:43:51.834Z",
  "description": "L'Oreal Age Perfect Cell Reduction Day Cream",
  "image": {
    "@type": "ImageObject",
    "height": 300,
    "mime": "image/jpeg",
    "url": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/1/4/7/1476800.jpg",
    "width": 300
  },
  "name": "Age Perfect Cell Reduction Day Cream",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 25,
    "lowPrice": 25,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-24T22:43:51.833Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "25.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/loreal-day-cream-age-perfect-cell-renewal"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/loreal-day-cream-age-perfect-cell-renewal"
  ],
  "sku": "1476800",
  "updatedAt": "2022-11-24T22:43:51.833Z"
}
