{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Ajax"
  },
  "createdAt": "2022-12-06T01:17:01.290Z",
  "description": "Ajax Hospital Grade Antibacterial Disinfectant is a Multi-Purpose Cleaner for easy grease and stain removal. Instantly cuts through more stains, dirt, grease and grime.<br><br>Ajax Hospital Grade Antibacterial Disinfectant Multipurpose cleaner kills 99.9% of germs, including Covid-19, Salmonella, E. coli, Staphylococcus aureus and Enterococcus, all that’s left is a clean and healthy surfacehome.<br><br>- Powerful instant degreaser<br>- Easy grease and stain removal<br>- Cuts through soap scum<br>- Grease cutting power<br>- Our most effective Ajax multipurpose cleaner*<br>- Leaves behind a shine & great fresh Lemon fragrance<br>- No harsh fumes<br>- 100% Recyclable Bottle & Trigger (Does not include sleeve)<br><br>Our Australian made formula cleans your homebathroom killing 99.9% of germs and cutting through grease, dirt, soap scum, grime and stains.<br><br>Directions for use: Simply spray and wipe. <br><br>To Disinfect: thoroughly wet your non-porous surface, wait 10 minutes then wipe clean.<br><br>Size: 500mL<br>Scent: Lemon Cleanse<br><br>Hard surface disinfectant only. Not to be used on skin. Always read the label. Follow the directions for use. Contains Lactic Acid.<br><br>*vs Ajax Spray n' Wipe<br><br>HOSPITAL GRADE MULTIPURPOSE CLEANER: Ajax Hospital Grade Antibacterial Disinfectant Multipurpose Cleaner is suitable for multi surfaces<br><br>ANTIBACTERIAL CLEANER: Kills 99.9 percent of germs and cuts through grease, grime, stains and soap scum<br><br>DISINFECTANT CLEANER: To disinfect surfaces, thoroughly wet your non-porous surface, wait 10 minutes then wipe clean<br><br>FRESH SCENT: Leaves behind a shine & great fresh Lemon fragrance when you spray and wipe<br><br>AUSTRALIAN MADE: Proudly made in Australia with a 100 percent recyclable bottle and trigger (does not include sleeve)",
  "gtin13": "8850006945407",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/215114.jpg",
  "name": "Ajax Hospital Grade Disinfectant Multipurpose Lemon Cleaner 500ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 5,
    "lowPrice": 5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T01:17:01.289Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/215114/ajax-hospital-grade-disinfectant-multipurpose-lemon-cleaner"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/215114/ajax-hospital-grade-disinfectant-multipurpose-lemon-cleaner"
  ],
  "sku": "215114",
  "updatedAt": "2022-12-06T01:17:01.289Z"
}
