{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Aqua One"
  },
  "createdAt": "2022-12-06T18:42:08.476Z",
  "description": "<h1><strong><span>Aqua One Aquarium Heater 100W</span></strong></h1>\n\n<p>Our pet fish originate from all over the globe and water temperatures can vary greatly between their different native environments. To be able to keep fish in an environment which is consistent with their natural habitat, we often need to maintain a water temperature above normal room temperature. Temperature extremes and fluctuations make fish susceptible to stress and diseases such as white spot (Ick!). An aquarium heater is a must have to prevent your water temperature dropping too low or changing too quickly.</p>\n\n<p>The Aqua One Glass Heater range has a sensitive and reliable thermostat that will keep your water at the perfect temperature for your fish throughout the cooler months. Easy to install and use, it will regulate the water temperature for your fish and ensure your aquarium is protected from the effects of low or fluctuating temperatures. All good fish keepers know that an aquarium thermometer is also a must have with any heated aquarium.</p>\n\n<p>The Aqua One Glass Heater range provides the perfect solution for each aquarium set up by producing high quality and economical heaters that are completely submersible with double insulation. Complete with heater thermostat with easy to use temperature settings, easy to read temperature guide and automatic shut off and 'on' light. Suitable for marine and tropical aquariums.</p>",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/1073955093.jpg",
  "name": "Aqua One 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 37.6,
    "lowPrice": 37.6,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T18:42:08.476Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 37.6,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073955093/aqua-one-100w-glass-aquarium-heater"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073955093/aqua-one-100w-glass-aquarium-heater"
  ],
  "sku": "1073955093",
  "updatedAt": "2022-12-06T18:42:08.476Z"
}
