{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "BABY TREND"
  },
  "createdAt": "2022-11-22T12:23:57.000Z",
  "description": "Get Ready for your outdoor adventure with the exclusive Baby Trend Expedition 2-in-1 Stroller Wagon! Designed with utility, safety and style, the Expedition 2-in-1 Stroller Wagon is for the family that loves outdoor activities and discovery. The super large cargo space with built-in seating and the two 3-point safety harness belt allows kids to explore with safety. Plus, the extra-large ratcheting canopy with UPF 50+ protection and air-flow mosquito netting keeps your little ones away from the harmful sun-rays and rain. Parents will also love the Ultimate Storage Solutions, which includes parent and child trays with 2 cup holders and center consoles, plus 2 additional cup holders outside of the wagon. The Baby Trend Expedition 2-in-1 Stroller Wagon is equipped with easy one button removable 11\" rear wheels and durable 8\" front wheels for easy maneuverability. With the Hideaway Pull Handle, parents can easily transform the ‚Äö√Ñ√∫Push‚Äö√Ñ√π stroller into a ‚Äö√Ñ√∫Pull‚Äö√Ñ√π wagon mode. The compact flat fold allows the wagon to be easily stored and transported.           Hideaway Pull Handle easily allows the Tour to transform from a push stroller to pull a wagon mode         Super large Cargo Space with Built-in Seating for two, includes 3-point safety harness belt         Ultimate Storage Solutions: includes parent and child trays with 2 cup holders and center consoles, plus 2 additional cup holders outside of the wagon         Extra-large ratcheting canopy with UPF 50+ protection and air-flow mosquito netting         Easy One-press Removable and durable 11 rear and 8 front wheels with suspension         Large and easy push brakes         Compact flat fold for storage and travel         Weight capacity: Stroller Wagon: Sit upright unassisted (6+Months) ~ 22.67 kg per seat, total weight limit up to 45.35 kg   Item Dimensions Approx: x 121.9 x 66.675 x109.22cm (L x W x H)     Includes:  1x Expedition 2 in 1 Stroller Wagon Evening Grey",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/1073847306.jpg",
    "width": 1200
  },
  "name": "Baby Trend 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 379,
    "lowPrice": 379,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-22T09:48:00.354Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 379,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073847306/baby-trend-expedition-2-in-1-stroller-wagon-evening-grey"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073847306/baby-trend-expedition-2-in-1-stroller-wagon-evening-grey"
  ],
  "sku": "1073847306",
  "updatedAt": "2022-11-22T09:48:00.354Z"
}
