{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Beauty’s Got Soul"
  },
  "createdAt": "2022-11-22T23:42:01.604Z",
  "description": "This Super Cute Newborn Baby Gift Hamper is the perfect present for the new little one in your life. Hand curated by Australian brand Beauty's Got Soul for Soul Baby Gifts, the hamper is packed with perfect presents from other exceptional Australian brands including Sapling Child, Wilson and Frenchy, Weegoamigo, and Bowhill. \nHere's what's inside:\nSapling Child Dove Grey Organic Heart Pants Size 3 to 6 Months\nPappe Organic White Knot Hat Size 3 to 6 Months\nPappe Bowhill Organic White Short Sleeve Baby Onesie Size 3 to 6 Months\nWilson and Frenchy Organic Stripe Bunny Rug Clay 100cm x 100cm\nWeegoamigo Avocado Crochet Rattle Toy\nPacked neatly into a Soul Baby Gifts Grey Suitcase for Mini Memories.\nDetails on each item:\nSapling Child Dove Grey Organic Heart Pants: Made with Beautiful 100% certified GOTS organic cotton. Dyed with GOTS approved water based dyes. Features a stitched in elastic drawstring for easy adjustment. Extra length in the cuffs allows for rolling up or down for the perfect fit.\nPappe Bowhill Organic White Short Sleeve Baby Onesie: A new take on a Pappe classic, this onesie is an essential. Pure, organic Turkish cotton long-sleeved style with Peter Pan collar and picot trim, is durable and has a soft touch to supple skin of your baby. 100% Turkish organic cotton. Gentle warm machine wash.\nWilson and Frenchy Organic Pointelle Bunny Rug: Foundered in Melbourne by a mother of two children, Wilson & Frenchy is a proudly Australian brand with a sustainable and high quality approach to babywear. Organic cotton pointelle knit with added stretch.\nPappe Organic White Knot Hat: The perfect top-knot for a head that still has very little hair – this organic baby knot hat in crisp white is a classic you will turn to time and time again. Made from the highest quality yarn of its kind, this organic Turkish hat is perfect for brisk mornings. Made from 94% organic Turkish cotton, 6% of organic elastane jersey, with the fit a primary concern on Australian company.\nWeegoamigo Avocado Crochet Rattle Toy: This Weegoamigo crochet rattle is handmade from 100% Cotton yarn and is terrifically tactile for little hands.\nSoul Baby Gifts Suitcase for Mini Memories: Measures 14cm wide, 19cm long and 9cm high.",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/1073890928.jpg",
    "width": 1200
  },
  "name": "Beauty’s Got Soul 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 210,
    "lowPrice": 210,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-22T23:42:01.604Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 210,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073890928/beauty-s-got-soul-for-soul-baby-gifts-super-cute-newborn-gift-hamper"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073890928/beauty-s-got-soul-for-soul-baby-gifts-super-cute-newborn-gift-hamper"
  ],
  "sku": "1073890928",
  "updatedAt": "2022-11-22T23:42:01.604Z"
}
