{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 7,
    "ratingValue": 4.71428571428571
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Bic"
  },
  "createdAt": "2022-12-06T14:16:47.882Z",
  "description": "A later version of the classic and original one-piece BIC razor for men, the BIC 2 Sensitive twin-blade razor has stainless steel blades coated in chrome and polymer for durability. The blades are specially angled so you can expect a comfortable smoother shave than a BIC single-blade razor and great value for money. The slim fixed head is designed for precision. The handle is also designed for accurate handling and a no-nonsense shaving experience. Quickly and efficiently tame that stubble with this lightweight men?s razor that?s also easily portable for whenever you need a shave. BIC has over 40 years of experience in designing and manufacturing razors, so this is expertise you can count on. Every blade is made in Europe at BIC?s own state-of-the-art plants where each razor undergoes stringent quality controls. Legendary BIC quality and value.\n\n- The twin-blade BIC 2 Sensitive disposable razor for men has stainless steel blades for a close and comfortable shave\n- The slim fixed head is engineered to more easily tackle hard-to-reach areas for a clean shave\n- A twin-blade razor that?s quick and efficient with stainless steel blades coated in polymer and chrome for durability\n- The long green handle is designed for accurate handling and control\n- Delivers a smoother shave than the single-blade BIC 1 disposable razor for men",
  "gtin13": "3086127501115",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/196087.jpg",
  "name": "Bic Razor Disposable Twin Easy Sensitive 10 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 2.5,
    "lowPrice": 2.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T14:16:47.881Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 2.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/196087/bic-razor-disposable-twin-easy-sensitive"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/196087/bic-razor-disposable-twin-easy-sensitive"
  ],
  "sku": "196087",
  "updatedAt": "2022-12-06T14:16:47.881Z"
}
