{
  "@type": "Product",
  "additionalProperty": [
    {
      "@type": "NutritionInformation",
      "calories": "Negligible",
      "carbohydrateContent": "0g",
      "dietary_fibre": "-",
      "fatContent": "0g",
      "name": "nutrition",
      "proteinContent": "0g",
      "saturatedFatContent": "0g",
      "servingSize": "100 g",
      "sodiumContent": "Negligible",
      "sugarContent": "0g"
    }
  ],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Bushells"
  },
  "createdAt": "2022-11-22T13:09:34.495Z",
  "description": "BUSHELLS TEA BAG BLUE LABEL 100S 182 GR  We all have friends, family or colleagues who might be struggling to open up. In fact, 1 in 3 Aussies feel stressed, anxious or sad and depressed every day, which means someone you know probably needs a bit of support.That's why Bushells are proud supporters of Lifeline. Because nothing opens up a good conversation like a great cup of tea! There's no better time to talk than now! Our classic Blue Label is a well-rounded tea for a good Australian cuppa any time of day. This distinctively smooth and full-flavoured tea blended to taste the same as the original Bushells launched in Queensland in 1883. Australia’s first tea company, Bushells have brewed full flavoured conversations and friendships for over 130 years. Bushells has a long tradition of bringing Australians together for a good chat over a great cuppa, blended especially for Aussie tastes. We’ve been part of Australian life for over a century, and proud to be a familiar icon that Aussies have grown up with – a delicious taste of home. Bringing people together for a good chat and a great cuppa is our passion – which is why we support and reinvest in organisations that help ordinary Australians.  Bushells has partnered with Lifeline to team up by being there for more Australians and get the conversation flowing.  Bushells is committed to creating a high-quality cuppa, with the full flavour Australians know and love.  A simple How are you? goes a long way. Start a conversation, there's no better time to talk than now!  Bushells is committed to creating a high-quality cuppa, with the full flavour Australians know and love.  Makes a good Australian cuppa any time of day  Available in 50 and 100 teabag packs.",
  "gtin13": "9310062021105",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/036655.jpg",
    "width": 1200
  },
  "name": "Bushells Blue Label Black Tea 100 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 4,
    "lowPrice": 4,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-22T13:09:34.494Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 4,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/36655/bushells-blue-label-black-tea"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/36655/bushells-blue-label-black-tea"
  ],
  "sku": "36655",
  "updatedAt": "2022-11-22T13:09:34.494Z"
}
