{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Chicco"
  },
  "createdAt": "2022-11-22T22:53:07.000Z",
  "description": "The crib is better than the cot during the first few months of the baby's life. Its enveloping shape and compact design make the baby safer and happier, transmitting the feeling of being in a protected environment, somewhat similar to the uterus and making the transition from uterine to extrauterine life more pleasant, natural and gradual.  With Chicco Juvenile Crib Next2Me Air Dark Beige 0m+, you and your baby can spend quieter nights and you will be able to cuddle and breastfeed him every time he wakes up.  In this way, the bond between mom, dad and baby will be even stronger and the night more peaceful.  Easy to install, the Chicco Next2Me Air cot is equipped with a simple hooking system suitable for all types of beds, even those with drawers. In case of need, Chicco Next2Me Air can also be used as an independent cradle, in the child's bedroom or in other rooms, accompanying you during your chores at different times of the day thanks to the presence of two practical wheels.  Wrap-around mesh for better ventilation All sides of the crib are covered with a net to ensure optimal air circulation and to allow parents to see the baby at all times.  Practical, safe and ideal for any bed The crib is equipped with a simple and safe attachment system that allow a solid attachment to the bed through 2 belts.  Fits most beds, including those with drawer, thanks to folding feet and 6-level height adjustment.  Chicco Next2Me Air can also be used as an independent crib detached from the bed of mum and dad, in the baby's room or in the living room during the day. In this way, your baby will always be close to you, also thanks to the presence of 2 wheels that make the cot very easy to move.  Comfortable as a nest The crib can be used at a slight angle to reduce regurgitation or in case of nasal congestion.  The soft mattress offers the child the right support, always guaranteeing air circulation.  In addition, for sweet sleep, you can choose from a large variety of coordinated accessories for every taste and season.  Dimensions when open: 94 x 66/81 x 69 cm (WxHxD) Closed dimensions: 57 x 20 cm (WxH) Colour: Dark Beige Weight: 9 kg From to: 0 m - 6 m / 9 kg  Includes: 1x Crib  Recommended Age Range: 0 months+",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/1073955521.jpg",
    "width": 1200
  },
  "name": "Chicco 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 429,
    "lowPrice": 429,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-22T14:19:33.883Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 429,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073955521/chicco-juvenile-crib-next2me-air-dark-beige-0m-"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073955521/chicco-juvenile-crib-next2me-air-dark-beige-0m-"
  ],
  "sku": "1073955521",
  "updatedAt": "2022-11-22T14:19:33.883Z"
}
