{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Cadbury Dairy Milk Bauble Full Cream Milk, Sugar, Cocoa Butter, Cocoa Mass, Milk Solids, Emulsifiers (Soy Lecithin, 476), Flavours. Carmello Bauble Full Cream Milk, Sugar, Glucose Syrup, Cocoa Butter, Cocoa Mass, Milk Solids, Sweetened Condensed Milk, Vegetable Fat, Invert SUgar, Emulsifiers (Soy Lecithin, 476, 471), Acidity Regulator (331), Flavours, Salt. Cadbury Dairy Milk Santa Full Cream Milk, Sugar, Cocoa Butter, Cocoa Mass, Milk Solids, Emulsifiers (Soy Lecithin, 476), Flavours. Magical Elves Full Cream Milk, Sugar, Cocoa Butter, Cocoa Mass, Milk Solids, Popping Candy (Sugar, Glucose, Milk Solids, Carbon Dioxide), Emulsifiers (Soy Lecithin, 476), Flavours. Hazelnut Piece Full Cream Milk, Sugar, Cocoa Butter, Cocoa Mass, Milk Solids, Hazelnuts, Emulsifiers (Soy Lecithin, 476), Flavours."
    },
    {
      "name": "Allergen",
      "value": "Contains Hazelnuts, May Be Present Tree Nuts, May Be Present Peanuts, May Be Present Wheat, May Be Present Gluten, Contains Soy, Contains Milk"
    },
    {
      "name": "Servings Per Pack",
      "value": "21.0"
    },
    {
      "name": "Warning",
      "value": "We do not guarantee that all units will be in this pack. Should it be necessary to leave out a particular unit at any time, it will be replaced by another of equal quality."
    },
    {
      "name": "Size",
      "value": "520g"
    },
    {
      "name": "Unit Price",
      "value": "$1.92 per 100G"
    },
    {
      "name": "Country Of Origin",
      "value": "Made in Australia"
    }
  ],
  "brand": "Cadbury",
  "createdAt": "2022-12-06T20:59:43.145Z",
  "description": "100% sustainably cocoa. Cocoa lifeCadbury believes that sustainably sourced cocoa does good - for farmers, their communities and our planet. Cadbury Dairy Milk SantaCadbury Dairy Milk Caramello BaubleCadbury Dairy Milk BaubleCadbury Magical Elves with Popping CandyCadbury Dairy Milk Hazelnut piece",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/5/4/5/5455697.jpg",
  "name": "Christmas Tree Giftbox",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 10,
    "lowPrice": 10,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/OutOfStock",
        "availabilityStarts": "2022-12-06T20:59:43.145Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "10.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/tree-giftbox"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/tree-giftbox"
  ],
  "sku": "5455697",
  "updatedAt": "2022-12-06T20:59:43.145Z"
}
