{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 10,
    "ratingValue": 4.3
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Colgate"
  },
  "createdAt": "2022-11-23T22:11:31.596Z",
  "description": "Colgate Total Antibacterial Charcoal Deep Clean Toothpaste active cleaning formula fights plaque between teeth and hard to reach places, and provides a superior clean with stronger 12 hour bacterial defense***Colgate Total® Antibacterial Fluoride toothpaste has a unique formula that keeps your whole mouth healthy by fighting bacteria on teeth, tongue, cheeks, and gums for 12 hours*. Colgate Total Charcoal Deep Clean, active cleaning formula fights plaque even between teeth and hard to reach spaces**.A Healthier YouEvery day, we make it our mission to get you feeling your best - and we believe a healthy mouth makes a difference in being ready for what's ahead.So we are truly excited that you've chosen us to help you step forward confidently into life, with a smile that's healthy as can be.Colgate Total Whole Mouth Health Toothpaste helps to:• Prevents cavities• Remove plaque• Protect enamel• Prevent tartar buildup• Freshen breath• Whiten teeth• Protect gumsNo Colgate Toothpaste contains Sugar. Colgate Total toothpaste are also Vegan, Gluten Free and Responsibly Made^Recommended by: The Australian Dental Association (ADA) & New Zealand Dental Association (NZDA).Boxed contents: 1 ToothpasteSize: 200g*With 4 weeks of continuous use**vs. a regular fluoride toothpaste***vs. ordinary non-antibacterial fluoride toothpastes, with 4 weeks of continued use^To learn more, visit colgatepalmolive.com/responsibly-madeWHOLE MOUTH HEALTH: Brushing with Colgate Total Toothpaste will help improve your teeth, tongue, cheeks and gum health.STRONGER 12-HOUR BACTERIAL DEFENSE: Use Colgate Total Antibacterial Toothpaste for a stronger 12 hour bacterial defense***CHARCOAL DEEP CLEAN: active cleaning formula fights plaque between teeth and hard to reach spacesCAVITY PROTECTION: Formula helps to remove plaque with brushing and prevents buildup of cavities and tartarADDITIONAL BENEFITS: Freshens breath, protects gums and enamel",
  "gtin13": "8850006932711",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/065172.jpg",
    "width": 1200
  },
  "name": "Colgate Total Charcoal Deep Clean Antibacterial Toothpaste 200g",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 10,
    "lowPrice": 10,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:11:31.560Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 10,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/65172/colgate-total-charcoal-toothpaste?"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/65172/colgate-total-charcoal-toothpaste?"
  ],
  "sku": "65172",
  "updatedAt": "2022-11-23T22:11:31.560Z"
}
