{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Colgate"
  },
  "createdAt": "2022-12-06T10:31:07.777Z",
  "description": "Colgate Deep Clean Replaceable Brush Head refills, fits any Colgate ProClinical Electric Toothbrush. Made with soft thin-tipped bristles to sweep along the gumline, for healthier gums in 4 weeks*.<br><br>Colgate Deep Clean replacement toothbrush heads fits any Colgate ProClinical Electric Toothbrush. <br><br>The deep clean brush head refills has soft thin tipped bristles and designed for healthier gums in 4 weeks*.<br><br>The deep clean electric toothbrush replaceable head features:<br>- Compact head to clean back teeth<br>- Soft thin-tipped bristles sweep along gum line<br>- Power tip bristles clean hard-to-reach areas<br>- Tongue and cheek cleaner helps remove odour causing bacteria<br><br>Pack Includes: 2 x soft deep clean refill heads for Colgate Pro Clinical Electric Toothbrush<br><br>Dentists and hygienists recommended replacing your toothbrush refill every 3 months.<br><br>After use, rinse toothbrush head thoroughly, shake off excess water, and store upright.<br><br>*vs. a manual flat-trim toothbrush<br><br>REPLACEMENT ELECTRIC TOOTHBRUSH HEAD: Refill any Colgate ProClinical Toothbrush with Colgate PRO Clinical replaceable deep clean brush heads<br><br>SOFT BRISTLES: Designed with soft thin-tipped bristles sweep along gum line<br><br>POWER TIP BRISTLES: clean hard to reach areas<br><br>TONGUE CLEANER: Electric toothbrush head comes with a tongue and cheek cleaner to help remove odour causing bacteria<br><br>PACK INCLUDES: 2 x soft deep clean refill heads for Colgate Pro Clinical Electric Toothbrush",
  "gtin13": "9300632081820",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/576394.jpg",
  "name": "Colgate Proclinical Deep Clean Electric Toothbrush Refill 2 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 9,
    "lowPrice": 9,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T10:31:07.776Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 9,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/576394/colgate-proclinical-deep-clean-electric-toothbrush-refill"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/576394/colgate-proclinical-deep-clean-electric-toothbrush-refill"
  ],
  "sku": "576394",
  "updatedAt": "2022-12-06T10:31:07.776Z"
}
