{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Colgate"
  },
  "createdAt": "2022-12-06T10:31:52.369Z",
  "description": "<p>Colgate Optic White Pro Series Electric Power Toothbrush starts whitening from day 1^. The electric toothbrush has dual brushing modes, multi-directional sonic vibrations and a rechargeable battery that lasts up to 10 days*.</p><p>Experience a powerful yet gentle clean with the Colgate Optic White Pro Series Whitening Electric Toothbrush with dual brushing modes. Starts whitening from day 1^. <br/><br/>The Colgate ProClinical 500R Whitening Electric Toothbrush with dual brushing modes features 30,000 strokes per minute for a daily clean and 20,000 strokes per minute for a gentle clean. It has multi-directional sonic vibrations, a quiet design and is easy to control. The rechargeable battery lasts up to 10 days* and comes with a travel case for convenience on the go. <br/><br/>Pack contents include:<br/>- 1 x Red Rechargeable toothbrush<br/>- 1 x Whitening replaceable brush head<br/>- 1 x Travel case<br/>- 1 x Charger (AU plug)<br/><br/>Features of the teeth whitening replaceable brush head:<br/>1. Compact head to clean back teeth<br/>2. Spiral bristles help remove surface stains<br/>3. Soft rubber strips polish teeth<br/>4. Soft, thin-tipped bristles sweep along gum line<br/>5. Tongue and cheek cleaner helps remover odour causing bacteria<br/><br/>For optimal care, replace your brush head every 3 months and visit your dentist at least twice a year.<br/><br/>^by removing surface stains. Results may vary.<br/>* when brushing twice daily.</p><p>ELECTRIC TOOTHBRUSH: Colgate Optic White Pro Series Teeth Whitening Electric Powered toothbrush has dual brushing modes and multidirectional sonic vibrations</p><p>START WHITENING FROM DAY 1^: Spiral bristles help remove surface stains and rubber strips polish your teeth (Results may vary)</p><p>SOFT BRISTLES: Soft, thin-tipped bristles sweep along gum line for a gentle clean</p><p>TRAVEL CASE: Pack includes a convenient travel case, so you can keep with your oral care routine when you are travelling</p><p>RECHARGEABLE BATTERY: that lasts up to 10 days (when brushing twice daily), AU charger included.</p>",
  "gtin13": "8850006933268",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/078345.jpg",
  "name": "Colgate Proclinical 500r Whitening Sonic Electric Toothbrush 1 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 70,
    "lowPrice": 70,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T10:31:52.368Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 70,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/78345/colgate-proclinical-500r-whitening-sonic-electric-toothbrush"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/78345/colgate-proclinical-500r-whitening-sonic-electric-toothbrush"
  ],
  "sku": "78345",
  "updatedAt": "2022-12-06T10:31:52.368Z"
}
