{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Colgate"
  },
  "createdAt": "2022-12-06T10:25:28.683Z",
  "description": "<p>Remove 10 years of yellow stains* on your teeth and reveal a whiter looking smile with Colgate Optic White Renewal Vibrant Clean Teeth Whitening Toothpaste.<br/><br/></p><p>Colgate Optic White Renewal Vibrant Clean Teeth Whitening Toothpaste removes 10 years of yellow stains*<br /><br />Did you know that yellow stains, as well as other types of stains, can build up on the inside as well as the outside of your teeth? Colgate Optic White Renewal contains 3% hydrogen peroxide, which is clinically proven to whiten your teeth inside and out. Take years off your smile with Colgate Optic White Renewal.<br /><br />- Remove 10 years of yellow stains*<br />- Powered by Hydrogen Peroxide, the whitening ingredient dentists use<br />- Proven to deeply whiten beyond surface stains<br />- Enamel safe for daily use<br /><br />Boxed Contents: 1 x Teeth Whitening Toothpaste<br />Size: 85g <br /><br />Causes of tooth discolouration - certain foods and beverages can cause teeth to become discoloured. These include coffee, tea and wine. Smoking also causes teeth to become discoloured.<br /><br />Types of teeth stains:<br />1. Extrinsic Stains - an extrinsic tooth stain is a stain on the outer part of the tooth. These stains make their home on your enamel, which is the layer that protects the softer part of the tooth (dentine) underneath. Enamel comes into contact with everything you eat or drink and can adsorb some of the pigment over time, causing a stain.<br /><br />2. Intrinsic Stains - intrinsic stains happen when pigments become incorporated in the enamel structure. Dentine is naturally darker and more yellow in colour than enamel. Dentine is more visible when enamel is thinned or worn down from abrasion, which can result from hard toothbrushing; or erosion, which can occur from the ingestion of acidic foods and drinks amongst other things.<br /><br />Teeth whitening treatments - there are many at-home treatment options available including using a whitening toothpaste, mouthwash or whitening pen. Colgate Optic White toothpastes contain hydrogen peroxide. Hydrogen peroxide works by removing extrinsic and intrinsic stains. Other whitening toothpastes use high cleaning silica, which helps to remove surface stains on the outer layer of the teeth.<br /><br />*With twice daily brushing for 4 weeks. Individual results may vary</p><p><br/><br/>REVEAL A WHITER LOOKING SMILE: Colgate Optic White Renewal Vibrant Clean is a teeth whitening toothpaste for a whiter smile<br/><br/>REMOVES STAINS: Colgate Optic White Renewal toothpaste removes 10 years of yellow stains with twice daily brushing<br/><br/>POWERED BY THE TEETH WHITENING INGREDIENT THAT DENTISTS USE: Optic White renewal contains 3% hydrogen peroxide, which is clinically proven to whiten your teeth inside and out<br/><br/>ENAMEL SAFE: This teeth whitening toothpaste is enamel safe and suitable for daily use<br/><br/>DEEPLY WHITENS: Proven to remove deep set in stains</p>",
  "gtin13": "7509546652528",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/080817.jpg",
  "name": "Colgate Optic White Renewal Vibrant Clean Whitening Toothpaste 85G",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 12,
    "lowPrice": 12,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T10:25:28.683Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 12,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/80817/colgate-optic-white-renewal-vibrant-clean-whitening-toothpaste"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/80817/colgate-optic-white-renewal-vibrant-clean-whitening-toothpaste"
  ],
  "sku": "80817",
  "updatedAt": "2022-12-06T10:25:28.683Z"
}
