{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 8,
    "ratingValue": 3.875
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Colgate"
  },
  "createdAt": "2022-12-06T10:26:34.727Z",
  "description": "With Colgate Pro Clinical Deep Clean Electric Power Toothbrush, experience a powerful yet gentle clean. The electric toothbrush has multi-directional vibrations, a 2 minute timer has 5 x plaque removal^, designed for your smile.<br><br>Designed for your smile, Colgate PRO Clinical Deep Clean Electric Toothbrush has 5x plaque removal^ and helps with healthier gums in 4 weeks*. <br><br>The Colgate ProClinical 250R Deep Clean Electric Toothbrush has multi-directional vibrations, with up to 30,000 strokes per minute. It has a slim, lightweight handle that is easy to control, a 2 minute timer with quadrant pacer and a rechargeable battery that lasts up to 10 days**. <br><br>Pack contents include:<br>- 1 x White Rechargeable toothbrush<br>- 2 x Deep clean replaceable brush heads<br>- 1 x Charger (AU plug)<br><br>Features of the deep clean replaceable brush head:<br>1. Compact head to clean back teeth<br>2. Soft thin-tipped bristles sweep along gum line<br>3. Power tip bristles clean hard-to-reach areas<br>4. Tongue and cheek cleaner helps remover odour causing bacteria<br><br>For optimal care, replace your brush head every 3 months and visit your dentist at least twice a year.<br><br>^vs a manual flat trim toothbrush.<br>*at the gum margin after 4 weeks vs a manual flat-trim toothbrush.<br>**when brushing twice daily.<br><br>ELECTRIC TOOTHBRUSH: Colgate PRO Clinical Deep Clean Electric Powered toothbrush has a rechargeable battery that lasts up to 10 days (when brushing twice daily), AU charger included.<br><br>5X PLAQUE REMOVAL: 250R PRO Clinical Electric Toothbrush has 5 x plaque removal vs a manual flat trim toothbrush<br><br>HEALTHIER GUMS IN 4 WEEKS: helps with healthier gums at the gum margin after 4 weeks vs a manual flat-trim toothbrush<br><br>2 MINUTE TIMER: Designed with a 2 minute timer and 30 second quadrant pacer to help with brushing habits<br><br>TONGUE CLEANER: Electric toothbrush head comes with a tongue and cheek cleaner to help remove odour causing bacteria",
  "gtin13": "8718951242180",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/829190.jpg",
  "name": "Colgate Proclinical 250r Deep Clean Sonic Electric Toothbrush 1 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 50,
    "lowPrice": 50,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T10:26:34.725Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 50,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/829190/colgate-proclinical-250r-deep-clean-sonic-electric-toothbrush"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/829190/colgate-proclinical-250r-deep-clean-sonic-electric-toothbrush"
  ],
  "sku": "829190",
  "updatedAt": "2022-12-06T10:26:34.725Z"
}
