{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Ferrero Rocher: Ingredients: Milk Chocolate (30%) (Sugar, Cocoa Butter, Cocoa Mass, Skim Milk Powder, Anhydrous Milkfat, Emulsifier: Lecithins (Soy), Flavouring: Vanillin), Hazelnuts (28.5%), Sugar, Vegetable Oil (Palm*), Wheat Flour, Whey Powder, Fat-Reduced Cocoa Powder, Emulsifier (Lecithins) (Soy), Raising Agent (Sodium Bicarbonate), Salt, Flavouring (Vanillin). Total Cocoa Solids: 16% / In Milk Chocolate: 42% Confetteria Raffaello: Ingredients: Vegetable Fats (Palm*, Shea), Desiccated Coconut (23.5%), Sugar, Whole Almond (8%), Skim Milk Powder, Whey Powder, Wheat Flour, Tapioca Starch, Flavourings, Emulsifier (Lecithins) 9Soy), Salt, Raising Agent (Sodium Bicarbonate). Ferrero Rondnoir: Crisp dark chocolate covered specialty, with a smooth filling and a dark chocolate center. Ingredients: Dark chocolate (40.5%) (sugar, cocoa mass, cocoa butter, emulsifier: lecithins (soy), flavouring: vanillin), Sugar, Vegetable fat (palm*), Wheat flour, Fat reduced cocoa powder, Whey powder, Skim milk powder, Milk chocolate (sugar, cocoa butter, milk powder, cocoa mass, emulsifier: lecithins (soy), Flavouring: vanillin), Wheat starch, Vegetable oil (sunflower), Cocoa butter, Emulsifier: lecithins (soy), Glazing agent (gum arabic), Whey proteins, Cocoa mass, Raising agents (sodium bicarbonate, ammonium bicarbonate), salt, flavouring: vanillin. Total cocoa solids: 28% / in dark chocolate: 52.5% / in milk chocolate: 38.5% *Sustainable and segregated certified palm oil."
    },
    {
      "name": "Contains",
      "value": "Ferrero Rocher: Contains Milk, Hazelnuts, Gluten, Soy. Confetteria Raffaello: Contains Almonds, Milk, Gluten, Soy. Ferrero Rondnoir: Milk, Gluten, Soy. Made on equipment that also processes Almonds."
    },
    {
      "name": "Allergen",
      "value": "Contains Hazelnuts, Contains Tree Nuts, Contains Gluten, Contains Soy, Contains Milk"
    },
    {
      "name": "Size",
      "value": "172g"
    },
    {
      "name": "Unit Price",
      "value": "$8.14 per 100G"
    },
    {
      "name": "Country Of Origin",
      "value": "Made in Poland/Germany"
    }
  ],
  "brand": "Ferrero",
  "createdAt": "2022-12-01T03:24:54.647Z",
  "description": "Ferrero Collection Rocher Raffaello Rondnoir Chocolate Gift Box 15 Pack",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/1/5/4/1545663.jpg",
  "name": "Collection Rocher Raffaello Rondnoir Chocolate Gift Box 15 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 14,
    "lowPrice": 14,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-01T03:24:54.646Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "14.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/ferrero-collection-chocolates-t15"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/ferrero-collection-chocolates-t15"
  ],
  "sku": "1545663",
  "updatedAt": "2022-12-01T03:24:54.646Z"
}
