{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Colour Creme: Aqua (Water, Eau) Cetearyl Alcohol Ammonium Hydroxide Coconut Alcohol Sodium Laureth-6 Carboxylate Sodium Myreth Sulfate Toluene-2,5-Diamine Sulfate Succinic Acid Bis-Diisopropanolamino-PG-Propyl Dimethicone/Bis-Isobutyl PEG-14 Copolymer Resorcinol Potassium Hydroxide Acrylamidopropyltrimonium Chloride/Acrylates Copolymer Coco-Glucoside Paraffinum Liquidum (Mineral Oil, Huile Minerale) Glyceryl Oleate Ammonium Sulfate Arginine Lysine HCl Ceteareth-12 Ceteareth-20 Parfum (Fragrance) Sodium Sulfite Sodium Silicate m-Aminophenol Etidronic Acid Ascorbic Acid Sodium Chloride Butyloctanol Citric Acid Polysorbate 20 2-Amino-4-Hydroxyethylaminoanisole Sulfate 6-Methoxy-2-Methylamino-3-Aminopyridine HCl Linalool Phenoxyethanol 4-Chlororesorcinol Benzyl Salicylate Lactic Acid Citronellol Geraniol Limonene Sodium Benzoate Methylparaben Ethylparaben Developer: Aqua (Water, Eau) Hydrogen Peroxide Cetearyl Alcohol Propylene Glycol Ceteareth-20 Steartrimonium Chloride Paraffinum Liquidum (Mineral Oil, Huile Minerale) Etidronic Acid 2,6-Dicarboxypyridine Disodium Pyrophosphate Potassium Hydroxide Isopropyl Alcohol Sodium Benzoate After colouring repair mask/After 3 weeks repair mask: Aqua (Water, Eau) Cetearyl Alcohol Isopropyl Myristate Behentrimonium Chloride Distearoylethyl Hydroxyethylmonium Methosulfate Dimethylsilanol Hyaluronate Panthenol Cocodimonium Hydroxypropyl Hydrolyzed Keratin Hydrolyzed Keratin Stearamidopropyl Dimethylamine Cetyl Palmitate Dimethicone Phenoxyethanol Citric Acid Isopropyl Alcohol Parfum (Fragrance) Methylparaben Glycerin Cetrimonium Chloride Guar Hydroxypropyltrimonium Chloride Linalool Hexyl Cinnamal Limonene Benzyl Salicylate Benzyl Alcohol"
    },
    {
      "name": "Contains",
      "value": "Hydrogen peroxide, phenylenediamines (toluenediamines), resorcinol and ammonia. Colour Creme 60mL, Developer 60mL, After Colouring Repair Mask 22.5mL, After 3 Weeks Repair Mask 22.5mL, Instruction Leaflet, Gloves"
    },
    {
      "name": "Warning",
      "value": "WARNING - This product contains ingredients which may cause skin sensitisation to certain individuals. A preliminary test according to accompanying directions should be made before use. This product must not be used for dyeing eyelashes or eyebrows. To do so may be injurious to the eye. DO NOT SWALLOW. Repeated exposure may cause sensitisation. Conduct an allergy alert test 48 hours before each time you colour (see enclosed leaflet), even if you have already used colouring products before. So remember to buy the product 48 hours in advance."
    },
    {
      "name": "Size",
      "value": "1 pack"
    },
    {
      "name": "Unit Price",
      "value": "$20.00 per 1Ea"
    }
  ],
  "brand": "Schwarzkopf",
  "createdAt": "2022-12-06T14:16:26.417Z",
  "description": "Schwarzkopf Colour Specialist 4-13 Dark Cool Brown",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/5/2/5/5259575.jpg",
  "name": "Colour Specialist 4-13 Dark Cool Brown",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 20,
    "lowPrice": 20,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/OutOfStock",
        "availabilityStarts": "2022-12-06T14:16:26.417Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "20.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/4-13-dark-cool-brown"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/4-13-dark-cool-brown"
  ],
  "sku": "5259575",
  "updatedAt": "2022-12-06T14:16:26.417Z"
}
