{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Colour Crme: Aqua (Water, Eau) Cetearyl Alcohol Ammonium Hydroxide Coconut Alcohol Toluene-2,5-Diamine Sulfate Sodium Laureth-6 Carboxylate Sodium Myreth Sulfate Potassium Hydroxide Succinic Acid Bis-Diisopropanolamino-PG-Propyl Dimethicone/Bis-Isobutyl PEG-14 Copolymer Resorcinol Acrylamidopropyltrimonium Chloride/Acrylates Copolymer Coco-Glucoside Paraffinum Liquidum (Mineral Oil, Huile Minrale) Glyceryl Oleate Ceteareth-12 Ceteareth-20 Arginine Ceteareth-50 Lysine HCl Parfum (Fragrance) Sodium Sulfite 4-Chlororesorcinol Sodium Silicate 2-Amino-3-Hydroxypyridine Etidronic Acid Ascorbic Acid Ammonium Sulfate m-Aminophenol Sodium Chloride Butyloctanol 1,3-Bis-(2,4-Diaminophenoxy) Propane HCl Citric Acid Polysorbate 20 Linalool 6-Methoxy-2-Methylamino-3-Aminopyridine HCl Phenoxyethanol Benzyl Salicylate Lactic Acid Citronellol Geraniol Limonene Sodium Benzoate Methylparaben Ethylparaben Developer: Aqua (Water, Eau) Hydrogen Peroxide Cetearyl Alcohol Propylene Glycol Ceteareth-20 Steartrimonium Chloride Paraffinum Liquidum (Mineral Oil, Huile Minrale) Etidronic Acid 2,6-Dicarboxypyridine Disodium Pyrophosphate Potassium Hydroxide Isopropyl Alcohol Sodium Benzoate After colouring repair mask/After 3 weeks repair mask: Aqua (Water, Eau) Cetearyl Alcohol Isopropyl Myristate Behentrimonium Chloride Distearoylethyl Hydroxyethylmonium Methosulfate Dimethylsilanol Hyaluronate Panthenol Cocodimonium Hydroxypropyl Hydrolyzed Keratin Hydrolyzed Keratin Stearamidopropyl Dimethylamine Cetyl Palmitate Dimethicone Phenoxyethanol Citric Acid Isopropyl Alcohol Parfum (Fragrance) Methylparaben Glycerin Cetrimonium Chloride Guar Hydroxypropyltrimonium Chloride Linalool Hexyl Cinnamal Limonene Benzyl Salicylate Benzyl Alcohol"
    },
    {
      "name": "Contains",
      "value": "Contains not more than 19 g/LAmmonium Hydroxide and 21 g/LSodium Laureth-6 Carboxylate. Contains hydrogen peroxide, phenylenediamines (toluenediamines), resorcinol and ammonia. Colour creme 60mL, Developer 60mL, After colouring repair mask 22.5mL, After 3 weeks repair mask 22.5mL, Instruction leaflet with gloves"
    },
    {
      "name": "Warning",
      "value": "This product contains ingredients which may cause skin sensitisation to certain individuals. A preliminary test according to accompanying directions should be made before use. This product must not be used for dyeing eyelashes or eyebrows; to do so may be injurious to the eye. DO NOT SWALLOW. Repeated exposure may cause sensitisation. Keep out of reach of children. Read safety directions. For advice, contact a Poisons Information Centre (Phone eg Australia 13 1126; New Zealand 0800 764 766) or a doctor (at once). Rinse hair well after application."
    },
    {
      "name": "Size",
      "value": "1 pack"
    },
    {
      "name": "Unit Price",
      "value": "$20.00 per 1Ea"
    }
  ],
  "brand": "Schwarzkopf",
  "createdAt": "2022-12-06T14:02:35.772Z",
  "description": "Schwarzkopf Colour Specialist Imperial Brown 3.0 Hair Colour",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/3/2/7/3279378.jpg",
  "name": "Colour Specialist Imperial Brown 3.0 Hair Colour",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 20,
    "lowPrice": 20,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-06T14:02:35.771Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "20.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/schwarzkopf-specialist-3-0-imperial-brown"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/schwarzkopf-specialist-3-0-imperial-brown"
  ],
  "sku": "3279378",
  "updatedAt": "2022-12-06T14:02:35.771Z"
}
