{
  "@type": "Product",
  "additionalProperty": [
    {
      "@type": "NutritionInformation",
      "calories": "1330kJ, 138kJ *",
      "carbohydrateContent": "18.6g, 6.6g *",
      "dietary_fibre": "-",
      "fatContent": "12.2g, 0.4g *",
      "name": "nutrition",
      "proteinContent": "31.8g, 0.7g *",
      "saturatedFatContent": "4.2g, 0.1g *",
      "servingSize": "100 g",
      "sodiumContent": "840mg, 430mg *",
      "sugarContent": "6.8g, 2.0g *"
    }
  ],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Continental"
  },
  "createdAt": "2022-12-05T08:22:41.240Z",
  "description": "CONTINENTAL RECIPE BASE CHILLI CON CARNE 40 GR<BR><BR>In just a few easy steps, create a delicious mid-week meal the whole family will enjoy, with the help of Continental. This Chilli Con Carne recipe base makes a mildly spiced mince dish with tomatoes and beans that serves four people. Mince Beef Chilli Con Carne has never been this easy or so tasty. All of our Continental Recipe Bases contain no artificial colours, flavours and added MSG, and are made with real ingredients, simply dried and combined to create a perfectly balanced flavour for your favourite dish. This Chilli Con Carne Recipe Base is made with responsibly grow Australian tomatoes, as well as real onion and paprika. All you need is beef mince, tomatoes and red kidney beans to have dinner ready in no time. It's delicious served with steamed rice, a dollop of light sour cream and avocado. Or serve it on a bed of corn chips for a flavourful nachos. At Continental, we love food the way you do. We know how much you value good, nutritious, flavourful food, as well as authentic home cooking. It feels good to cook, and even better to bring pleasure to the ones you love, through the food you put on the table. For over 50 years now, our chefs at Continental have combined their expertise, love of flavour, and only the finest ingredients to help you create great tasting meals every day.Go to http://continental.com.au/ to find more recipe inspirations and additional flavours such as sheperds pie, curried sausages, spaghetti Bolognese, beef stroganoff, chicken curry, beef stew, chicken risotto, swedish meatballs, chicken korma and many more instant sauces.<BR><BR>Continental Recipe Bases are made with real ingredients, simply dried and combined to create a perfectly balanced flavour for your favourite dish<BR><BR>In just a few easy steps, create a delicious mid-week meal the whole family will enjoy, with the help of Continental<BR><BR>This Chilli Con Carne Recipe Base is made with responsibly grow Australian tomatoes, as well as onion and paprika<BR><BR>No added MSG<BR><BR>No artificial colours & flavours<BR><BR>Serves 4",
  "gtin13": "9300667028067",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/054375.jpg",
  "name": "Continental Recipe Base Chilli Con Carne 40G",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 1.8,
    "lowPrice": 1.8,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-05T08:22:41.238Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 1.8,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/54375/continental-recipe-base-chilli-con-carne"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/54375/continental-recipe-base-chilli-con-carne"
  ],
  "sku": "54375",
  "updatedAt": "2022-12-05T08:22:41.239Z"
}
