{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Cuddly"
  },
  "createdAt": "2022-11-22T22:53:07.000Z",
  "description": "<p>Cuddly Sensitive Concentrated Liquid Fabric Softener Conditioner 1L 40 Washes is Made in Australia. Gentle on Sensitive Skin, Hypoallergenic, Dermatologist Tested and is a Sensitive Choice Proud Supporter of the Eczema Association Australasia Inc. Designed for Luxurious Softness, Easy Iron, Reduces wrinkles, Reduces Static, Helps clothes look newer for longer and is Fast Drying.<BR><BR>Cuddly Concentrate Hypoallergenic Liquid Fabric Softener Conditioner is gentle on sensitive skin. <br/><br/>Delicate skin needs the gentlest touch which is why we've formulated Cuddly Sensitive. It's hypoallergenic, has been dermatologically tested and contains no dyes. <br/><br/>Cuddly Sensitive gives that little bit extra to show you care. <br/><br/>- Luxurious Softness<br/>- Gentle Fragrance<br/>- Hypoallergenic<br/>- Dermatologically tested<br/>- Free from dyes<br/>- Sensitive Choice<br/>- Proud supporter of the Eczema Association Australasia (EAA)<br/>- Grey Water and Septic Tank safe<br/>- 100% recyclable packaging<br/><br/>Directions for use<br/>Top Loader - Cuddly can be added to your machine's fabric conditioner dispensing unit or diluted and added to the final rinse. <br/>Front Loader - Add Cuddly to your machine's fabric conditioner dispenser unit only. This is often marked with a flower.<br/><br/>Cuddly is ready to use so there is no need to dilute. Never pour directly onto fabrics.<br/><br/>Size: 1L Liquid Fabric Softener Conditioner Concentrate<br/>Washes: 40 washes<BR><BR>FABRIC SOFTENER CONDITIONER: Cuddly Concentrate Sensitive Liquid Fabric Softener Conditioner is gentle on sensitive skin<BR><BR>HYPOALLERGENIC AND DERMATOLOGICALLY TESTED: Cuddly Concentrate Sensitive fabric conditioner is hypoallergenic and dermatologically tested.<BR><BR>DELICATE ON SENSITIVE SKIN: Cuddly Sensitive fabric conditioner is a Sensitive Choice, Proud supporter of Eczema Association Australasia Inc<BR><BR>FREE FROM: any dyes and has a gentle fragrance<BR><BR></p>",
  "gtin13": "9300632072750",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/336493.jpg",
  "name": "Cuddly Concentrate Fabric Conditioner Hypoallergenic Sensitive 1L",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 5,
    "lowPrice": 5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-05T11:41:38.162Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/336493/cuddly-concentrate-fabric-conditioner-hypoallergenic-sensitive"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/336493/cuddly-concentrate-fabric-conditioner-hypoallergenic-sensitive"
  ],
  "sku": "336493",
  "updatedAt": "2022-12-05T11:41:38.162Z"
}
