{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Precolour Shampoo Aqua (Water), Sodium Myreth Sulfate, Cocamidopropyl Betaine, Sodium Cocoamphoacetate, Lauryl Glucoside, PEG-4 Rapeseedamide, Betaine, Glycerin, Ascorbic Acid, Hyaluronic Acid, Hydrolyzed Keratin, Leuconostoc/Radish Root Ferment Filtrate, Polyquaternium-7, Propylene Glycol, Guar Hydroxypropyltrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Tetrasodium EDTA, Lactic Acid, Sodium Benzoate, Phenoxyethanol, Dehydroacetic Acid, Benzoic Acid, Potassium Sorbate, Benzyl Alcohol, EDTA, Methylchloroisothiazolinone, Sodium Chloride, Methylisothiazolinone, Limonene, Hydroxycitronellal, Parfum (Fragrance). Part 1 Activator Aqua, Sodium Oxymethlene Sulfoxylate, PEG-40 Hydrogenated Caster Oil, Hydroxyethyl Cellulose, Polysorbate 20, Glycerin, Parfum, Phenoxyethanol, Ethylhexylglycerin, Sodium Hydroxide, Citronellol, Hexyl Cinnemal, Linalool. Part 2 Remover Aqua, Citric Acid, Cetearyl Alcohol, Hydroxyethyl Cellulose, Polysorbate 20, PEG-40 Hydrogenated Caster Oil, Parfum Phenoxyethanol, Ethylhexylgycerin, Cocamidopropyl Betaine, Ctironellol, Hexyl Cinnamal, Linalool. Part 3 Conclude Balm Aqua (Water), Hydroxypropyl Starch Phosphate, Cetearyl Alcohol, Glyceryl Stearate, Wheat Amino Acids, Soy Amino Acids, Arginine HCl, Serine, Threonine, Glycerin, Sodium Lauroyl Glutamate, Sodium Stearoyl Lactylate, Lactic Acid, Ceteareth-20, Amodimethicone, Trideceth-12, Cetrimonium Chloride, Propylene Glycol, Myristyl Lactate, Polyquaternium-53, Polyquaternium-22, Benzyl Alcohol, Potassium Sorbate, Sodium Benzoate, Methylchloroisothiazolinone, Methylisothiazolinone, Phenoxyethanol, Hexyl Cinnamal, Parfum (Fragrance)."
    },
    {
      "name": "Size",
      "value": "1 pack"
    },
    {
      "name": "Unit Price",
      "value": "$25.00 per 1Ea"
    }
  ],
  "brand": "Scott Cornwall",
  "createdAt": "2022-11-30T22:56:14.379Z",
  "description": "Scott Cornwall Decolour Hair Colour Remover",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/2/6/6/2666700.jpg",
  "name": "Decolour Hair Colour Remover",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 25,
    "lowPrice": 25,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-30T22:56:14.378Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "25.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/scott-cornwall-decolour-hair-colour-remover"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/scott-cornwall-decolour-hair-colour-remover"
  ],
  "sku": "2666700",
  "updatedAt": "2022-11-30T22:56:14.378Z"
}
