{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-11-23T22:01:05.382Z",
  "description": "Baby Dove Rich Moisture Head to Toe Baby Wash gently cleanses and helps baby’s skin retain moisture. We know there’s no right or wrong way to be a parent – only your way. That’s why Baby Dove is here to help you to care for your baby on your exciting but sometimes daunting journey together. From the moment your baby is born, we’ll be there to help with our skin care expertise. Because you know what’s best for your baby, we’ll work with you to give them the gentle care they need. Just trust your way, and we’ll be there to support you. Our range of products helps provide your baby with skin care that goes beyond mildness and restores essential moisture. Whether it’s a tear-free shampoo during baby bath time, or a soothing lotion after, we give you the confidence that you’re doing the best you can for your baby. The best shampoo for babies moisturises while cleansing. Baby Dove Rich Moisture Baby Shampoo goes beyond mildness to leave hair soft and healthy looking. Help keep bath time stress to a minimum every day with this caring, hypoallergenic and tear-free baby shampoo, with a delicate, comforting scent. Care for your baby’s delicate skin and take unnecessary stress out of bath time with our range of Baby Hair Care.  Baby Dove Rich moisture shampoo helps keep baby's scalp moisturised and hair soft.  Helps replenish essential moisture and important nutrients in the scalp as it gently cleanses.  Hypoallergenic and Tear Free.  Dermatologically and Ophthalmologically tested  Paediatrically tested.  Our range of products helps provide your baby with skin care that goes beyond mildness and restores essential moisture.",
  "gtin13": "8710908657900",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/000680.jpg",
    "width": 1200
  },
  "name": "Dove Baby Shampoo Rich Moist 200mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 0,
    "lowPrice": 0,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/OutOfStock",
        "availabilityStarts": "2022-11-23T22:01:05.377Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": "",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/680/dove-baby-shampoo-rich-moist"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/680/dove-baby-shampoo-rich-moist"
  ],
  "sku": "680",
  "updatedAt": "2022-11-23T22:01:05.377Z"
}
