{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 55,
    "ratingValue": 4.87272727272727
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-12-06T12:05:43.719Z",
  "description": "DOVE BODY WASH TRIPLE MOIST 1 LTR<BR><BR>Who doesn’t like having soft skin? We all want to keep our skin looking healthy and well cared for, and it’s much easier to make that a regular part of your routine if you’ve found a moisturising shower gel. That’s the best way to feel confident that you’re nurturing your skin right from the start of your day. We know how you can do just that – with Dove Body Wash Soap Triple Moisturising. This moisturising body wash combines microbiome gentle technology, with mild cleansers to help your skin retain its natural moisture, leaving you with softer, smoother skin after just one shower or bath. The caring formula in this Dove body wash hydrates skin, and helps maintain your skin’s moisture barrier while delivering natural skin nourishment that goes deep into the surface layers of your skin. This moisturising body wash creates a rich lather that replenishes your skin’s nutrients while also leaving it feeling cared for and clean. And as a sulfate-SLES-free Dove body wash, this formula is kind to your skin’s living protective layer – the microbiome – too. <br/><br/>Dove, the home of real beauty. For over a decade, we've been working to make beauty a source of confidence, not anxiety. Dove celebrates a new definition of strength: one with care at its centre. Real strength is shown through the care you give to the people that matter – and that includes you. Whether you’re looking for a deodorant to keep you feeling fresh and dry all day or you want a body wash to help keep your skin hydrated, Dove products are designed to protect and care for your skin. All Dove skin care products are cruelty-free, accredited by PETA.<BR><BR>Dove Body Wash Triple Moisturising Soap gentle formula protects your microbiome (your skin's protective layer) and provides lasting care for your skin.<BR><BR>Dove Body Wash Triple Moisturising Soap leaves your skin feeling softer and smoother after just one shower or bath.<BR><BR>Dove Body Wash Triple Moisturising Soap has no sulfate SLES & no parabens.<BR><BR>Dove Body Wash Triple Moisturising Soap formula has plant-based moisturiser and naturally derived cleansers.<BR><BR>Dove Body Wash Triple Moisturising Soap is a mild & gentle formula that is kind to your skin & suitable for daily use.<BR><BR>Dove Body Wash Triple Moisturising Soap is Cruelty-Free and, Globally, Dove does not test on animals.",
  "gtin13": "9300830001101",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/380810.jpg",
  "name": "Dove Body Wash Triple Moisturising 1L",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 17,
    "lowPrice": 17,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T12:05:43.717Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 17,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/380810/dove-body-wash-triple-moisturising"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/380810/dove-body-wash-triple-moisturising"
  ],
  "sku": "380810",
  "updatedAt": "2022-12-06T12:05:43.718Z"
}
