{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 9,
    "ratingValue": 4.66666666666667
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "DOVE BEAUTY BAR EXTRA SENSITIVE 200 GRIf you have sensitive skin, you know how important it is to choose the right cleansing products. Good sensitive skin care depends on having a cleanser that truly cares for your skin and won’t dry it out, and once you find something that works, you stick with it. So, here’s some good news: Dove Beauty Cream Bar Sensitive Soap (2 bars) gives you truly mild cleansing that leaves sensitive skin feeling soft and smooth. Dove Beauty Cream Bar Sensitive Soap brings you the classic Dove cleansers and ¼ moisturising cream in a fragrance-free, hypoallergenic bar that’s gentle enough for sensitive skin. Suitable for daily use, it helps protect skin’s natural moisture and can be used on your hands, body or face. Get the gentle skin care for sensitive skin that you deserve – try Dove Beauty Cream Bar Sensitive Soap. Rub your Dove Beauty Cream Bar Sensitive Soap between your hands to create lather. Smooth the foam over your skin, massaging gently. Then just rinse off the foam with warm water. Dove Beauty Cream Bar Sensitive Soap is mild enough to be used every day, even on your face, without worrying about it drying out or irritating your skin. That’s because it is not a soap bar, it’s a Dove beauty bar, specially designed by skin care experts to be unscented, hypoallergenic and gentle for sensitive skin. Dove Beauty Soap Bar Extra Sensitive washes away bacteria.Dove, the home of real beauty. For over a decade, we've been working to make beauty a source of confidence, not anxiety. Dove celebrates a new definition of strength: one with care at its centre. Real strength is shown through the care you give to the people that matter – and that includes you. Whether you’re looking for a deodorant to keep you feeling fresh and dry all day or you want a body wash to help keep your skin hydrated, Dove products are designed to protect and care for your skin.Dove Beauty Cream Bar Sensitive Soap (2 bars) helps wash away bacteria.Dove Beauty Cream Bar Sensitive Soap (2 bars) is ¼ moisturising cream.Dove Beauty Cream Bar Sensitive Soap (2 bars) is pH Balanced and Dermatologically approved.Dove Beauty Cream Bar Sensitive Soap (2 bars) is Sulphate SLES Free and Paraben Free.Dove Beauty Cream Bar Sensitive Soap (2 bars) leaves skin soft & smooth.Dove Beauty Cream Bar Sensitive Soap (2 bars) is Cruelty-Free and, Globally, Dove does not test on animals.",
  "gtin13": "9300663278336",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/000878.jpg",
    "width": 1200
  },
  "name": "Dove Sensitive Beauty Bar Soap Hypo-allergenic 2x100G",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 0,
    "lowPrice": 0,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/OutOfStock",
        "availabilityStarts": "2022-11-23T22:01:18.180Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": "",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/878/dove-sensitive-beauty-bar-soap-hypo-allergenic"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/878/dove-sensitive-beauty-bar-soap-hypo-allergenic"
  ],
  "sku": "878",
  "updatedAt": "2022-11-23T22:01:18.180Z"
}
