{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "Searching for something fresh? The new Dove Go Fresh Apple and White Tea aerosol spray is the perfect match if you are looking for an antiperspirant deodorant with 48h protection and an addictive fresh, fruity fragrance. With its crisp notes of juicy apple and white tea and a subtle hint of floral, this refreshing scent will take you straight to those early summer days with blossoming apple-trees and flower markets.  The mild, alcohol-free formula helps reduce irritation and dryness while Dove’s unique ¼ moisturising cream cares for your underarm skin and helps to recover from any irritation that regular shaving might cause.  Whether it is after your morning shower, post a hot yoga class or just before going out; no matter the occasion, Dove Go Fresh has got your underarm needs covered keeping them smelling fresh and staying protected all day long. To get the best out of Dove Go Fresh Apple and White Tea antiperspirant deodorant, simply shake the can, hold your arm above your head spraying one underarm at a time for two seconds each. For even coverage, can should be held at 15cm from your underarms. Stay fresh with new Dove Go Fresh Apple & White Tea, try this womens deodorant today.Provides instant freshness and up to 48h antiperspirant protectionA fruity floral fragrance with crisp notes of juicy apple and white teaMild 0% alcohol formulation to help reduce irritation and dryness¼ moisturising cream for underarm care, helping smoothen underarm skinHelps delicate underarm skin recover from irritation caused by shavingAn aerosol deodorant",
  "gtin13": "9300830056996",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/079703.jpg",
    "width": 1200
  },
  "name": "Dove Go Fresh Antiperspirant Apple & White Tea Scent 250mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 0,
    "lowPrice": 0,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/OutOfStock",
        "availabilityStarts": "2022-11-23T22:13:09.020Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": "",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/79703/dove-go-fresh-antiperspirant-apple-white-tea-scent?"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/79703/dove-go-fresh-antiperspirant-apple-white-tea-scent?"
  ],
  "sku": "79703",
  "updatedAt": "2022-11-23T22:13:09.020Z"
}
