{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 22,
    "ratingValue": 4.86363636363636
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-12-06T12:04:53.190Z",
  "description": "<p>DOVE NOURISHING SECRETS BODY WASH RESTORING COCONUT & ALMOND OIL 1 LTR<br/><br/>Looking for tips on how to restore skin? We’ve got a moisturising body wash to help give you soft skin. To make a formula that’s even more nourishing, we’ve combined this star ingredient with skin-natural moisturisers, with the formula working deep into skin to help renew natural moisture levels. And as a sulfate-SLES-free Dove body wash, this formula is kind to your skin’s living protective layer. Dove Body Wash Restoring Soap is a nourishing body wash with the summery fragrance of Coconut and Almond Milk that leaves your skin feeling pampered and hydrated. This mild body wash, with microbiome gentle technology, combines gentle cleansers with skin natural nutrients to give you soft & smooth skin. Simply squeeze a generous amount of body wash onto your hands or a shower puff and enjoy the lather and refreshing scent before rinsing. <br/><br/>Dove, the home of real beauty. For over a decade, we've been working to make beauty a source of confidence, not anxiety. Dove celebrates a new definition of strength: one with care at its centre. Real strength is shown through the care you give to the people that matter – and that includes you. Whether you’re looking for a deodorant to keep you feeling fresh and dry all day or you want a body wash to help keep your skin hydrated, Dove products are designed to protect and care for your skin. All Dove skin care products are cruelty-free, accredited by PETA.<br/><br/>Dove Body Wash Restoring Soap with coconut & almond oil pampers & softens skin with a beautiful scent<br/><br/>Dove Body Wash Restoring Soap gentle formula protects your microbiome (your skin's protective layer) and provides lasting care for your skin.<br/><br/>Dove Body Wash Restoring Soap formula has plant-based moisturiser and naturally derived cleansers.<br/><br/>Dove Body Wash Restoring Soap has no sulfate SLES & no parabens.<br/><br/>Dove Body Wash Restoring Soap bottle is made with 70% recycled plastic.<br/><br/>Dove Body Wash Restoring Soap is Cruelty-Free and, Globally, Dove does not test on animals.</p>",
  "gtin13": "9300830050611",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/816185.jpg",
  "name": "Dove Body Wash Restoring Coconut & Almond Oils 1L",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 17,
    "lowPrice": 17,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T12:04:53.188Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 17,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/816185/dove-body-wash-restoring-coconut-almond-oils"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/816185/dove-body-wash-restoring-coconut-almond-oils"
  ],
  "sku": "816185",
  "updatedAt": "2022-12-06T12:04:53.189Z"
}
