{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "Refreshes and soothes scalp dryness. With aloe vera and ginger. Directions: Apply to wet hair, gently massage onto scalp, later and rinse. At Dove, we are dedicated to providing intense nourishment solutions for hair. We believe that if you want to achieve real results you need real care that works hard each time you use it. That is why we create our products to provide instant results for a nourished and beautiful hair. Sometimes little flakes on the shoulders can make us feel self-conscious and seek for the use of harsh anti-dandruff products. Harsh anti-dandruff shampoos and conditions can take away your scalp’s nutrients and your hair’s moisture balance, making it dry and dull. New Dove Dermacare Scalp series helps fight dandruff while also soothing your dry scalp to keep your hair looking beautiful. At Dove, we believe no young person should be held back from reaching their full potential. However, low body confidence and anxieties over appearance stop young people being their best selves, affecting their health, friendships and even performance at school. For more than 10 years, we’ve been helping parents, mentors, teachers and youth leaders deliver self-esteem education that's reached more than 20 million young people so far. Join us to help reach even more.Fights dandruffProvides nourishment and moisturisationGently cares for your hairGentle enough to be used every dayHydrates, nourishes and refreshes scalpDove’s Self Esteem Project is helping young people build self-esteem globally",
  "gtin13": "9300830053568",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/082541.jpg",
    "width": 1200
  },
  "name": "Dove Shampoo Dermacare Anti Dandruff Clean & Fresh 300mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 11,
    "lowPrice": 11,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:41:20.369Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 11,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/82541/dove-shampoo-dermacare-anti-dandruff-clean-fresh"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/82541/dove-shampoo-dermacare-anti-dandruff-clean-fresh"
  ],
  "sku": "82541",
  "updatedAt": "2022-11-23T22:41:20.369Z"
}
