{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 26,
    "ratingValue": 4.69230769230769
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "DOVE ANTIPERSPIRANT ROLL ON ORIGINAL 50 ML<BR><BR>Have you got a little black dress you just keep coming back to? Something elegant and simple that always feels right whenever you put it on? Maybe it’s the fit, maybe it’s because it goes with anything – but maybe it’s just because it does exactly what it needs to without any fuss. Just like Dove Antiperspirant Roll On Original, actually. <br/><br/>Dove Antiperspirant Roll On Deodorant Original is a women's deodorant that provides up to 48 hours of antiperspirant protection with a delicate fragrance that helps to keep you feeling dry and fresh all day. And with our unique ¼ moisturising cream, it helps to reduce the irritation that regular underarm shaving can cause. <br/><br/>If you're the kind of person who likes to keep things simple, Dove Antiperspirant Roll on Original is for you. Just like that little black dress, it’s a familiar favourite and always there when you need it most for an all-day fresh smell. <br/><br/>To use your Dove Deodorant, put one arm up above your head and apply the roller ball to your skin using light pressure and a circular motion to cover the whole area. Repeat the process on the other underarm. Apply your antiperspirant deodorant before bed as well as in the morning – at night, your body temperature is cooler, so you sweat less and the formula has a better chance of sinking into the delicate underarm skin ready for the day ahead.<br/><br/>Dove is a proud maker of deodorant for women. For deodorant for men, look for Dove Men+Care.<BR><BR>Antiperspirant roll on deodorant 48-hour protection from sweat<BR><BR>Dove deodorant is dermatologically tested to deliver prescription strength defence against wetness and sweating<BR><BR>Dove deodorants do not contain aluminium chloride or alcohols which can cause skin irritation and discomfort<BR><BR>Deodorant with 1/4 moisturising cream to help care for your skin<BR><BR>Dove Roll On is ultimate combination of strength and beauty<BR><BR>Dove long lasting deodorant cares for delicate underarm skin",
  "gtin13": "93666466",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/001597.jpg",
  "name": "Dove Go Fresh Women Antiperspirant Roll On Deodorant Original 50ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 2.25,
    "lowPrice": 2.25,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T17:31:35.989Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 2.25,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1597/dove-women-deodorant-original-clean-alcohol-freereviewPageNumber=2"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1597/dove-women-deodorant-original-clean-alcohol-freereviewPageNumber=2"
  ],
  "sku": "1597",
  "updatedAt": "2022-12-06T17:31:35.989Z"
}
