{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 9,
    "ratingValue": 4.66666666666667
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Dove"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "We all spend plenty of time on our skin and hair care routines but it’s easy to forget about underarm care. Frankly, our underarms deserve better! Good news: you can care for your underarms every day with a quick spritz of Dove Antiperspirant Aerosol Original. It helps give you beautifully soft and smooth underarm skin, while providing up to 48 hours of antiperspirant protection. Dove antiperspirant deodorants help to reduce the irritation on your delicate underarm skin that can be caused by shaving. They contain ¼ moisturising cream for beautifully soft and smooth underarms. In fact, the ¼ moisturising cream in our formula is proven to give you soft and smooth underarm skin after just three days of use. Like all of our Dove Original products, this antiperspirant deodorant has a delicate scent that helps to keep you smelling fresh and clean all day long. Try our Dove Antiperspirant Aerosol Original for outstanding underarm care and protection against underarm wetness and odour, plus the signature Dove Original scent you know and love. Dove celebrates a new definition of strength: one with care at its centre. Real strength is shown through the care you give to the people that matter – and that includes you. Whether you’re looking for a deodorant to keep you feeling fresh and dry all day or you want a body wash to help keep your skin hydrated, Dove products are designed to protect and care for your skin.Up to 48-hour antiperspirant protectionContains ¼ moisturisers for soft and smooth underarmsUnderarms left feeling soft and freshFor soft and smooth underarmsGoes on dry in a spray form that gives easy coverageWe believe beauty should be a source of confidence, and not anxiety",
  "gtin13": "9300663404100",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/001096.jpg",
    "width": 1200
  },
  "name": "Dove Women Antiperspirant Aerosol Deodorant Original 169mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 0,
    "lowPrice": 0,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/OutOfStock",
        "availabilityStarts": "2022-11-23T22:01:29.798Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": "",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1096/dove-women-antiperspirant-aerosol-deodorant-original"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1096/dove-women-antiperspirant-aerosol-deodorant-original"
  ],
  "sku": "1096",
  "updatedAt": "2022-11-23T22:01:29.798Z"
}
