{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Gillette"
  },
  "createdAt": "2022-11-22T12:23:57.000Z",
  "description": "Gillette Venus Comfortglide Freesia Razor Women's Razor Handle + 1 Blade Refill for a smooth, close shave that lasts. Flexible gel bars for a comfortable shave. No need for shave gel. Gillette Venus ComfortGlide Freesia women's razors feature 3 curve hugging blades for a smooth, close shave that lasts. From handles designed for a comfortable grip, to pivoting heads that contour to curves, The razor blade refills come equipped with built in flexible gel bars that, when wet, release rich Freesia scented body butter lather for glide and comfort. No need for shave gel. Venus ComfortGlide women's razors feature an adaptive, pivoting design that adjusts to your body's contours and a rounded head that hugs curves and fits easily into hard to shave areas. No awkwardly angling your razor. This razor's handle is also made with up to 30% recycled plastic. Any Venus blade refill fits any Venus razor handle (except Simply Venus and Venus Pubic Hair Razor).Product Features:3 Curve-hugging blades for a smooth shaveFreesia scented Flexible gel bars with a touch of Botanical Oils for seamless glideThe pivoting, rounded head hugs curves and fits easily into hard-to-shave areasSoap or shave cream not required, simply wet the razor to activate moisture bars.Each blade refill lasts up to one month (based on twice/week shave) just use and replace when you're ready for a new one",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/1073846065.jpg",
    "width": 1200
  },
  "name": "Gillette 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 6.25,
    "lowPrice": 6.25,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-22T07:44:14.942Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 6.25,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073846065/gillette-venus-comfortglide-freesia-razor-women-s-razor-handle-1-blade-refill"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073846065/gillette-venus-comfortglide-freesia-razor-women-s-razor-handle-1-blade-refill"
  ],
  "sku": "1073846065",
  "updatedAt": "2022-11-22T07:44:14.942Z"
}
