{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Gillette"
  },
  "createdAt": "2022-12-06T17:05:43.353Z",
  "description": "<p>Gillette Venus Comfortglide White Tea Women's Razor Blade Refills 4 Pack for a smooth, close shave that lasts. Flexible gel bars for a comfortable shave. No need for shave gel. Lather and shave in 1 easy stroke!, Close & Clean in 1 Stroke<br/><br/>Venus ComfortGlide White Tea women's razors feature 3 curve hugging blades for a smooth, close shave that lasts. The razor blade refills come equipped with built in flexible gel bars that, when wet, release rich white tea scented body butter lather for glide and comfort. No need for shave gel. Gillette Venus ComfortGlide women's razors feature an adaptive, pivoting design that adjusts to your body's contours and a rounded head that hugs curves and fits easily into hard to shave areas. No awkwardly angling your razor. This razor's handle is also made with up to 30% recycled plastic. Any Venus blade refill fits any Venus razor handle (except Simply Venus 3 and Venus Pubic Hair Razor). Shave your way without buying a whole new Venus handle. Lather and shave in 1 easy stroke!, Close & Clean in 1 Stroke<br/><br/>3 Curve-hugging blades for a smooth shave<br/><br/>White Tea scented Flexible gel bars with a touch of Botanical Oils for seamless glide<br/><br/>The pivoting, rounded head hugs curves and fits easily into hard-to-shave areas<br/><br/>Soap or shave cream not required, simply wet the razor to activate moisture bars.<br/><br/>Each blade refill lasts up to one month (based on twice/week shave); just use and replace when you're ready for a new one<br/><br/>Any Venus blade refill fits any Venus razor handle (except Simply Venus 3 and Venus Pubic Hair Razor)<br/><br/>Fully recyclable packaging, made with up to 35% recycled material<br/><br/>Handle & Cartridge Recycle with TerraCycle*</p>",
  "gtin13": "4987176039347",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/165290.jpg",
  "name": "Gillette Venus Comfortglide White Tea Razor Blades 4 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 15.05,
    "lowPrice": 15.05,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T17:05:43.353Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 15.05,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/165290/gillette-venus-comfortglide-white-tea-razor-blades"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/165290/gillette-venus-comfortglide-white-tea-razor-blades"
  ],
  "sku": "165290",
  "updatedAt": "2022-12-06T17:05:43.353Z"
}
