{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Gillette"
  },
  "createdAt": "2022-12-06T17:03:14.787Z",
  "description": "Gillette Venus Smooth Women's Razor Blade Refills 4 Pack. Venus Smooth is the FIRST EVER 3 bladed razor designed for women. Venus' smoothness at our best value.<br><br>The Gillette Venus Smooth women's razor is the FIRST EVER 3 bladed razors designed for women. Venus' smoothness at our best value. Featuring 3 curve-hugging blades surrounded by protective, elastomer comfort cushions smoothing skin for a quick and straightforward shave with results you can rely on. The pivoting head responds to subtle changes in your body’s contours. The razor blades also feature a blue indicator strip that fades away to tell you when you are no longer getting the optimal shave. Based on shaving twice per week, each razor blade refill will last for up to 1 month. Just use and replace when you are ready for a new one. Did you know that any Venus blade refill fits any Venus razor handle? Shave your way without buying a whole new Venus handle. Close & clean in 1 stroke<br><br>DURABLE DESIGN: Each blade refill lasts up to one month (based on twice/week shave); just use and replace when you're ready for a new one<br><br>SAVE TIME: This razor has 3 built-in blades, shaving hair quickly and effectively. Shave right, not more<br><br>SOFT SHAVING: Made with protective elastomer comfort cushions around the blades<br><br>Features a blue indicator strip that fades when you’re no longer getting the optimal shave<br><br>Any Venus blade refill fits any Gillette Venus razor handle (except Simply Venus and Venus Pubic Hair Razor)<br><br>Handle & Cartridge Recycle with TerraCycle*",
  "gtin13": "4987176039187",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/165282.jpg",
  "name": "Gillette Venus Smooth Razor Blades 4 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 11.2,
    "lowPrice": 11.2,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T17:03:14.787Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 11.2,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/165282/gillette-venus-smooth-razor-blades"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/165282/gillette-venus-smooth-razor-blades"
  ],
  "sku": "165282",
  "updatedAt": "2022-12-06T17:03:14.787Z"
}
