{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Happy Way"
  },
  "createdAt": "2022-11-29T09:04:31.000Z",
  "description": "It’s the flavour that started it all—Happy Way’s Vanilla Whey Protein Powder is smooth, creamy and anything but boring! Packed with all-natural goodness and nutrients that nourish from the inside out, this is the flavour you’ll always come back to, time and time again. Perfect in your morning smoothie, workout shake, and a go-to flavour for all your baked treats, it delivers a subtle sweetness that’s lick-your-lips delicious! It’s a classic for a reason.\n\nEnjoy at breakfast, lunch and snack time by combining two heaped tablespoons (30 g) with water or your milk of choice, mixing well in a shaker or blender to create a delicious shake or smoothie. Alternatively, add 30 grams to your morning oats, natural yoghurt or baked goodies. For optimal results, enjoy twice a day. \n\n\nKey benefits: \n100% natural\nMade with pasture-fed whey\nNo artificial flavours, preservatives or sweeteners\nGluten-free, non-GMO\nSupports energy, weight management and fitness goals \n\n\nSouth Aussie health and wellness brand Happy Way have been adding flavour and fun to smoothie cups across the globe since 2015. Proudly 100% natural and packed full of goodness, Happy Way’s supplements are designed to nourish the mind and body whilst supporting you to live life to the fullest! Offering a range of nutritional products to suit all needs and dietary requirements, they’re available in a range of mouth-watering flavours guaranteed to satisfy tummies and taste buds everywhere!",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/1073931442.jpg",
  "name": "Happy Way 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 51.95,
    "lowPrice": 51.95,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-29T08:25:43.838Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 51.95,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073931442/happy-way-whey-protein-powder-vanilla-500g"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073931442/happy-way-whey-protein-powder-vanilla-500g"
  ],
  "sku": "1073931442",
  "updatedAt": "2022-11-29T08:25:43.838Z"
}
