{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "John Frieda"
  },
  "createdAt": "2022-12-06T11:27:07.678Z",
  "description": "<p>Care for your gorgeous curls with John Frieda Frizz Ease Dream Curls Conditioner. Get the moisture and definition you've been wanting with soft, bouncy curls so you're ready to conquer whatever comes your way. Transform your frizzy curls and ringlets with our rich, curl-loving formulas. This curly hair conditioner, formulated with rosehip oil and our curl-enhancing technology, detangles and helps reform curls. This paraben-free, SLS/SLES sulfate-free conditioner for wavy, curly hair also moisturises to enhance curls and smooth unmanageable curls. 1. ANTI-FRIZZ FORMULA - Helps style unmanageable curls with anti-frizz, Curl Enhancing Technology formula that moisturises, detangles, and forms bouncy, lightweight, soft curls. 2. CARE FOR CURLS WITH CONFIDENCE - Spend more time embracing your natural curls with this conditioner that deeply nourishes, softens, and untangles.  3. LOCKS IN MOISTURE FOR DEFINITION AND BOUNCE - Align curly strands to create an ideal shape with bounce, nourishment, moisture and hydration. 4. NOURISHING MOISTURE - Fight dry hair with rich, creamy hydration for difficult to manage curly and wavy hair. 5. PARABEN FREE, SLS/SLES SULFATE FREE FORMULA - This conditioner is paraben free and SLS/SLES sulfate free.</p>",
  "gtin13": "717226271861",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/152457.jpg",
  "name": "John Frieda Frizz Ease Dream Curls Conditioner 250mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 18,
    "lowPrice": 18,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T11:27:07.678Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 18,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/152457/john-frieda-frizz-ease-dream-curls-conditioner"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/152457/john-frieda-frizz-ease-dream-curls-conditioner"
  ],
  "sku": "152457",
  "updatedAt": "2022-12-06T11:27:07.678Z"
}
