{
  "@type": "Product",
  "additionalProperty": [
    {
      "@type": "NutritionInformation",
      "calories": "-",
      "carbohydrateContent": "-",
      "dietary_fibre": "-",
      "fatContent": "-",
      "name": "nutrition",
      "proteinContent": "-",
      "saturatedFatContent": "-",
      "servingSize": "100 g",
      "sodiumContent": "-",
      "sugarContent": "-"
    }
  ],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Lipton"
  },
  "createdAt": "2022-11-24T12:33:42.013Z",
  "description": "LIPTON TEA BAG QUALITY BLACK 200 GROur Master Blenders have crafted a delicious blend that includes carefully selected and fresh-pressed tea leaves, capturing as much natural tea taste as possible. Lipton Black Tea blend has real tea leaves specially blended to enjoy a hot tea or iced tea. To enjoy Lipton Black Tea iced as the perfect addition for any of your meals because is naturally tasty and refreshing. Don’t just default to the usual, enjoy the superior taste of fresh-brewed Lipton tea. It’s the Lipton Difference, so take a sip and let our tea brighten your day. To enjoy iced, simply brew 4 fresh tea bags with 1 quart boiling water, brew 3 minutes, sweeten, and add 3 quarts of fresh cold water and ice. Then sip and let great-tasting Lipton black tea brighten your day! Thomas Lipton was a man on a mission – to share his passion for tea around the world. He believed that everyone deserved high quality, great tasting tea. And over 120 years later, that belief is still what drives us – inspiring more flavours, more varieties and more love than ever before. All our tea bags are 100% sustainably sourced, which translates into ensuring decent wages for tea farmers around the world together with access to quality housing, education and medical care. Your tea is their brighter future.Lipton Quality Black is well know for its reddish golden hue and its rich natural tasteSourced from some of the finest tea gardens in the worldLipton Quality Black tea is expertly blended to give you the famous Lipton taste which is vigorously maintained every season.Lipton Quality Black has double chamber tea bagsLipton Quality Black is available in packs of 25, 50 , 100 & 200We have worked closely with the Rainforest Alliance to holistically approach sustainability and the welfare of all farm workers",
  "gtin13": "6281006868694",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/587911.jpg",
    "width": 1200
  },
  "name": "Lipton Quality Black Tea Bags 100 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 4,
    "lowPrice": 4,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-24T12:33:42.001Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 4,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/587911/lipton-quality-black-tea-bags"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/587911/lipton-quality-black-tea-bags"
  ],
  "sku": "587911",
  "updatedAt": "2022-11-24T12:33:42.001Z"
}
