{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Retinol acetate (vitamin A) 300 micrograms R.E.# Betacarotene 600 micrograms Colecalciferol (vitamin D3) 20 micrograms Phytomenadione (vitamin K1) 20 micrograms Calcium pantothenate (vitamin B5) 11.9 mg Thiamine nitrate (vitamin B1) 4.2 mg Nicotinamide 14 mg Riboflavin (vitamin B2) 3.85 mg Pyridoxine hydrochloride (vitamin B6) 6 mg Cyanocobalamin (vitamin B12) 21.6 micrograms Biotin (vitamin H) 45 micrograms Folic acid 400 micrograms dl-alpha-tocopheryl acetate (vitamin E) 28 mg Ascorbic acid (vitamin C) 150 mg Calcium (394 mg as calcium carbonate and 6 mg as calcium hydrogen phosphate) 400 mg Magnesium (as magnesium oxide) 64 mg Iron (as ferrous fumarate) 6.8 mg Zinc (as zinc oxide) 8 mg Manganese (as manganese sulfate monohydrate) 5 mg Chromium (as chromic chloride hexahydrate) 25 micrograms Selenium (as sodium selenate) 55 micrograms Copper (as cupric sulfate) 900 micrograms Iodine (as potassium iodide) 150 micrograms #R.E = Retinol Equivalents"
    },
    {
      "name": "Contains",
      "value": "Sulfites, colourings and tabletting aids. 60 Tablets"
    },
    {
      "name": "Warning",
      "value": "This medicine contains selenium which is toxic in high doses. A daily dose of 150 micrograms for adults of selenium from dietary supplements should not be exceeded. Vitamin and mineral supplements should not replace a balanced diet. Not for the treatment of iron deficiency conditions. Talk to your health professional before you use if you are breastfeeding. If taking other supplements, read the label since supplements may contain the same ingredients. Keep out of reach of children."
    },
    {
      "name": "Size",
      "value": "1 Pack"
    },
    {
      "name": "Unit Price",
      "value": "$21.50 per 1Ea"
    }
  ],
  "brand": "Centrum",
  "createdAt": "2022-12-02T03:08:01.206Z",
  "description": "Centrum Multivitamin And Mineral Supplement for Women 60 Tablets",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/1/2/8/1281696.jpg",
  "name": "Multivitamin And Mineral Supplement for Women 60 Tablets",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 21.5,
    "lowPrice": 21.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-02T03:08:01.205Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "21.50",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/centrum-vitamin-multi-for-women"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/centrum-vitamin-multi-for-women"
  ],
  "sku": "1281696",
  "updatedAt": "2022-12-02T03:08:01.205Z"
}
