{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Each tablet contains: Thiamine nitrate 700 micrograms equiv. to Thiamine (Vitamin B1) 567.4 micrograms, Riboflavin (Vitamin B2) 1.3 mg, Nicotinamide 16 mg, Calcium pantothenate 2.18 mg, equiv. to pantothenic acid (Vitamin B5) 2 mg, Pyridoxine hydrochloride 700 micrograms equiv. to Pyridoxine (Vitamin B6) 600 micrograms, Cyanocobalamin (Vitamin B12) 2 micrograms, Folic acid 100 micrograms, Ascorbic acid (Vitamin C) 25 mg, Colecalciferol (Vitamin D3) 7.5 micrograms (300 IU), Retinol acetate 258.7 micrograms equiv. to Vitamin A 225 micrograms RE, Iron (as Ferrous fumarate) 1.9 mg, Manganese (as Manganese sulfate monohydrate) 1 mg, Biotin 30 micrograms, dl-Alpha-Tocopheryl acetate (Vitamin E) 3 IU, Iodine (as Potassium iodide) 50 micrograms, Chromium (as Chromic chloride hexahydrate) 5 micrograms, Zinc (as Zinc oxide) 1.4 mg, Copper (as Cupric oxide) 170 micrograms, Magnesium (as Heavy magnesium oxide) 42 mg."
    },
    {
      "name": "Contains",
      "value": "Contains sulfites. 200 Tablets"
    },
    {
      "name": "Warning",
      "value": "If you are pregnant or considering becoming pregnant, do not take vitamin A supplements without consulting your doctor or pharmacist. When taken in excess of 3000 micrograms retinol equivalents, vitamin A can cause birth defects. The recommended daily amount of vitamin A from all sources is 700 micrograms retinol equivalents for women and 900 micrograms retinol equivalents for men. If symptoms persist, talk to your health professional. Vitamins and minerals can only be of assistance if dietary intake is inadequate. Not for the treatment of iron deficiency conditions. Contains sulfites."
    },
    {
      "name": "Size",
      "value": "200 pack"
    },
    {
      "name": "Unit Price",
      "value": "$0.08 per 1Ea"
    }
  ],
  "brand": "Nature's Way",
  "createdAt": "2022-11-24T07:07:47.000Z",
  "description": "Nature's Way Multi Vitamin With Antioxidants Tablets",
  "image": {
    "@type": "ImageObject",
    "height": 300,
    "mime": "image/jpeg",
    "url": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/9/5/4/9548938.jpg",
    "width": 300
  },
  "name": "Multi Vitamin With Antioxidants Tablets",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 16.3,
    "lowPrice": 16.3,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-24T07:05:56.261Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "16.30",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/natures-way-multi-vitamin-capsules"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/natures-way-multi-vitamin-capsules"
  ],
  "sku": "9548938",
  "updatedAt": "2022-11-24T07:05:56.261Z"
}
