{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Nestle NAN"
  },
  "createdAt": "2022-12-06T01:53:35.115Z",
  "description": "<p><strong>WIN Peter Alexander PJs for the family!</strong></p><p><span style=\"background-color: transparent;\">Purchase any NAN Toddler Milk Drink and enter between 01.07.22 – 15.10.22. AU res 18+. Retain original itemised receipt(s). Max 1 entry p/transaction. Max 1 Instant Win prize p/person (excludes SA res). Draw occurs prior to promotional period (on 27.06.22) to determine 20 winning moments throughout promotional period. Prize is 1 of 20 $500 PETER ALEXANDER eGift cards. Total Instant Win Prize Pool $10,000. Instant Winners notified on screen & via email within 2 business days and published on www.nestle.com.au/productnews/winners by 02.11.22. Second Chance Draw occurs 09.11.22. Claim prize by 09.02.23. Unclaimed prize draw occurs 15.02.23. Authorised by NSW: TP/01443, ACT: TP 22/00810, SA Permit T22/630.</span><br/></p><ul><li>NAN OPTIPRO 3 is a formulated supplementary food for young children.</li><li>NAN OPTIPRO 3 is a growing up milk drink for toddlers from 1 year. We optimise the formulation with the right amount of quality proteins for your toddler’s growth and development, plus our scientific formulation also includes probiotic Bifidus BL and 16 essential vitamins and minerals.</li><li><strong>OPTIMISED PROTEIN</strong>: NAN OPTIPRO 3 Toddler Milk Drink has been scientifically designed with age optimised protein levels, tailored to help support growth and development in young children.</li><li><strong>CALCIUM & VITAMIN D</strong>: Rich in vitamin D to help with the absorption of calcium, which supports your child’s muscle function and maintains strong teeth and bones.</li><li>NAN OPTIPRO 3 has been specially formulated for your toddler to enjoy supplementary to a varied diet when energy and nutrient intakes may not be adequate.</li><li><strong>16 VITAMINS AND MINERALS</strong>: Just 2 serves per day provides your child with an average of 50% or more of the recommended dietary intake of calcium, iron, zinc, iodine and vitamins B1, B2, C, D & E.</li><li><strong> PROBIOTIC BIFIDUS BL</strong>: One of the most well researched probiotic strains in paediatric nutrition.</li><li>Backed by more than 150 years of expertise, Nestlé has pioneered cutting edge research in paediatric nutrition and is committed to science for children’s nutrition foundation.</li><li>For hygiene and convenience, it is available in an innovative packaging format with a separate storage area for the scoop, and a semi-transparent window which allows you to see how much powder is left in the can without having to open it.</li></ul>",
  "gtin13": "7613287028563",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/155538.jpg",
  "name": "Nestle Nan Optipro 3 Toddler 1+ Years Milk Drink Powder 800g",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 23,
    "lowPrice": 23,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T01:53:35.115Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 23,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/155538/nestle-nan-optipro-3-toddler-1-years-milk-drink-powder"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/155538/nestle-nan-optipro-3-toddler-1-years-milk-drink-powder"
  ],
  "sku": "155538",
  "updatedAt": "2022-12-06T01:53:35.115Z"
}
