{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 7,
    "ratingValue": 4.85714285714286
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Nivea"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "NIVEA Soft All-purpose Moisturiser with Vitamin E and Jojoba Oil has been enriched with two powerful ingredients so you can get the best out of your everyday lotion. The formula highly refreshing and quick absorbing, intensively moisturising your skin.NIVEA Soft All-purpose Moisturiser with Vitamin E and Jojoba Oil is a highly effective, intensive moisturising cream for everyday use. The lotion's light texture is ideal for all skin types – from dry to sensitive – always giving you the most refreshing feeling. The compact pot makes it perfect for easy, everyday application anywhere you want. This fantastic formula with Vitamin E and Jojoba Oil is quickly absorbed to replenish the skin. This provides you with a long-lasting soft touch and leaves your skin feeling soft and supple. Skin compatibility dermatologically approved. NIVEA Soft is ph neutral & dermatological approved to provide the best everyday moisture for your face, hands & body.1Quality Ingredients: infused with Vitamin E and Jojoba Oil2Lasting Nourishment: noticeably reduces the roughness of dry to very dry skin after just one application3Rich Formula: restores the appearance of dry skin4Fast Absorption: soft and creamy yet fast absorbing or a non-greasy feeling5Usage: perfect for everyday use to boost your skin’s hydration6Suitable for all skin types: Skin tolerance dermatologically provenHighly effective, intensive moisturizing cream",
  "gtin13": "4005808890576",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/027053_7.jpg",
    "width": 1200
  },
  "name": "Nivea Soft Moisturiser Cream Face Body Hands 75ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 6,
    "lowPrice": 6,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:21:26.485Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 6,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/27053/nivea-soft-moisturiser-cream-lotion-with-jojoba-oil-vitamin-e"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/27053/nivea-soft-moisturiser-cream-lotion-with-jojoba-oil-vitamin-e"
  ],
  "sku": "27053",
  "updatedAt": "2022-11-23T22:21:26.485Z"
}
