{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Nivea"
  },
  "createdAt": "2022-12-06T17:40:44.910Z",
  "description": "NIVEA’s innovative Cellular Lift Expert Advanced Anti-Age Day Cream formula SPF 15, with pure Bakuchiol and micro and macro Hyaluronic Acid, is just what you need for an extra lift. It defines contours, restores the skin's structure and reduces deep wrinkles.<br><br>NIVEA Cellular Lift Expert Advanced Anti-Age Day Cream - the science of younger looking skin. Younger-looking skin is a visible reflection of healthy cellular activity. Our innovative formula features a combination of powerful anti-age actives working to reveal younger looking skin. PURE BAKUCHIOL to help visibly improve skin density and to strengthen skin’s structure. MICRO & MACRO HYALURONIC ACID, two anti-age must-haves, known to hydrate, smooth skin and help to visibly reduce wrinkles. Apply daily on cleansed face, avoiding direct eye contact. For optimal results complement your routine with NIVEA Cellular Expert Lift Advanced Anti-Age Night Care.<br><br>189% of women agree skin elasticity is visibly improved (Self-Assessment Study, 2 weeks)<br><br>2Quality Ingredients: With pure Bakuchiol + micro & macro Hyaluronic Acid<br><br>3Visible Results: see noticeable change after one use<br><br>4Lasting Nourishment: Defines facial contours, reduces deep wrinkles and improves skin structure<br><br>5SPF 15: Protection help to protect the skin against sun-induced wrinkle formation and premature skin ageing<br><br>6Directions: apply a generous amount to clean skin, massaging thoroughly around the face, neck, ears, and décolleté.",
  "gtin13": "4005900940308",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/196582.jpg",
  "name": "Nivea Cellular Lift Expert Anti-age Day Cream Moisturiser Spf15 50ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 38,
    "lowPrice": 38,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T17:40:44.910Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 38,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/196582/nivea-cellular-lift-expert-anti-age-day-cream-moisturiser-spf15"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/196582/nivea-cellular-lift-expert-anti-age-day-cream-moisturiser-spf15"
  ],
  "sku": "196582",
  "updatedAt": "2022-12-06T17:40:44.910Z"
}
