{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "1238538 E - NOURISHING AFTER COLOUR CONDITIONER: AQUA / WATER CETEARYL ALCOHOL DIMETHICONE GLYCERIN BEHENTRIMONIUM CHLORIDE OLEA EUROPAEA FRUIT OIL / OLIVE FRUIT OIL ARGANIA SPINOSA KERNEL OIL VACCINIUM MACROCARPON (CRANBERRY) SEED OIL HELIANTHUS ANNUUS SEED OIL / SUNFLOWER SEED OIL ROSMARINUS OFFICINALIS LEAF EXTRACT / ROSEMARY LEAF EXTRACT PERSEA GRATISSIMA OIL / AVOCADO OIL BUTYROSPERMUM PARKII BUTTER / SHEA BUTTER AMODIMETHICONE ISOPROPYL ALCOHOL CAPRYLYL GLYCOL CITRIC ACID LACTIC ACID TOCOPHEROL SODIUM BENZOATE CETRIMONIUM CHLORIDE LINALOOL BENZYL ALCOHOL PARFUM / FRAGRANCE (F.I.L. C249244/1) Please be aware that ingredient lists for the products of our brand are updated regularly. Please refer to the ingredient list on your product package for the most up to date list of ingredients to ensure it is suitable to your personal use., 1092149 Nourishing cream: Aqua/ Water, Cetearyl Alcohol, Deceth-3, Propylene Glycol, Laureth-12, Ammonium Hydroxide, Oleth-30, Lauric Acid, Hexadimethrine Chloride, Glycol Distearate,1-Hydroxyethyl 4, 5-Diamino Pyrazole Sulfate, Ethanolamine, Polyquaternium-22, Silica Dimethyl Silylate, 4-Amino-2-Hydroxytoluene, CI 77891/ Titanium Dioxide, 5-Amino-6-Chloro-o-Cresol, p-Aminophenol, Ascorbic Acid, Sodium Metabisulfite, Toluene-2,5-Diamine, Dimethicone, Pentasodium Pentetate, Carbomer, Vitis Vinifera Seed Oil/ Grape Seed Oil, Parfum / Fragrance. (FIL C45104/1) 1071202- Developer Milk: Aqua/ Water, Hydrogen Peroxide, Cetearyl Alcohol, Sodium Stannate, Trideceth-2 Carboxamide Mea, Pentasodium Pentetate, Phosphoric Acid, Ceteareth-25, Tetrasodium Pyrophosphate, Glycerin, Parfum / Fragrance, (FIL C34593/1) 1040683 E - Nourishing Radiance Conditioner: Aqua/ Water, Cetearyl Alcohol, Behentrimonium Chloride, Cetyl Esters, Trideceth-6, Chlorhexidine Dihydrochloride, Limonene. Linalool, Benzyl Alc"
    },
    {
      "name": "Contains",
      "value": "1. Nourishing Colour Cream 2. Developer Cream with applicator bottle 3. Multi-application Conditioner 4. Gloves & instruction leaflet"
    },
    {
      "name": "Allergen",
      "value": "Contains Milk"
    },
    {
      "name": "Colour",
      "value": "Red"
    },
    {
      "name": "Warning",
      "value": "This product contains ingredients which may cause skin irritation to certain individuals. A preliminary test according to accompanying directions should be made before use. This product must not be used for dyeing eyelashes or eyebrows; to do so many be injurious to the eye. Irritant. Avoid contact with eyes. Rinse eyes immediately with water if product comes into contact with them. If you wear contact lenses, take them out before rinsing eyes thoroughly with water., AN ALLERGY ALERT TEST MUST BE DONE 48 HOURS BEFORE EACH USE OF THIS PRODUCT"
    },
    {
      "name": "Size",
      "value": "1 pack"
    },
    {
      "name": "Unit Price",
      "value": "$17.00 per 1Ea"
    },
    {
      "name": "Country Of Origin",
      "value": "Imported"
    }
  ],
  "brand": "Garnier",
  "createdAt": "2022-12-05T14:07:19.644Z",
  "description": "Garnier Nutrisse Hair Colour 6.6 Fiery Red",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/8/6/5/8656855.jpg",
  "name": "Nutrisse Hair Colour 6.6 Fiery Red",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 17,
    "lowPrice": 17,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-05T14:07:19.644Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "17.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/garnier-nutrisse-hair-colour-fiery-red"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/garnier-nutrisse-hair-colour-fiery-red"
  ],
  "sku": "8656855",
  "updatedAt": "2022-12-05T14:07:19.644Z"
}
