{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Omo"
  },
  "createdAt": "2022-12-05T12:21:19.767Z",
  "description": "<p>OMO LAUNDRY POWDER ACTIVE CLEAN 2 KG<BR><BR>Omo Laundry Detergent Powder with built in pre-treaters attacks tough stains like grease, oil, mud, grass and chocolate ice cream. This effective washing detergent is specially formulated to be tough on stains. Omo Laundry Detergent Powder has the power of built in pre-treaters so one dose is all you need for amazing first time stain removal! Specially formulated to be tough on stains, Omo Washing Powder acts as a stain remover to clean all stains effectively in no time.<br/><br/>Omo Laundry Powder is suitable for all washing machine types - both front loader and top loader - and is recommended by leading washing machine manufacturers for spotless results.<br/><br/>Omo has always been committed to delivering the very best in stain removal and innovation for your laundry. Globally, hundreds of scientists are working on their laundry formulations. These formulations are designed to provide you with outstanding stain removal and clothes care. Whatever Omo washing detergent you choose you can trust Omo can help you make laundry easier.<br/>Omo believes that dirt is good for kids. Why? Because every time kids come back with dirt and stains on their clothes, you know they’ve had an adventure! Experiential learning through messy play is essential for a child’s development. Through experiential learning and messy play, children can explore their interests, develop confidence, and embrace their creativity. The laundry basket can sometimes seem bottomless, but every time we clean our children’s clothes we’re helping them to go back out there clean, smart, and prepared to take on the world. With Omo around to take care of the toughest stains, you don’t have to worry about the laundry.<br/>Laundry can have a big impact on the environment. <BR><BR>Omo Washing Powder with built-in pre-treaters<BR><BR>Amazing 1st time stain removal with this expert washing detergent<BR><BR>Specially formulated to be tough on stains and make laundry easier<BR><BR>Omo Washing Powder is suitable for all washing machine types<BR><BR>Laundry detergent recommended by leading Washing Machine Manufacturers<BR><BR>Winner of Readers Digest's 2016 Trusted Brands - Laundry Detergent </p>",
  "gtin13": "9300830033959",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/430650.jpg",
  "name": "Omo Active Clean Laundry Detergent Washing Powder 2Kg",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 26,
    "lowPrice": 26,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-05T12:21:19.766Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 26,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/430650/omo-active-clean-laundry-detergent-washing-powder"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/430650/omo-active-clean-laundry-detergent-washing-powder"
  ],
  "sku": "430650",
  "updatedAt": "2022-12-05T12:21:19.766Z"
}
