{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Omo"
  },
  "createdAt": "2022-12-05T12:15:24.410Z",
  "description": "<p>OMO LAUNDRY POWDER SENSITIVE 2 KG<BR><BR>Omo Sensitive Laundry Detergent Washing Powder is dermatologically tested and contains no dyes or perfumes. Just 1 dose of this washing detergent is tough on stains and leaves clothes gentle on sensitive skin.<br/><br/>Omo Sensitive Laundry Powder is suitable for all washing machine types - both front loader and top loader - and is recommended by leading washing machine manufacturers for spotless results.<br/><br/>Omo has always been committed to delivering the very best in stain removal and innovation for your laundry. Globally, hundreds of scientists are working on their laundry formulations. These formulations are designed to provide you with outstanding stain removal and clothes care. Whatever Omo washing detergent you choose you can trust Omo can help you make laundry easier.<br/>Omo believes that dirt is good for kids. Why? Because every time kids come back with dirt and stains on their clothes, you know they’ve had an adventure! Experiential learning through messy play is essential for a child’s development. Through experiential learning and messy play, children can explore their interests, develop confidence, and embrace their creativity. The laundry basket can sometimes seem bottomless, but every time we clean our children’s clothes we’re helping them to go back out there clean, smart, and prepared to take on the world. With Omo around to take care of the toughest stains, you don’t have to worry about the laundry.<br/>Laundry can have a big impact on the environment. Find out about the Laundry Sustainable Living Plan and what Omo is doing to reduce their impact on the Omo website..<BR><BR>Omo Sensitive Washing Powder is tough on stains & soft on sensitive skin<BR><BR>Omo Sensitive Laundry Detergent Powder is dermatologically tested<BR><BR>Amazing 1st time stain removal with this expert washing detergent<BR><BR>Omo Washing Powder is suitable for all washing machine types<BR><BR>Laundry detergent recommended by leading Washing Machine Manufacturers<BR><BR>Winner of Readers Digest's 2016 Trusted Brands - Laundry Detergent </p>",
  "gtin13": "9300830034017",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/471182.jpg",
  "name": "Omo Sensitive Laundry Detergent Powder Front & Top Loader 2Kg",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 26,
    "lowPrice": 26,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-05T12:15:24.409Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 26,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/471182/omo-sensitive-laundry-detergent-powder-front-top-loader"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/471182/omo-sensitive-laundry-detergent-powder-front-top-loader"
  ],
  "sku": "471182",
  "updatedAt": "2022-12-05T12:15:24.409Z"
}
