{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Omo"
  },
  "createdAt": "2022-12-05T12:02:10.243Z",
  "description": "OMO LAUNDRY POWDER 3 IN 1 CAPS DOY ACTIVE 28 EA<br><br>New OMO laundry detergent dissolves rapidly, penetrating deeply to target the root of stains, lifting stains completely away. With this formula, clothes get a new life and remain like new ones even after prolonged use. The quick action helps remove the stubborn stains and maintains the freshness of the fabric.<br>New OMO powder detergent guarantees 100% Effective Stain Removal.<br><br><br>HOW TO USE OMO Laundry Capsules Triple DOY Active. <br><br>Storage Condition to be stored in a Cool, Dry, Hygienic place, Please Avoid Humidity, Heat, Sunlight, and Strong Light. Preparation and usage; Always wash whites and coloured clothes separately, Always dissolve the powder completely before adding clothes, do not use bleach with this product, For really tough stains, soak clothes in wash solution for 30 mins before washing, Then rinse with water. Always follow the washing instructions. <br><br>The Brand Message; OMO is an Unilever brand that specialises in making active, enzyme-rich detergents. Their product portfolio includes detergent powder and liquid, including products that are aimed at sensitive skin. <br><br>Safety warning; Do not swallow. Rinse and dry hands thoroughly after use, keep out of reach of children. Avoid contact with eyes. In case of contact with eyes, rinse immediately with water. People with sensitive or damaged skin should avoid prolonged contact with the wash solution, if the contact occurred please contact a doctor immediately. The use of gloves is recommended to prevent any unwanted problems.<br><br>OMO Laundry Capsules Triple DOY Active is specially formulated to give you 100% effective stain removal.<br><br>OMO Laundry Capsules Triple DOY Active quickly dissolves in the washing machine. It works even with cold water and removes tough stains<br><br>OMO Laundry Capsules Triple DOY Active penetrates deep into the fabric and targets the root of the stain.<br><br>OMO Laundry Capsules Triple DOY Active ensures stain removal after every wash.<br><br>OMO Laundry Capsules Triple DOY Active are effective and super easy to wash, ensuring unbeatable stain removal and perfect care.<br><br>OMO Laundry Capsules Triple DOY Active guarantee 100% home hygiene.",
  "gtin13": "9300830070022",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/221076.jpg",
  "name": "Omo Active 3 In 1 Capsule 28 pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 18.2,
    "lowPrice": 18.2,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-05T12:02:10.242Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 18.2,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/221076/omo-active-3-in-1-capsule"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/221076/omo-active-3-in-1-capsule"
  ],
  "sku": "221076",
  "updatedAt": "2022-12-05T12:02:10.242Z"
}
