{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 5
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Omo"
  },
  "createdAt": "2022-11-22T22:53:07.000Z",
  "description": "OMO LAUNDRY LIQUID SENSITV DILUTE AT HOME REFILL 665 MLDon’t compromise performance for sustainability. Omo Dilute at Home Sensitive Refill is a laundry liquid with a 3X concentrate formulation that has been developed to attack stains 1st time whilst being gentle on skin and reduce plastic waste. This game-changing product from Australia’s Most Trusted Laundry brand is more practical as there is no change in dosage and easy to carry. It is also more sustainable with the bottle containing 50% less plastic compared to a normal 2L bottle, 70% less water is used during the production process and the bottle is 100% recyclable. Omo Dilute At Home Sensitive Laundry Liquid is also more affordable, saving 20% vs full priced Omo Active Laundry Liquid 2L. Using Omo Dilute at Home Sensitive Laundry Liquid is simple and easy. 1. Fill your empty, dry OMO 2L bottle with 1.35L tap water; 2. Pour entire contents of Omo Dilute at Home refill into the bottle and shake gently;3. Use as normal OMO Laundry Liquid.At Unilever we understand that plastic pollution is on the rise. For this reason, and many others, we have decided to set out the Unilever Sustainable Living Plan. The OMO Dilute at Home Refill will play a major role in helping us achieve our vision of making sustainable living commonplace.Reduce plastic waste. 50% less plastic usedSimply refill your OMO 2L bottle with OMO Dilute at Home Concentrate and water to make 2L of laundry detergent, for up to 40 washesAmazing stain remover. Attack stains first time70% less water used during production100% recyclable bottleNo perfumes, no dyes. Dermatologically tested",
  "gtin13": "9300830065103",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/141941.jpg",
    "width": 1200
  },
  "name": "Omo Dilute At Home Refill Sensitive 665mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 15,
    "lowPrice": 15,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-22T14:36:40.422Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 15,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/141941/omo-dilute-at-home-refill-sensitive"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/141941/omo-dilute-at-home-refill-sensitive"
  ],
  "sku": "141941",
  "updatedAt": "2022-11-22T14:36:40.422Z"
}
