{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Otrivin"
  },
  "createdAt": "2022-12-06T15:59:47.529Z",
  "description": "Otrivin Baby & Kids Nasal Spray is an isotonic saline solution that gently cleanses the nasal cavities when the nose is blocked by washing away the excess mucus or the allergen particles such as dust or pollen. It also moisturises dry or irritated noses.<br><br>WHAT IS OTRIVIN BABY & KIDS NASAL SPRAY?<br> Otrivin Baby & Kids Nasal Spray is an isotonic saline solution that gently cleanses the nasal cavities when the nose is blocked by washing away the excess mucus or the allergen particles such as dust or pollen. It also moisturises dry or irritated noses. <br> <br> HOW IT WORKS<br> Otrivin Baby & Kids Nasal Spray is an isotonic saline solution. The salt concentration is optimised to prevent any nasal irritation. The solution contains castor oil (macrogol glycerol hydroxystearate) which is known to have moisturising and emollient properties. Otrivin Baby & Kids Nasal Spray is recommended to gently cleanse the nasal cavities when the nose is blocked, e.g. during a cold or in allergic conditions, by washing away the excess mucus or the allergen particles such as dust or pollen. It also moisturises the nasal mucosa when dry or irritated in case of minor nasal irritations or due to low humidity (e.g. due to heatedairconditioned rooms, high altitude, air travelling) as well as thinning and loosen nasal secretions and help their removal.<br> <br> WHO IS IT FOR <br> Suitable for infants aged 2 weeks old and above, children and adults. <br> <br> HOW TO USE<br> The usual frequency of use is 2 to 4 times a day per nostril. Suitable for infants, children and adults. However, you should seek medical advice before using it on an infant less than 2 weeks old. For children below 11 years, Otrivin Baby & Kids Nasal Spray should be used under adult supervision. In elderly or disabled people, the use of the device may require help from an adult. For infants and toddlers (up to 2 years): 1 spray in each nostril as needed. For adults and children (over 2 years): 1 or 2 sprays in each nostril as needed.<br><br>Clears blocked noses. Moisturises dry or irritated noses",
  "gtin13": "9300673870056",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/207943.jpg",
  "name": "Otrivin Baby Nasal Spray 15ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 10,
    "lowPrice": 10,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T15:59:47.528Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 10,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/207943/otrivin-baby-nasal-spray"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/207943/otrivin-baby-nasal-spray"
  ],
  "sku": "207943",
  "updatedAt": "2022-12-06T15:59:47.528Z"
}
