{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 13,
    "ratingValue": 4.92307692307692
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Palmolive"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "<p>Palmolive Naturals Mild & Sensitive Body Wash With 100% Natural Styrax extracts is pH balanced and contains 0% parabens, phthalates & alcohol. Made with a Recyclable Bottle.<br/><br/>We're here to make great skincare products without complexity or compromise.<br/><br/>Our Palmolive Naturals Mild & Sensitive Body Wash with Moisturising Milk uses a non-irritating, hypoallergenic formula to provide daily care for sensitive skin.<br/>At Palmolive we're all about giving you more of what you love and less of what you don't.<br/><br/>That's why this Shower Gel is made with 100% Natural Styrax extracts. It contains mild cleansers to gently yet thoroughly cleanse your body. Wrap yourself in cotton with this delicate and gentle scent, we've lightly layered in citrusy notes and a woody finish.<br/><br/>What we leave out is as important as what we put in.<br/>- No Parabens<br/>- No Phthalates<br/>- No Mineral Oil<br/>- No Alcohol<br/>- No Silicones<br/>- No Soap<br/>- No Animal Derivatives<br/>- No Gluten<br/>- No BPA<br/><br/>This Shower Gel has been formulated with skin loving ingredients and is clinically tested and pH balanced. It's clinically proven and suitable for daily use on all skin types.<br/><br/>Please recycle us! This bottle is recyclable. <br/><br/>Size: 1L Body Wash Pump<br/><br/>Enough for 200 washes.<br/><br/>BODY WASH WITH NATURAL EXTRACTS: Palmolive Naturals Mild & Sensitive Body Wash is made with 100 percent Natural Styrax Extracts<br/><br/>SUITABLE FOR SENSITIVE SKIN: Our Palmolive Mild & Sensitive Body Wash formula has been clinically tested and suitable for daily use on all skin types<br/><br/>MORE OF WHAT YOU LOVE AND LESS OF WHAT YOU DON'T: Palmolive Shower Gel are FREE from Parabens, Phthalates, Mineral Oil, Alcohol, Silicones, Soap, Animal Derivatives, Gluten and BPA<br/><br/>GENTLE SCENT: Wrap yourself in cotton with this delicate and gentle scent, we've lightly layered in citrusy notes and a woody finish.<br/><br/>RECYCLABLE: Palmolive Naturals Body Wash are made with a recyclable bottle</p>",
  "gtin13": "8850006481295",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/814008.jpg",
  "name": "Palmolive Naturals Body Wash Mild & Sensitive Shower Gel 1L",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 10,
    "lowPrice": 10,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-01T12:58:30.947Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 10,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/814008/palmolive-naturals-body-wash-mild-sensitive-shower-gel"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/814008/palmolive-naturals-body-wash-mild-sensitive-shower-gel"
  ],
  "sku": "814008",
  "updatedAt": "2022-12-01T12:58:30.947Z"
}
