{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 33,
    "ratingValue": 4.6969696969697
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Palmolive"
  },
  "createdAt": "2022-12-06T12:23:24.373Z",
  "description": "Palmolive Foaming Hand Wash Soap in Japanese Cherry Blossom is made with skin-loving ingredients, for healthy, beautiful hands. It removes germs and contains NO parabens, phthalates or alcohol.<br><br>With natural botanical extracts, Palmolive Foaming Hand Wash Japanese Cherry Blossom will gently cleanse & remove germs while leaving your hands feeling soft and smooth.<br><br>The smell of spring with cherry blossoms, gardenia and jasmine, sweetened with cherry and raspberry notes.<br><br>What we leave out is as important as what we put in.<br>- No Parabens<br>- No Phthalates<br>- No Mineral Oil<br>- No Alcohol<br>- No Silicones<br>- No Soap<br>- No Animal Derivatives<br>- No Gluten<br>- No BPA<br><br>This product is made with 100% natural essential oil and is dermatologically tested and pH balanced.<br><br>Please recycle us! This bottle is recyclable.<br><br>Pack Size: 250mL pump<br>Refill your pump and save with Palmolive Foaming Hand Wash Refills<br><br>Use in the bathroom, kitchen and laundry.<br><br>FOAMING HAND WASH WITH NATURAL ESSENTIAL OILS: Palmolive Foaming Hand Wash Soap Japanese Cherry Blossom is made with 100 percent natural essential oil<br><br>SCENTED HAND WASH: The smell of spring with cherry blossoms, gardenia and jasmine, sweetened with cherry and raspberry notes.<br><br>FREE FROM: Parabens, Phthalates, Mineral Oil, Alcohol, Silicones, Soap, Gluten, BPA, and Animal Derived Ingredients<br><br>REFILL AND SAVE: you can refill and save with Palmolive Foaming Hand Wash refills<br><br>RECYCLABLE BOTTLE: Palmolive Foaming Hand Wash Soap pumps are made with a recyclable bottle",
  "gtin13": "8850006494097",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/500851.jpg",
  "name": "Palmolive Foaming Liquid Hand Wash Soap Japanese Cherry Blossom 250mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 2,
    "lowPrice": 2,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T12:23:24.370Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 2,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/500851/palmolive-foaming-liquid-hand-wash-soap-japanese-cherry-blossom"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/500851/palmolive-foaming-liquid-hand-wash-soap-japanese-cherry-blossom"
  ],
  "sku": "500851",
  "updatedAt": "2022-12-06T12:23:24.370Z"
}
