{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Panasonic"
  },
  "createdAt": "2022-12-06T18:46:42.817Z",
  "description": "TheÂ Panasonic LUMIX DMC-GM5 Mirrorless Micro Four Thirds Digital Camera(Green) packs a full-featured interchangeable lens system into a sleek, compact magnesium alloy frame. It features a 16 megapixel Digital Live MOS sensor and Venus Engine image processor to produce high-resolution images and Full HD 1080p video at 60/50 fps. The camera introduces a high-resolution electronic viewfinder to the GM series, enabling confident shot composition in a variety of environments. An integrated hotshoe is featured for using external flash units. Built-in wireless capabilities enable the GM5 to be remotely controlled from a linked mobile device and also supports image transfer to devices using the Panasonic Image App.<br /><br />A wide array of focusing technologies are implemented in the camera to ensure fast and accurate focusing. The smart Contrast AF system exchanges signals between camera and lens at a maximum of 240 fps (with compatible lenses); especially useful when using the camera's high-speed burst shooting at 5.8 fps in full 16MP resolution, and up to 40 fps in with the electronic shutter. You'll also find convenient focusing technologies such as Face/Eye Detection AF, Low Light AF for focusing in dimly-lit (-4 EV) conditions, and Focus Peaking when focusing manually.<br /><br />Included with the GM5 is the versatile LUMIX G Vario 12-32mm f/3.5-5.6 ASPH. MEGA O.I.S. lens; a standard zoom providing a 35mm-equivalent focal length range of 24-64mm. Its retractable design meshes well with the small form-factor of the camera and the inclusion of MEGA O.I.S. image stabilization benefits working with longer shutter speeds and in low-light conditions.<br /><br /> <br /><br />16MP Live MOS Sensor and Venus Engine<br />A 16 megapixel Micro Four Thirds Digital Live MOS sensor and Venus Engine image processor work together to produce high resolution imagery that exhibits a great deal of clarity, detail, and overall impressive image quality. The processing power affords heightened sensitivity to ISO 25600 with minimal noise for enhanced use in low-light conditions.<br />Electronic Viewfinder<br />The 1,166k-dot viewfinder lets you frame and capture shots even in bright sunlight. Based on the Adobe RGB color space, the viewfinder faithfully reproduces the primary colors for more true-to-life hues, allowing you to accurate judge the colors of your scene.<br />Silent Mode<br />When lights and noise from your camera could be distracting to a performer or audience, you can active the Silent Mode. This mode switches the shutter from mechanical to electronic, turns off all sounds, and deactivates the AF assist lamp and flash.<br />Autofocus Performance<br />Fast, Accurate Autofocus<br />By exchanging digital signals between camera and lens at a maximum of 240 fps, the smart Contrast AF system is both fast and accurate. The GM5 also delivers high-speed burst shooting at 5.8 fps in 16-megapixel resolution, and a maximum of 40 fps with the electronic shutter.<br /><br />Eye Sensor AF<br />Image output between the viewfinder and rear monitor is automatically switched by an integrated eye sensor. This same sensor also accommodates the Eye Sensor AF, which starts auto-focusing automatically by simply looking into the LVF, helping prevent missed shooting opportunities.<br /><br />Low Light AF<br />Thanks to its low light AF ability, the camera is designed to focus on subjects in -4EV situations, such as shooting outdoors at night.<br /><br />Face/Eye Detection AF<br />In additional to conventional Face Recognition AF, the Face/Eye Detection AF automatically adjusts the focus precisely on a subject's face or eye.<br /><br />Pinpoint AF<br />This feature incrementally sets magnification from 3x to 10x in 0.1x steps. This is ideal for precision focusing on a desired part of your frame, such as a flower or the pupil of an eye.<br />Focus Peaking<br />Focus Peaking can be enabled to show highlight around the in-focus edges, a feature useful when manually focusing in photo or video modes. The feature is also available in remote shooting when using a smartphone or tablet via Wi-Fi.<br />Built-in Wi-Fi<br />Wi-Fi connectivity lets you easily share images using the Panasonic Image App. By simply scanning the QR code displayed on the camera monitor with a smartphone or tablet, it also lets you use your mobile device as a remote controller for the camera. Additionally, a new Time function is ideal for sharing slow-shutter images like fireworks and nightscapes. Sharing while browsing is also made quicker, thanks to direct uploading capability.<br />LUMIX G Vario 12-32mm f/3.5-5.6 ASPH. MEGA O.I.S. Lens<br />Included with the GM5 is the standard zoom LUMIX G Vario 12-32mm f/3.5-5.6 ASPH. MEGA O.I.S. lens, which covers a 35mm-equivalent focal length range of 24-64mm. The retractable design maintains a sleek, compact profile that complements the GM5. Three aspherical elements and one extra-low dispersion element are incorporated into the optical design to minimize chromatic aberrations throughout the zoom range while also contributing to high overall sharpness. Multi-coated lens elements also benefit the image quality through the reduction of lens flare and ghosting for more contrast-rich and color-neutral photos and videos. MEGA O.I.S. image stabilization minimizes the appearance of camera shake to support working in low lighting and with longer shutter speeds, while support for the contrast-detection sensor drive at max. 240 fps focusing system enables quick and precise AF performance.<br />Additional Features<br />1080p video at 60/50 fps<br /><br />External flash hotshoe<br /><br />Durable magnesium alloy body<br /><br /> <br /><br />",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/1073954999.jpg",
  "name": "Panasonic 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 1749,
    "lowPrice": 1749,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T18:46:42.817Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 1749,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073954999/panasonic-lumix-g9-lumix-12-60mm-f-3-5-5-6-kit"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073954999/panasonic-lumix-g9-lumix-12-60mm-f-3-5-5-6-kit"
  ],
  "sku": "1073954999",
  "updatedAt": "2022-12-06T18:46:42.817Z"
}
