{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Contains",
      "value": "Propellent: Hydrocarbon"
    },
    {
      "name": "Warning",
      "value": "H225: Highly flammable liquid and vapour. H280: Contains gas under pressure; may explode if heated. H402: Harmful to aquatic life. P102: Keep out of reach of children. P210: Keep away from heat, sparks, open flames and hot surfaces. - No smoking. P211: Do not spray on an open flame or other ignition source. P251: Pressurized container: Do not pierce or burn, even after use. P261: Avoid breathing fumes, mists, vapours or spray. P301+P330+P331: IF SWALLOWED: Rinse mouth. Do NOT induce vomiting., EXTREMELY FLAMMABLE. DO NOT SPRAY ON A NAKED FLAME OR INCANDESCENT MATERIAL. KEEP AWAY FROM SOURCES OF IGNITION - NO SMOKING BEWARE: DELIBERATELY SNIFFING OR INHALING CONCENTRATED SPRAY CAN BE HARMFUL OR FATAL. KEEP OUT OF REACH OF CHILDREN. DO NOT SPRAY TOWARDS THE FACE. DO NOT SPRAY DIRECTLY ONTO HUMANS, PETS, EXPOSED FOOD, FOOD UTENSILS OR FOOD PREPARATION AREAS. REMOVE OR COVER FISH TANKS BEFORE SPRAYING. REMOVE CAGED BIRDS BEFORE SPRAYING. CARE SHOULD BE TAKEN NOT TO SPRAY DELICATE FABRICS OR FURNISHINGS AND PLASTIC SURFACES WITHOUT PRIOR TESTING. EXTREMELY FLAMMABLE., KEEP OUT OF REACH OF CHILDREN. DO NOT SPRAY TOWARDS THE FACE. DO NOT SPRAY DIRECTLY ONTO HUMANS, PETS, EXPOSED FOOD, FOOD UTENSILS OR FOOD PREPARATION AREAS. COVER FISH TANKS. REMOVE BIRDS BEFORE SPRAYING. DO NOT SPRAY ON DELICATE FABRICS, FURNISHINGS, PAINT WORK OR PLASTIC SURFACES WITHOUT PRIOR TESTING. EXTREMELY FLAMMABLE. DO NOT SPRAY ON NAKED FLAME OR INCANDESCENT MATERIAL. KEEP AWAY FROM SOURCES OF IGNITION - NO SMOKING. BEWARE: INTENTIONAL MISUSE BY DELIBERATELY CONCENTRATING AND INHALING CONTENTS CAN BE HARMFUL OR FATAL."
    },
    {
      "name": "Size",
      "value": "350g"
    },
    {
      "name": "Unit Price",
      "value": "$1.43 per 100G"
    }
  ],
  "brand": "Raid",
  "createdAt": "2022-11-29T06:33:17.972Z",
  "description": "Raid Pest Odourless Flying Insect Spray Killer",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/9/3/7/9374531.jpg",
  "name": "Pest Odourless Flying Insect Spray Killer",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 5,
    "lowPrice": 5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-29T06:33:17.971Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "5.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/raid-protector-fly-spray-hypo-allergenic"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/raid-protector-fly-spray-hypo-allergenic"
  ],
  "sku": "9374531",
  "updatedAt": "2022-11-29T06:33:17.971Z"
}
