{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Colourant Gel: AQUA /WATER - CETEARYL ALCOHOL - GLYCERIN - BEHENTRIMONIUM CHLORIDE - CANDELILLA CERA / CANDELILLAWAX - AMODIMETHICONE - CETYL ESTERS - ISOPROPYL ALCOHOL - TOCOPHERYL ACETATE - SODIUM PCA - PHENOXYETHANOL - ETHYLHEXYL SALICYLATE - TRIDECETH-6 - CHLORHEXIDINE DIGLUCONATE - LIMONENE - CAMELINA SATIVA SEED OIL - LINALOOL - BENZYL ALCOHOL - BENZYL BENZOATE - GERANIOL - CETRIMONIUM CHLORIDE - CITRONELLOL - HEXYL CINNAMAL - AMYL CINNAMAL - PARFUM / FRAGRANCE. Developer Cream AQUA / WATER - HYDROGEN PEROXIDE - CETEARYL ALCOHOL - SODIUM SALICYLATE - TRIDECETH-2 CARBOXAMIDE MEA - PHOSPHORIC ACID - CETEARETH-25 - TETRASODIUM ETIDRONATE - TETRASODIUM PYROPHOSPHATE - GLYCERIN. Shine Protect Condtioner AQUA /WATER - TRIDECETH-2 CARBOXAMIDE MEA - PROPYLENE GLYCOL - HEXYLENE GLYCOL - PEG-2 OLEAMINE - POLYGLYCERYL-4 OLEYL ETHER - OLEYL ALCOHOL - ALCOHOL DENAT. - POLYGLYCERYL-2 OLEYL ETHER - AMMONIUM HYDROXIDE - OLEIC ACID - SODIUM DIETHYLAMINOPROPYL COCOASPARTAMIDE - p-PHENYLENEDIAMINE - 2,4-DIAMINOPHENOXYETHANOL HCL - m-AMINOPHENOL - HYDROXYPROPYL BIS(N-HYDROXYETHYL-P-PHENYLENEDIAMINE) HCL - AMMONIUM ACETATE - AMMONIUM THIOLACTATE - N,N-BIS(2-HYDROXYETHYL)-p-PHENYLENEDIAMINE SULFATE - RESORCINOL - EDTA - ERYTHORBIC ACID - PARFUM / FRAGRANCE. Shine Oil PPG-5-CETETH-20 - HELIANTHUS ANNUUS SEED OIL / SUNFLOWER SEED OIL - PARFUM / FRAGRANCE - COCOS NUCIFERA OIL / COCONUT OIL - TOCOPHEROL - CAMELLIA OLEIFERA SEED OIL Please be aware that ingredient lists for the products of our brand are updated regularly. Please refer to the ingredient list on your product package for the most up to date list of ingredients to ensure it is suitable to your personal use."
    },
    {
      "name": "Contains",
      "value": "1 Pack"
    },
    {
      "name": "Colour",
      "value": "Black"
    },
    {
      "name": "Warning",
      "value": "DO NOT SWALLOW. This product contains ingredients which may cause skin irritation to certain individuals. A preliminary test according to accompanying directions should be made before use. This product must not be used for dyeing eyelashes or eyebrows; to do so may be injurious to the eye. Irritant. Avoid contact with eyes., AN ALLERGY ALERT TEST MUST BE DONE 48 HOURS BEFORE EACH USE OF THIS PRODUCT"
    },
    {
      "name": "Size",
      "value": "1 pack"
    },
    {
      "name": "Unit Price",
      "value": "$19.00 per 1Ea"
    }
  ],
  "brand": "L'Oreal",
  "createdAt": "2020-11-21T05:51:14.344Z",
  "description": "L'Oreal Preference 1.0 Napoli Hair Colour",
  "image": {
    "@type": "ImageObject",
    "height": 300,
    "mime": "image/jpeg",
    "url": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/8/1/3/8138089.jpg",
    "width": 300
  },
  "name": "Preference 1.0 Napoli Hair Colour",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 19,
    "lowPrice": 19,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2020-11-21T05:51:14.344Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "19.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/preference-hair-colour-madrid-black"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/preference-hair-colour-madrid-black"
  ],
  "sku": "8138089",
  "updatedAt": "2020-11-21T05:51:14.344Z"
}
