{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Contains",
      "value": "1 Diffuser Unit & 1 Perfume Bottle"
    },
    {
      "name": "Warning",
      "value": "Use only as directed. Keep out of the reach of children and pets. Avoid contact with skin and eyes. If eye or skin contact occurs, immediately rinse with plenty of water for 20 minutes. If eye irritation persists, consult a physician. Do not ingest. If swallowed, do not induce vomiting; call physician or poison control center immediately. Make sure that the product does not interfere with any car instruments and do not install, adjust or remove the device while driving. Do not place if the shape cf ventilation is curve or has a big incline. Do not place near heat or open flame., Wipe away any spilt product immediately with water as it may cause damage and ensure no residue remains. Make sure that the product does not interfere with any car instruments and do not install, adjust or remove the device while driving. Use only as directed. People suffering from perfume sensitivity should be cautious when using this product. May produce allergic reaction. May cause sensitization by skin contact. Avoid contact with skin and eyes. In case of contact with skin or eyes, wash immediately with water. Do not induce vomiting. If swallowed, seek medical advice immediately."
    },
    {
      "name": "Size",
      "value": "7.5mL"
    },
    {
      "name": "Unit Price",
      "value": "$11.73 per 10mL"
    }
  ],
  "brand": "Ambi Pur",
  "createdAt": "2022-12-07T00:20:37.526Z",
  "description": "Ambi Pur Premium Clip Vanilla Voyager Car Air Freshener",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/2/1/3/2135033.jpg",
  "name": "Premium Clip Vanilla Voyager Car Air Freshener",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 8.8,
    "lowPrice": 8.8,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-07T00:20:37.525Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "8.80",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/ambi-pur-car-premium-clip-vanilla-voyage"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/ambi-pur-car-premium-clip-vanilla-voyage"
  ],
  "sku": "2135033",
  "updatedAt": "2022-12-07T00:20:37.525Z"
}
