{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Whey protein hydrolysate (milk), lactose (milk), vegetable oils (emulsifier (soy lecithin), antioxidant (ascorbyl palmitate, citric acid)), short chain galacto-oligosaccharides (milk), emulsifier (citric acid esters of mono- and diglycerides), long chain fructo-oligosaccharides, maltodextrin, omega LCPUFAs (fish oil, antioxidant (mixed natural tocopherol (soy), dl-alpha tocopherol, ascorbyl palmitate, citric acid)), choline chloride, taurine, Bifidobacterium breve M-16V, inositol, L-carnitine. Minerals: Potassium, calcium, chloride, phosphorus, sodium, magnesium, iron, zinc, copper, iodine, manganese, selenium. Vitamins: Vitamins (A, B1, B2, B3, B5, B6, B12, C, D3, E, K1), folic acid, biotin. Nucleotides: Cytidine-5'-monophosphate, uridine-5'-monophosphate, adenosine -5'-monophosphate, inosine -5'-monophosphate, guanosine-5'-monophosphate. Aptamil Prosyneo Sensitive Infant Formula is based on partially hydrolysed cows' milk protein."
    },
    {
      "name": "Contains",
      "value": "Contains: cow's milk, fish and soy."
    },
    {
      "name": "Allergen",
      "value": "Contains Fish, Contains Soy, Contains Milk"
    },
    {
      "name": "Warning",
      "value": "Breast milk is best for babies. Before you decide to use this product, consult your doctor or health worker for advice. Not to be used for infants with a diagnosed cows' milk protein allergy. Consult your healthcare professional for advice. Follow instructions exactly. Prepare bottles and teats as directed. Do not change proportions of powder except on medical advice. Incorrect preparation can make your baby very ill. Suitable from birth. Infants over 6 months should be offered foods in addition to infant formula product."
    },
    {
      "name": "Size",
      "value": "900g"
    },
    {
      "name": "Unit Price",
      "value": "$3.33 per 100G"
    },
    {
      "name": "Country Of Origin",
      "value": "Made in Poland"
    }
  ],
  "brand": "Aptamil",
  "createdAt": "2022-11-29T13:20:22.000Z",
  "description": "Aptamil Prosyneo Sensitive Baby Infant Formula Formulated For Tolerance From Birth to 12 Months",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/3/6/7/3672945.jpg",
  "name": "Prosyneo Sensitive Baby Infant Formula Formulated For Tolerance From Birth to 12 Months",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 30,
    "lowPrice": 30,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-29T11:24:59.204Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "30.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/aptamil-prosyneo-sensitive-infant-formula"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/aptamil-prosyneo-sensitive-infant-formula?adId=display_pQsI80h6MmukSChSA2i_A6x8330KCgoIMzY3Mjk0NVASABoLCLWdkZwGEJv11FYiAggB"
  ],
  "sku": "3672945",
  "updatedAt": "2022-11-29T11:24:59.204Z"
}
