{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 11,
    "ratingValue": 4.72727272727273
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Radox"
  },
  "createdAt": "2022-12-06T12:17:48.204Z",
  "description": "<p>RADOX BATH MUSCLE SOOTHE 500 GR<BR><BR>Radox muscle soothe bath salts has been specially formulated for your best ever relaxing bath experience. This product contains a unique blend of concentrated herbal extracts, mineral salts and essential oils to help soothe tired aching muscles, and leave you feeling relaxed after strenuous activity. Radox bath salts contain a relaxing fragrance, blend of natural herbs and minerals, and essential oils. To use: pour a generous amount (approximately 2 handfuls) of Radox muscle soothe bath salts directly under warm running water. When the salt is dissolved properly step into the bath. At Radox, we know that smell is not only one of the most important senses. They have the power to lift you when you are down, to awaken you when you rise, to make us sleep, love, create, dream. The power to genuinely transform how you feel. In fact, there's hardly a mood in society that can't be moved by fragrance. And there's barely a person on earth who can not be affected by the right scent. Life's a rollercoaster of emotions and we know it can be a challenge to constantly feel the way you want to. So at Radox, we want to help. Each of our fragrance combinations is specially designed to unleash a mood, whether you want to be energised or refreshed, uplifted or soothed. And that's why we ask each and every one of you ‘How do you want to feel?’<BR><BR>Herbal mineral salts to help sooth tired, aching muscles<BR><BR>Leave you feeling relaxed after strenuous activity<BR><BR>Just add to a bath running with warm water<BR><BR>Unique blend of concentrated herbal extracts, mineral salts and essential oils<BR><BR>Specially formulated for your best ever relaxing bath experience<BR><BR>Radox bath salts contain a relaxing fragrance</p>",
  "gtin13": "9300636012783",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/147485.jpg",
  "name": "Radox Bath Salt Muscle Soothe 500G",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 8.25,
    "lowPrice": 8.25,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T12:17:48.202Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 8.25,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/147485/radox-bath-salt-muscle-soothe"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/147485/radox-bath-salt-muscle-soothe"
  ],
  "sku": "147485",
  "updatedAt": "2022-12-06T12:17:48.202Z"
}
