{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Redoxon"
  },
  "createdAt": "2022-12-06T15:21:44.296Z",
  "description": "Redoxon Immunity triple-action formula brings together the benefits of vitamin C, D and zinc, which play a significant role to support healthy immune function and can help enhance your general health.<br><br>Redoxon Immunity works with a 3-way action by combining vitamins C, D and Zinc to enhance the body's three lines of immune defence. It helps the body cope with environmental stress associated with a modern lifestyle by supporting your immune system to help fight illness including cold and flu symptoms. <br><br>Your body is equipped with powerful natural defences - the immune system has many branches and ways of dealing with threats from the environment. You can take additional vitamins and minerals to help maintain your immune system. <br>That’s where Redoxon Immunity comes in with our combination product of high strength Vitamin C, plus vitamin D and Zinc, to help support your immune system. Your immune system works 247 and you can support its function by taking Redoxon Immunity daily.<br><br><strong>Key Benefits<strong><br> - Has a unique combination of Vitamin C, D and Zinc to support immunity.<br> - Supports the immune system to fight illness and reduce free radicals formed in the body.<br> - Take Redoxon Immunity daily to help reduce the occurrence of the common cold and help decrease the severity and duration of common cold symptoms.<br> - Vitamin C helps your body maintain your immune system. Our bodies cannot make Vitamin C or store large amounts of Vitamin C so you may need additional support. <br> - Vitamin D is formed from the action of UV sunlight on the skin but sometimes it is not possible to get your daily dose of Vitamin D so you can top up with Redoxon Immunity.<br> - Zinc helps maintain your skin – the body's first line of defence.<br> - Great tasting blackcurrant flavour.<br>- Effervescent format.<br> - Supports healthy immune function.",
  "gtin13": "4057599003949",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/152328.jpg",
  "name": "Redoxon Immunity Vitamin Blackcurrant Flavoured Effervescent Tablets 45 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 26,
    "lowPrice": 26,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T15:21:44.296Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 26,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/152328/redoxon-immunity-vitamin-blackcurrant-flavoured-effervescent-tablets"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/152328/redoxon-immunity-vitamin-blackcurrant-flavoured-effervescent-tablets"
  ],
  "sku": "152328",
  "updatedAt": "2022-12-06T15:21:44.296Z"
}
