{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "CREAM BLEACH: WATER, CETYL ALCOHOL, GLYCERYL STEARATE, HYDROGEN PEROXIDE, MINERAL OIL, PETROLATUM, PROPYLENE GLYCOL, PEG-100 STEARATE, PENTAERYTHRITYLTETRACAPRYLATE/CAPRATE, DIMETHICONE, FRAGRANCE,TOCOPHERYL ACETATE (VITAMIN E ACETATE), PHOSPHORIC ACID.ACCELERATOR POWDER: AMMONIUM BICARBONATE., Cream Bleach: Water, Cetyl Alcohol, Glyceryl Stearate, Hydrogen Peroxide, Mineral Oil, Petrolatum, Propylene Glycol, Peg-100 Stearate, Pentaerythrityl Tetracaprylate/caprate, Dimethicone, Fragrance, Tocopheryl Acetate (Vitamin E Acetate), Phosphoric Acid. Accelerator Powder: Ammonium Bicarbonate."
    },
    {
      "name": "Contains",
      "value": "Hydrogen Peroxide 5.0% Nair Cream Bleach 28g, Nair Accelerator Powder 7g, Spatula, Mixing Cup, Instruction Leaflet"
    },
    {
      "name": "Warning",
      "value": "WARNING: CHILDREN UNDER AGE 3 SHOULD USE UNDER ADULT SUPERVISION. DO NOT SUBMERGE IN WATER, THE UNIT CAN BE DAMAGED. CAUTION: Do not apply the product after a hot bath or in a steam filled room or over deodorants. Open pores can create sensitivity. Do not expose bleached area to strong or prolonged sunlight for at least 24 hours after application. Do not apply if skin has cuts or abrasions; postpone use until skin is fully healed. Do not use near eyes or other sensitive areas. If product comes in contact with eyes, rinse immediately with cold water., Irritation or allergic reactions may occur with some people even after prior use without adverse effect. Therefore, test before each use by applying Nair on a small patch of skin on the area where hair is to be lightened. Follow directions and wait 24 hours. If skin appears normal, proceed with full application. Keep out of reach of children."
    },
    {
      "name": "Size",
      "value": "35g"
    },
    {
      "name": "Unit Price",
      "value": "$40.00 per 100G"
    }
  ],
  "brand": "Nair",
  "createdAt": "2022-12-06T07:22:00.972Z",
  "description": "Nair Regular Facial Hair Bleach",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/4/7/0/4701084.jpg",
  "name": "Regular Facial Hair Bleach",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 14,
    "lowPrice": 14,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-06T07:22:00.971Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "14.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/nair-facial-hair-bleach-regular"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/nair-facial-hair-bleach-regular"
  ],
  "sku": "4701084",
  "updatedAt": "2022-12-06T07:22:00.971Z"
}
