{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Aqua, Sodium Cocoyl Isethionate, Cocamidopropyl Betaine, Cocamidopropyl Hydroxysultaine, Glycol Distearate, PEG-12 Dimethicone, PEG-150 Distearate, Polyquaternium-10, Panthenol, Trideceth-9 PG-Amodimethicone, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, HydrolyzedKeratin, Sodium PCA, Sodium Lactate, Hydrolyzed Quinoa, Arginine, Aspartic Acid, Aloe Barbadensis Leaf Juice, Parfum, Phenoxyethanol, Laureth-4, Butylene Glycol, Sodium Benzoate, Ethylhexylglycerin, Glycerin, Potassium Sorbate, PCA, Glycine, Alanine, Guar Hydroxypropyltrimonium Chloride, Serine, Valine, Quercus Alba Bark Extract, Isoleucine, Proline, Threonine, Histidine, Phenylalanine, Disodium EDTA, Trideceth-12, Citric Acid, Linalool."
    },
    {
      "name": "Size",
      "value": "300mL"
    },
    {
      "name": "Unit Price",
      "value": "$6.67 per 100mL"
    }
  ],
  "brand": "Zena",
  "createdAt": "2022-12-06T14:30:36.221Z",
  "description": "Nourishes dry, damaged, or stressed hair. A hydrating formula with Keratin, Hydrolysed Quinoa and Amino Acids works to prevent breakage and protect against heat damage for stronger, healthier hair. Cruelty Free Paraben Free Sulphate (SLES/SLS) Free Gentle on Coloured Hair Made In Australia",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/3/9/5/3958347.jpg",
  "name": "Repair Shampoo",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 20,
    "lowPrice": 20,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-06T14:30:36.221Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "20.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/repair-shampo"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/repair-shampo"
  ],
  "sku": "3958347",
  "updatedAt": "2022-12-06T14:30:36.221Z"
}
