{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 38,
    "ratingValue": 4.81578947368421
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Rexona"
  },
  "createdAt": "2022-11-23T22:12:27.897Z",
  "description": "REXONA MEN ANTIPERSPIRANT CREAM CLINICAL SUMMER STRENGTH 45 MLSummer Strength Clinical Protection antiperspirant deodorant keeps you dry, fresh and confident on those long, hot summer days. Our products are intelligently designed to work as hard as you do. We make it our business to know more about sweat, and what we learn informs every product innovation. Sweat, also known as perspiration, is a normal and healthy bodily function and it starts to occur just a few months after birth. We mainly sweat to cool our bodies down, a process called thermoregulation. Our brain sends a signal to over 3 million glands in our body to release sweat (a clear fluid made of water, salts and proteins). As this fluid evaporates from our skin, it lowers our body temperature. Rexona entered the world of professional sports, backing some of the world’s best sports men and women. To this day, Rexona continues to provide ultimate protection at even the busiest of times. Rexona was created in Australia in 1908 by Mrs Alice Sheffer, the wife of SF Sheffer, the founder of the Sheldon Drug Company. A talented physician, she wanted to give people a new kind of personal care product, with effective ingredients that also smelt good. When Rexona hit the shelves in 1908, it soon became the company’s biggest sellerClinical protection provides up to 3x more wetness protection than a basic antiperspirant deodorantRexona's most advanced formulation in stick formatUnique odour protect technology activated by movementAll-day freshness and protection to fight sweatingStrong deodorant but gentle enough for everyday useAlcohol* and aluminium chloride free (*ethyl alcohol) antiperspirant",
  "gtin13": "4800888185792",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/789434.jpg",
    "width": 1200
  },
  "name": "Rexona Women Clinical Antiperspirant Deodorant Summer Strength 45ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 13,
    "lowPrice": 13,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:12:27.892Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 13,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/789434/rexona-clinical-protection-summer-strength?"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/789434/rexona-clinical-protection-summer-strength?"
  ],
  "sku": "789434",
  "updatedAt": "2022-11-23T22:12:27.892Z"
}
