{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Rexona"
  },
  "createdAt": "2022-12-06T12:59:33.812Z",
  "description": "<p>REXONA WOMEN ANTIPERSPIRANT AEROSOL ADVANCED PROT WATERMELN FREEZE 220 ML<BR><BR>Rexona Advanced Protection Watermelon Freeze and Cactus Water Scent 72 hour antiperspirant aerosol deodorant provides long-lasting protection against sweat and odour throughout the day. Some deodorants let you down as the day goes on, holding you back and stopping you from pushing yourself further, especially as your day “levels up”. But, our Rexona Advanced Protection deodorants release more fresh fragrance the more you move, so as the day goes on, you feel fresh and confident enough to move more. Our products are intelligently designed to work as hard as you do. Experience an unexpected freshness that combines an uplifting blend of clean fruits<br/>and cactus water scents.<br/><br/>We make it our business to know more about sweat, and what we learn informs every product innovation. Sweat, also known as perspiration, is a normal and healthy bodily function, and it starts to occur just a few months after birth. We mainly sweat to cool our bodies down, a process called thermoregulation. Our brain sends a signal to over 3 million glands in our body to release sweat (a clear fluid made of water, salts and proteins). As this fluid evaporates from our skin, it lowers our body temperature. To help with excessive sweating, try our Clinical strength deodorants.<br/><br/>Rexona entered the world of professional sports, backing some of the world’s best sports men and women. To this day, Rexona continues to provide ultimate strength at even the busiest of times. Rexona was created in Australia in 1908 by Mrs Alice Sheffer, the wife of SF Sheffer, the founder of the Sheldon Drug Company. A talented physician, she wanted to give people a new kind of personal care product, with effective ingredients that also smelt good. When Rexona hit the shelves in 1908, it soon became the company’s biggest seller.<BR><BR>Rexona Advanced Protection antiperspirant aerosol with 72 hour protection<BR><BR>With motion-activated protection - the more you level up, the more Rexona will fresh you up<BR><BR>An uplifting blend of clean fruits and cactus water scents<BR><BR>All-day freshness for the strength you need in a convenient aerosol deodorant<BR><BR>Long-lasting protection against odour<BR><BR>Alcohol* free (*ethyl alcohol) deodorant</p>",
  "gtin13": "9300830062775",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/137806.jpg",
  "name": "Rexona Woman Advanced Protection Watermelon Antiperspirant 130g",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 6.8,
    "lowPrice": 6.8,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T12:59:33.812Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 6.8,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/137806/rexona-woman-advanced-protection-watermelon-antiperspirant"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/137806/rexona-woman-advanced-protection-watermelon-antiperspirant"
  ],
  "sku": "137806",
  "updatedAt": "2022-12-06T12:59:33.812Z"
}
