{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 2,
    "ratingValue": 4
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Rimmel"
  },
  "createdAt": "2022-12-06T14:58:22.998Z",
  "description": "Next generation of BB cream with 9 in 1 Benefits. All day naturally flawless & protected. See beautiful skin, not makeup!<br><br>Want the London look? Get un-BB-believable flawless skin! Better than a moisturiser, better than a foundation… BB Cream in Light from Rimmel London is a skin-perfecting super makeup developed specifically for women with lighter complexions who won’t wear foundation. The perfect 9-part regimen in one easy step: it primes, moisturises, minimises pores, conceals, covers, smooths, mattifies, brightens, and helps protect. This lightweight, ultra-comfortable formula instantly gives you flawless skin with a healthy glow. If you don’t use traditional foundation when preparing for a day at the office or a night out with the girls, then BB Cream makes a great everyday base. Apply a tiny bit, the size of a pea, focusing on your problem areas and blend. It meshes nicely with skin and has a moisturizing and brightening effect that's ideal for normal to dry skin. Once set, it gives you a seamless finish, providing sheer-to-medium coverage. If you want a very natural looking finish that does a great job of evening out your skintone, try BB Cream from Rimmel London. Makes a great gift for a girlfriend, sister or even your mum! Rimmel London is an inner confidence that how we look is always cool, irreverent, never predictable and always evolving. Rimmel is not perfection or intimidating, it is like London: young, urban, eclectic, edgy. It is expression with no rules, it is real, it is accessible. Live the London look.<br><br>Long-lasting finish<br><br>Transfer-proof<br><br>With SPF 15 & UVB filters to protect your skin from external aggressions<br><br>24HR moisturisation",
  "gtin13": "3607347460596",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/740162.jpg",
  "name": "Rimmel Bb Cream 001 Light 30mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 7.5,
    "lowPrice": 7.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T14:58:22.997Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 7.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/740162/rimmel-bb-cream-001-light"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/740162/rimmel-bb-cream-001-light"
  ],
  "sku": "740162",
  "updatedAt": "2022-12-06T14:58:22.997Z"
}
