{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 2,
    "ratingValue": 4.5
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Rimmel"
  },
  "createdAt": "2022-12-06T14:49:50.073Z",
  "description": "Say goodbye to shine with Stay Matte Pressed Powder from Rimmel London! This longlasting pressed powder with natural minerals helps to minimize the appearance of pores and fine lines.<br><br>Want the London look? Say goodbye to shine with Stay Matte Pressed Powder from Rimmel London! This oil absorbing pressed powder helps to minimize the appearance of large pores and leaves you with a flawless, natural, shine-free complexion. Dermatologically tested, its smooth non-powdery texture keeps everything in place. Perfect for all skin types, it helps to set concealer, foundation or any base makeup without changing the colour of the product, giving you a natural non-cakey finish which is completely undetectable. For long lasting shine protection at work or out on the town, make Stay Matte your go-to powder! Apply a light dusting with a brush and blend onto skin to set your foundation and create a true matte look. Then use it as a shine cover-up as you need it throughout the day with a poof. To mattify your complexion and set your foundation, there’s nothing like Rimmel Stay Matte Pressed Powder. Try it once and you won’t want to go without it. Perfect as a gift for a girlfriend, sister or mum! Rimmel London is an inner confidence that how we look is always cool, irreverent, never predictable and always evolving. Rimmel is not perfection or intimidating, it is like London: young, urban, eclectic, edgy. It is expression with no rules, it is real, it is accessible. Live the London look.<br><br>Mattifying face powder<br><br>Up to 6 hours shine control<br><br>Contains natural minerals and powders<br><br>Dermatologically tested<br><br>Contains natural minerals and powders",
  "gtin13": "9317408007519",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/365976.jpg",
  "name": "Rimmel Powder Pressed Transparent 14G",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 14,
    "lowPrice": 14,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T14:49:50.072Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 14,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/365976/rimmel-powder-pressed-transparent"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/365976/rimmel-powder-pressed-transparent"
  ],
  "sku": "365976",
  "updatedAt": "2022-12-06T14:49:50.072Z"
}
