{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "WAX INGREDIENTS: GLYCERYL ROSINATE, TRIETHYLENE GLYCOL ROSINATE, HYDROGENATED BUTYLENE / ETHYLENE / STYRENE COPOLYMER, PARAFFIN, CERA MICROCRISTALLINA, ZINC OXIDE, MICA, PARFUM, CI 77891, BHT, CAPRYLIC/ CAPRIC TRIGLYCERIDE/CITRUS AURANTIUM AMARA FLOWER EXTRACT, ARGANIA SPINOSA KERNEL OIL. AFTERCARE WIPE INGREDIENTS: PARAFFINUM LIQUIDUM, ETHYLHEXYL STEARATE, CETEARYL ETHYLHEXANOATE, ISOPROPYL MYRISTATE, METHYLPARABEN, BISABOLOL, GLYCINE SOJA OIL, PARFUM, ETHYLPARABEN, BUTYLPARABEN, ISOBUTYLPARABEN, PROPYLPARABEN, BENZYL SALICYLATE, BUTYLPHENYL METHYLPROPIONAL, FARNESOL, HYDROXYISOHEXYL 3-CYCLOHEXENE CARBOXALDEHYDE, LINALOOL, CITRONELLOL, EUGENOL, ALPHA-ISOMETHYL IONONE, CHAMOMILLA RECUTITA EXTRACT, BUTYLATED HYDROXYTOULENE, TOCOPHEROL."
    },
    {
      "name": "Contains",
      "value": "400g microwaveable wax 2 post-waxing wipes 1 wooden spatula Instruction leaflet Nair Wax Tub 400g, Wooden Spatula, 2 Aftercare wipes, Instruction Leaflet"
    },
    {
      "name": "Warning",
      "value": "WARNINGS: Do not use product in the area of the eye. Wax should not be used by people suffering from diabetes or circulatory problems or on areas with varicose veins, moles and warts. Do not wax inside nose or ears, on nipples, perianal, vaginal/genital areas or eyelashes. DO NOT USE ON IRRITATED, INFLAMED OR BROKEN SKIN. NOT SUITABLE FOR PEOPLE WITH EXTRA SENSITIVE OR PROBLEM SKIN. Not recommended for the elderly or people with loose skin. Do not apply wax over sunburned, chapped, broken or sore skin, cuts, weak scars or eczema. Do not use immediately after a bath."
    },
    {
      "name": "Size",
      "value": "400g"
    },
    {
      "name": "Unit Price",
      "value": "$5.50 per 100G"
    }
  ],
  "brand": "Nair",
  "createdAt": "2022-12-06T07:21:37.608Z",
  "description": "Nair Sensitive Pain Reducing Wax",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/2/2/7/2274200.jpg",
  "name": "Sensitive Pain Reducing Wax",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 22,
    "lowPrice": 22,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-06T07:21:37.607Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "22.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/nair-sensitive-pain-reducing-wax"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/nair-sensitive-pain-reducing-wax"
  ],
  "sku": "2274200",
  "updatedAt": "2022-12-06T07:21:37.607Z"
}
