{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Barbeque Wheat Flour, Vegetable Oil, Starch (Wheat), Salt, Tomato Powder, Yeast, Garlic, Parsley, Sugar, Worcestershire Sauce, Onion Powder Baking Powder, Natural Flavour, Vegetable Protein Extract (from Maize), Spices, Antioxidants (E300, E307b From Soy, E304), Flavour Enhancer (E635), Emulsifier (Soy Lecithin), Malt Extract (From Barley). Pizza Wheat Flour, Vegetable Oil, Starch (Wheat), Tomato Powder, Salt, Cheese (Contains: Milk), Maltodextrin (Maize), Yeast. Milk Solids, Baking Powder, Sugar, Spice, Garlic Powder, Onion Powder, Herb, Natural Flavour, Vegetable Extract (From Maize, Soy), Food Acid (Citric Acid), Food Colours (Turmeric, Paprika Extract), Antioxidants (E300, E307b From Soy, E304), Yeast Extract, Emulsifier (Soy Lecithin). Chicken Crimpy Wheat Flour, Vegetable Oil, Sugar, Salt, Malt Extract (From Barley), Baking Powder, Flavour Enhancers (E621, E635), Onion Powder, Natural Flavour, Maltodextrin (Maize), Chicken, Spices, Antioxidants (E304, E307b From Soy), Emulsifier (Soy Lecithin)."
    },
    {
      "name": "Contains",
      "value": "Barbecue: Gluten containing Cereals (Wheat and Barley) and Soy. Pizza: Gluten containing Cereals (Wheat), Milk and Soy. Chicken Crimpy: Gluten containing Cereals (Wheat and Barley) and Soy."
    },
    {
      "name": "Allergen",
      "value": "May Be Present Sesame, May Be Present Tree Nuts, Contains Barley, May Be Present Peanuts, Contains Soy, Contains Wheat, Contains Milk, May Be Present Egg"
    },
    {
      "name": "Servings Per Pack",
      "value": "5.0"
    },
    {
      "name": "Warning",
      "value": "Do not purchase if pack is open or torn. Individual packs not for retail sale. Biscuits not actual size."
    },
    {
      "name": "Size",
      "value": "375g"
    },
    {
      "name": "Unit Price",
      "value": "$1.47 per 100G"
    },
    {
      "name": "Country Of Origin",
      "value": "Made in Australia"
    }
  ],
  "brand": "Arnott's",
  "createdAt": "2022-12-06T23:25:45.133Z",
  "description": "Arnott's Shapes Originals Variety Multipack is oven baked, not fried.",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/2/9/9/2992180.jpg",
  "name": "Shapes Multipack Variety 15 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 5.5,
    "lowPrice": 5.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-06T23:25:45.132Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "5.50",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/arnotts-shapes-multipack-variety-15-pack"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/arnotts-shapes-multipack-variety-15-pack"
  ],
  "sku": "2992180",
  "updatedAt": "2022-12-06T23:25:45.132Z"
}
