{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Just add... 500g lean minced lamb or beef 4 large potatoes 60mL milk 1 onion 1 carrot Preparation time: 15 minutes Cooking time: 40 minutes Simply... 1. Preheat oven to 200˚C. 2. Peel and chop 4 large potatoes and boil until tender, drain. Mash potato with 1/4 cup (60mL) milk and 1 tablespoon (20g) Flora spread. 3. Heat 2 teaspoons oil in a medium saucepan or frying pan and brown 500g lean minced lamb or beef and 1 chopped onion. Add Recipe Base, 1 cup (250mL) water and 1 diced carrot; stir to combine. Cover and simmer for 10 minutes or until carrot is tender. 4. Spoon into an ovenproof dish; top with mashed potato and bake for 20 minutes or until golden brown. Serve with green vegetables. Here's an idea... Top with grated cheese before baking., Wheat flour, corn starch, maltodextrin, salt, burnt sugar, onion powder, soy sauce powder (contains wheat), natural flavours, sage, yeast extract, sunflower oil, pepper, garlic extract. Contains naturally occurring glutamates."
    },
    {
      "name": "Contains",
      "value": "Soy, Wheat and Soybeans. Contains naturally occurring glutamates. 50g"
    },
    {
      "name": "Allergen",
      "value": "May Be Present Sesame, May Be Present Peanuts, May Be Present Fish, Contains Wheat, May Be Present Crustacea, May Be Present Egg, May Be Present Tree Nuts, May Be Present Lupin, May Be Present Milk"
    },
    {
      "name": "Servings Per Pack",
      "value": "4.0"
    },
    {
      "name": "Warning",
      "value": "Taste Great Taste is in our Nature Our recipe bases are made with real ingredients, carefully selected by our chefs to ensure a perfectly balanced and great tasting meal every time. Learn more about our Responsible Farming Initiative by visiting our website"
    },
    {
      "name": "Size",
      "value": "50g"
    },
    {
      "name": "Unit Price",
      "value": "$3.60 per 100G"
    }
  ],
  "brand": "Continental",
  "createdAt": "2022-11-24T05:50:39.844Z",
  "description": "Continental Shepherds Pie Recipe Base",
  "image": {
    "@type": "ImageObject",
    "height": 300,
    "mime": "image/jpeg",
    "url": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/5/5/6/5564728.jpg",
    "width": 300
  },
  "name": "Shepherds Pie Recipe Base",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 1.8,
    "lowPrice": 1.8,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-24T05:50:39.843Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "1.80",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/continental-recipe-mix-shepherds-pie"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/continental-recipe-mix-shepherds-pie"
  ],
  "sku": "5564728",
  "updatedAt": "2022-11-24T05:50:39.843Z"
}
