{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 5,
    "ratingValue": 4.8
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Simple"
  },
  "createdAt": "2022-12-06T13:31:42.693Z",
  "description": "SIMPLE KIND TO SKIN FACIAL CLEANSER MOISTURISING FACE WASH 150 ML<br><br>Ready to take your face cleansing routine to a new, skin-boosting level? Meet Simple Kind to Skin?Moisturising?Facial Wash. Supercharged with a vitamin-rich formula – this is the same gentle skin care you know and love from Simple – made even more effective for stronger, healthy-looking and smooth skin. With pro vitamin B5, together with vitamin E, this deep cleansing, foaming gel-cream helps skin become more resilient against damage with every wash. Its Pro Amino Acid Technology boosts the levels of strengthening amino acids naturally present in skin, for a hydrated and strong skin barrier against drying elements like pollution. But it doesn’t stop there. This face cleanser is also proven to boost skin moisture from the very first wash. You’ll love the non-stripping, pH-neutral lather which leaves skin gratifyingly clean and satisfyingly moisturised. And you can count on this face wash to remove traces of?make-up, dirt and grime – minus that tight, dry skin feeling. 100% soap free and packed with ultra-nourishing ingredients, this daily cleanser is suitable for all skin types and is super gentle – even on?sensitive skin. Like all?Simple?products, our Moisturising Facial Wash is dermatologically tested,?non-comedogenic, contains no harsh chemicals that can upset your skin and is free from alcohol, mineral oils, artificial colours and perfume. What’s more, this?Simple face wash?is PETA approved and vegan, with planet-friendly packaging that’s made with 25% less plastic vs our previous tube.<br><br>Deeply cleansing, incredibly moisturising! Simple Kind to Skin Moisturising Facial Wash is a non-stripping daily cleanser that boosts skin moisture from the first wash.<br><br>Vitamin-rich, creamy cleanser. One wash is all it takes to gently remove traces of make-up, dirt and grime effectively, without stripping your skin.<br><br>Pro vitamin B5 + vitamin E + pro amino acids = stronger and healthier-looking skin. Our ultimate hydrating facial wash hero.<br><br>Real people love it. 91% agreed this newly enhanced face wash formula cleanses skin thoroughly.<br><br>Our kind to planet promise. This face wash is PETA approved vegan, with planet-friendly packaging that’s made with 25% less plastic vs our previous tube.<br><br>Soap free and moisturising. Suitable for all skin types, this hydrating face wash contains no harsh chemicals that can upset your skin, no alcohol, no mineral oils, no artificial colour or perfume.<br><br>cleanser,clear,clear skin,cream,face cleanser,face cream,face moisturiser,face scrub,face toner,face wash,facial wash,gel,healthy-looking,lotion,make-up,refreshing,scrub,sensitive,Simple,skin care,smooth,St Ives,St. Ives,toner",
  "gtin13": "5011451103870",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/314984.jpg",
  "name": "Simple Kind To Skin Facial Wash Moisturising 150mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 11.5,
    "lowPrice": 11.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T13:31:42.692Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 11.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/314984/simple-kind-to-skin-facial-wash-moisturising"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/314984/simple-kind-to-skin-facial-wash-moisturising"
  ],
  "sku": "314984",
  "updatedAt": "2022-12-06T13:31:42.692Z"
}
