{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Simple"
  },
  "createdAt": "2022-11-29T22:46:26.000Z",
  "description": "<p>Be Kind to your skin wherever you are & wherever you’ re going! Our Simple Travel Minis range is made up of three of our most-loved Simple Kind to Skin products for the perfect Travel Skincare regime.</p><p>Each Pack Contains: 1 x Eye Makeup Remover 50mL, 1 x Hydrating Light Moisturiser 50mL, 1 x Refreshing Facial Wash 50mL. These Travel Minis come packaged in a reusable Toiletries Travel Pack that is made with 60% Recycled Plastics! Gift this to your favourite travel buddy or simply for yourself for your next getaway. Pop on your complimentary Sleeping Mask and you are ready to jet! Onwards to your next destination!</p><p>Simple have been the experts in sensitive skin since launching the first perfume and colour-free soap in 1960. Simple have stayed committed to their original philosophy of creating skincare products suitable for all skin types and as product range has grown. Simple have learnt that when something is as delicate and precious as skin, it deserves only the kindest care. This is why all Simple Products are Dermatologically Tested and contain no artificial perfume or colour no harsh chemicals that can upset your skin no alcohol & no animal-derived ingredients.</p> <br><br><p><strong>Product Features:</strong></p><ul><li>Each Pack Contains: 1 x Eye Makeup Remover 50mL, 1 x Hydrating Light Moisturiser 50mL, 1 x Refreshing Facial Wash 50mL, 1 x Sleep Mask</li><li>Simple Kind To Skin Eye Make-up remover, containing Pro-Vitamin B5, removes all eye make-up even waterproof mascara without stinging or irritating the eyes.</li><li>Simple Kind To Skin Hydrating Light Moisturiser, made with Borage Seed Oil and Vitamin E, is a perfect light-weight blend of active ingredients and vitamin goodness to keep your skin hydrated and nourished all day long.</li><li>Simple Refreshing Facial Wash contains a special blend of skin-loving ingredients, including Pro-Vitamin B5, which helps to soften and gently cleanse skin.</li><li>Comes with a convenient toiletry bag for your travel essentials, made with 60% Recycled Plastics.</li></ul>",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/1073846026.jpg",
  "name": "Simple 1EA",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 10,
    "lowPrice": 10,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-29T14:36:13.436Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 10,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/1073846026/simple-kind-to-skin-giftset-mini-travel-pack"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/1073846026/simple-kind-to-skin-giftset-mini-travel-pack"
  ],
  "sku": "1073846026",
  "updatedAt": "2022-11-29T14:36:13.436Z"
}
