{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Sunsilk"
  },
  "createdAt": "2022-12-06T11:52:05.758Z",
  "description": "<p>SUNSILK CONDITIONER SOFT & SMOOTH 700 ML<BR><BR>Want softness & smoothness at one time? This exclusive formula, with a unique ultralight fusion of Moroccan Argan and Almond oils, has a non-greasy texture. We make hair products you will enjoy trying, exploring, dreaming and discovering. We'll be honest: today, we have a wider range of possibilities than ever before. Every second is an opportunity to live life to the full. And we want to be beautiful when we do that, don't we? Out here, in the real world, our life is rather hectic and we need our hair to be beautiful and to stay that way despite all the twists and turns. This is where Sunsilk comes in. Simple, vibrant, full of colour and scents, Sunsilk stands shoulder to shoulder with you every step of the way. In a vibrant and constantly changing world, we can celebrate each challenge with protected, repaired, strong and well-groomed hair. With decades of experience in each bottle, you can count on us to hit the mark in this endeavour. They say you only live once, but if you do it right, once is enough. Welcome to our world, providing hair care for girls who like to experiment, explore, dream and discover.<BR><BR>Moroccan Argan & Almond oils<BR><BR>Hair that's softer and smoother** **With use of shampoo and conditioner vs non-conditioning shampoo<BR><BR>Sunsilk gives you shiny, manageable hair in 1 wash<BR><BR>Time to lather up with our shampoo and conditioner that leaves hair fresh and oh-so fabulous<BR><BR>For smooth hair that shines like you do** **With use of shampoo and conditioner vs non-conditioning shampoo<BR><BR>So you will always have HAIR ON YOUR SIDE</p>",
  "gtin13": "9300830030989",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/463180.jpg",
  "name": "Sunsilk Conditioner Soft & Smooth 700mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 11,
    "lowPrice": 11,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T11:52:05.757Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 11,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/463180/sunsilk-conditioner-soft-smooth"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/463180/sunsilk-conditioner-soft-smooth"
  ],
  "sku": "463180",
  "updatedAt": "2022-12-06T11:52:05.757Z"
}
