{
  "@type": "Product",
  "additionalProperty": [],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 12,
    "ratingValue": 4.91666666666667
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Sunsilk"
  },
  "createdAt": "2022-12-06T11:48:08.385Z",
  "description": "Sunsilk SHAMPOO SUMMER CARE 700 ML<BR><BR>Sunsilk Summer Care Shampoo, with coconut oil & hibiscus, cleanses and hydrates your hair your hair, making it ready for the summer season. This formula helps protect the hair against damage and summer frizz**, making it soft and smooth.<br>We make hair products you will enjoy trying, exploring, dreaming and discovering. <br><br>Massage onto wet hair and then rinse thoroughly. Repeat application and use daily. For even more incredible hair, why not combine it with Sunsilk Summer Care Conditioner? <br><br>We'll be honest: today, we have a wider range of possibilities than ever before. Every second is an opportunity to live life to the full. And we want to be beautiful when we do that, don't we? Out here, in the real world, our life is rather hectic and we need our hair to be beautiful and to stay that way despite all the twists and turns. This is where Sunsilk comes in. Simple, vibrant, full of colour and scents, Sunsilk stands shoulder to shoulder with you every step of the way. In a vibrant and constantly changing world, we can celebrate each challenge with protected, repaired, strong and well-groomed hair. With decades of experience in each bottle, you can count on us to hit the mark in this endeavour. They say you only live once, but if you do it right, once is enough. Welcome to our world, providing hair care for girls who like to experiment, explore, dream and discover.<br><br>**Sunsilk Summer Care Shampoo & Conditioner vs. non-conditioning shampoo.<BR><BR>With Coconut Oil & Hibiscus.<BR><BR>This shampoo cleanses and hydrates your hair.<BR><BR>This formula helps protect the hair against damage and summer frizz (when using shampoo & conditioner system).<BR><BR>This shampoo makes your hair soft and smooth.<BR><BR>Sunsilk gives you shiny, manageable hair in 1 wash (with shampoo & conditioner system)<BR><BR>So you will always have HAIR ON YOUR SIDE",
  "gtin13": "9300830048496",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/804093.jpg",
  "name": "Sunsilk Summer Care Shampoo Coconut Oil & Hibiscus 700mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 11,
    "lowPrice": 11,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T11:48:08.383Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 11,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/804093/sunsilk-summer-care-shampoo-coconut-oil-hibiscus"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/804093/sunsilk-summer-care-shampoo-coconut-oil-hibiscus"
  ],
  "sku": "804093",
  "updatedAt": "2022-12-06T11:48:08.383Z"
}
