{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Sunsilk"
  },
  "createdAt": "2022-12-06T11:37:35.082Z",
  "description": "<p>SUNSILK SHAMPOO BRILLIANT SHINE 700 ML<br/><br/>Shine on! Sunsilk's exclusive shampoo formula, with Pearl Extract & Almond Oil, works to bring out your hair's natural shine! To use, massage onto wet hair and then rinse thoroughly. Repeat application and use daily. We make hair products you will enjoy trying, exploring, dreaming and discovering. We'll be honest: today, we have a wider range of possibilities than ever before. Every second is an opportunity to live life to the full. And we want to be beautiful when we do that, don't we? Out here, in the real world, our life is rather hectic, and we need our hair to be beautiful and to stay that way despite all the twists and turns. This is where Sunsilk comes in. Simple, vibrant, full of colour and scents, Sunsilk stands shoulder to shoulder with you every step of the way. In a vibrant and constantly changing world, we can celebrate each challenge with protected, repaired, strong and well-groomed hair. With decades of experience in each bottle, you can count on us to hit the mark in this endeavour. They say you only live once, but if you do it right, once is enough. Welcome to our world, providing hair care for girls who like to experiment, explore, dream and discover.<br/><br/>Glossy and shiny hair from root to tip**With use of Sunsilk Addictive Brilliant Shine Shampoo and Conditioner vs non-conditioning shampoo<br/><br/>With Pearl Extract & Almond Oil to bring out your hair's natural shine<br/><br/>This exclusive shampoo formula works to bring out your hair's natural shine!<br/><br/>Sunsilk shampoo and conditioner bottles are made with 25% recycled plastic<br/><br/>Paraben & Dye Free Shampoo for your hair<br/><br/>HOW TO USE Ready? Massage shampoo onto wet hair and then rinse thoroughly. Repeat application and use daily.</p>",
  "gtin13": "9300830032419",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/463193.jpg",
  "name": "Sunsilk Shampoo Addictive Brilliant Shine 700mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 11,
    "lowPrice": 11,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T11:37:35.081Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 11,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/463193/sunsilk-shampoo-addictive-brilliant-shine"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/463193/sunsilk-shampoo-addictive-brilliant-shine"
  ],
  "sku": "463193",
  "updatedAt": "2022-12-06T11:37:35.081Z"
}
