{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Step 1 Base Coat: G948793 - Isododecane, Trimethylsiloxysilicate, Nylon-611 Copolymer, Disteardimonium Hectorite, Lauroyl Lysine, Propylene Carbonate, Alumina, C30-45 Alkyldimethylsilyl Polypropylsilsesquioxan, Calcium Sodium Borosilicate, Calcium Aluminum Borosilicate, Synthetic Fluorphlogopite, Sodium Hyaluronate, Silica Prunus Armeniaca Kernel Oil/Apricot Kernel Oil, Benzyl Alcohol, Passiflora Edulis Oil/Passiflora Edulis Seed Oil, Aluminum Hydroxide, Polyethylene Terephthalate, Tin Oxide, Macadamia Ternifolia Seed Oil, Coriandrum Sativum Oil/Coriander Fruit Oil, Simmondsia Chinensis Oil/Jojoba Seed Oil, Acrylates Copolymer, Paraffin, Dimethicone, Fragrance. F.I.L D175838/1 Step 2 Top Coat: G948794 - Trimethyl Pentaphenyl, Trisiloxane, Bis-Diglyceryl Polyacyladipate-2, Ozokerite, Cera Alba/Beeswax/Cire Dabeille, Tocopheryl Acetate, Prunus Armeniaca, Kernel Oil, Passiflora Edulis Oil/Passiflora Edulis Seed Oil, Macadamia Ternifolia Seed Oil, Coriandrum Sativum Oil/Coriander Fruit Oil, Simmondsia Chinensis Oil/Jojoba Seed Oil, Fragrance. F.I.L D175835/1 Please be aware that ingredient lists for the products of our brand are updated regularly. Please refer to the ingredient list on your product package for the most up to date list of ingredients to ensure it is suitable to your personal use., Base Coat: Isododecane, Trimethylsiloxysilicate, Nylon-611/Dimethicone Copolymer, Disteardimonium Hectorite, Lauroyl Lysine, C30-45 Alkyldimethylsilyl Polypropylsilsesquioxane, Alumina, Propylene Carbonate, Synthetic Fluorphlogopite, Silica, Calcium Sodium Borosilicate, Calcium Sodium Borosilicate, Polyethylene Terephthalate, Parfum / Fragrance, Aluminium Hydroxide, Acrylates Copolymer, Benzyl Alcohol, Dimethicone, Paraffin, Tin Oxide [+/- May Contain, Mica CI 77891, Titanium Dioxide, CI 77491, CI 77492, Iron Oxides, Ci 15850, Red 7, CI 15985, Yellow 6 Lake, CI 45410, Red 28 Lake, CI 45380, Red 22 Lake, CI 19140, Yellow 5 Lake, CI 42090, Blue 1 Lake, CI 75470, Carmine. Top Coat: Hydrogenated Polydecene, Ozokerite, Hydrogenated Styrene / Methyl Styrene, Indene Copolymer, Cera Alba, Beeswax, Cera Microcristallina, Microcrystalline Wax, Tocopheryl Acetate, Parfum / Fragrance, Trimethyl Pentaphyl Trisiloxane, Pentaerythrityl Tetra- di-t-butyl Hydroxyhydrocinnamate, Tocopherol, Benzyl Alcoh"
    },
    {
      "name": "Warning",
      "value": "#NAME?"
    },
    {
      "name": "Size",
      "value": "4.1mL"
    },
    {
      "name": "Unit Price",
      "value": "$63.42 per 10mL"
    },
    {
      "name": "Country Of Origin",
      "value": "Imported"
    }
  ],
  "brand": "Maybelline",
  "createdAt": "2022-12-04T18:05:13.985Z",
  "description": "Maybelline Superstay 24H Lip Cherry",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/8/5/0/8505725.jpg",
  "name": "Superstay 24H Lip Cherry",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 26,
    "lowPrice": 26,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-04T18:05:13.984Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "26.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/maybelline-superstay-lip-colour-all-day-cherry"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/maybelline-superstay-lip-colour-all-day-cherry"
  ],
  "sku": "8505725",
  "updatedAt": "2022-12-04T18:05:13.984Z"
}
