{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Tommee Tippee"
  },
  "createdAt": "2022-12-06T02:03:16.542Z",
  "description": "The instinctive action of sucking helps to calm and soothe babies and all parents know there’s nothing more wonderful than a calm, content baby. So, when you need to turn screams and sobs into smiles and sleep, simply pick up a Tommee Tippee Night time soother. Our Night time soothers feature ingenious glow in the dark handles, so parents can locate the soother in a dark room without having to disturb baby. Our soother packs feature a reusable steriliser pod that can be used to effectively and efficiently sterilise up to 2 soothers at once in a microwave, killing up to 99.9% of bacteria.  Our orthodontic* Night time soothers feature an oval, reverse ortho baglet that is vented meaning it compresses more easily than traditional, air-filled baglets and therefore reduces pressure on baby’s developing teeth and gums.  The symmetrical, soft silicone baglet that is fully reversible and has no ‘wrong’ side-up so the soother will always be placed correctly in your baby’s mouth, even when baby puts the soother in their mouth themselves. The curved shield sits comfortably between baby’s chin and nose and the holes in each side allow extra air flow and prevent the build-up of moisture which helps to protect baby’s delicate skin against irritation. The easy to clean, BPA-free silicone baglet is soft and flexible whilst also being robust and durable. We recommend that you replace the soother every month and always at the first signs of damage or wear. We recommend against prolonged pacifier use over 24 months and stopping pacifier use when your child is older than 36 months To help reduce our environmental impact we have redesigned our soother packaging. Free from single-use plastic, our soothers are packaged in 100% recyclable cardboard. *as compared to traditional round unvented soothers which do not compress as easily. **From an independent study in July 2021 of 416 mums with a 0-36m child, who are currently using a Tommee Tippee soother: **99% of mums would recommend a Tommee Tippee soother  **97% of mums say a Tommee Tippee soother helped settle baby  **93% of mums say babies love their Tommee Tippee soother **97.5% accept a Tommee Tippee soother",
  "gtin13": "5010415330185",
  "image": "https://cdn0.woolworths.media/content/wowproductimages/large/612568.jpg",
  "name": "Tommee Tippee Closer To Nature Night-time Soothers 18 To 36 Months 2 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 8.4,
    "lowPrice": 8.4,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-12-06T02:03:16.541Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 8.4,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/612568/tommee-tippee-closer-to-nature-night-time-soothers-18-to-36-months"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/612568/tommee-tippee-closer-to-nature-night-time-soothers-18-to-36-months"
  ],
  "sku": "612568",
  "updatedAt": "2022-12-06T02:03:16.541Z"
}
