{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Tresemme"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "TRESemmé SHAMPOO COLOUR SHINEPLEX 350 MLYour colour is an investment you want to last. Whether you’re a fan of the natural look or you love a bold new colour trend, it’s important to take care of your coloured hair by using products that are mild and gentle for your hair. That is why we launched our first ever sulphate free shampoo, TRESemmé Pro Collection Colour Shineplex. Combining professional performance with gentle care, the shampoo is designed to gently cleanse the hair without stripping colour and shine. Our professional-quality formula is enriched with luxurious camellia oil, known for its regenerative properties, bringing out your hair’s natural beauty. Our unique low-foaming formula delivers a long-lasting effect, that helps you get vibrant colour and shine for up to 12 weeks without the use of parabens, dyes or sulphates. How to use TRESemmé Pro Collection Colour Shineplex shampoo: Step 1: Cover your hair with an abundant amount of shampoo. Step 2: Gently massage the scalp and roots with your fingertips to work into a lather. Step 3: Lightly squeeze the shampoo from roots to ends and rinse thoroughly. Step 4: Finish with TRESemmé Pro Collection Colour Shineplex Conditioner and style with your favourite TRESemmé styling aids as needed.TRESemmé Pro Collection Colour Shineplex Shampoo combines professional performance with gentle careSulphate free shampoo with low foaming formulaDesigned to gently cleanse without stripping colour and shineInfused with camellia oil, known for its regenerative propertiesGet long lasting colour vibrancy for up to 12 weeksDelivers on coloured hair needs without the use of sulphates",
  "gtin13": "9300830056286",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/082387.jpg",
    "width": 1200
  },
  "name": "Tresemme Colour Shineplex Shampoo 350mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 0,
    "lowPrice": 0,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/OutOfStock",
        "availabilityStarts": "2022-11-23T22:40:30.563Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": "",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/82387/tresemme-colour-shineplex-shampoo"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/82387/tresemme-colour-shineplex-shampoo"
  ],
  "sku": "82387",
  "updatedAt": "2022-11-23T22:40:30.563Z"
}
