{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Tresemme"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "TRESemmé SHAMPOO KERATIN SMOOTH 350 MLDon’t let unruly frizz ruin your style. When it comes to control, you should never have to compromise smooth for limp, poker straight hair.Specially formulated to fight frizz, detangle knots, boost shine, add silky softness and tame those pesky flyaways, TRESemme´ Keratin Smooth, with Keratin, Avocado Oil and lush Marula oil from Africa, gives you five smoothing benefits in one system, for hair that’s silky smooth but still full of natural movement.- UP TO 72 HOURS OF FRIZZ CONTROL- PERFECTLY DETANGLES - SOFT FEEL- TAMES FLY-AWAYS- SMOOTHNESSOur Keratin Smooth System*, infused with MARULA OIL and AVOCADO OIL, gently cleanses and nourishes hair.*System consists of TRESemmé Keratin Smooth Shampoo and Conditioner.WANT A BOOST OF SMOOTH?Follow with our Keratin Smooth Conditioner to create a soft and smooth hair.OUR PHILOSOPHYFrom our origins in Salons in 1948, TRESemmé has been driven by a simple truth: every woman deserves to look & feel fabulous, like they've just stepped out of the salonTRESemmé is dedicated to creating haircare products that are salon quality. Inspired by stylist and salons, the products are designed to help you achieve salon gorgeous hair every day.TRESemmé. Professional. At your fingertips.Goes Well With: TRESemmé Keratin Smooth ConditionerTRESemmé Keratin Smooth System Now with Avocado Oil to give you the 5 benefits in 1 systemAlso with Keratin and Marula OilSpecifically formulated to leave your hair gorgeously sleek and manageableHelps to control frizzy hair without leaving hair looking dull up to 72 hoursEnjoy a smooth look and feel that moves as you doUse it together with TRESemmé Conditioner Keratin Smooth for best result",
  "gtin13": "9300830051144",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/822764.jpg",
    "width": 1200
  },
  "name": "Tresemme Keratin Smooth Shampoo 350mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 9,
    "lowPrice": 9,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:39:58.226Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 9,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/822764/tresemme-keratin-smooth-shampoo"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/822764/tresemme-keratin-smooth-shampoo"
  ],
  "sku": "822764",
  "updatedAt": "2022-11-23T22:39:58.226Z"
}
