{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Tresemme"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "TRESemmé SHAMPOO VIOLET BLONDE SHINE 350 MLWant to revitalise & enhance the colour of your blonde or silver hair? Want intense nourishment & healthy looking, shiny hair? Have Both!Our first range designed specifically for blonde and silver hair. A professional, quality system, with PEARL EXTRACT and VIOLET TONING PIGMENT to help neutralise brassy and yellow tones, revitalising colour and shine, while giving intense nourishmentHOW DO I USE IT?Start with our Violet Blonde Shine Shampoo to neutralise the yellow and brassy tones in your blonde or silver hair. Use a generous amount, spread in your hands, apply to wet hair, massaging the scalp and roots with finger tips to work into a lather. Rinse thoroughly. For optimum results use 2-3 times maximum per week. Follow with Violet Blonde Shine Conditioner for extra nourishment and shine.OUR PHILOSOPHYFrom our origins in Salons in 1948, TRESemmé has been driven by a simple truth: every woman deserves to look & feel fabulous, like they've just stepped out of the salonTRESemmé is dedicated to creating haircare products that are salon quality. Inspired by stylist and salons, the products are designed to help you achieve salon gorgeous hair every day.TRESemmé. Professional. At your fingertips.Goes Well With: TRESemmé Violet Blonde Shine Conditioner <Violet Blonde Shine Shampoo with Pearl Extract and Toning PigmentFor blonde and silver hairNeutralise brassy and yellow tonesFor healthy looking and shiny blonde hairUse it together with TRESemmé Violet Blonde Shine Conditioner for best resultTRESemmé Pro-Collection Range - Professional Care in Your Hands",
  "gtin13": "9300830051120",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/822763.jpg",
    "width": 1200
  },
  "name": "Tresemme Purple Shampoo Violet Blonde Shine 350mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 9,
    "lowPrice": 9,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:41:28.467Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 9,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/822763/tresemme-purple-shampoo-violet-blonde-shine"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/822763/tresemme-purple-shampoo-violet-blonde-shine"
  ],
  "sku": "822763",
  "updatedAt": "2022-11-23T22:41:28.467Z"
}
