{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Tresemme"
  },
  "createdAt": "2022-11-23T23:43:51.000Z",
  "description": "TRESemmé CONDITIONER COLOUR SHINEPLEX 350 MLYour colour is an investment you want to last. Whether you’re a fan of the natural look or you love a bold new colour trend, it’s important to take care of your coloured hair by using products that are mild and gentle for your hair. That is why we launched our TRESemmé Pro Collection Colour Shineplex conditioner that is part of our first ever sulphate free system. Using a patented blend of two silicones that distribute evenly over the hair fibre for smooth and moisturized hair, the conditioning formula helps repair damage to lock colour in for longer. Our professional-quality formula is enriched with camellia oil, known for its regenerative properties that bring out your hair’s natural beauty. Our unique formula delivers a long-lasting effect, that helps you get vibrant colour and shine for up to 12 weeks without the use of parabens, dyes or sulphate. How to use TRESemmé Pro Collection Colour Shineplex Conditioner: 1.Start with TRESemmé Pro Collection Colour Shineplex Shampoo. 2.Then apply the conditioner from mid-lengths to ends. Work anything that's left through roots. 3.Run a wide-tooth comb or your fingers from roots to ends to detangle and fully coat hair. 4.Leave on for 2-3 minutes and rinse thoroughly. 5.Finish with your favourite TRESemmé styling aids as needed.TRESemmé Pro Collection Colour Shineplex Conditioner combines professional performance with gentle careThe nourishing formula helps repair damage to lock colour in for longerPatented blend of two silicones that distribute evenly over the hair fibre for smooth and moisturized hairInfused with camellia oil, known for its regenerative propertiesGet long lasting colour vibrancy for up to 12 weeksDelivers on coloured hair needs without the use of sulphates",
  "gtin13": "9300830056293",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/082388.jpg",
    "width": 1200
  },
  "name": "Tresemme Colour Shineplex Conditioner 350mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 0,
    "lowPrice": 0,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/OutOfStock",
        "availabilityStarts": "2022-11-23T22:40:24.494Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": "",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/82388/tresemme-colour-shineplex-conditioner"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/82388/tresemme-colour-shineplex-conditioner"
  ],
  "sku": "82388",
  "updatedAt": "2022-11-23T22:40:24.494Z"
}
