{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Tresemme"
  },
  "createdAt": "2022-11-23T22:40:41.482Z",
  "description": "TRESemmé CONDITIONER KERATIN SMOOTH 350 MLLife doesn’t always run smooth, but there’s no reason why your hair can’t. Our redesigned Keratin Smooth Conditioner, with powerful Keratin, is specially formulated to give you noticeably smooth, manageable hair that keeps frizz on the fringe for up to 72 Hours.*When used with TRESemme´ Keratin Smooth Shampoo, formulated with Keratin and lush Marula oil from Africa and avocado oil, this salon-quality conditioner nourishes each strand to leave hair silky, shiny and totally under your control.WHY KERATIN SMOOTH?5 BENEFITS, 1 SYSTEM*- UP TO 72 HOURS OF FRIZZ CONTROL- PERFECTLY DETANGLES - SOFT FEEL- TAMES FLY-AWAYS- SMOOTHNESSOur Keratin Smooth System*, infused with MARULA OIL and AVOCADO OIL, gently cleanses and nourishes hair.*System consists of TRESemmé Keratin Smooth Shampoo and Conditioner.WANT A BOOST OF SMOOTH?Follow with your favourite Tresemmé product.OUR PHILOSOPHYFrom our origins in Salons in 1948, TRESemmé has been driven by a simple truth: every woman deserves to look & feel fabulous, like they've just stepped out of the salonTRESemmé is dedicated to creating haircare products that are salon quality. Inspired by stylist and salons, the products are designed to help you achieve salon gorgeous hair every day.TRESemmé. Professional. At your fingertips.Goes Well With: TRESemmé Keratin Smooth Shampoo TRESemmé Salon Finish Extra Hold HairsprayTRESemmé Keratin Smooth System Now with Avocado Oil to give you the 5 benefits in 1 systemAlso with Keratin and Marula OilSpecifically formulated to leave your hair gorgeously sleek and manageableHelps to control frizzy hair without leaving hair looking dull up to 72 hoursEnjoy a smooth look and feel that moves as you doUse it together with TRESemmé Shampoo Keratin Smooth for best result",
  "gtin13": "9300830051137",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/822770.jpg",
    "width": 1200
  },
  "name": "Tresemme Conditioner Keratin Smooth 350mL",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 9,
    "lowPrice": 9,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:40:41.481Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 9,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/822770/tresemme-conditioner-keratin-smooth"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/822770/tresemme-conditioner-keratin-smooth"
  ],
  "sku": "822770",
  "updatedAt": "2022-11-23T22:40:41.481Z"
}
