{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "tresemme"
  },
  "createdAt": "2020-11-25T21:33:46.000Z",
  "description": "TRESemmé SHAMPOO THICK & FULL 350 ML  You want a braid, a twist or a bun.You want texture and looks that last.You want visibly thicker, fuller hair everyday.GET VISIBLY THICKER HAIR SO YOU CAN WORK THE BEST LOOKSHarness the power of Glycerol for fuller, more voluminous hair. Designed specifically for fine hair, TRESemme´ Thick and Full Shampoo with Micellar Technology gently cleanses and removes residue while ensuring thicker looking hair. The pH-balanced formula in our volumizing shampoo for fine hair respects your hair’s delicate structure. After using, hair feels textured and full, with a lightweight, natural feel. Get style-ready hair with the entire Thick & Full collection so your hairstyle makes an impact.WHY THICK AND FULL?TRESemmé Thick & Full System*, with COLLAGEN, has been created with GLYCEROL to penetrate inside the hair. The system works to plume each strand and instantly helps hair look thicker!*TRESemmé Thick & Full Shampoo & Conditioner vs. non-conditioning shampoo.NEED AN EXTRA BOOST OF VOLUME?Follow with your favourite TRESemmé product.Goes Well With: TRESemmé Thick & Full ConditionerOUR PHILOSOPHYFrom our origins in Salons in 1948, TRESemmé has been driven by a simple truth: every woman deserves to look & feel fabulous, like they've just stepped out of the salonTRESemmé is dedicated to creating haircare products that are salon quality. Inspired by stylist and salons, the products are designed to help you achieve salon gorgeous hair every day.TRESemmé. Professional. At your fingertips.  Thick & Full System With Collagen and Glycerol  with Micellar Technology  pH-Balanced - Thickening System To Plump The Hair Fiber  The system has been created with glycerol to penetrate inside the hair  Pluming each strand to helps hair look thicker instantly  Use it together with TRESemmé Thick and Full Conditioner for best result",
  "gtin13": "9300830051014",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/822499.jpg",
    "width": 1200
  },
  "name": "Tresemme Shampoo Thick & Full 350ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 4.5,
    "lowPrice": 4.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2020-11-22T08:03:22.324Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 4.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/822499/tresemme-shampoo-thick-full"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/822499/tresemme-shampoo-thick-full"
  ],
  "sku": "822499",
  "updatedAt": "2020-11-22T08:03:22.324Z"
}
