{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "tresemme"
  },
  "createdAt": "2020-11-25T21:33:46.000Z",
  "description": "TRESemmé CONDITIONER THICK & FULL 350 ML  You want a braid, a twist or a bun.You want texture and looks that last.You want visibly thicker, fuller hair everyday.GET VISIBLY THICKER HAIR SO YOU CAN WORK THE BEST LOOKS.Harness the power of Glycerol for fuller, more voluminous hair. Designed specifically for fine hair, TRESemme´ Thick and Full Conditioner contains just the right amount of moisture, so you can enjoy easy detangling and visibly thicker hair every day. This volumizing conditioner for fine hair contains ultra-light conditioning polymers specifically tailored for fine hair, with Glycerol that binds water and hair proteins in order to plump strands and create beautiful volume.WHY THICK AND FULL?TRESemmé Thick & Full System*, with COLLAGEN, has been created with GLYCEROL to penetrate inside the hair. The system works to plume each strand and instantly helps hair look thicker!*TRESemmé Thick & Full Shampoo & Conditioner vs. non-conditioning shampoo.NEED AN EXTRA BOOST OF VOLUME?Follow with our Thick & Full Conditioner to lightly moisturise and leave locks looking luscious.Goes Well With: TRESemmé Thick & Full ShampooOUR PHILOSOPHYFrom our origins in Salons in 1948, TRESemmé has been driven by a simple truth: every woman deserves to look & feel fabulous, like they've just stepped out of the salonTRESemmé is dedicated to creating haircare products that are salon quality. Inspired by stylist and salons, the products are designed to help you achieve salon gorgeous hair every day.TRESemmé. Professional. At your fingertips.  Thick & Full System With Collagen and Glycerol  pH-Balanced - Thickening System To Plump The Hair Fiber  The system has been created with glycerol to penetrate inside the hair  Pluming each strand to helps hair look thicker instantly  Use it together with TRESemmé Thick and Full Shampoo for best result  TRESemmé Pro-Collection Range - Professional Care in Your Hands",
  "gtin13": "9300830051021",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/822765.jpg",
    "width": 1200
  },
  "name": "Tresemme Conditioner Thick & Full 350ml",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 4.5,
    "lowPrice": 4.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2020-11-22T08:04:26.696Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 4.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/822765/tresemme-conditioner-thick-full"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/822765/tresemme-conditioner-thick-full"
  ],
  "sku": "822765",
  "updatedAt": "2020-11-22T08:04:26.697Z"
}
