{
  "@type": "Product",
  "additionalProperty": [
    {
      "@type": "NutritionInformation",
      "calories": "564.00kJ",
      "carbohydrateContent": "17.30g",
      "dietary_fibre": "-",
      "fatContent": "6.30g",
      "name": "nutrition",
      "proteinContent": "1.90g",
      "saturatedFatContent": "0.50g",
      "servingSize": "100 g",
      "sodiumContent": "227.00mg",
      "sugarContent": "1.50g"
    }
  ],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Twisties"
  },
  "createdAt": "2022-11-24T22:03:11.000Z",
  "description": "Fun-Shaped Kids Snack!Our Cheese Twisties chips are made into perfectly rigid zig zags for a full-bodied and satisfying crunch. We make sure they’re covered in a finger-licking and succulent cheesy seasoning to deliver the most satisfying snacking experience.Perfectly-sized Party SnacksThe captivating crunch coupled with its irresistibly cheesy flavour is sure to leave you craving the crunch long after they’re gone, wishing you had more. That’s why we’ve gone and upsized them into a party bag size, so that you and your friends don’t have to twist your hands getting into the packet. Lunch Snacks For All AgesOur Twisties Party Bags are the perfect size to leave in the pantry and divide up among your family for lunch. They provide the maximum crunch and flavour to satisfy your lunchtime cravings at work and they’re perfect school lunch snacks that kids will adore. Even Better with Friends!There’s a good reason why Twisties are a national snack icon that has had a special place in the hearts and mouths of Australians for more than 50 years. They’re the ideal taste to pair with good times, whether that’s with the next footy final viewing or out and about on road trips. They’re perfect anytime during the day, for morning tea or a late-night snack because let’s face it, life’s pretty straight without… Twisties! They can’t get better can they? Well here’s the twist - We’re proud to say that Twisties are Australian made from only the finest ingredients.Our Twisties are Australian made from ingredients that have been selected for maximum crunch.An extra size up means there’s enough for all of your friends and family.Twisties Party Bags are the perfect size to keep large crowds entertained at gatherings or just to divide up into lunchboxes.Perfectly suitable as morning tea, lunch snacks or an after-dinner indulgence.They’re the ideal taste to pair with good times, whether that’s at the footy finals with your mates or to pass around the backseat during a road trip.",
  "gtin13": "9310015243653",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/586679.jpg",
    "width": 1200
  },
  "name": "Twisties Cheese Snacks Party Size Bag 270G",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 3.5,
    "lowPrice": 3.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-24T15:00:54.874Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 3.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/586679/twisties-cheese-snacks-party-size-bag"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/586679/twisties-cheese-snacks-party-size-bag"
  ],
  "sku": "586679",
  "updatedAt": "2022-11-24T15:00:54.874Z"
}
