{
  "@type": "Product",
  "additionalProperty": [
    {
      "@type": "NutritionInformation",
      "calories": "397.00kJ",
      "carbohydrateContent": "12.20g",
      "dietary_fibre": "0.23g",
      "fatContent": "4.50g",
      "name": "nutrition",
      "proteinContent": "1.30g",
      "saturatedFatContent": "0.40g",
      "servingSize": "100 g",
      "sodiumContent": "160.00mg",
      "sugarContent": "1.00g"
    }
  ],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Twisties"
  },
  "createdAt": "2022-11-24T22:03:11.000Z",
  "description": "Snacks… with a Twist!Our Cheese Twisties are shaped into a perfect fun-sized zig zag for a full-bodied and satisfying crunch. We make sure they’re covered in a succulent and savoury cheesy seasoning to deliver the most satisfying snacking experience that’s sure to leave you wondering where they all went.Multipack Snacks to Go AroundThe captivating crunch coupled with its irresistibly cheesy flavour is sure to leave you licking the seasoning off your fingers, wishing you had more. That’s why we’ve done the only thing that could make them better and put them in a value snack pack of 6 that’s sure to be empty by the end of the week!Portioned Perfectly for Lunch SnacksThey’re the perfect portion size to gobble up as a quick snack during your commute to work or on your lunch break. This exquisite flavour combination is sure to satisfy all ages, so be sure to pick some up before the kids head back to school for an easy snack to slide into their lunchbox before they head out the door. Bring a Twist to Your Next GatheringThere’s a good reason why Twisties are a national snack icon that has had a special place in the hearts and mouths of Australians for more than 50 years. They’re the ideal taste to pair with good times, whether that’s out and about on a road trip or keeping the kids happy at a birthday party. What's more, their fun and quirky zig-zag shape make them a perfect Halloween treat or a stocking stuffer during Christmas.They’re perfect anytime during the day, for morning tea or a late-night snack because let’s face it, life’s pretty straight without… Twisties! Australian-made From Only the Good StuffThey can’t get better can they? Well here’s the twist - We’re proud to say that Twisties are made locally on our doorstep.Twisties are made here in Australia from only the finest ingredients.A gluten free snack to take along with you to any outdoor activities.You don’t need to twist them into your kid’s lunchbox! Our multipack portions are perfect to slip into any bag for an easy lunch snack.Loved by kids for their fun shapes and flavours, Twisties are a perfect Halloween treat or a stocking filler during the Christmas holidays.They’re the ideal snack to pair with good times, whether that’s out and about on a road trip or keeping the kids happy at a birthday party.",
  "gtin13": "9310015234491",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/345305.jpg",
    "width": 1200
  },
  "name": "Twisties Cheese Snacks Multipack 6 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 3.9,
    "lowPrice": 3.9,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-24T14:46:50.529Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 3.9,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/345305/twisties-cheese-snacks-multipack"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/345305/twisties-cheese-snacks-multipack"
  ],
  "sku": "345305",
  "updatedAt": "2022-11-24T14:46:50.529Z"
}
