{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "EACH FILM COATED TABLET CONTAINS: Biotin 50 g; Folic acid 500 g; Nicotinamide 25 mg; Vitamin B1 (thiamine from thiamine hydrochloride) 22.03 mg; Vitamin B2 (riboflavin) 30 mg; Vitamin B5 (pantothenic acid from calcium pantothenate) 69 mg; Vitamin B6 (pyridoxine from pyridoxine hydrochloride) 24.68 mg; Vitamin B12 (cyanocobalamin) 50 g; Vitamin C (ascorbic acid) 165 mg; Vitamin D3 (colecalciferol) 25 g; Vitamin E (d-alpha-tocopheryl acid succinate) 24.79 mg; Calcium (from calcium citrate tetrahydrate) 21 mg; Chromium (from chromium picolinate) 6.2 g; Copper (from copper gluconate) 58 g; Iodine (from potassium iodide) 50 g; Iron (from ferrous fumarate) 3 mg; Magnesium (from heavy magnesium oxide) 105 mg; Manganese (from manganese amino acid chelate) 1.2 mg; Potassium (from potassium sulfate) 4 mg; Selenium (from selenomethionine) 26 g; Zinc (from zinc sulfate monohydrate) 15 mg; Betacarotene 1 mg; Choline (from choline bitartrate) 10.28 mg; Co-enzyme Q10 (ubidecarenone) 1 mg; Inositol 25 mg; Lutein 0.2 mg; Lysine (from lysine hydrochloride) 8 mg; Spearmint oil 1.5 mg; Astragalus (Astragalus membranaceus extract 5 mg) equiv. dry root 50 mg; Bilberry (Vaccinium myrtillus extract 0.25 mg) equiv. fresh fruit 25 mg; Celery (Apium graveolens extract 1.6 mg) equiv. dry seed 20 mg; Fennel (Foeniculum vulgare extract 3 mg) equiv. dry fruit 15 mg; Ginger (Zingiber officinale extract 1 mg) equiv. dry rhizome 5 mg; Ginkgo (Ginkgo biloba extract 2 mg) equiv. dry leaf 100 mg; Globe Artichoke (Cynara scolymus extract 1 mg) equiv. fresh leaf 50 mg; Grape Seed (Vitis vinifera extract 9.9 mg) equiv. dry seed 1.18 g; Gotu Kola (Centella asiatica extract 12.5 mg) equiv. dry whole plant 50 mg; Green Tea (Camellia sinensis extract 62 mg) equiv. dry leaf 372 mg; Korean Ginseng (Panax ginseng extract 5 mg) equiv. dry root 50 mg; Liquorice (Glycyrrhiza glabra extract 2 mg) equiv. dry root & stolon 10 mg; Milk Thistle (Silybum marianum extract 0.71 mg) equiv. dry fruit 50 mg; Papaya (Carica pa"
    },
    {
      "name": "Contains",
      "value": "Contains soya beans."
    },
    {
      "name": "Warning",
      "value": "Stop taking this medication if you experience tingling, burning or numbness and see your healthcare practitioner as soon as possible. [Contains vitamin B6]. Do not use if pregnant or likely to become pregnant. Use in children under 12 years is not recommended. Do not use while breastfeeding. This product contains selenium which is toxic in high doses. A daily dose of 150 micrograms for adults of selenium from dietary supplements should not be exceeded. Do not take while on warfarin therapy without medical advice. Not for the treatment of iron deficiency conditions."
    },
    {
      "name": "Size",
      "value": "120 pack"
    },
    {
      "name": "Unit Price",
      "value": "$28.33 per 100Ea"
    }
  ],
  "brand": "Swisse",
  "createdAt": "2022-11-24T08:16:49.020Z",
  "description": "Swisse Ultivite Men's Multivitamin Tablets",
  "image": {
    "@type": "ImageObject",
    "height": 300,
    "mime": "image/jpeg",
    "url": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/6/8/4/6840773.jpg",
    "width": 300
  },
  "name": "Ultivite Men's Multivitamin Tablets",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 34,
    "lowPrice": 34,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-24T08:16:49.019Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "34.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/swisse-vitamins-ultivite-tablets-formula-1-mens"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/swisse-vitamins-ultivite-tablets-formula-1-mens"
  ],
  "sku": "6840773",
  "updatedAt": "2022-11-24T08:16:49.019Z"
}
