{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "EACH FILM COATED TABLET CONTAINS: Biotin 150 g; Folic Acid 500 g; Nicotinamide 25 mg; Vitamin A (retinol acetate) 750 g/RE; Vitamin B1 (thiamine from thiamine hydrochloride) 22.03 mg; Vitamin B2 (riboflavin) 30 mg; Vitamin B5 (pantothenic acid from calcium pantothenate) 40 mg; Vitamin B6 (pyridoxine from pyridoxine hydrochloride) 24.68 mg; Vitamin B12 (cyanocobalamin) 50 g; Vitamin C (ascorbic acid) 165 mg; Vitamin D3 (colecalciferol) 25 g; Vitamin E (d-alpha-tocopheryl acid succinate) 41.33 mg; Calcium (from calcium citrate tetrahydrate) 42 mg; Chromium (from chromium picolinate) 50 g; Copper (from copper gluconate) 1.2 mg; Iodine (from potassium iodide) 150 g; Iron (from ferrous fumarate) 5 mg; Magnesium (from heavy magnesium oxide) 105 mg; Manganese (from manganese amino acid chelate) 3.5 mg; Molybdenum (from molybdenum trioxide) 45 g; Potassium (from potassium sulfate) 4 mg; Selenium (from selenomethionine) 50 g; Zinc (from zinc sulfate monohydrate) 5 mg; Co-enzyme Q10 (ubidecarenone) 3 mg; Lutein 1 mg; Silicon (from colloidal anhydrous silica) 9.33 mg; Spearmint Oil 2 mg; Ashwagandha (Withania somnifera extract 50 mg) equiv. dry root 500 mg; Astragalus (Astragalus membranaceus extract 5 mg) equiv. dry root 50 mg; Bilberry (Vaccinium myrtillus extract 1 mg) equiv. fresh fruit 100 mg; Black Cohosh (Actaea racemosa extract 40 mg) equiv. dry root & rhizome 200 mg; Cranberry (Vaccinium macrocarpon fruit powder 20 mg) equiv. fresh fruit 1000 mg; Ginger (Zingiber officinale extract 3 mg) equiv. dry rhizome 15 mg; Ginkgo (Ginkgo biloba extract 20 mg) equiv. dry leaf 1000 mg; Globe Artichoke (Cynara scolymus extract 1 mg) equiv. fresh leaf 50 mg; Grape Seed (Vitis vinifera extract 9.9 mg) equiv. dry seed 1.18 g; Milk Thistle (Silybum marianum extract 21.43 mg) equiv. dry fruit 1.5 g; Turmeric (Curcuma longa extract 5 mg) equiv. dry rhizome 112.5 mg; Water Hyssop (Bacopa monnieri extract 1.25 mg) equiv. dry herb 50 mg. Note: g = micrograms."
    },
    {
      "name": "Contains",
      "value": "Contains soya beans."
    },
    {
      "name": "Warning",
      "value": "If you are pregnant, or considering becoming pregnant, do not take vitamin A supplements without consulting your doctor or pharmacist. When taken in excess of 3000 g/RE, vitamin A can cause birth defects. The recommended daily amount of Vitamin A from all sources is 700 g/RE for women and 900 g/RE for men. In very rare cases, black cohosh has been associated with liver failure."
    },
    {
      "name": "Size",
      "value": "90 pack"
    },
    {
      "name": "Unit Price",
      "value": "$66.67 per 100Ea"
    }
  ],
  "brand": "Swisse",
  "createdAt": "2022-12-04T04:49:59.891Z",
  "description": "Swisse Ultivite Women's 50+ Tablets",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/8/0/9/8097185.jpg",
  "name": "Ultivite Women's 50+ Tablets",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 60,
    "lowPrice": 60,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-04T04:49:59.890Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "60.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/swisse-vitamins-ultivite-womens-50"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/swisse-vitamins-ultivite-womens-50"
  ],
  "sku": "8097185",
  "updatedAt": "2022-12-04T04:49:59.890Z"
}
