{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Special K: Rice (43%), whole grains (23%)(wheat, oat flour), wheat protein, sugar, minerals (calcium carbonate, iron, zinc oxide), oat fibre, salt, barley malt extract, vitamins (niacin, vitamin D, vitamin B6, riboflavin, folate). Sustain: Whole grains (55%)(wheat, brown rice, rolled oats), corn, fruit (12%)(sultanas, dried apple (apple [apple, preservative (sodium metabisulphite)], currants), sugar, almonds, wheat germ, invert syrup, barley malt extract, salt, minerals (iron, zinc oxide) , vitamins (niacin, vitamin B6, riboflavin, folate). Nutri-Grain: Cereals (51%)(wheat flour, oatmeal, maize flour), sugar, wheat protein, maltodextrin, molasses, oat fibre, vegetable gum (acacia gum), salt, barley malt extract, minerals (calcium carbonate, iron, zinc oxide), raising agent (potassium bicarbonate), natural flavours, natural colours (paprika, turmeric), vitamins (niacin, B6 riboflavin, folate). Coco Pops: Whole white rice (65%), sugar, cocoa (3%), minerals (calcium carbonate, iron, zinc oxide), salt, natural flavour, barley malt extract, vitamins (niacin, riboflavin, vitamin B6, folate). Just Right: Whole grains (64%)(wheat, oats), fruit (sultanas, apricot piece[5%] [concentrated apricot puree, concentrated apple puree, invert sugar, humectant (glycerol), sugar, wheat fibre, gelling agent (pectin), acidity regulator (296), natural flavour, colours (turmeric, paprika)]), sugar, puffed triticale, wheat flour, barley malt extract, salt, natural flavour, minerals (iron, zinc oxide), vitamins (niacin, vitamin B6, riboflavin, folate). Corn Flakes: Corn (90%), sugar, salt, barley malt extract, vitamins (vitamin E, niacin, vitamin B6, riboflavin, folate), minerals (iron, zinc oxide). Sultana Bran: Whole wheat, sultanas (26%), wheat bran (25%), sugar, barley malt extract, salt, minerals (iron, zinc oxide), vitamins (niacin, vitamin B6, riboflavin, folate). (Natural source of magnesium)."
    },
    {
      "name": "Allergen",
      "value": "Contains Sulphates, Contains Tree Nuts, Contains Barley, May Be Present Tree Nuts, Contains Peanuts, Contains Wheat, Contains Cereals Containing Gluten"
    },
    {
      "name": "Servings Per Pack",
      "value": "8.0"
    },
    {
      "name": "Size",
      "value": "275g"
    },
    {
      "name": "Unit Price",
      "value": "$2.91 per 100G"
    }
  ],
  "brand": "Kellogg's",
  "createdAt": "2022-12-06T05:05:19.663Z",
  "description": "Kellogg's Variety Pack assorted breakfast cereals sachets 8 pack",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/5/2/0/5203956.jpg",
  "name": "Variety Pack assorted breakfast cereals sachets 8 pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 8,
    "lowPrice": 8,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-12-06T05:05:19.663Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "8.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/kelloggs-cereal-variety-pack-8-pack"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/kelloggs-cereal-variety-pack-8-pack"
  ],
  "sku": "5203956",
  "updatedAt": "2022-12-06T05:05:19.663Z"
}
