{
  "@type": "Product",
  "brand": {
    "@type": "Thing",
    "name": "OhMyVeggies"
  },
  "createdAt": "2022-12-05T00:07:14.399Z",
  "description": "32 Plant-Based Recipes for your Thanksgiving Feast!\nThe holidays are my favorite time of year. It's filled with incredible food, fun celebrations, and lots of time with family and friends.\nBut I know it's also a source of stress for many families. And that's especially true for those trying to pull together a fully plant-based feast, on an occasion that is traditionally centered around turkey!\nBut I'm here to show you that Thanksgiving can be just as delicious with a table full of plant based treats! So I've pulled together all my favorite Thanksgiving worthy recipes in this handy e-book. So you can have a complete vegan feast at your fingertips, without spending hours scouring the internet!\nWhether you're planning a completely vegan holiday, or just looking for a few special vegan-friendly dishes to round out your celebration, you'll find everything you need to make your holiday delicious!\n\n\n\nAbout the Author\nNicole is the creator behind the popular plant-based food blogs Oh My Veggies, Veg Kitchen, and Delicious Everyday.\nShe's also a lifelong vegetarian, author of the hit cookbook Weeknight One-Pot Vegan Cooking, and very busy mom!\n\n What's Included?\nThe Vegan Thanksgiving Cookbook is packed full of plant based recipes that are fit for your holiday feast.\nStart your holiday feast with plant powered appetizers like:\n\nOlive Bar with Tofu \"Feta\"\nTempeh Fries with Horseradish Dill Sauce\nChickpea Tomato Dip and Spiced Pita Chips\n\nImpress your guests with show-stopping vegan main dishes such as:\n\nMushroom Wellington\nVeggie Pot Pies\nSlow Cooker Pumpkin Chili\nWhole Roasted Cauliflower in Tahini Sauce\nClassic Veggie Shepherd's Pie\nRice and Pecan Stuffed Squash\nRoasted Beetroot Napoleon with Walnut Chive Cream\nPumpkin Stuffed Cannelloni\nMushroom Bourguignon\n\nAdd on these incredible vegan Soups, Salads, and Sides to round out your holiday menu:\n\nRoasted Butternut Squash &amp; Quinoa Salad\nChickpea Avocado Chopped Salad with Tahini Maple Dressing\nChunky Sweet Potato Bisque\nButternut Squash and Apple Soup\nHearty Veggie &amp; Lentil Soup\nCorn &amp; Sweet Potato Chowder\nSoy and Maple Glazed Winter Squash\nMashed Potatoes with Onion Gravy\nMaple and Tarragon Sweet Potatoes\nCrispy Roast Potatoes\nSweet Potato Fritters with Cashew Lime Cream\nGreen Bean Salad with Miso Dressing\n\nAnd finish the meal with easy, yet indulgent desserts like:\n\nPumpkin Pie Bars\nEasy Pumpkin Cookies\nGreen Baklava\n30-Minute Vegan Brownies\nPeanut Butter Cookies\n3-Ingredient Chocolate Mousse\nSweet &amp; Salty Tahini Cookies\nDark Chocolate Cookies\n\nThere's a little something for everyone in this incredible collection of recipes. And while I put this book together with Thanksgiving in mind, you'll likely find yourself cooking these dishes all year long. They're that irresistible. 😉\n\nFAQs\nWhat format is the book in?\nThe book will be delivered as a PDF download. It's designed to be read on your computer, mobile device, or printed out.\nCan I print the book?\nAbsolutely! In fact, I encourage you to print it out. Stick it in a three-ring binder, and keep it in your kitchen for easy reference.\nHow many times can I download the book?\nAs many times as you want. I lose stuff too! 😉\nAre any of the recipes available on your website?\nSome of them are available elsewhere and some of them are exclusive to this book.\nWhat is the refund policy?\nWe don't offer refunds on digital products, as it unfortunately attracts fraud. But frankly, I've never been asked for one anyway. If you're not happy with the book, email me personally at nicole@ohmyveggies.com and I will do my best to make it right!",
  "image": [
    "https://cdn.shopify.com/s/files/1/0595/0341/1353/products/veganthanksgivingebook_1200x.jpg?v=1631201012"
  ],
  "name": "Vegan Thanksgiving Cookbook",
  "offers": [
    {
      "@type": "Offer",
      "availability": "http://schema.org/InStock",
      "price": 7.99,
      "priceCurrency": "USD",
      "url": "https://shop.ohmyveggies.com/products/ebook-vegan-thanksgiving-cookbook?variant=41038715289753"
    }
  ],
  "sameAs": [
    "https://ohmyveggies.com/products/ebook-vegan-thanksgiving-cookbook?pr_prod_strat=copurchase&pr_rec_id=0b13bc3e7&pr_rec_pid=7045675614361&pr_ref_pid=7046333431961&pr_seq=uniform"
  ],
  "updatedAt": "2022-12-05T04:03:59.817Z",
  "url": "https://shop.ohmyveggies.com/products/ebook-vegan-thanksgiving-cookbook"
}
