{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Chocolate - Protein Blend (Pea Protein Isolate, Brown Rice Protein Isolate, Hemp Seed Protein), Cocoa (11%), Thickeners (Maize Starch, Xanthan Gum, Guar Gum), Soluble Maize Fibre, Minerals (Potassium Chloride, Calcium Phosphate, Sodium Phosphate, Magnesium Oxide, Zinc Sulphate, Ferric Pyrophosphate, Potassium Iodide, Sodium Selenite), Vitamins (Ascorbic Acid, Niacinamide, dl-Alpha-Tocopheryl Acetate, Riboflavin, Pyridoxine Hydrochloride, Thiamin Hydrochloride, Vitamin A Acetate, Folic Acid, Ergocalciferol, Cyanocobalamin), Coconut Oil, Flavour, Sweet Potato Flour, Emulsifier (Sunflower Lecithin), Flaxseed, Psyllium Husk, Chia Seed, Natural Sweetener (Steviol Glycosides), Green Tea Extract, Probiotic (Bacillus Coagulans)&lt;br&gt;Vanilla - Protein Blend (Pea Protein Isolate, Brown Rice Protein Isolate, Hemp Seed Protein), Soluble Maize Fibre, Thickeners (Maize Starch, Xanthan Gum, Guar Gum), Flavour, Coconut Oil, Minerals (Potassium Chloride, Calcium Phosphate, Sodium Phosphate, Magnesium Oxide, Zinc Sulphate, Ferric Pyrophosphate, Potassium Iodide, Sodium Selenite), Vitamins (Ascorbic Acid, Niacinamide, dl-Alpha-Tocopheryl Acetate, Riboflavin, Pyridoxine Hydrochloride, Thiamin Hydrochloride, Vitamin A Acetate, Folic Acid, Ergocalciferol, Cyanocobalamin), Sweet Potato Flour, Emulsifier (Sunflower Lecithin), Flaxseed, Psyllium Husk, Chia Seed, Natural Sweetener (Steviol Glycosides), Green Tea Extract, Probiotic (Bacillus Coagulans)"
    },
    {
      "name": "Allergen",
      "value": "May Contain Peanuts, May Contain Tree Nuts, May Contain Sesame Seeds"
    },
    {
      "name": "Servings Per Pack",
      "value": "14.0"
    },
    {
      "name": "Warning",
      "value": "Formulated meal replacement. Should not be used as a total dietary replacement or for children under the age of 3 years old. Use in conjunction with an appropriate physical training and exercise program."
    },
    {
      "name": "Unit Price",
      "value": "$7.02 per 100Ea"
    }
  ],
  "brand": "The Man Shake",
  "createdAt": "2022-12-06T22:10:46.207Z",
  "description": "The Man Shake Vegan Meal Replacement Variety 14 Pack",
  "image": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/5/0/8/5081123.jpg",
  "name": "Vegan Meal Replacement Variety 14 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 55,
    "lowPrice": 55,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/OutOfStock",
        "availabilityStarts": "2022-12-06T22:10:46.206Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "55.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/variety-14pk-5081123p-1"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/variety-14pk-5081123p-1"
  ],
  "sku": "5081123",
  "updatedAt": "2022-12-06T22:10:46.206Z"
}
