{
  "@type": "Product",
  "brand": {
    "@type": "Thing",
    "name": "OhMyVeggies"
  },
  "createdAt": "2022-12-04T14:14:13.478Z",
  "description": "Christmas is my all-time favorite holiday! It's filled with sparkling lights, delicious food, and plenty of celebrations with family and friends.\nBut I know it can also be a source of stress for many. And that's especially true for those of us that are trying to pull together a fully plant-based celebration!\nBut I'm here to show you that Christmas can be just as delicious with a table full of vegan dishes! So I've pulled together all my favorite Christmas dinner table worthy recipes in this handy e-book. So you can have a complete vegan feast at your fingertips, without spending hours scouring the internet!\nWhether you're planning a completely plant based holiday, or are just looking for a few special vegan-friendly dishes to round out your holiday menu, you'll find everything you need to make your celebration delicious!\n\n\nWhat's Included?\nThe Vegan Christmas Cookbook is packed full of plant based recipes that are fit for a holiday feast.\nStart your holiday menu with vegan-friendly appetizers like:\n\nSmoky Vegan Cheddar Cheez\nCranberry and Pecan Vegan \"Cheese Ball\"\nLemon, Thyme, and Garlic Marinated Mushrooms\n\nImpress your guests with show-stopping vegan main dishes such as:\n\nMushroom Wellington\nVegan Paella\nMushroom and Cauliflower Shepherd's Pies\nCranberry Spaghetti Squash\nMiso Glazed Eggplant\nGreek Moussaka\nOne-Pot Vegan Jambalaya\nSpaghetti Mushroom Bolognese\n\nAdd on these incredible vegan soups and side dishes to round out your holiday menu:\n\nFarro &amp; Eggplant with Sun Dried Tomato Pesto\nOne-Pot Creamy Potato Soup\nTuscan Bean Soup\nVegan Carrot Soup\nKale with Fennel, Cranberries, and Walnuts\nMoroccan Chickpea Salad\nRosemary Roasted Mushrooms\nCrispy Roast Potatoes\nLoaded Sweet Potatoes with Spicy Black Beans and Cashew-Lime Cream\nCreamy Mashed Potatoes and Onion Gravy\nRosemary Roasted Carrots\nGlazed Baked Onions\nEasy Vegan Meatballs\n\nAnd finish the meal with a little something sweet:\n\nVegan Sugar Cookies\nPeppermint Chocolatte\nBay, Thyme, and Agave Roasted Pears\nVegan Biscotti\nVegan Coffee Cake\nVegan Pound Cake\nEasy Vegan Cheesecake\nQuick Cinnamon Raisin Bread\nChai Spiced Cranberry Apple Pie\n\nThere's a little something for everyone in this delicious collection of recipes. And while I put this book together with Christmas in mind, you'll likely find yourself cooking these dishes all year long. They're that irresistible. 😉\n\nFAQs\nWhat format is the book in?\nThe book will be delivered as a PDF download. It's designed to be read on your computer, mobile device, or printed out.\nCan I print the book?\nAbsolutely! In fact, I encourage you to print it out. Stick it in a three-ring binder, and keep it in your kitchen for easy reference.\nHow many times can I download the book?\nAs many times as you want. I lose stuff too! 😉\n Are any of the recipes available on your website?\nSome of the recipes are available elsewhere and some of them are exclusive to this book.\nI already have the Vegan Thanksgiving Cookbook. Are these recipes the same or different?\nThe Vegan Christmas Cookbook contains completely different recipes, with one exception. The Mushroom Wellington appears in both books - it's a reader favorite for both holidays!\nWhat is the refund policy?\nWe don't offer refunds on digital products, as it unfortunately attracts fraud. But frankly, I've never been asked for one anyway. If you're not happy with the book, email me personally at nicole@ohmyveggies.com and I will do my best to make it right!",
  "image": [
    "https://cdn.shopify.com/s/files/1/0595/0341/1353/products/christmas-ebook_1200x.jpg?v=1631124218"
  ],
  "name": "Vegan Christmas Cookbook",
  "offers": [
    {
      "@type": "Offer",
      "availability": "http://schema.org/InStock",
      "price": 7.99,
      "priceCurrency": "USD",
      "url": "https://shop.ohmyveggies.com/products/ebook-vegan-christmas-cookbook?variant=41038729052313"
    }
  ],
  "sameAs": [
    "https://ohmyveggies.com/products/ebook-vegan-christmas-cookbook?pr_prod_strat=copurchase&pr_rec_id=3f43e0d64&pr_rec_pid=7045684953241&pr_ref_pid=7045675614361&pr_seq=uniform"
  ],
  "updatedAt": "2022-12-05T04:08:54.631Z",
  "url": "https://shop.ohmyveggies.com/products/ebook-vegan-christmas-cookbook"
}
