{
  "@type": "Product",
  "additionalProperty": [],
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Vicks"
  },
  "createdAt": "2022-11-23T22:22:16.110Z",
  "description": "Vicks VapoRub Chest Rub Ointment provides up to 8 hours relief from cold symptoms.- Relieves 4 Cough & Cold Symptoms: Cough, Nasal congestion, Body ache, Headache and Muscle stiffness.- 8 hours of relief from cough and cold- Active ingredients in Vicks VapoRub work in two ways: 1) By Inhalation - Medicinal vapours help relieve nasal congestion.; 2) By Stimulation – Rub in. VapoRub Acts directly on the skin, warming away muscular aches and pains- Suitable for adults and children above 2 years old- Available in two pack sizes: 50g  100gDon’t let cough and cold come in the way of you and your family’s sweet dreams. Vicks Vicks VapoRub Chest Rub Ointment provides up to 8 hours relief from cold symptoms so you can enjoy a full night of restful sleep, even with a cold.Suitable for adults and children above 2 years old.     Vicks VapoRub contains cough suppressants. So if you want a good night’s sleep for the whole troop (For children 2 years and above), gently apply VapoRub on chest and throat before bedtime to reduce coughs due to cold. A loving massage will also soothe cold induced minor muscular aches and pains such as sore muscles and blocked nose.  Helps Relieve Distress of Colds. Up to 8 Hours Relief.Relieves Cough, Nasal Congestion and Chest Congestion.Relieves Body Ache & Muscle StiffnessUse as medicated vapour to relieve nasal congestion.Use as rub on massage for temporary relief from coughs due to colds and minor muscular aches due to colds",
  "gtin13": "9300618580026",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/030256.jpg",
    "width": 1200
  },
  "name": "Vicks Vaporub Decongestant Rub 50g",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 8.5,
    "lowPrice": 8.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-23T22:22:16.108Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 8.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/30256/vicks-chest-rub-vaporub"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/30256/vicks-chest-rub-vaporub"
  ],
  "sku": "30256",
  "updatedAt": "2022-11-23T22:22:16.108Z"
}
