{
  "@type": "Product",
  "additionalProperty": [
    {
      "@type": "NutritionInformation",
      "calories": "478kilojoule",
      "carbohydrateContent": "19.4g",
      "dietary_fibre": "-",
      "fatContent": "3.4gram",
      "name": "nutrition",
      "proteinContent": "1.1gram",
      "saturatedFatContent": "2.6gram",
      "servingSize": "100 g",
      "sodiumContent": "15milligram",
      "sugarContent": "17.8g"
    }
  ],
  "aggregateRating": {
    "@context": "http://schema.org",
    "@type": "AggregateRating",
    "ratingCount": 26,
    "ratingValue": 4.76923076923077
  },
  "brand": {
    "@context": "http://schema.org",
    "@type": "Organization",
    "name": "Weis"
  },
  "createdAt": "2022-11-24T12:31:52.231Z",
  "description": "WEIS ICE CREAM FRUITO 280 MLSweet pineapple, ripened bananas and tangy passionfruit topped with cream is how we made our first iconic bar ever - The Fruito Bar. It was developed by Cyril Weis in 1936 and first commercially sold by his son Les in 1957 - at Pop's Milk Bar across from the Empire Theatre in Toowoomba, Queensland. Based on the classic pairing of fruit salad and ice cream, the unique and refreshing taste and purity of ingredients remains a family favourite. It's the perfect treat for a hot summer's day! Fruit and cream are soulmates. Put them together with delicious natural ingredients, and you’ve got heaven in a Weis Bar. Our signature two-toned Classic Weis Bars, a moreish combination of real fruit and our traditional cream strip, are an irresistible indulgence – all wrapped up in a no stick, no-drip package. Available in a variety of flavours at your local snack bar, convenience store or service station. Or if you want to enjoy more of our divinely delicious Weis Bars, we’ve put them in Multipacks so you never have to run out. Look out for our colourful packs in the freezer at your supermarket. At Weis our products are based on recipes, so the focus is on the subtle blending of real ingredients and ultimately the taste. Our knowledge and expertise in sourcing and working with all different kinds of fruits, premium grade nuts and natural ingredients enables us to create unique combinations and taste experiences. Visit our website to find our full range of exciting flavours such as Mango, Fruito, Mango Macadamia, Vanilla bean, blackberry, dairy free coconut an many more.Sweet pineapple, ripened bananas, tangy passionfruit paired with smooth ice cream is how we made our first iconic bar ever - The Fruito Bar.Real Fruit, Real Aussie Dairy for the Real Weis taste!Refreshment in a two-tone bar.  Perfect for hot summer days, treats or any occasion, get your multipack today.We're proud of what goes in - so you can enjoy every bite! No artificial colours or flavoursDelicious snack that is Gluten Free.Weis bars are made right here in Australia since 1957.",
  "gtin13": "9310541000522",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://cdn0.woolworths.media/content/wowproductimages/large/178950.jpg",
    "width": 1200
  },
  "name": "Weis Ice Cream Passionfruit Banana Pineapple 4 Pack",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 8.5,
    "lowPrice": 8.5,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "http://schema.org/InStock",
        "availabilityStarts": "2022-11-24T12:31:52.229Z",
        "itemCondition": "http://schema.org/NewCondition",
        "offeredBy": "Woolworths",
        "potentialAction": {
          "@context": "http://schema.org",
          "@type": "BuyAction"
        },
        "price": 8.5,
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Woolworths"
        },
        "url": "https://woolworths.com.au/shop/productdetails/178950/weis-ice-cream-passionfruit-banana-pineapple"
      }
    ]
  },
  "sameAs": [
    "https://woolworths.com.au/shop/productdetails/178950/weis-ice-cream-passionfruit-banana-pineapple"
  ],
  "sku": "178950",
  "updatedAt": "2022-11-24T12:31:52.229Z"
}
