{
  "@type": "Product",
  "additionalProperty": [
    {
      "name": "Ingredients",
      "value": "Butane, Isobutane, Propane, Cyclopentasiloxane, Aluminum Chlorohydrate, Fragrance, Ppg-14 Butyl Ether, Disteardimonium Hectorite, Bht, Propylene Carbonate, Dimethiconol, Caprylic/Capric Triglyceride, Hydrated Silica, Gelatin Crosspolymer, Water, Cellulose Gum, Sodium Benzoate, Sodium Starch Octenylsuccinate, Maltodextrin, Hydrolysed Corn Starch, Silica."
    },
    {
      "name": "Contains",
      "value": "250mL"
    },
    {
      "name": "Warning",
      "value": "Pressurised dispenser. Protect from sunlight and do not expose to temperatures exceeding 50°C. Do not pierce or burn, even when empty. Intentional misuse by deliberately concentrating and inhaling contents may be harmful or fatal. DO NOT SPRAY NEAR A NAKED FLAME OR ANY HOT SURFACE. KEEP AWAY FROM SOURCES OF IGNITION ? NO SMOKING. AVOID DIRECT INHALATION. USE IN WELL VENTILATED PLACES, AVOID PROLONGED SPRAYING. KEEP OUT OF REACH OF CHILDREN. EXTREMELY FLAMMABLE., Warning: Do Not Spray Near A Naked Flame Or Any Hot Surface. Keep Away From Sources Of Ignition - No Smoking. Avoid Direct Inhalation. Use In Well Ventilated Places, Avoid Prolonged Spraying. Keep Out Of Reach Of Children. Caution: Pressurised Dispenser. Protect From Sunlight And Do Not Expose To Temperatures Exceeding 50C. Do Not Pierce Or Burn, Even When Empty. Intentional Misuse By Deliberately Concentrating And Inhaling Contents May Be Harmful Or Fatal."
    },
    {
      "name": "Size",
      "value": "250mL"
    },
    {
      "name": "Unit Price",
      "value": "$2.40 per 100mL"
    }
  ],
  "brand": "Rexona",
  "createdAt": "2022-11-24T08:45:23.000Z",
  "description": "Rexona Women Antiperspirant Aerosol Deodorant Sexy Bouquet",
  "image": {
    "@type": "ImageObject",
    "height": 300,
    "mime": "image/jpeg",
    "url": "https://shop.coles.com.au/wcsstore/Coles-CAS/images/8/9/4/8949220.jpg",
    "width": 300
  },
  "name": "Women Antiperspirant Aerosol Deodorant Sexy Bouquet",
  "offers": {
    "@type": "AggregateOffer",
    "highPrice": 6,
    "lowPrice": 6,
    "offerCount": 1,
    "offers": [
      {
        "@context": "http://schema.org",
        "@type": "Offer",
        "availability": "https://schema.org/InStock",
        "availabilityStarts": "2022-11-24T07:34:52.181Z",
        "itemCondition": "https://schema.org/NewCondition",
        "offeredBy": "Coles",
        "price": "6.00",
        "priceCurrency": "AUD",
        "seller": {
          "@type": "Organization",
          "name": "Coles"
        },
        "url": "https://shop.coles.com.au/a/national/product/rexona-deodorant-anti-perspirant-aerosol-sexy"
      }
    ]
  },
  "sameAs": [
    "https://shop.coles.com.au/a/national/product/rexona-deodorant-anti-perspirant-aerosol-sexy"
  ],
  "sku": "8949220",
  "updatedAt": "2022-11-24T07:34:52.181Z"
}
