{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "119",
    "ratingValue": "4.7"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T17:38:16.356Z",
  "datePublished": "2015-04-02T05:00:07+00:00",
  "description": "AMAZING, rich chocolate hazelnut cake made in just 1 bowl! Entirely vegan and gluten-free and so simple to make. Perfect for every day or birthdays and special occasions.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/03/V-GF-Chocolate-Hazelnut-Cake-SQUARE.jpg"
  ],
  "keywords": "hazelnut cake",
  "name": "1-Bowl Chocolate Hazelnut Cake (Vegan + GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "444 kcal",
    "carbohydrateContent": "55 g",
    "fatContent": "25 g",
    "fiberContent": "6.5 g",
    "proteinContent": "6.3 g",
    "saturatedFatContent": "12.5 g",
    "servingSize": "1 slices",
    "sodiumContent": "82 mg",
    "sugarContent": "35 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "4 Tbsp flaxseed meal (to make flax eggs)",
    "10 Tbsp water (to make flax eggs)",
    "1 cup unsweetened plain almond milk",
    "1 1/2 tsp apple cider vinegar",
    "3 tsp baking soda",
    "2/3 scant cup maple syrup or agave nectar (sub honey if not vegan)",
    "2/3 cup cane or granulated sugar",
    "1/2 cup melted coconut oil or vegan butter (such as Earth Balance)",
    "1 tsp pure vanilla extract",
    "2 cups unsweetened applesauce (or other hearty fruit puree, such as beets)",
    "1/2 tsp sea salt",
    "1 cup unsweetened cocoa powder (if clumpy, sift)",
    "1 cup almond meal (finely ground from raw almonds)",
    "1/2 cup gluten-free oat flour (finely ground from raw oats)",
    "1 1/2 cups gluten-free flour blend*",
    "1/2 cup unsweetened plain almond milk",
    "1 1/4 cups dairy-free dark or semi-sweet chocolate (chopped)",
    "1/4 cup melted coconut oil or softened vegan butter (cut into slices // such as Earth Balance)",
    "1 1/4 - 2 cups powdered sugar (ensure vegan-friendliness)",
    "1 1/2 cups roasted unsalted hazelnuts"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and butter two 8\" round cake pans (or line 24 muffin tins with paper liners // as original recipe is written // adjust number/size of pans if altering batch size). Dust with gluten free flour and shake out excess."
    },
    {
      "@type": "HowToStep",
      "text": "Measure out almond milk and add vinegar. Stir and let curdle while moving onto the next step."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare flax eggs in a large mixing bowl by mixing flaxseed meal and water and let rest for 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add baking soda to the almond milk vinegar mixture and stir."
    },
    {
      "@type": "HowToStep",
      "text": "Add the sugar, maple syrup and almond milk mixture to the flax egg and beat/whisk to combine. Then add applesauce, vanilla, melted coconut oil, salt and mix."
    },
    {
      "@type": "HowToStep",
      "text": "Add cocoa powder, almond meal, oat flour and gluten free flour and beat/whisk to combine. If the batter appears too thick, add a touch more almond milk, but it should be perfect. It should resemble a semi-thick batter that’s pourable."
    },
    {
      "@type": "HowToStep",
      "text": "Divide batter evenly between cake pans (if using muffin tins, it should be enough for roughly 24 filling generously 3/4 full // amount as original recipe is written)."
    },
    {
      "@type": "HowToStep",
      "text": "Bake cake for 35-45 minutes or more (cupcakes for about 29-35 minutes) or until a toothpick inserted into the center comes out clean and the top appears dry. Time will vary if you sub ingredients, as well as depending on the size of your pan."
    },
    {
      "@type": "HowToStep",
      "text": "Let rest in the tin for 15-20 minutes, then carefully run a butter knife along the edges and invert onto cooling racks. Let cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "FOR FROSTING: Add almond milk to your rinsed out mixing bowl from earlier and microwave for 1 minute. (Alternatively, heat in a saucepan until just simmering and then transfer back to mixing bowl.)"
    },
    {
      "@type": "HowToStep",
      "text": "Immediately add chocolate to warm milk but don’t touch for 3 minutes so it can melt."
    },
    {
      "@type": "HowToStep",
      "text": "Stir with a wooden spoon to incorporate, then add coconut oil or softened butter and cover. Let rest untouched for another 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Use your mixer (or a whisk) to beat the mixture together. Then add 1 cup powdered sugar, mix again, and place in fridge to set for 20 minutes. You’ll know it’s ready when you tip it and it’s slow to move."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from fridge and beat again. If it’s still too thin, add another 1/4 - 1/2 cup powdered sugar (amount as original recipe is written // adjust if altering batch size) and beat until light and fluffy. I found that adding 1 3/4 cups total powdered sugar (amount as original recipe is written // adjust if altering batch size) was perfect. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the bottom layer of the cooled cake to a serving plate/dish. Spread a semi-generous layer of frosting on the top of the bottom layer and top generously with hazelnuts. Press down with hands to settle them into the frosting (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully top with second layer and frost the top generously, then the sides. Using a butter knife yields a smooth surface. It should be the perfect amount of frosting - not too thick, not too thin."
    },
    {
      "@type": "HowToStep",
      "text": "Add hazelnuts around the perimeter of the top of the cake. Slice and serve."
    },
    {
      "@type": "HowToStep",
      "text": "Will keep well-covered at room temperature for several days, though best when fresh. Refrigeration not necessary."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://minimalistbaker.com/1-bowl-chocolate-hazelnut-cake-vegan-gf"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-02T17:38:16.354Z"
}
