{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "59",
    "ratingValue": "4.77"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-02T04:38:41.250Z",
  "datePublished": "2016-12-14T05:00:33+00:00",
  "description": "Tender, spicy, perfectly sweet ginger cookies made entirely in 1 bowl! The perfect vegan, gluten-free cookie for your holiday spread.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/11/1-Bowl-Ginger-Cookies-SQUARE.jpg"
  ],
  "keywords": "ginger cookies",
  "name": "1-Bowl Ginger Cookies (V/GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "208 kcal",
    "carbohydrateContent": "36.8 g",
    "fatContent": "6.8 g",
    "fiberContent": "2 g",
    "proteinContent": "1.7 g",
    "saturatedFatContent": "4 g",
    "servingSize": "1 cookies",
    "sodiumContent": "80 mg",
    "sugarContent": "19 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup softened vegan butter* (1 stick = 1/2 cup // I like Earth Balance buttery sticks)",
    "2/3 cup organic cane sugar* (plus more for rolling)",
    "3 Tbsp aquafaba",
    "3 Tbsp molasses",
    "3/4 tsp baking powder",
    "1 tsp ground cinnamon (plus more for rolling)",
    "3/4 tsp ginger",
    "1/4 tsp nutmeg",
    "1/4 tsp sea salt",
    "1 2/3 cups gluten-free flour blend*",
    "2/3 cup almond flour*",
    "1/3 cup cornstarch (I didn't test it with arrowroot but think it would work the same)",
    "1 cup powdered sugar",
    "1-2 Tbsp unsweetened dairy-free milk"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and line two baking sheets with parchment paper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the topping for later by adding 2-3 Tbsp organic cane sugar and 1/2 tsp cinnamon to a small bowl and mixing. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add softened vegan butter to a large mixing bowl and beat until creamy and smooth - about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add sugar and mix on medium speed until fluffy and light - about 1 minute. Then add chickpea brine (or other egg substitutes*) and molasses and mix again, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add baking powder, cinnamon, ginger, nutmeg, and sea salt and blend to combine. Then add gluten-free flour blend, almond flour, and cornstarch and mix on low until the ingredients are combined."
    },
    {
      "@type": "HowToStep",
      "text": "The dough should be thick and almost difficult to mix at this point. If too soft, continue adding 1 Tbsp each gluten-free flour blend, almond flour, and cornstarch until a thick, moldable dough is formed. Then transfer dough to the refrigerator and chill for 30 minutes*."
    },
    {
      "@type": "HowToStep",
      "text": "Use a cookie scooper (I like this one) or Tablespoon to measure out 1 1/2 Tbsp amounts of dough and gently roll into balls - the dough will still be soft so be gentle. Then carefully roll in the cinnamon-sugar topping and arrange on the parchment-lined baking sheets. Press down gently with the palm of your hand or a drinking glass to smash until about the thickness you want to enjoy them at. They won't spread or rise much so keep that in mind."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 10-11 minutes or until the cookies appear fluffy and the edges are slightly beginning to dry out. Let cool on baking sheet for 10 minutes before transferring to a wire rack to cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "If frosting, whisk together the powdered sugar and almond milk until a thick, pourable glaze is achieved. Then drizzle over the cookies. See notes if hoping to roll out and cut into shapes."
    },
    {
      "@type": "HowToStep",
      "text": "Storage: Once cooled, store leftover cookies covered at room temperature for 3-4 days, or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "15",
  "sameAs": [
    "https://minimalistbaker.com/1-bowl-ginger-cookies"
  ],
  "totalTime": "PT57M",
  "updatedAt": "2022-12-02T04:38:41.248Z"
}
