{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "74",
    "ratingValue": "4.72"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T17:33:20.170Z",
  "datePublished": "2014-12-13T05:00:37+00:00",
  "description": "A hearty, 1-bowl vegan apple cake infused with gingerbread flavors and rolled oats. A healthier cake perfect for holiday gatherings and cozy afternoons alongside tea.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/12/Vegan-Apple-Gingerbread-Cake-SQUARE.jpg"
  ],
  "keywords": "apple gingerbread cake",
  "name": "1-Bowl Apple Gingerbread Cake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "485 kcal",
    "carbohydrateContent": "74 g",
    "fatContent": "19 g",
    "fiberContent": "4 g",
    "proteinContent": "5.3 g",
    "saturatedFatContent": "4.9 g",
    "servingSize": "1 slices",
    "sodiumContent": "450 mg",
    "sugarContent": "46 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "2 Tbsp flaxseed meal (to make flax eggs)",
    "5 Tbsp water (to make flax eggs)",
    "1/4 cup organic cane sugar",
    "1/3 cup brown sugar",
    "3 Tbsp molasses",
    "3/4 tsp vanilla extract",
    "1/2 cup avocado oil (or sub olive or melted coconut with varied results)",
    "1 1/4 cup grated apple (loosely packed // a mix of sweet + tart)",
    "1 1/2 cups unsweetened almond milk (sub up to 1/3 with water)",
    "1/2 tsp salt",
    "1 tsp baking powder",
    "1 1/2 tsp baking soda",
    "1/2 tsp ground ginger",
    "1 1/4 tsp ground cinnamon",
    "1 1/2 cups Bob’s Red Mill Whole-Wheat Flour",
    "1/2 cup rolled oats",
    "1/2 cup vegan cream cheese (softened // such as Tofutti or Trader Joe’s brand)",
    "1/3 cup vegan butter (softened // such as Earth Balance // butter sticks are best // not the spreadable tub)",
    "2 1/2 - 3 cups powdered sugar",
    "1/2 cup flour (this is optional for thickening // alternatively sub more powdered sugar)",
    "1 cup chopped pecans (optional // for topping)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 325 degrees F (162 C) and butter two 8-inch round cake pans, or an 8×8 baking dish (as original recipe is written // adjust number or size of pans if altering batch size). Add flour to coat, then shake out excess and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a large mixing bowl, prepare flax eggs by mixing flaxseed and water and let rest."
    },
    {
      "@type": "HowToStep",
      "text": "Core apples (no need to peel) and grate. I recommend a mix of finely grated, and coarsely grated. Place grated apple on a clean dish towel and gently squeeze to remove about half of the juice. Set aside. (P.S. you should totally drink that apple juice.)"
    },
    {
      "@type": "HowToStep",
      "text": "To the flax egg, add sugars, molasses, oil, vanilla, almond milk, grated apples, and whisk."
    },
    {
      "@type": "HowToStep",
      "text": "Set a sifter over something to catch fall out and add dry ingredients in this order: 1 cup whole wheat flour (amount as original recipe is written // use 2/3 of the total if altering batch size), baking soda, baking powder, salt, ginger, cinnamon, remaining 1/2 cup whole wheat flour (amount as original recipe is written // use remaining 1/3 of the total if altering batch size). Stir gently with a spoon, then sift over wet ingredients and stir to combine, being careful not to over mix)."
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, add oats and stir again to combine, being careful not to over mix. The batter should be thick but pourable. If it appears too thick, add a bit more almond milk to thin and stir."
    },
    {
      "@type": "HowToStep",
      "text": "Pour batter into prepared cake pan(s). If you're dividing between two pans, it may look like there’s not enough batter but there is! Spread it in an even layer and it will rise while baking."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for about 30-35 minutes if using 2 round cake pans or about 40-50 minutes for an 8x8. A toothpick inserted into the center should come out clean and the edges should be visibly browned. Remove from oven and set out on counter to cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "While the cake is cooling, prepare frosting. To the same mixing bowl (rinsed clean), add softened cream cheese, softened butter and beat or whisk vigorously to combine. Then add powdered sugar in 1/2 cup increments until thick and spreadable."
    },
    {
      "@type": "HowToStep",
      "text": "Add flour at the end to thicken (optional - or just more powdered sugar). You want this frosting to be pretty thick so it won’t slide off the cake, so keep adding flour and/or powdered sugar until it reaches the right consistency."
    },
    {
      "@type": "HowToStep",
      "text": "Once the cake is completely cooled, add 1/3 of the frosting to the top of the bottom layer and spread into an even layer. Then add the top layer of cake and frost generously with remaining frosting, coating sides last. Add crushed pecans on the edges (optional), slice and serve."
    },
    {
      "@type": "HowToStep",
      "text": "The cake should be stored covered in the fridge for optimal freshness, and should keep for 3-4 days. Move to the freezer after that, and thaw at room temp before serving."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/1-bowl-apple-gingerbread-cake"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-02T17:33:20.166Z"
}
