{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "21",
    "ratingValue": "4.67"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-04T01:44:06.923Z",
  "datePublished": "2020-07-23T03:00:00+00:00",
  "description": "Incredibly delicious, 1-pot vegan green curry loaded with vegetables. Serve over rice or quinoa for the ultimate light comfort meal! Just 30 minutes required.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/05/1-Pot-Vegetable-Green-Curry-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/05/1-Pot-Vegetable-Green-Curry-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/05/1-Pot-Vegetable-Green-Curry-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/05/1-Pot-Vegetable-Green-Curry-SQUARE-480x270.jpg"
  ],
  "keywords": "green curry",
  "name": "1-Pot Vegetable Green Curry",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "206 kcal",
    "carbohydrateContent": "17.6 g",
    "fatContent": "14.6 g",
    "fiberContent": "3.2 g",
    "proteinContent": "2.8 g",
    "saturatedFatContent": "11.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "735 mg",
    "sugarContent": "9.6 g",
    "unsaturatedFatContent": "0.5 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entrée or Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup canned light coconut milk (reserve the rest of the can for adding to the curry later)",
    "5-6 Tbsp green curry paste",
    "2 cups chopped shiitake, cremini, or button mushrooms",
    "1 large red or yellow bell pepper, sliced and halved (bite-size slices)",
    "2 14-oz cans light coconut milk",
    "1 cup vegetable broth",
    "4-5 makrut lime leaves (optional)",
    "1 stalk lemongrass, halved (optional)",
    "1 cup bamboo shoots, rinsed and drained (or other sturdy vegetable of choice such as broccoli or cabbage)",
    "1-2 Tbsp coconut aminos (or sub salt or tamari to taste)",
    "1-2 Tbsp coconut sugar, palm sugar, or maple syrup",
    "1 handful fresh basil or mint",
    "1 cup snap peas, snow peas, or green peas",
    "White rice",
    "Protein of choice",
    "Fresh basil or mint",
    "Lime wedges",
    "Chili garlic sauce or sriracha"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat a large pot or Dutch oven over medium heat. Once hot, add 1/2 cup (120 ml) coconut milk (as original recipe is written) and reserve the rest of the can for later."
    },
    {
      "@type": "HowToStep",
      "text": "Cook until the coconut milk is bubbling and some of the liquid has evaporated and left more of the dense cream behind. This is a technique I learned from Hot Thai Kitchen to avoid using oil since the coconut milk releases its natural oil/cream content once cooked for a few minutes. Stir occasionally and turn down heat as needed to prevent burning."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add green curry paste and stir to combine with the coconut milk. Sauté for 2-3 minutes. Then add your mushrooms (if adding any animal protein or tempeh, do so now // if using tofu, I’d recommend cooking using this method and serving on the side of your curry for best texture). Adding your protein or mushrooms at this time allows them to infuse with the curry paste for richer flavor. Sauté for 3-4 minutes, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add your bell pepper and stir to coat. I like adding bell pepper at this time to soak up some of the curry paste flavor. Then add your remaining coconut milk (total cans used should be 2 as original recipe is written) and vegetable broth. Stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add makrut lime leaves and lemongrass (optional to infuse more flavor), as well as your bamboo shoots and stir. Then add coconut aminos and coconut sugar or palm sugar (starting with the lesser amounts and working your way up as needed) and stir to combine. Let the broth come to a simmer, then reduce heat to low and simmer for 10 minutes, or until the flavor of the broth has become more rich and your vegetables are fork tender."
    },
    {
      "@type": "HowToStep",
      "text": "OPTIONAL: For a deeper green hue, scoop out ~1 cup (240 ml) of your broth and blend in a small blender (that’s safe for blending hot liquids) with a handful of fresh basil or mint and/or 1-2 tsp of barley grass juice powder. This creates a deeper green color curry and infuses a bit of earthy, floral flavor. Stir this mixture into the pot at this time (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust your broth as needed at this time, adding more salt to taste, coconut aminos for depth of flavor, or coconut sugar for sweetness. You’re looking for a rich broth with a balance of sweet, spicy, and salty. Don’t be shy with seasonings as the potency of the broth will be diluted when served with grains."
    },
    {
      "@type": "HowToStep",
      "text": "In the final few minutes of cooking, add your peas and stir to combine. They only need a few minutes to cook. Then turn off heat."
    },
    {
      "@type": "HowToStep",
      "text": "Serve as is or over grain of choice or cauliflower rice. Add tofu if serving at this time. You could also top with fresh herbs, chili peppers, lime juice, or some roasted cashews at this time (something I enjoy for more protein and texture)."
    },
    {
      "@type": "HowToStep",
      "text": "Store cooled leftovers covered in the refrigerator up to 4-5 days, or in the freezer up to 1 month. Reheat on the stovetop over medium heat until hot."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/1-pot-vegetable-green-curry"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T01:44:06.922Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=D4WgbIVGl8k",
    "description": "Incredibly delicious, 1-pot vegan green curry loaded with vegetables. Serve over rice or quinoa for the ultimate light comfort meal! Just 30 minutes required.\n\nFull Recipe: https://minimalistbaker.com/1-pot-vegetable-green-curry/\n\nGreen curry is a popular Thai dish believed to have originated in the early 20th century. This recipe is our inspired (but not traditional) plant-based take on this flavorful Thai dish. \n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M4S",
    "embedUrl": "https://www.youtube.com/embed/D4WgbIVGl8k?feature=oembed",
    "name": "1-Pot Vegetable Green Curry | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/D4WgbIVGl8k/hqdefault.jpg",
    "uploadDate": "2020-07-31T08:00:03+00:00"
  }
}
