{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "66",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-04T13:45:18.361Z",
  "datePublished": "2017-07-15T05:00:25+00:00",
  "description": "Amazing, 3-ingredient plantain tortillas! A delicious and simple grain-free option for Mexican-inspired dishes and more. Entirely vegan and both gluten- and grain-free.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/06/Plantain-Tortillas-SQUARE.jpg"
  ],
  "keywords": "plantain tortillas",
  "name": "3-Ingredient Plantain Tortillas",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "54 kcal",
    "carbohydrateContent": "14.1 g",
    "fatContent": "0.1 g",
    "fiberContent": "0.9 g",
    "proteinContent": "0.5 g",
    "saturatedFatContent": "0.1 g",
    "servingSize": "1 tortillas",
    "sodiumContent": "189 mg",
    "sugarContent": "5.5 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 large green (unripe) plantains",
    "1 tsp sea salt",
    "~1/4 cup tapioca starch for rolling out (or sub gluten-free flour or arrowroot starch with varied results)",
    "coconut oil or avocado oil (for cooking)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Slice plantains into 4 sections, and then halve those sections lengthwise (top to bottom // see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Bring a pot of water to a boil and add plantains. Boil for 15 minutes to tenderize the plantains. Then drain and let cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Peel plantains and discard the peel. Then add the plantain and salt to a blender or a food processor. Blend until a ball forms (~30 seconds) - it will be sticky (this is normal)."
    },
    {
      "@type": "HowToStep",
      "text": "Dust a clean surface with tapioca and take small (~3 Tbsp) amounts of the dough and dust with tapioca. Dust a rolling pin with tapioca and roll out until almost paper thin (see photo). The dough is sticky so add more tapioca as needed. Repeat until all tortillas are formed (~10-12 as original recipe is written)."
    },
    {
      "@type": "HowToStep",
      "text": "Optional: you can use a knife or pizza cutter to make the edges a perfect circle, but this is optional!"
    },
    {
      "@type": "HowToStep",
      "text": "To cook, heat a large skillet over medium heat and lightly grease with coconut or avocado oil. Once hot, add one to two tortillas at a time (or however many fit comfortably in the pan) and cook until dried out and slightly browned on either side (~ 3 min per side). Continue until all tortillas are cooked (no need to continue adding more oil). See notes for baking instructions."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately as a vessel for things like Vegan Barbacoa, Quinoa Taco Meat, Guacamole, and more!"
    },
    {
      "@type": "HowToStep",
      "text": "Store cooled leftovers covered in the refrigerator up to 3-4 days (though best when fresh), or in the freezer up to 1 month. If frozen, thaw before use. Heat in a 350 degree F (176 C) oven, or on the stovetop."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/3-ingredient-plantain-tortillas"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-04T13:45:18.360Z"
}
