{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - makingbaking"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-26T10:43:05.000Z",
  "datePublished": "2022-08-03",
  "description": "Easy to remember sourdough recipe, I like this one because I can adjust the size of my loaf to the amount of starter I have, which means zero waste.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/a5fglnv1wjhpulxnxdws:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Bread",
  "name": "4 Ingredient Sourdough Bread Recipe | Woolworths",
  "prepTime": "PT1440M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Australian",
  "recipeId": "a0K2y0000016i1zEAA",
  "recipeIngredient": [
    "150g starter (1)",
    "300g water (2)",
    "450g flour (3)",
    "9g salt (2% of flour weight)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Weigh out your starter, flour, water and salt all into one big bowl."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Mix either by hand or by mixer, until the dough becomes nice and smooth and stretchy and elastic if you were to pick it up and tug on it. About 14 minutes in a stand mixer, or until it stops sticking to your hands if kneading by hand."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cover the bowl and let the dough rest for half an hour."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "After half an hour uncover the dough, wet your hands, and scoop it from underneath. Lift it as far as you can (it'll be stretchy!) and place it back down, folding onto itself. Twist the bowl a quarter turn and repeat, until it doesn't stretch out as much anymore. You can repeat this step as many or little times as you'd like over the next couple of hours, the more you do the fluffier and airy your bread will be."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Leave the dough to ferment for 4-5 hours during the day (warmer temperatures), or overnight (cooler temperatures). The sign that it is ready is when it has doubled in size and you will see some bubbles appear on the surface of the dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tip dough out onto bench in one piece, and divide if you are making more than one loaf. Be light and careful when handling the dough as you don't want to ruin the bubbles / \"structure\" inside the dough. Loosely make the dough into a square and pull the back third over the middle third. Then pull the bottom third over the middle section. Pull the sides out and stretch them over the centre, then tip the dough upside down. Cup the dough with your hands and move them in a circular motion until it resembles a circle. If I've lost you here - search bread shaping on YouTube and you'll get a better idea!"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Let the dough sit for half an hour, covered, then repeat the circular motion to make a neat ball."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the dough upside down into a bowl that is about the size of the dough, lined with a tea towel covered in flour. Cover the bowl (shower caps can be really handy for this!) and place it in the fridge for approximately 24 hours."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Once your dough has risen about another third, and is showing some bubbles on top, it's ready to bake!"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat your oven to 230 degrees Celsius along with a Dutch oven, or roasting dish that fits the dough, if you have one. This will trap the steam inside and gets it rising nicely! If you don't, place a shallow dish on the bottom with water in it, and that'll make some nice steam inside the oven that lets the same thing happen instead."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tip the loaf upside down onto some baking paper, so that the side that was against the bottom of the bowl is now on top. Move the loaf using the paper and place the loaf inside the Dutch oven or onto a baking tray, then cover with a lid (if using Dutch oven or roasting dish) and close the oven."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "After 20 minutes, uncover the lid or remove the dish of water. Bake for a further 15-25 minutes until it is your desired colour (darker crust = more crunch!)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove from oven and place on a wire rack to cool. Let cool completely before slicing into it."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Enjoy!"
    }
  ],
  "recipeNameId": "four-ingredient-sourdough-bread",
  "recipeYield": "1",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/four-ingredient-sourdough-bread"
  ],
  "totalTime": "PT1480M",
  "updatedAt": "2022-11-26T03:01:01.834Z",
  "url": "https://www.woolworths.com.au/shop/recipes/four-ingredient-sourdough-bread"
}
