{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "8",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT3M",
  "createdAt": "2022-12-05T20:38:19.008Z",
  "datePublished": "2017-10-31T03:00:48+00:00",
  "description": "Dark Chocolate Coconut Butter Cups made with just 5 ingredients, naturally sweetened, and SO satisfying. The perfect healthier plant-based dessert!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/10/Coconut-Butter-Cups-SQUARE.jpg"
  ],
  "keywords": "coconut butter cups",
  "name": "5-Ingredient Chocolate Coconut Butter Cups",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "341 kcal",
    "carbohydrateContent": "11.8 g",
    "fatContent": "35.4 g",
    "fiberContent": "6 g",
    "proteinContent": "3.2 g",
    "saturatedFatContent": "24.6 g",
    "servingSize": "1 coconut butter cup",
    "sodiumContent": "7 mg",
    "sugarContent": "3.6 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "~1 cup Coconut Butter",
    "Stevia or maple syrup (optional // to taste)",
    "1 1/4 cup finely chopped food-grade cocoa butter",
    "2 heaping Tbsp coconut oil (if avoiding oil, omit)",
    "2 Tbsp maple syrup",
    "1 cup cacao or unsweetened cocoa powder (I mixed half + half)",
    "1 pinch pinch sea salt (optional)",
    "1/2 tsp vanilla extract (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare coconut butter and set aside (see link in ingredients)."
    },
    {
      "@type": "HowToStep",
      "text": "Add 2 inches of water to a medium saucepan and bring to a rolling simmer over medium-high heat. Then reduce heat to medium and set a medium glass or ceramic mixing bowl on top, making sure it's not touching the water (this creates a \"double boiler\")."
    },
    {
      "@type": "HowToStep",
      "text": "To the mixing bowl, add finely chopped cocoa butter and coconut oil and let melt, stirring occasionally with a wooden spoon or whisk - about 2-3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once melted, carefully remove bowl from heat (turn off stove) and add maple syrup. First add cacao or cocoa powder to a sifter and sift over mixture. Then use a whisk or wooden spoon to mix until smooth and thoroughly combined. At this time, add optional sea salt and vanilla if desired."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed. I added about 2 Tbsp maple syrup total (amount as original recipe is written // alter if adjusting batch size), but it’s completely up to how sweet you prefer your chocolate."
    },
    {
      "@type": "HowToStep",
      "text": "Because the chocolate is quite thin at this point, set in the refrigerator to chill, slightly thicken, and make coating the cupcake wrappers easier - about 15-20 minutes total, removing to stir/whisk occasionally. You'll know it's ready when it's more like pourable hot fudge than melted coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Line a standard muffin tin with 10 (alter amount if adjusting batch size) paper cupcake liners and add 2 Tbsp (~30 g) of the chocolate to each. Use a spoon to gently push some of the chocolate up so it slightly coats the paper liners. Then set in the refrigerator or freezer to chill for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the chocolate is slightly firmer, add 1 1/2 Tbsp (~27 g) coconut butter to each. Then set back in the refrigerator or freezer to chill for 10 minutes or until the coconut butter is slightly hardened to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "Add remaining chocolate (~1 1/2 Tbsp each) on top of the coconut butter and use a spoon to ensure that the coconut butter is fully covered. Then set back in the refrigerator or freezer to chill for 10-15 minutes or until the cups are firm to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy straight from the refrigerator or freezer. Or let set out and thaw for 10-15 minutes and enjoy at room temperature for a softer coconut butter cup (my favorite)."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers in the refrigerator up to 2 weeks or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/5-ingredient-chocolate-coconut-butter-cups"
  ],
  "totalTime": "PT48M",
  "updatedAt": "2022-12-05T20:38:19.007Z"
}
