{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "30",
    "ratingValue": "4.54"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T07:16:13.122Z",
  "datePublished": "2014-04-15T05:00:26+00:00",
  "description": "7-ingredient smoky veggie sliders that are gluten-free, vegan, and perfectly tender and crumbly. Make the whole batch for a crowd, or par-bake half, freeze, and save them for later.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/03/7-Ingredient-Veggie-Sliders-SQUARE.jpg"
  ],
  "keywords": "veggie sliders",
  "name": "7-Ingredient Veggie Sliders",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "89 kcal",
    "carbohydrateContent": "9 g",
    "fatContent": "4.2 g",
    "fiberContent": "3 g",
    "proteinContent": "4.1 g",
    "servingSize": "1 patties",
    "sodiumContent": "190 mg",
    "sugarContent": "1.3 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 red onion (finely diced // 1/2 onion yields ~3/4 cup)",
    "6 button or baby bella mushrooms (diced // 6 mushrooms yield ~1 1/4 cups)",
    "1 pinch each salt and pepper",
    "1 15-ounce can kidney (or black) beans (well rinsed and drained)",
    "3/4 cup cooked quinoa",
    "1 Tbsp (yes, Tablespoon) chili powder (or sub cumin)",
    "~1/2 cup raw walnuts (crushed or ground into a loose meal // divided)",
    "1 shake vegan Worcestershire or A-1 sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium-low heat and add some nonstick spray or add a bit of olive oil. When hot, add the onion and slowly sauté, seasoning with a pinch each salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "When the onions are soft – about 5 minutes – turn up the heat to medium and add the mushrooms. Season with another pinch of salt and pepper and cook until the mushrooms and onions are slightly browned and fragrant – about 3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from heat and add beans and mash. You’re looking for a rough mash, not to turn it into a paste, so you can leave some whole or halved if you want. Taste and add another pinch of salt, or pepper if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to a mixing bowl, add the quinoa, chili powder or cumin and stir. Lastly, add the walnuts a little at a time until the mixture is thick and malleable enough to form into patties. Pop in the fridge for 10-15 minutes to cool and preheat your oven to 375 degrees F (190 C). Coat a baking sheet with nonstick spray or olive oil."
    },
    {
      "@type": "HowToStep",
      "text": "Once chilled, form into small patties. I love using a peanut butter jar lid lined with plastic wrap to get the perfect, mess-free shape (a tip I learned from Iowa Girl Eats). See photo."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange on the baking sheet and brush or spray the tops with olive oil and another pinch of black pepper and any leftover crushed walnuts (optional). Bake for a total of 40-45 minutes, flipping around the 20-minute mark. Cook longer to dry them out even more and achieve more crisp, but it’s not necessary. For a quicker option, form into thinner patties (1/4 inch) and brown in a saucepan over medium to medium-high heat lightly coated with olive oil. Cook until brown on both sides – 3-4 minutes on each side. However, this version doesn’t get them as well done in the middle."
    },
    {
      "@type": "HowToStep",
      "text": "Serve on small buns or atop mixed greens with desired toppings."
    },
    {
      "@type": "HowToStep",
      "text": "If you don’t want to cook the whole batch at once, form into 10 thicker patties (as original recipe is written), par-bake them at 375 for 15-20 minutes. Then cool and stack between layers of parchment paper and cover. Freeze for up to a few weeks. To cook, bake as instructed until desired texture/color is reached."
    },
    {
      "@type": "HowToStep",
      "text": "Makes ~10 medium baked patties or ~16 thin sautéed patties (as original recipe is written)"
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/7-ingredient-veggie-sliders"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-02T07:16:13.121Z"
}
