{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "34",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-05T18:02:31.791Z",
  "datePublished": "2014-05-13T09:00:13+00:00",
  "description": "Simple, savory 7-ingredient stuffed mushrooms topped with a black rice-walnut filling and vegan parmesan cheese!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/04/Stuffed-Mushrooms-SQUARE.jpg"
  ],
  "keywords": "vegan stuffed mushrooms",
  "name": "7-Ingredient Vegan Stuffed Mushrooms",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "66 kcal",
    "carbohydrateContent": "8.5 g",
    "fatContent": "4 g",
    "fiberContent": "0.8 g",
    "proteinContent": "2.2 g",
    "servingSize": "1 mushrooms",
    "sodiumContent": "72 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup black rice (or sub wild or brown rice)",
    "1 scant cup vegetable stock",
    "1 10-ounce package baby portobello or white button mushrooms*",
    "1/4 cup vegan parmesan cheese",
    "1/4 cup raw walnuts (crushed)",
    "1 1/2 tsp finely minced garlic",
    "1 1/2 Tbsp olive oil (plus more for drizzling/coating)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and rinse rice in a fine mesh strainer."
    },
    {
      "@type": "HowToStep",
      "text": "Bring veggie stock to a boil in a small saucepan, then add rice. Lower heat, cover and cook until liquid is completely absorbed – anywhere from 30-45 minutes. Taste to sample doneness – if you prefer a chewier, softer rice, cook longer. If you’re OK with more bite, check around the 25-minute mark."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, place walnuts on a baking sheet and toast in oven for 5 minutes. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Brush dirt from mushrooms using a damp towel and remove stems. Brush or spray with olive oil and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare parmesan cheese if needed. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once rice is done, fluff and then add vegan parmesan cheese, toasted walnuts, minced garlic and olive oil. Stir, taste and adjust seasonings as needed. I added just a pinch of salt and pepper and a little more vegan parmesan."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the mushrooms on a baking sheet WITHOUT the filling for 10 minutes to soften."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from oven and scoop generous spoonfuls of the filling into the par-baked mushrooms. (You will have a little leftover filling.) Top with additional vegan parmesan cheese and bake another additional 15-18 minutes or until tender and the parmesan is golden brown. (Baking the mushrooms on their own helps prevent the rice from getting too crisp.)"
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately. TIP: Dust your serving plate with vegan parmesan cheese so the bottom of the mushrooms have plenty of flavor, too."
    }
  ],
  "recipeYield": "14",
  "sameAs": [
    "https://minimalistbaker.com/7-ingredient-vegan-stuffed-mushrooms"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-05T18:02:31.789Z"
}
