{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "67",
    "ratingValue": "4.8"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-04T01:36:22.461Z",
  "datePublished": "2012-09-25T08:26:18+00:00",
  "description": "A simple, 7 Ingredient muesli bread studded with pumpkin seeds, almonds and raisins. Perfect for sandwiches, french toast, or toasted with butter and honey for breakfast.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2012/09/Simple-Muesli-Bread-by-Minimalist-Baker-google.jpeg"
  ],
  "keywords": "muesli bread",
  "name": "7-Ingredient Muesli Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "106 kcal",
    "carbohydrateContent": "19.4 g",
    "fatContent": "1.8 g",
    "fiberContent": "1 g",
    "proteinContent": "3.1 g",
    "servingSize": "1 slices",
    "sodiumContent": "1 mg",
    "sugarContent": "1.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Bread",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 1/2 cups warm water",
    "3 cups unbleached flour",
    "1/4 cup whole wheat flour",
    "1/2 Tbsp salt",
    "3/4 Tbsp fast-acting yeast (1 pack yields ~3/4 Tbsp)",
    "1/4 cup raisins",
    "1/4 cup raw pumpkin seeds",
    "1/4 cup raw almonds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine warm water (like bath water, or 110 degrees F / 43 C), yeast, salt and flours in a large mixing bowl and stir. The result will be a sticky, rough dough. If using a stand mixer, beat at medium speed for about a minute. Otherwise just use a spoon to stir until well combined."
    },
    {
      "@type": "HowToStep",
      "text": "Lift the dough out and lightly grease the bowl with nonstick spray or olive oil. Cover and let rise in the refrigerator for two hours. Alternatively, let rise for 2 hours at room temp and 2 hours in the fridge. I went straight for the fridge to save time."
    },
    {
      "@type": "HowToStep",
      "text": "While the dough is rising, soak the raisins by placing them in a small bowl and covering with water. Allow to soak for 20 minutes, then drain, pat dry, and set aside. This helps prevent the raisins from popping out of the bread or burning."
    },
    {
      "@type": "HowToStep",
      "text": "Once risen, lightly sprinkle the dough with flour and transfer to a floured work surface. Knead a few times and then add pumpkin seeds, almonds and raisins. Knead until just combined, trying to keep the add-ins on the inside of the loaf, or else they’ll get too crisp while baking."
    },
    {
      "@type": "HowToStep",
      "text": "Place on parchment-lined baking stone or lightly greased baking sheet. Sift a light coating of flour over the top; to help keep the dough moist. Let rest for 45-60 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 450 degrees F (232 C) while the dough rests. Place a metal or cast iron pan (not glass, Pyrex, or ceramic) on the lowest oven rack, and have 1 cup of hot water ready."
    },
    {
      "@type": "HowToStep",
      "text": "When ready to bake, slash the bread 2 or 3 times with a knife, making a cut about 1/2 -inch deep."
    },
    {
      "@type": "HowToStep",
      "text": "Place bread in oven and carefully pour hot water into the shallow pan on the rack beneath. Expect it to bubble and steam; then close oven door quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the bread for 25 to 35 minutes, or until deep, golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the bread from the oven and cool on a rack. Store leftovers in a plastic bag at room temp."
    }
  ],
  "recipeYield": "18",
  "sameAs": [
    "https://minimalistbaker.com/7-ingredient-muesli-bread"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-04T01:36:22.458Z"
}
