{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT8M",
  "createdAt": "2022-12-02T08:30:56.218Z",
  "datePublished": "2021-11-09T06:00:00+00:00",
  "description": "Go from cookie craving to cookie reality in less than 15 minutes with my Air Fryer Chocolate Chip Cookies! With crispy edges and soft and gooey insides this small batch recipe is perfect for when you&#039;re craving cookies but don&#039;t want to make a full batch. Gluten-free option included and it&#039;s as good as the gluten-filled version!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Air-Fryer-Chocolate-Chip-Cookies-A-Virtual-Vegan-2-2.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Air-Fryer-Chocolate-Chip-Cookies-A-Virtual-Vegan-2-2-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Air-Fryer-Chocolate-Chip-Cookies-A-Virtual-Vegan-2-2-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Air-Fryer-Chocolate-Chip-Cookies-A-Virtual-Vegan-2-2-480x270.jpg"
  ],
  "keywords": "air fryer, air fryer recipe, cookies, vegan chocolate chip cookies",
  "name": "Air Fryer Chocolate Chip Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "209 kcal",
    "carbohydrateContent": "28 g",
    "fatContent": "11 g",
    "fiberContent": "1 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "4 g",
    "servingSize": "1 cookie",
    "sodiumContent": "250 mg",
    "sugarContent": "18 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "5 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "3 tablespoons (41 grams) vegan butter (, slightly softened (not melted)",
    "2 tablespoons (25 grams) dark brown sugar",
    "2 tablespoons (25 grams) cane sugar (, or white sugar)",
    "1/4 teaspoon vanilla extract",
    "1/4 teaspoon fine sea salt",
    "6 tablespoons (47 grams) all purpose flour",
    "1/2 teaspoon baking powder",
    "1/8 teaspoon baking soda (, (bicarbonate of soda in the UK)",
    "1 tablespoon plant-based milk",
    "1/4 cup (45 grams) dairy-free chocolate chips or chunks (, or a combination of chips and chunks, plus a few extra for decoration)",
    "Flaky sea salt for sprinkling"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cut a piece of parchment paper to fit in the bottom of your air fryer basket. It needs to be a little smaller than the surface area and not go up the sides of the basket."
    },
    {
      "@type": "HowToStep",
      "text": "To a medium bowl add the butter, brown sugar, white sugar, vanilla and salt. Mix them together until well combined."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour, baking powder, baking soda and milk and stir gently to combine. Don't over-mix."
    },
    {
      "@type": "HowToStep",
      "text": "Once it's just combined, tip in the chocolate chips and fold them through."
    },
    {
      "@type": "HowToStep",
      "text": "Using an ice cream scoop or cookie scoop, scoop the cookie dough (about 3 tablespoons per cookie) onto the parchment paper in the air fryer basket leaving plenty of space around each one. If you don't have a scoop roll it into balls in your hands. My air fryer is a 5.8 quart one and 4 cookies fit perfectly. If your air fryer is smaller just scoop in as many as will fit and cook a 2nd batch after."
    },
    {
      "@type": "HowToStep",
      "text": "Leave the cookie dough heaped. Do not press it down. It will spread on its own. At this point I like to press a few extra chocolate chips/chunks gently into the tops to make them look pretty. A sprinkle of flaky sea salt is amazing too if you have it."
    },
    {
      "@type": "HowToStep",
      "text": "Slide the basket into the air fryer (do this really gently so the cookies don't slide forward as you close it) and cook on 350°F (175 °C) for about 8 minutes (10 minutes if using gluten-free flour). When done the cookies will be golden brown all over and the tops will look set. They will be more golden than cookies cooked in an oven. It's important to let that colour develop so the bottoms and middle cook properly."
    },
    {
      "@type": "HowToStep",
      "text": "Once they are cooked turn off the air fryer, remove the basket and give it a sharp, quite hard tap on a hard surface like a thick wooden cutting board, your wire rack or a cast iron stove top. This knocks any air out of the cookies and improves the texture. Especially important if you used gluten-free flour because they tend to be a little puffier."
    },
    {
      "@type": "HowToStep",
      "text": "Place the entire basket on a wire rack and leave the cookies to cool for at least 10 minutes before attempting to remove them from the basket so that they firm up. If you try to remove them before this they will be way too soft and fall apart (but taste amazing;O)"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://avirtualvegan.com/air-fryer-chocolate-chip-cookies"
  ],
  "totalTime": "PT13M",
  "updatedAt": "2022-12-02T08:30:56.216Z"
}
