{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-11-30T13:33:42.467Z",
  "datePublished": "2022-08-03",
  "description": "Brioches Suisses are indulgent breakfast pastries found everywhere in France - strips of light brioche filled with vanilla crème pâtissière and chocolate chips. We've given these Swiss brioches the Lyonnais dessert treatmen. ",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/chocol191allswi_036:Square-1300x1300"
  ],
  "keywords": "Brioche",
  "name": "All-chocolate Swiss Brioche Recipe | Woolworths",
  "prepTime": "PT60M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "French",
  "recipeId": "RGR9939",
  "recipeIngredient": [
    "3.33 tsp yeast",
    "315g plain flour",
    "340g strong bread flour",
    "85g caster sugar",
    "80g dark cocoa powder",
    "0.5 tsp sea salt",
    "6 eggs (save 1 egg to glaze)",
    "330g unsalted butter, diced, at room temperature",
    "170g good-quality dark chocolate chips",
    "8 eggs, 2 whole eggs, 6 egg yolks",
    "250g caster sugar",
    "1 tsp good-quality vanilla extract",
    "100g plain flour",
    "3.6 cup whole milk",
    "140g good-quality dark chocolate, 70% cocoa, chopped"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Dissolve the yeast in 120ml water at room temperature. If using dried yeast, follow the pack instructions. Place the flours, sugar, cocoa powder, salt, and 5 eggs in a food mixer. Start mixing on a low speed.Gradually add the dissolved yeast to the mixer bowl."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Leave the mixer running for 8-10 minutes to form a stiff dough, pausing halfway through to scrape the sides using a silicone spatula. Add the buttera little at a time and mix for 10 minutes. The dough will become stickier and paste-like."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Increase the speed to medium for 2 minutes. Scrape the mixture down the sides again and mix on a low speed for 10 minutes until the dough is soft, shiny,and elastic. Transfer the dough to a large greased bowl and loosely cover with cling film. Leave to prove in the fridge overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the crème pâtissière, whisk the eggs and egg yolks in a large bowl. Add The sugar, vanilla, and flour. Whisk vigorously for about 30 seconds until the mixture forms a ribbon when you lift the whisk out."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add half the milk to the mixture, a little at a time, whisking in between additions. Whisk until smooth. Transfer the mixture to a large saucepan, add the remaining milk, and place over a medium heat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Whisk the mixture constantly in a circular motion for 4-5 minutes until the mixture starts to steam. Whisk more vigorously, at a steady pace, to prevent the mixture from curdling. If the mixture begins to bubble or stick to the bottom of the pan, reduce the heat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Continue whisking the mixture until it reaches the consistency of thick custard. Reduce the heat and cook for a further 2 minutes, whisking constantly. Remove from the heat and stir the chocolate into the mixture,using a silicone spatula, until the mixture is fully combined and smooth.Leave for 5 minutes and stir again. Cover with cling film and leave to cool before refrigerating overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the dough from the fridge. While the dough is still cold, roll it out on a lightly floured surface into a 35 x 70cm rectangle,approximately 5mm thick. With one of the long edges facing you, spread thecrème pâtissière over the half of the dough closest to you. Sprinkle the chocolate chips evenly over the crème pâtissière."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Fold the uncovered half of the dough over the covered half, very slightly overlapping the side closest to you. Whisk the remaining egg with a little cold water and brush over the top of the folded dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cut the length of dough into fourteen 5cm pieces, and transfer them to 2 lined baking sheets. Leave about 1cm between the pieces. Brush the edges of each brioche with alittle of the whisked egg mixture and pinch to seal them. Loosely cover both baking sheets with cling film and leave to rest in a warm place for 1 1/2 -2 hours. Preheat the oven to 180oC."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bake the brioches for 25-35 minutes until risen and the edges start to darken in colour. The dough will be firm to touch."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the brioches from the oven and allow them to cool completely. The Brioches are best served fresh, but you can store them in an airtight container at room temperature for up to 3 days. You can freeze uncooked brooches for up to 1 month, and baked brioches for up to 2 weeks."
    }
  ],
  "recipeNameId": "all-chocolate-swiss-brioche",
  "recipeYield": "14",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/all-chocolate-swiss-brioche"
  ],
  "totalTime": "PT95M",
  "updatedAt": "2022-11-30T13:33:42.466Z",
  "url": "https://www.woolworths.com.au/shop/recipes/all-chocolate-swiss-brioche"
}
