{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-01T08:57:22.766Z",
  "datePublished": "2018-03-10T18:59:47+00:00",
  "description": "Almost Eggs Benedict is the easy and approachable version of the brunch classic, scaled back and scaled down to feed just two on a lazy weekend morning. ",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2018/03/Almost-Eggs-Benedict-H1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/03/Almost-Eggs-Benedict-H1-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/03/Almost-Eggs-Benedict-H1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/03/Almost-Eggs-Benedict-H1-480x270.jpg"
  ],
  "keywords": "Egg Recipes, hollandaise sauce",
  "name": "Almost Eggs Benedict",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "519.95 kcal",
    "carbohydrateContent": "24.3 g",
    "fatContent": "38.55 g",
    "fiberContent": "1.5 g",
    "proteinContent": "19.05 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1067.2 mg"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "French",
  "recipeIngredient": [
    "5 Tbsp butter, divided ($0.83)",
    "2 English muffins ($1.00)",
    "3 large eggs, divided ($0.83)",
    "2 thick slices ham ($0.83)",
    "1 Tbsp water ($0.00)",
    "1 lemon (or about 1/2 Tbsp juice)* ($0.37)",
    "pinch cayenne ($0.02)",
    "pinch salt and pepper ($0.03)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Separate the whites from the yolk of ONE egg. Add the yolk to a small sauce pot along with 1 Tbsp water and about 1/2 Tbsp lemon juice (I like my hollandaise quite lemony, if you don't, start with 1 tsp lemon juice). Whisk them together until smooth. The pot is not over heat at this point."
    },
    {
      "@type": "HowToStep",
      "text": "Cut 4 Tbsp butter into 1/2 Tbsp chunks, then place them in the sauce pot with the egg, water, and lemon juice. Finally, place the pot over LOW heat and whisk continuously, allowing the butter to slowly melt into the yolk as you whisk. It should take 2-3 minutes for the butter to melt."
    },
    {
      "@type": "HowToStep",
      "text": "When the butter is fully melted, continue to whisk continuously and vigorously. As the mixture continues to heat, the yolk will begin to cook and solidify, which will thicken the sauce into a light, velvety mixture. It should take about 3-5 minutes for the mixture to cook to the point where it is thickened and will first look frothy, then finally begin to thicken. Once thickened, remove it from the heat. Taste the sauce and season with a pinch of salt and cayenne pepper. If you prefer more lemon, it can be whisked in at this point. Place a lid on the pot and set it near the burner that will be used for the eggs and ham, but not over direct heat, to keep it slightly warm."
    },
    {
      "@type": "HowToStep",
      "text": "Add about 1 tsp butter to a large skillet and place it over medium heat. Allow the butter to melt, then tilt the skillet to coat the surface. Open the English muffins and place them cut sides down in the skillet. Cook them until browned, then flip an cook a couple minutes more on the other side (about 5 minutes total). Place the buttery toasted muffins on your plates."
    },
    {
      "@type": "HowToStep",
      "text": "Wipe out the skillet to remove any cornmeal from the muffins, then add another teaspoon of butter. Once melted, add the ham slices to the skillet and cook until browned on both sides (another 3-5 minutes). If your ham slices are large like mine were, cut them in half to better fit the English muffins. Once browned, place the ham pieces on the toasted English muffins."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the heat down to medium-low, add another teaspoon of butter to the skillet and cook two of the eggs until the whites are set, but the yolks are still runny. I find using a slightly lower heat helps give the whites time to heat through and cook before cooking the yolk. Top the muffins and ham with the eggs."
    },
    {
      "@type": "HowToStep",
      "text": "Finally, drizzle the prepared hollandaise sauce over the eggs and ham on the English muffins, and enjoy."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://budgetbytes.com/almost-eggs-benedict"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-01T08:57:22.764Z"
}
