{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "4.41"
  },
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T16:07:12.003Z",
  "datePublished": "2014-06-20T01:00:52+00:00",
  "description": "This recipe makes 12 standard-sized muffins. You can easily cut in in half, but do know that leftover muffins freeze well, so you can set them aside for future weekends if you'd like.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2014/06/img_3932-300x200-1.jpg"
  ],
  "name": "almond-pulp muffins with cherries and chia",
  "prepTime": "PT20M",
  "recipeIngredient": [
    "1 cup pitted and halved cherries (about 20 cherries)",
    "1/4 cup unsalted butter (melted and slightly cooled)",
    "1 cup packed almond pulp leftover from one batch of almond milk",
    "2 eggs",
    "a scant 1/2 cup honey",
    "1 tsp vanilla extract",
    "3/4 cup plain yoghurt",
    "1 Tbsp chia seeds",
    "1 1/2 cups whole wheat pastry flour",
    "2 tsp baking powder",
    "1/2 tsp baking soda",
    "1/2 tsp salt",
    "1/4 cup slivered almonds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat your oven to 180oC / 350oF. Line 12 standard muffin cups with muffin liners or squares of parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Start by pitting the cherries. This can be messy business so keep a cleanup towel handy and don't wear white! There are many cherry pitting methods (maybe you even have a cherry pitter?) but what I usually do is slice them around the middle with a sharp knife, twist to separate the two halves, and pick the pit out with my fingers. Place the cherry halves in a measuring cup and stop when you get to one heaping cup."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium sized bowl, whisk together melted butter, almond pulp, eggs, honey, vanilla, yoghurt, and chia seeds. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a smaller bowl, whisk together whole wheat pastry flour, baking powder, baking soda, and salt. Stir the dry mixture into the wet, careful to not over mix - it should still be a touch lumpy."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the cherry halves into the batter, and spoon into the prepared muffin tins."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the tops with slivered almonds."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 18-20 minutes, until muffins are puffed and golden and toothpick inserted towards the center comes out clean."
    },
    {
      "@type": "HowToStep",
      "text": "Let cool in the muffin tins for about 5 minutes, then transfer to a wire rack."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://heynutritionlady.com/almond-pulp-muffins-with-cherries-and-chia"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T16:07:12.001Z"
}
