{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT5400S",
  "createdAt": "2022-12-04T02:19:39.312Z",
  "creator": {
    "@type": "Person",
    "name": "Lisa Ludwinski"
  },
  "dateCreated": "2019-11-19T11:15:16-05:00",
  "dateModified": "2020-01-21T22:26:07-05:00",
  "datePublished": "2019-11-19T11:15:16-05:00",
  "headline": "Apple Sage Gouda Pie",
  "HowtoTip": {
    "text": "Make ahead: You can keep the pie dough unrolled in the fridge for a few days or in the freezer for up to 1 year. If frozen, remove the dough and place in the refrigerator to thaw one full day before you intend to use it.Storage: Store leftover pie, well wrapped in plastic wrap or under a pie dome, at room temperature for up to 2 days.Reprinted with permission from Sister Pie, copyright © 2018. Published by Lorena Jones Books, an imprint of Penguin Random House."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FEdit%2F2019-11-Cookbook-Club-Sister-Pie%2Fapple_sage_gouda"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FEdit%2F2019-11-Cookbook-Club-Sister-Pie%2Fapple_sage_gouda"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FEdit%2F2019-11-Cookbook-Club-Sister-Pie%2Fapple_sage_gouda"
    }
  ],
  "keywords": [
    "autumn",
    "cheese",
    "Cookbook Recipe",
    "dessert",
    "fruit",
    "Kitchn Cookbook Club",
    "pie",
    "recipe",
    "Sister Pie Cookbook Club",
    "sweets",
    "thanksgiving",
    "winter",
    "team:news",
    "purpose:commerce",
    "purpose:facebook",
    "purpose:flipboard",
    "purpose:instagram",
    "purpose:pinterest",
    "platform:social",
    "businessconversion:affiliate",
    "course:dessert",
    "dishtype:sweets",
    "dishtype:pie",
    "dishtype:baked good",
    "cuisine:united states"
  ],
  "name": "Apple Sage Gouda Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "552 cal",
    "carbohydrateContent": "75.9 g",
    "cholesterolContent": "0 mg",
    "fatContent": "25.5 g",
    "fiberContent": "4.7 g",
    "proteinContent": "6.5 g",
    "saturatedFatContent": "15.6 g",
    "servingSize": "Serves 8",
    "sodiumContent": "340.6 mg",
    "sugarContent": "37.6 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT1800S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dessert",
  "recipeCuisine": "United states",
  "recipeIngredient": [
    "2 tablespoons apple cider vinegar",
    "2 1/2 cups all-purpose flour",
    "1 teaspoon granulated sugar",
    "1 teaspoon kosher salt",
    "2 sticks (16 tablespoons) cold unsalted European-style butter",
    "1 ounce aged Gouda cheese, grated",
    "2 pounds Northern Spy, Idared, or Golden Delicious apples, peeled and sliced",
    "1 teaspoon freshly squeezed lemon juice",
    "3/4 cup granulated sugar",
    "2 tablespoons minced fresh sage leaves",
    "1/4 cup packed light brown sugar",
    "1/4 cup tapioca starch",
    "1/4 teaspoon ground cinnamon",
    "1/2 teaspoon ground nutmeg",
    "1/4 teaspoon kosher salt",
    "1 large egg, beaten"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make a water-vinegar mixture: Fill a 1-cup liquid measuring cup with about 1 inch of water and freeze until completely frozen. Add the apple cider vinegar and top with water to get to 1 cup. The ice-cold water-vinegar mixture should look just like apple juice."
    },
    {
      "@type": "HowToStep",
      "text": "In a large stainless steel bowl, combine the flour, sugar, and salt and stir to mix well. Place the sticks of butter in the bowl and coat on all sides with flour. Using a bench scraper, cut the butter into 1/2-inch cubes. Work quickly to separate the cubes with your hands until they are all lightly coated in the flour mixture. Grab that bench scraper once again and cut each cube in half. I always tell my pie dough students that it’s unnecessary to actually cut each cube perfectly in half, but it’s a good idea to break up the butter enough so that you can be super-efficient when it’s pastry blender time."
    },
    {
      "@type": "HowToStep",
      "text": "It’s pastry blender time! Switch to the pastry blender and begin to cut in the butter with one hand while turning the bowl with the other. It’s important not to aim for the same spot at the bottom of the bowl with each stroke of the pastry blender, but to actually slice through butter every time to maximize efficiency. When the pastry blender clogs up, carefully clean it out with your fingers (watch out, it bites!) or a butter knife and use your hands to toss the ingredients a bit. Continue to blend and turn until the largest pieces are the size and shape of peas and the rest of it feels and looks freakishly similar to canned Parmesan cheese. Speaking of cheese, now is the time to add the Gouda and mix it in quickly with the pastry blender until it is evenly distributed."
    },
    {
      "@type": "HowToStep",
      "text": "At this point, add 1/2 cup of the water-vinegar mixture all at once, and switch back to the bench scraper. Scrape as much of the mixture as you can from one side of the bowl to the other, until you can’t see visible pools of liquid anymore. Now it’s hand time. Scoop up as much of the mixture as you can, and use the tips of your fingers (and a whole lot of pressure) to press it back down onto the rest of the ingredients. Rotate the bowl a quarter-turn and repeat. Scoop, press, and turn. With each fold, your intention is to be quickly forming the mixture into one cohesive mass. Remember to incorporate any dry, floury bits that have congregated at the bottom of the bowl, and once those are completely gone and the dough is formed, it’s time to stop."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the dough from the bowl, place it on a lightly floured counter, and use your bench scraper to divide it into two equal pieces. Gently pat one into a 2-inch-thick disc, working quickly to seal any broken edges before wrapping it tightly in a double layer of plastic wrap. Pat the other half into a 6 by 3-inch rectangle for the lattice. Refrigerate the dough for at least 2 hours or, ideally, overnight. When you go to roll out the crust, you want the disc to feel as hard and cold as the butter did when you removed it from the fridge to make the dough. This will make the roll-out way easier."
    },
    {
      "@type": "HowToStep",
      "text": "To roll out pie crust, lightly flour your work surface and place the unwrapped pie disc in the center. Using a rolling pin, begin by banging the dough from the left to the right, striking the dough about four times. Rotate the dough 180 degrees and bang across the dough from left to right once more."
    },
    {
      "@type": "HowToStep",
      "text": "Use one tapered end of the rolling pin to press and roll along the edge of the round one single time, enlarging the circle. After each press of the edge, rotate the disc 45 degrees clockwise. If you sense that the dough is sticking to the surface, lift it up and lightly flour the surface below it."
    },
    {
      "@type": "HowToStep",
      "text": "To begin the final step, place the rolling pin in the very center of the dough. Apply pressure to the pin while rolling it away from yourself (stand on your tiptoes to get maximum leverage if necessary), being careful to stop rolling about 1 inch away from the edge (to avoid over-rolling the areas you’ve already rolled). Rotate the disc 45 degrees and roll again. If it becomes difficult to rotate the dough, lift it up and lightly flour the surface beneath it. If the top surface of the dough starts to feel sticky, flip it over onto the floured counter and roll on the other side. Continue this roll and rotation process until you have a circle 12 to 13 inches in diameter. Gently run your rolling pin over the entirety of the dough to make sure the final size is an even thickness."
    },
    {
      "@type": "HowToStep",
      "text": "Invert your pie tin or dish onto the circle. Using a pastry cutter or knife, and the pie tin as a guide, cut a circle around the tin that is 2 1/2 to 3 inches larger than the edge of the tin. Gather up the dough scraps, wrap in plastic wrap, and store in the fridge to be added to other scraps and rerolled for another use. Remove the pie tin and turn it right side up on the work surface. Fold the dough circle in half. Place the folded dough in the pie tin so that it covers one-half of the pan. Unfold the other half, and gently press the dough to fit it snugly into the tin, making sure it is completely centered and pressed all the way into the bottom of the tin."
    },
    {
      "@type": "HowToStep",
      "text": "Line a baking sheet with parchment paper. Lightly flour your work surface and place the unwrapped pie rectangle in the center. Using a rolling pin, bang the dough from the left to the right. Now roll out the dough to flatten it into a slightly larger rectangle. Fold up the rectangle in thirds, like a letter. Turn the dough over back onto the floured surface and repeat the banging from side to side. Place the rolling pin in the very center of the dough and apply pressure to the pin while rolling it away from yourself (stand on your tiptoes to get maximum leverage if necessary), from the center to the far edge. Rotate the square 180 degrees and roll again. Flour the surface and flip the dough as needed to prevent sticking. Repeat this process until you have a rectangle that is approximately 13 by 12 inches. Use a ruler and the pastry cutter to trim the very edges of the rectangle. Then, using the ruler as your guide, cut at least 6 strips of dough, each about 2 inches wide. Place the strips on the baking sheet, wrap in plastic, and transfer to the fridge until you’re ready to assemble the pie. Gather up any dough scraps to be added to other scraps and rerolled for another use, wrap in plastic wrap, and refrigerate for up to 3 days."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the apples to a large mixing bowl and toss with the lemon juice."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, combine the granulated sugar and sage, massaging together with your fingertips. Add the brown sugar, tapioca starch, cinnamon, nutmeg, and salt. Add to the apples and toss with your hands until evenly distributed."
    },
    {
      "@type": "HowToStep",
      "text": "When you’re ready to assemble the pie, remove the unbaked crust and lattice strips from the refrigerator. Sprinkle the sugar-flour mixture all over the bottom of the crust. Layer the apples on top, being careful not to mound them in the center. Dot the apples with butter cubes."
    },
    {
      "@type": "HowToStep",
      "text": "Place one strip of lattice across the center of the pie. Take another strip and lay it on top, perpendicular to the first one, creating a cross. Lay the next two strips on either side of the first strip you laid down, so they are parallel to both each other and the original strip. Next, working with the original strip, fold back both ends toward the center, and then place the last two lattice strips down on either side of the second (perpendicular) strip. Fold the original strip back down, so that it lies across and on top of the newly placed strips. It should look like a woven lattice."
    },
    {
      "@type": "HowToStep",
      "text": "Tear off the ends of the lattice pieces so they are flush with the perimeter of the tin. Roll the edge of the crust in, sealing the lattice. To create a crimped edge, Use the thumb and index finger of one hand to form a “C,” and position that hand in the very center of the pie pan. Position your opposite thumb on the outside of the pan. Use the “C” fingers to push and press the rim of the dough up and away from the pan, simultaneously pressing the thumb of your other hand into the “C” to make a crimp. Continue until the entire ring of dough is crimped. If you’re right handed, you’ll move clockwise; if you’re left-handed, counterclockwise. At this point, put the crust in the freezer for at least 15 minutes. If you don’t plan to use the crust that same day, wrap it tightly in plastic wrap and store it in the freezer for up to 1 year. Put the assembled pie in the freezer for a 15-minute rest."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat your oven to 450°F. Line a baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pie from the freezer, place on the baking sheet, and brush the lattice and crimped edge with the beaten egg. Transfer the baking sheet with the pie on it to the oven and bake for 15 to 20 minutes, or until the crust is evenly golden brown. Turn the temperature down to 325°F and continue to bake for 50 to 70 minutes more, until the pie juices are bubbling in the center."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the baking sheet from the oven and transfer the pie to a wire rack to cool for 4 to 6 hours. When the pie is at room temperature, slice it into 6 to 8 pieces and serve."
    }
  ],
  "recipeYield": 8,
  "sameAs": [
    "https://thekitchn.com/apple-sage-gouda-pie-22958515"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FEdit%2F2019-11-Cookbook-Club-Sister-Pie%2Fapple_sage_gouda",
  "totalTime": "PT7200S",
  "updatedAt": "2022-12-04T02:19:39.310Z",
  "url": "https://www.thekitchn.com/apple-sage-gouda-pie-22958515"
}
