{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T23:43:26.260Z",
  "datePublished": "2021-02-03T03:00:00+00:00",
  "description": "All of the flavors of autumn packed into vegan, gluten-free cheesecake bars! Apple butter is swirled with a coconut cashew filling and baked over an almond-oat crust. Naturally sweetened and just 10 wholesome ingredients required!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/12/Apple-Butter-Cheeecake-Bars-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/12/Apple-Butter-Cheeecake-Bars-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/12/Apple-Butter-Cheeecake-Bars-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/12/Apple-Butter-Cheeecake-Bars-SQUARE-480x270.jpg"
  ],
  "keywords": "cheesecake bars, vegan cheesecake",
  "name": "Apple Butter Cheesecake Bars (Vegan/GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "212 kcal",
    "carbohydrateContent": "19 g",
    "fatContent": "14.2 g",
    "fiberContent": "2.5 g",
    "proteinContent": "3.9 g",
    "saturatedFatContent": "6.8 g",
    "servingSize": "1 bar",
    "sodiumContent": "7 mg",
    "sugarContent": "8.6 g",
    "unsaturatedFatContent": "6.15 g"
  },
  "prepTime": "PT420M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 cup apple butter",
    "1 heaping cup rolled oats (ensure gluten-free for GF eaters)",
    "1 heaping cup raw almonds",
    "1/4 tsp sea salt",
    "2 Tbsp maple syrup",
    "4-5 Tbsp coconut oil (melted)",
    "1 cup raw cashews",
    "1 cup coconut cream*",
    "1 1/2 Tbsp arrowroot or cornstarch",
    "2 tsp lemon zest (~1 lemon zested, as original recipe is written)",
    "3 Tbsp lemon juice (~1 large lemon juiced, as original recipe is written)",
    "1 pinch sea salt",
    "1/4 cup maple syrup (plus more to taste)",
    "1/2 tsp ground cinnamon (optional)",
    "2 Tbsp rolled oats (ensure gluten-free for GF eaters)",
    "3 Tbsp almond flour",
    "1 healthy pinch ground cinnamon",
    "1/2 tsp coconut oil (melted) or avocado oil",
    "2-3 tsp maple syrup"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven’t prepared your apple butter yet, do so at this time and allow it to fully cool (not included in prep time). Alternatively, use store-bought to save time."
    },
    {
      "@type": "HowToStep",
      "text": "Add raw cashews (for filling) to a glass measuring cup or mixing bowl and cover with boiling hot water. Let rest for 30 minutes (or up to 1 hour ) uncovered. Then drain thoroughly."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, preheat oven to 350 degrees F (176 C) and line an 8x8 inch baking dish with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Add oats, almonds, and sea salt to a high-speed blender and mix on high until a fine meal is achieved."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a medium mixing bowl and add maple syrup and melted coconut oil, starting with the lesser end of the range (4 Tbsp or 60 g as original recipe is written // adjust if altering batch size) and adding more if it's too dry. Stir with a spoon to combine until a loose dough is formed. You should be able to squeeze the mixture between two fingers and form a dough instead of it crumbling. If too dry, add a bit more melted coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to parchment-lined baking pan and spread evenly. Then place parchment paper on top and use a flat-bottomed object, such as a drinking glass, to press down firmly until it’s evenly distributed and well packed."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 15 minutes, then increase heat to 375 F (190 C) and bake for 4-6 minutes more, or until the edges are golden brown and there is some browning on the surface. Remove from oven to cool slightly, then reduce oven heat to 350 degrees F (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Once cashews are soaked and drained, add to a high-speed blender with coconut cream, arrowroot starch, lemon zest, lemon juice, sea salt, maple syrup, and cinnamon (optional). Blend on high until very creamy and smooth, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed. I added a bit more lemon zest for tanginess, or you can add maple syrup for sweetness. It should be a balanced flavor — both lemony and sweet. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To the crust, add a few spoonfuls of your apple butter and spread into a thin layer (it won’t cover it entirely or evenly — that’s okay). Then pour all of the cheesecake filling on top and spread into an even layer. Tap on the counter to remove any air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining apple butter in small spoonfuls (~1 Tbsp amounts) and use a toothpick or knife to create a swirled effect."
    },
    {
      "@type": "HowToStep",
      "text": "OPTIONAL CRUMBLE: To a small bowl add oats, almond flour, salt, cinnamon, coconut oil, and maple syrup and mix to combine until a loose crumble forms. If too wet, add more almond flour. If too dry, add more maple syrup. Sprinkle the crumble evenly over the cheesecake."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 20-25 minutes or until the edges look very slightly dry and the center appears “jiggly” but not liquidy. It will be a little golden brown on top (especially around the edges) but only slightly. Resist the temptation to overbake."
    },
    {
      "@type": "HowToStep",
      "text": "Let rest for 10 minutes, then loosely cover with parchment paper and transfer to the refrigerator to chill for at least 6-8 hours or until totally set (preferably overnight)."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, gently lift out of the baking dish and slice into even bars (as the recipe is written, ~16). Store leftovers in the refrigerator (covered) for up to 4 days, or in the freezer for up to 1 month, though best within the first 2 days."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://minimalistbaker.com/apple-butter-cheesecake-bars-vegan-gf"
  ],
  "totalTime": "PT465M",
  "updatedAt": "2022-12-02T23:43:26.254Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=37BF5f5bZ4s",
    "description": "All of the flavors of autumn packed into vegan, gluten-free cheesecake bars! Apple butter is swirled with a coconut cashew filling and baked over an almond-oat crust. Naturally sweetened and just 10 wholesome ingredients required!\n\nFull Recipe: https://minimalistbaker.com/apple-butter-cheesecake-bars-vegan-gf/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT57S",
    "embedUrl": "https://www.youtube.com/embed/37BF5f5bZ4s?feature=oembed",
    "name": "Apple Butter Cheesecake Bars (Vegan/GF) | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/37BF5f5bZ4s/hqdefault.jpg",
    "uploadDate": "2021-02-03T09:00:04+00:00"
  }
}
