{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - dan_barra"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-09-26",
  "description": "This recipe comes with a warning... this cake is extremely addictive!!",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/rj2ykf2as2h4cjrlbnl2:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Cake",
  "name": "Baked Caramilk and Oreo Cheesecake Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "a0K0I00000SGIYUUA5",
  "recipeIngredient": [
    "250g Oreo's",
    "500g Philadelphia caramilk cream cheese",
    "3 eggs",
    "200g unsalted butter",
    "1.5 cup caster sugar",
    "1 fresh vanilla pod",
    "125g sour cream",
    "2 tbs plain flour",
    "2 tbs caramel sauce (for presentation)",
    "100g chocolate (for presentation)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/qjbuaxllfv14atr0sejn?$foodhub-method-images$&fmt=png-alpha",
      "text": "Start by preheating your oven to 140 degrees (fan forced) and coating a 20cm spring-form cake tin with a generous amount of butter. You can also line the cake tin with baking paper but this isn't essential.If you're like me you will also want to take a killer photo of your ingredients all lined up and looking pretty."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "In a food processor blend all of the Oreo's for a solid two minutes until they form a fine crumble for your base. Follow this up by melting the butter in a microwave and adding it to the crumbled Oreo mix. Blitz for another minute or two. You should end up with a grainy mixture similar to wet sand."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Empty the Oreo mixture into your cake tin and press the base out as thin as possible. You can use something with a flat base and a vertical side, like a drinking glass, to help flatten and shape the base out. You will want to use enough pressure to compact the mixture forming that delicious even base. Set this aside in the refrigerator to cool for about 30 mins."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Using a hand mixer beat the caramilk cream cheese until it's nice and smooth. About a minute on a medium to high speed should do the trick."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add the flour to the cream cheese batter and beat on a medium speed until just combined, no more than 30 seconds."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add the vanilla beans fresh from the pod to the cheese batter, along with the sour cream and sugar. Beat the mixture again until just combined, again 30 seconds should do the trick.Hint: 2tsp of vanilla essence will do the trick if you don't want to use fresh vanilla."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add the eggs to the cheese batter one at a time, beating in between each egg for 10 to 20 seconds at a low speed. It's important we don't over beat the cheese mix or use too high a setting on your mixer. We want to avoid introducing too much air into the mixture which will leave you with a sad, deflated cake when it comes out of the oven."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Pour the cheese batter into the Oreo crust prepared earlier.1"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bake in the oven for 55 minutes. The cake should jiggle just slightly when cooked and have a light golden color to it. (Check out the picture for my sausage dog giving his tick of approval!)"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Turn the oven off and allow the cheese cake to slowly come to room temperature in the oven with the door open. This will allow the cooling process to take place over a longer period of time ensuring your cake doesn't go flat or crack on the top. After 30 mins - 1 hour place the cake into the fridge still in the cake tin and allow to cool overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/qqfeekymgn2b8lqrmtkf?$foodhub-method-images$&fmt=png-alpha",
      "text": "To dress, drizzle some caramel sauce over the top of the cake and shave some chocolate on top. Enjoy!"
    }
  ],
  "recipeNameId": "baked-caramilk-and-oreo-cheesecake",
  "recipeYield": "10",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/baked-caramilk-and-oreo-cheesecake"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-11-24T18:07:51.649Z",
  "url": "https://www.woolworths.com.au/shop/recipes/baked-caramilk-and-oreo-cheesecake"
}
