{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "64",
    "ratingValue": "4.94"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-04T09:03:58.776Z",
  "datePublished": "2018-03-12T03:00:05+00:00",
  "description": "An easy, healthy take on falafel with wholesome black beans, quinoa, pumpkin seeds, and garlic. Baked instead of fried, smoky flavor, and entirely vegan and gluten-free!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/02/Black-Bean-Falafel-SQUARE.jpg"
  ],
  "keywords": "black bean falafel",
  "name": "Baked Quinoa Black Bean Falafel",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "60 kcal",
    "carbohydrateContent": "9.9 g",
    "fatContent": "1.1 g",
    "fiberContent": "1.8 g",
    "proteinContent": "2.9 g",
    "saturatedFatContent": "0.2 g",
    "servingSize": "1 Falafel",
    "sodiumContent": "85 mg",
    "sugarContent": "0.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup cooked and cooled quinoa (make sure it's cooked and completely cooled before using)",
    "1 15-ounce can black beans (rinsed, drained, dried)",
    "1/4 cup pumpkin seeds (raw or roasted)",
    "5 cloves garlic (skin removed and crushed)",
    "1/2 tsp sea salt, plus more to taste",
    "1 tsp ground cumin",
    "1/2 tsp ground coriander",
    "2 Tbsp tomato paste",
    "2 Tbsp coconut aminos",
    "1 chipotle pepper in adobo sauce (omit for less spicy falafel)",
    "1 tsp nutritional yeast ( (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven’t prepared your quinoa yet, do so now (make sure it’s cooked and cooled completely before use)."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C). Add rinsed, dried black beans to a parchment-lined baking sheet. Bake for 15 minutes or until beans appear cracked and feel dry to the touch (see beans in food processor photo). Remove beans from the oven and then increase oven heat to 375 degrees F (190C)."
    },
    {
      "@type": "HowToStep",
      "text": "Add black beans to a food processor along with pumpkin seeds and garlic (see photo) and pulse into a loose meal. Then add cooked/cooled quinoa, salt, cumin, coriander, tomato paste, coconut aminos, chipotle pepper in adobo, and nutritional yeast (optional). Blend to combine until a textured dough forms (you're not looking for a purée)."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more coconut aminos for saltiness/depth of flavor, adobo sauce for heat, cumin for smokiness, or salt for overall flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop out 1 1/2 Tbsp amounts (using this scoop or a Tablespoon) and gently form into small discs using your hands. Add formed falafel to a parchment-lined baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 15 minutes. Then flip to ensure even baking and bake for 10-15 minutes more or until golden brown and crispy on the edges."
    },
    {
      "@type": "HowToStep",
      "text": "These falafel are delicious with hummus, garlic dill sauce, baba ganoush, or tahini sauce. Try garnishing with chili garlic sauce for extra heat. Serve over greens or in pita, or enjoy as is!"
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers covered in the refrigerator up to 3-4 days. To freeze, either freeze once baked and cooled OR before baking. Then add to a freezer-safe container and freeze up to 1 month. Reheat in a 375 degree F (190 C) oven until warmed through."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/baked-quinoa-black-bean-falafel"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-04T09:03:58.774Z"
}
