{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths  ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-22T03:42:08.000Z",
  "datePublished": "2022-08-03",
  "description": "With its frangipane topping and buttery pastry case, this version of the English tea-time classic can even be served warm with cream as a dessert.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/stebak290baktar_035:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Tart",
  "name": "Bakewell Tart Recipe | Woolworths",
  "prepTime": "PT60M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "French",
  "recipeId": "RGR11836",
  "recipeIngredient": [
    "150g plain flour, sifted (save 10g for dusting)",
    "100g unsalted butter, chilled and diced",
    "50g caster sugar",
    "0.5 lemon, finely grated zest",
    "1 egg yolk",
    "0.5 tsp vanilla extract",
    "125g unsalted butter, softened",
    "125g caster sugar",
    "3 large eggs",
    "0.5 tsp almond extract",
    "125g ground almonds",
    "150g goodquality raspberry jam",
    "25g flaked almonds",
    "2 tsp icing sugar (to serve)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Rub together the flour and butter with your fingers, or pulseblend in a food processor, to form fine crumbs. Stir in the sugar and lemon zest. Beat the egg yolk with the vanilla extract and mix into the crumbs, bringing the mixture together to form a soft dough; add a little water to bring it together, if needed. Wrap the dough in cling film and chill for 1 hour."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 180°C. Roll the dough out on a floured surface to a thickness of about 3 mm. It will be quite fragile, so if it begins to crumble, bring it together with your hands and give it a gentle knead to get rid of any joins. Use it to line the tin, leaving an overlapping edge of at least 2cm. Prick the base all over with a fork. Line the pastry case with parchment and top with the baking beans."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the case on a baking sheet and blind bake it for 20 minutes. Remove the beans and the paper, and return it to the oven for another 5 minutes, if the centre still looks a little uncooked."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the filling, cream together the butter and sugar until pale and fluffy. Beat in the eggs and almond extract until well combined. Fold in the ground almonds to form a thick paste."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spread the jam over the base of the cooked tart case. Tip the frangipane over the jam layer and use a palette knife to spread it out evenly. Scatter the flaked almonds over the top."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bake in the centre of the oven for 40 minutes until golden brown. Remove from the oven and allow it to cool for 5 minutes. Then take a small, sharp knife and use it to trim the excess pastry from the edges of the tart. Allow the tart to cool before dusting with icing sugar to serve."
    }
  ],
  "recipeNameId": "bakewell-tart",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/bakewell-tart"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-11-21T23:11:02.149Z",
  "url": "https://www.woolworths.com.au/shop/recipes/bakewell-tart"
}
