{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T02:17:17.542Z",
  "datePublished": "2013-03-28T20:28:00+00:00",
  "description": "All of the flavor of your favorite Vietnamese sandwich in an easy to eat bowl. ",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2013/03/BanhMiBowlabove.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/03/BanhMiBowlabove-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/03/BanhMiBowlabove-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/03/BanhMiBowlabove-480x270.jpg"
  ],
  "name": "Bánh Mì Bowls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "511.33 kcal",
    "carbohydrateContent": "66.1 g",
    "fatContent": "17.5 g",
    "fiberContent": "2.65 g",
    "proteinContent": "20.18 g",
    "servingSize": "1 Serving",
    "sodiumContent": "392.4 mg"
  },
  "prepTime": "PT30M",
  "recipeIngredient": [
    "2 carrots ($0.27)",
    "1 onion ($0.32)",
    "1/2 cup rice vinegar ($0.25)",
    "1/4 cup white sugar ($0.08)",
    "1/2 tsp salt ($0.03)",
    "1/2 cup water ($0.00)",
    "1 lb ground pork ($3.47)",
    "1 large egg ($0.25)",
    "1/2 cup plain breadcrumbs ($0.17)",
    "2 cloves garlic, minced ($0.16)",
    "2 inches fresh ginger, grated ($0.34)",
    "1/2 Tbsp soy sauce ($0.06)",
    "2 green onions ($0.17)",
    "6 cups cooked jasmine rice ($1.04)",
    "1 cucumber ($0.79)",
    "2 jalapeños ($0.40)",
    "1/2 bunch cilantro ($0.38)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the pickled carrots first. In a small sauce pot combine the vinegar, sugar, salt, and water. Heat over medium flame and stir until the sugar is dissolved. Turn the heat off. Shred or julienne the carrots and slice the onion as thin as possible. Combine the carrots, onion, and vinegar mixture in a container. Make sure the vegetables are fully submerged in the liquid and refrigerate for at least 30 minutes (up to one week)."
    },
    {
      "@type": "HowToStep",
      "text": "Next, get the rice started. Combine 2 cups of dry jasmine rice and 3 cups of water in a medium sauce pot. Place a lid on top and bring it up to a boil over high heat. As soon as it reaches a full boil, turn the heat down to low and let it continue to simmer for 15 minutes. After 15 minutes, turn the heat off and let it sit, undisturbed with the lid in place, for an additional 15 minutes, or until you’re ready to use it."
    },
    {
      "@type": "HowToStep",
      "text": "After the rice is started, begin making the meatballs. In a large bowl combine the ground pork, egg, breadcrumbs, minced garlic, grated ginger, soy sauce, and sliced green onions. Mix these ingredients thoroughly (your hands are best for this job). Begin to preheat the oven to 400 degrees. Line a baking sheet with foil and spray it lightly with non-stick spray. Make about 30 meatballs, approximately 1 tablespoon each, and place them on the prepared baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the meatballs in the fully heated oven for 25 minutes. While the meatballs are cooking, thinly slice the jalapeno and cut the cucumber into quarter rounds (cut it into thin spears if you’re making this in sandwich form). Pull the cilantro leaves from the stems."
    },
    {
      "@type": "HowToStep",
      "text": "Once the rice and meatballs are both finished cooking, you’re ready to assemble! Place about 3/4 cup rice in the bottom of a bowl, add about 4 meatballs, about 1/4 cup of pickled carrots and onions, some cilantro leaves, cucumber, and jalapeno. Add a splash of soy sauce, sriracha, or mix up some sriracha mayo to top the bowls. Enjoy!"
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://budgetbytes.com/banh-mi-bowls"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-01T02:17:17.542Z"
}
