{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-11-24T13:15:12.744Z",
  "datePublished": "2022-08-03",
  "description": "Easy, although time intense, bread. 3 ingredients, flour, water and salt, combined with your love. Bread will never look the same once you master this base.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/s5r3xhtzuz7byjvszq95:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Bread",
  "name": "Basic Simple Sourdough Recipe | Woolworths",
  "prepTime": "PT1430M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Australian",
  "recipeId": "a0K2y0000016ZyeEAE",
  "recipeIngredient": [
    "60g sourdough starter",
    "0.5 cup plain white flour",
    "0.33 cup water (filtered, tap can contain chemicals that can kill the active starter)",
    "2.25 cup water (preferably chemical additive free)",
    "5.5 cup flour (recommended plain white, for beginners.)",
    "0.25 cup water",
    "0.75 tbs salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/jvmwxr2nkogbaxlzfilh?wid=1907&hei=1467&fmt=png-alpha",
      "text": "Make a Leaven In a glass bowl, mix together, first 3 ingredients. 60 grams Sourdough Starter, 1/2 cup plain white flour, 1/3 cup water."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/rdmbucuqfqhxiposldek?wid=1610&hei=1238&fmt=png-alpha",
      "text": "Loosely cover and sit, at room temperature overnight. If you have other ferments, such as kimchi, sauerkraut, or kombucha make sure to work your sourdough away from these, to prevent cross-fermentation."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/g7gl4jnsvlbvmslf8s49?wid=2517&hei=1936&fmt=png-alpha",
      "text": "After resting your Leaven for between 8 and 12 hours, it should have doubled to tripled in volume, and become smooth, more fluid and aerated."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Making your Leaven into an Autolyse. Place 2 & 1/4 cups of water, in a large bowl. Test your Leaven by dropping about a teaspoon of it into the water. It should float. Mix the Leaven with the water until it is mostly dispersed, through the water, making sure that any large pieces are broken up. My preference is to use my hands for all mixing of this process, as it is a living culture, and the more gentle the process, the better quality of completed product. You can use dough hooks if you prefer."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/r2ch79m2eiauubtzr0gz?wid=2592&hei=1936&fmt=png-alpha",
      "text": "Once the Leaven is dispersed, through the water, add 5 & 1/2 cups of flour and mix together. The dough will look very raggedy but this is how it should be. Cover and rest the Autolyse for between 30 minutes and 4 hours. This is dependent on your timetable but this is an opportunity for some very magical things to happen. Again, the longer the rest, the better the end product."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "While the Autolyse is resting, dissolve 3/4 tablespoon of salt in 1/4 cup water. The salt must be dissolved, not just dispersed, as raw salt when added later can cause burned patches, in your dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/ow2oak0og8xgzyobntyd?wid=2517&hei=1936&fmt=png-alpha",
      "text": "After allowing the Autolyse to rest for an appropriate time, allowing the magic of hydrating the flour, flavour development through the fermentation process, gluten bonds developing, allowing the dough to become more stretchy, enabling greater expansion. Add the salt water mixture, created in step 6. Gently work the dough, just enough to make sure that the salt water solution, is thoroughly mixed in and incorporated, into the dough. The dough should be smoother and appear more combined, than at the Autolyse stage."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/laewrkgl5qpekfissoon?wid=1659&hei=1276&fmt=png-alpha",
      "text": "Again loosely, cover the dough and allow to rest for 30 minutes. I set a timer at this stage, as there will be 6 further, work and rest for 30 minute steps."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "After resting the dough, with well floured hands lift one side of the dough and stretch it up, enough to fold it over the dough in the bowl. Repeat this with 4 sides. Imagine the dough as a clock face or compass, lift and fold at 12, 3, 6 & 9, or North, East, West & South. It is tempting to fold, more than 4 times, but this is not necessary and over stresses the dough, making it less elastic. Loosely cover and rest dough for 1/2 hour."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Repeat step 9, a further 5 times. Folding 4 times and resting for 30 minutes each time. Remember to set your timer. You should feel the dough becoming more relaxed and easier to stretch, each time. The dough will take on a smooth appearance."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/efdr2ltnf00iqh5ukpnm?wid=2310&hei=1777&fmt=png-alpha",
      "text": "When 6 rounds of folding and resting have been completed, turn dough onto lightly floured board. Cut dough into 2 and knead each piece, until dough is smooth and shiny. Do not over work. Form dough into 2 rounds. Cover lightly, with a tea towel and allow to rest for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/hckls5td6po1qv9p7rcp?wid=1549&hei=1191&fmt=png-alpha",
      "text": "Turn rounds over and lightly knead. Place dough, smooth side down, in proofing baskets. I use sieves provided with cottage cheese, lined with dishcloths, impregnated with flour. Allow to rest and rise, for 4 hours. Dough will increase in size, and soften, during this stage."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/ozj3cis3vjfmmp5wfftm?wid=1936&hei=1489&fmt=png-alpha",
      "text": "Shape loaves, deeply score top, to allow for maximum expansion. Place bread in heated pan, ideally a Dutch Oven, with the lid on. Alternatively you can use loaf tin, tightly sealed with pleated foil."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/zp7jy3jbop79hcs4aq6w?wid=1873&hei=1441&fmt=png-alpha",
      "text": "Cook in a hot oven of 250 degrees, with the lid on, for 20 minutes. Reduce oven to 220 for a further 10 minutes. Do not be tempted to open oven or lift lid at this stage. Remove lid and cook for a further 15 to 20 minutes, until crust is dark golden brown."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Allow to cool slightly, before removing from tins. Ready to serve."
    }
  ],
  "recipeNameId": "basic-simple-sourdough",
  "recipeYield": "15",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/basic-simple-sourdough"
  ],
  "totalTime": "PT1480M",
  "updatedAt": "2022-11-24T13:15:12.742Z",
  "url": "https://www.woolworths.com.au/shop/recipes/basic-simple-sourdough"
}
