{
  "@type": "Recipe",
  "cookTime": "PT20M",
  "createdAt": "2022-11-22T07:20:30.992Z",
  "datePublished": "2022-09-26",
  "description": "This classic Hungarian dessert recipe is made from fluffy dough wrapped around a sweet poppy seed or walnut filling. Yes, it's as delicious as it sounds.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2104-beigli:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Cake,Seafood free,Low salt,Autumn,Lemon,Baking,Apr 2021,Easter,Summer",
  "name": "Beigli Recipe | Woolworths",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "98 calories",
    "carbohydrateContent": "8.5 g",
    "fatContent": "6.2 g",
    "proteinContent": "1.9 g",
    "sodiumContent": "28 millig"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Desserts,Breakfast",
  "recipeId": "11214",
  "recipeIngredient": [
    "1 free range egg, separated",
    "2 free range egg yolks",
    "0.33 cup milk",
    "1.25 tsp instant dried yeast",
    "2.33 cups plain flour",
    "0.25 cup icing sugar",
    "0.5 tsp table salt",
    "140g unsalted butter, softened",
    "0.25 cup poppy seeds",
    "2 tbs caster sugar",
    "2 tbs raisins, chopped",
    "0.5 tsp vanilla extract",
    "0.5 lemon, zested",
    "1 tbs milk, heated",
    "1.33 cups walnuts",
    "0.5 cup icing sugar",
    "1 lemon, zested",
    "0.5 orange, zested (optional)",
    "0.5 tsp ground cinnamon (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the dough, combine yolks, milk and yeast in a small bowl, then set aside for 5 minutes. Place flour, sugar and salt in the bowl of a stand electric mixer fitted with a dough hook, then mix until combined. Add butter and mix until mixture resembles breadcrumbs. Add yolk mixture and knead on medium speed for 2 minutes or until a ball forms. Divide into 2 portions and shape each portion into a ball. Wrap and refrigerate for 2 hours."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make the poppy seed filling, place all the ingredients in a medium bowl. Stir to combine, then set aside to cool (see Tip)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make the walnut filling, process walnuts in a food processor until a course crumb forms.Transfer to a medium bowl with remaining ingredients and 2 tbs boiling water. Stir until well combined. Set aside to cool completely (see Tip)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Line a tray with baking paper. Roll out 1 dough portion to 24cm x 32cm (3mm thick) rectangle. Position dough with long side closest to you. Spread 1 filling over dough, leaving a 1cm border on all sides. Lightly flatten border on short sides, then fold short sides over filling. Starting with long side closest to you, roll up dough. Place seamside down on tray. Repeat with remaining dough and remaining filling. Lightly whisk egg yolk in a small bowl. Brush rolls with yolk, ensuring you brush close to the base. Refrigerate for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Lightly whisk egg white in a separate small bowl. Brush rolls with egg white, ensuring you brush close to the base. Refrigerate for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, preheat oven to 190°C/170°C fanforced. Using a skewer, poke top and sides of rolls. Bake for 20 minutes or until golden brown. Turn off oven. Stand beigli in oven, with door slightly ajar, for 20 minutes. Remove tray from oven. Cool beigli on tray. Slice and serve."
    }
  ],
  "recipeNameId": "beigli",
  "recipeYield": "40",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/beigli"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-22T07:20:30.989Z",
  "url": "https://www.woolworths.com.au/shop/recipes/beigli"
}
