{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-04T10:06:16.702Z",
  "datePublished": "2011-09-01T17:22:00+00:00",
  "description": "Besan Laddoo (Sweet Chickpea Flour Balls with Cashew and Raisins) Indian Sweet. Gluten Free, Soy Free and Vegan Recipe.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2011/09/aug-15-laddoo-2B005.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/09/aug-15-laddoo-2B005-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/09/aug-15-laddoo-2B005-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/09/aug-15-laddoo-2B005-480x270.jpg"
  ],
  "keywords": "easy recipe, traditional indian sweet, vegan snack",
  "name": "Besan Laddoo (Sweet Chickpea Flour Balls With Cashews And Raisins) Indian Sweet, Vegan",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "109 kcal",
    "carbohydrateContent": "13 g",
    "fatContent": "5 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "27 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "5 tablespoons gram/chickpea/garbanzo bean flour (besan)",
    "1 teaspoon semolina flour (fine sooji, omit this for gluten free version)",
    "2 teaspoons quinoa flour (optional, can be substituted with semolina flour)",
    "2 tablespoons vegan butter (earth balance, soy free)",
    "1 tablespoon coconut oil",
    "3 tablespoons raw sugar (more for sweeter balls, I like mine mildy sweet)",
    "1 tablespoon agave syrup (optional)",
    "1/4 teaspoons coarsely ground cardamom seeds (elaichi)",
    "2 tablespoons of chopped cashews (small pieces. large pieces will make it difficult to form balls)",
    "2 tablespoons raisins",
    "a tablespoon or 2 of water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Melt the vegan butter in a large pan on low heat."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the cashews and raisins in it for 2 minutes until golden and remove them leaving as much butter as possible in the pan. Alternatively, cook the cashews and raisins in about a teaspoon of butter separately."
    },
    {
      "@type": "HowToStep",
      "text": "Add coconut oil and heat with butter."
    },
    {
      "@type": "HowToStep",
      "text": "Add the besan (chickpea flour), semolina flour, quinoa flour and mix."
    },
    {
      "@type": "HowToStep",
      "text": "Cook on medium heat and begin to roast the mixture, until it becomes light golden brown in color and gives out a sweet aroma. Stir the mixture continuously with a spatula to prevent burning. 7-10 minutes. The mixture should also start to form clumps."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the flour well, else it will taste raw, which is not fun."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pan from the heat and let it cool to a warm-hot temperature. (a minute)"
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, Blend/grind the raw sugar into powder. or use powdered jaggery."
    },
    {
      "@type": "HowToStep",
      "text": "Add in cardamom seeds, and sugar to the flour mixture and mix well."
    },
    {
      "@type": "HowToStep",
      "text": "Add in the cashews and raisins and mix well with spoon or hand to make mixture more clumpy. (1 minute)"
    },
    {
      "@type": "HowToStep",
      "text": "To make the balls, take about 1.5-2 Tablespoons of warm flour mixture into your palm. Gently press the mixture between your palms to form a smooth, round ball. Of course if you are in a hurry, you can just eat the flour mix like a halwa :(dense sweet dough dessert)."
    },
    {
      "@type": "HowToStep",
      "text": "If the mixture doesn't form balls easily, which might happen because I use butter as less as possible, add half a tablespoon of agave syrup and a few drops of warm water and mix. Keep adding drops of water and a few drops of agave till it becomes a big clump."
    },
    {
      "@type": "HowToStep",
      "text": "All this should be done, while the mixture is still warm-hot to touch. (you can reheat the mixture in the pan to warm-hot if it has completely cooled down). Form balls and let cool completely before storing in airtight container for 1-2 weeks. Hope you all like these Indian Sweet Balls! Have an awesome day everyone!"
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://veganricha.com/2011/08/besan-laddoosweet-chickpea-flour-balls.html"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-05T07:13:36.200Z"
}
