{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths  ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-22T03:42:08.000Z",
  "datePublished": "2022-08-03",
  "description": "Pairing a very intense dark chocolate pastry with a filling of tangy blueberry and sweet white chocolate, these tartlets provide a delicious contrast in texture, flavour, and colour. They are also very easy to make in advance.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/chocol197bluwhi_032:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Sweet pie & tart,Blueberry",
  "name": "Blueberry & White Chocolate Tartlets Recipe | Woolworths",
  "prepTime": "PT85M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "French",
  "recipeId": "RGR9942",
  "recipeIngredient": [
    "350g unsalted butter, chilled and diced",
    "225g plain flour",
    "150g cocoa powder",
    "85g granulated sugar",
    "1 egg, beaten",
    "3 eggs yolks, beaten",
    "60g goodquality dark and white chocolate, tempered (to decorate)",
    "350g blueberries, fresh or frozen",
    "175g caster sugar",
    "1 lemon, juice only",
    "450g white chocolate, finely grated",
    "2 tbs unsalted butter, softened",
    "0.7 cup whipping cream",
    "10 blueberries (to decorate)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 180oC. Grease the tins and dust lightly with flour. Combine the flour, cocoa powder, and granulated sugar in a large bowl. Stir in the butter until the mixture resembles fine breadcrumbs. Add the beaten egg and egg yolks and bring together to form a dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "On a lightly floured surface, roll the dough into a flat, thin rectangle about 3mm thick. Using a bowl or plate about 5cm wider in diameter than your tins, cut 10 circles out of the dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Carefully line each tin with a circle of dough. Trim away excess pastry. Line the pastry cases with greaseproof paper, fill them with baking beans, and place on a baking sheet. Bake for 1517 minutes, until the dough is cooked through and slightly hardened. Remove from the oven, remove the beans and paper from the cases, and leave to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, make the filling. Place the blueberries, sugar, and lemon juice in a saucepan over a mediumhigh heat. Simmer for 15 minutes. Remove the pan from the heat and allow the mixture to cool. Drain off excess liquid, as this can damage the pastry cases. Set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the ganache, place the white chocolate into a heatproof bowl. Warm the cream in a saucepan until just below boiling point. Pour half the heated cream over the pieces of chocolate in the bowl."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Stir the mixture slowly using a silicone spatula. Once the chocolate begins to melt, add the remaining cream. Stir the mixture until smooth. Add the butter and stir to combine. Set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Turn the cooled pastry cases out of their tins onto a lined baking sheet. Spread 1 tablespoon of blueberry mixture across the base of each case. Gently reheat the white chocolate ganache in the bowl over a saucepan of simmering water. Divide the softened ganache evenly between the pastry cases. Refrigerate the tartlets for 2 hours until set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Serve the tartlets at room temperature, topped with fresh blueberries and drizzle of tempered dark and white chocolate. You can store the tartlets in an airtight container in the fridge for up to 1 week, or freeze for up to 2 months."
    }
  ],
  "recipeNameId": "blueberry-and-white-chocolate-tartlets",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/blueberry-and-white-chocolate-tartlets"
  ],
  "totalTime": "PT0M",
  "updatedAt": "2022-11-22T00:19:15.604Z",
  "url": "https://www.woolworths.com.au/shop/recipes/blueberry-and-white-chocolate-tartlets"
}
