{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T01:10:57.181Z",
  "datePublished": "2022-07-27T05:02:07+00:00",
  "description": "My Vegan Blueberry Muffin Cookies are packed with blueberries, topped with a brown sugar cinnamon streusel and brightened with a hint of lemon! These glutenfree grainfree almond flour cookies taste like a blueberry muffin and are so easy to make. A truly unforgettable breakfast or afternoon treat! Makes 8-11 cookies depending on size",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/06/Blueberry-Muffin-Cookies-5041.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/06/Blueberry-Muffin-Cookies-5041-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/06/Blueberry-Muffin-Cookies-5041-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/06/Blueberry-Muffin-Cookies-5041-480x270.jpg"
  ],
  "keywords": "vegan blueberry cookies",
  "name": "Blueberry Muffin Almond Flour Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "127 kcal",
    "carbohydrateContent": "14 g",
    "fatContent": "8 g",
    "fiberContent": "2 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "48 mg",
    "sugarContent": "8 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 1/4 cup almond flour (I use blanched super fine almond flour)",
    "1/3 cup tapioca starch",
    "1/4 teaspoon baking soda",
    "1/8 teaspoon salt",
    "2 tablespoons powdered sugar or use cane sugar or light brown sugar",
    "1 tablespoon semi solid refined coconut oil (measure when semi solid, melt before using)",
    "1/2 teaspoon vanilla extract",
    "1 teaspoon lemon juice",
    "1/2 teaspoon lemon zest (optional)",
    "1/4 cup maple syrup",
    "2 to 3 Tablespoons of dough from above",
    "2 tablespoons almond flour",
    "1 tablespoon brown sugar",
    "a generous pinch salt",
    "1/8 teaspoon cinnamon",
    "1/2 cup blueberries (preferably fresh, wash throroughtly and pat dry if using frozen berries)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the cookie base: In a bowl, add the dry ingredients and make sure to mix really well. Press and mix so that the almond flour lumps break down."
    },
    {
      "@type": "HowToStep",
      "text": "Then melt the coconut oil. Add to the bowl. Add the vanilla extract, lemon juice, zest and room temperature maple syrup to the dry ingredients."
    },
    {
      "@type": "HowToStep",
      "text": "Mix really well until you get a dough. The dough will be somewhat sticky. That's okay. Chill it for 15 to 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the dough is not too sticky, remove about 3 tbsp of the dough into another bowl. Then chill the rest of the dough for another 10-15 mins while you mix the streusel, line the baking sheet and preheat the oven to 335 deg f ( 165 deg c)."
    },
    {
      "@type": "HowToStep",
      "text": "Make the streusel: In the bowl with the 3 tbsp dough, add the almond flour, brown sugar, a generous pinch of salt and cinnamon, and mix really well. Mix to make a slightly dry mixture. Add more almond flour if needed a teaspoon at a time. then add the blueberries and mix in."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the chilled dough from the fridge. Then using a cookie scoop, divide the dough into equal portions. I use 1.5 or 2 tablespoon cookie scoop."
    },
    {
      "@type": "HowToStep",
      "text": "Flatten these scoops onto a parchment lined baking sheet.( I usually double line the baking sheet with parchment because if your baking sheet is too thin, the almond flour bottom can start to brown really quickly). Then top these cookies with the blueberry streusel mixture."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the streusel mixture evenly on all the cookies. The base cookies spread a lot so you want to cover a good portion of the top with the cookie mixture and not just the center. Lightly press the streusel in."
    },
    {
      "@type": "HowToStep",
      "text": "Bake at 335 degrees Fahrenheit for 13 to 15 minutes, depending on your baking sheet and the oven. Until the edges are golden."
    },
    {
      "@type": "HowToStep",
      "text": "Then remove the cookies from the oven. They will be somewhat soft. Let them cool for ten minutes, then transfer to a cooling rack and cool completely and enjoy."
    },
    {
      "@type": "HowToStep",
      "text": "Store these cookies on the counter for the day and refrigerate for up to a week."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://veganricha.com/blueberry-muffin-cookies"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T01:10:57.179Z"
}
