{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-12-04T22:50:03.535Z",
  "datePublished": "2021-07-13",
  "description": "Try our easy to follow Bombe Alaska recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/1312_bombealaska:Square-1300x1300"
  ],
  "keywords": "Cake,Christmas",
  "name": "Bombe Alaska Recipe | Woolworths",
  "prepTime": "PT60M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "1554",
  "recipeIngredient": [
    "0.25 cup orange-flavoures liqueur",
    "1L mango sorbet",
    "1 cup frozen raspberries",
    "1 sponge cake",
    "1L vanilla ice cream",
    "4 egg whites",
    "1 cup caster sugar",
    "0.5 cup slivered almonds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Line a 6 cup pudding basin with a double layer of plastic wrap. Cut a round of sponge to fit into the base of the pudding basin and a second round large enough to cover the top. Place small round of sponge into the basin and brush with some of the liqueur."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Scoop ice cream into a large bowl and set aside for 5 minutes until softened slightly. Add almonds and fold through. Spoon into pudding basin and spread thickly over side and sponge covered base, leaving the centre empty."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Scoop sorbet into a large bowl and set aside for 5 minutes until softened slightly. Lightly mash raspberries and fold into sorbet. Spoon into centre of ice cream. Smooth surface. Brush large round of sponge with remaining liqueur and press firmly onto top of ice cream pudding. Cover with plastic and freeze for 6 hours or overnight until firm."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "When ready to serve, beat egg whites in a large bowl using electric beaters until soft peaks form. Gradually add sugar, beating until thick and glossy."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove plastic from pudding and dip basin into hot water for 30 seconds. Invert onto a plate and remove basin. Spread meringue over pudding to cover it completely. Lightly brown meringue using a kitchen blowtorch. Cut into wedges to serve."
    }
  ],
  "recipeNameId": "bombe-alaska",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/bombe-alaska"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-04T22:50:03.534Z",
  "url": "https://www.woolworths.com.au/shop/recipes/bombe-alaska"
}
