{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "4.86"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-06T02:35:02.068Z",
  "datePublished": "2013-03-30T05:00:21+00:00",
  "description": "A simple, no-bake dessert that’s reminiscent of pecan pie, only it’s vegan and loaded with bourbon flavor.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2013/03/Raw-Pecan-Pie-Bars1.jpg"
  ],
  "keywords": "pecan pie bars",
  "name": "Boozy Pecan Pie Bars with Sea Salt",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "226 kcal",
    "carbohydrateContent": "18 g",
    "fatContent": "15 g",
    "fiberContent": "4 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 bars",
    "sugarContent": "13 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cup raw almonds",
    "1 1/2 cup raw pecans",
    "1 heaping cup pitted dates (1 heaping cup yields ~10-12 large medjool dates)",
    "2 pinches sea salt (2 pinches equals ~1/4 tsp)",
    "1/2 tsp pure vanilla extract",
    "1/3 cup bourbon (such as Bulleit Frontier Bourbon Whiskey)",
    "1/2 cup raw almonds",
    "3/4 cup raw pecans",
    "1 pinch sea salt",
    "1/4 tsp pure vanilla extract",
    "1 cup pitted dates (1 cup yields ~8-12 large medjool dates)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If making with bourbon, start by soaking your pitted dates in bourbon. I recommended 1/3 cup (as original recipe is written), but just use enough to cover your dates when pressed down firmly into a shallow bowl. Set aside and soak for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add your almonds and pecans to the food processor and blitz until only small bits remain – nearly a fine meal."
    },
    {
      "@type": "HowToStep",
      "text": "Add in vanilla extract and a healthy pinch sea salt and pulse a few times more to disperse throughout."
    },
    {
      "@type": "HowToStep",
      "text": "Next, turn onto mix and drop in dates one at a time until a dough forms (reserve the bourbon for adding later only if the dough looks dry // if not needed, add to cocktails or enjoy straight). It should take all of the dates. In the case that it doesn’t you can simply transfer the dough to a parchment lined 8×8 dish, place the remaining dates in the food processor and pulse into small pieces, and add them into the dough."
    },
    {
      "@type": "HowToStep",
      "text": "Press pecan pie dough down until uniformly flat, using another piece of parchment paper to flatten if needed. Top with another pinch of sea salt."
    },
    {
      "@type": "HowToStep",
      "text": "Pop in the freezer for 15 minutes to set, then remove and cut into 12 equal squares (amount as original recipe is written // adjust if altering batch size). Store in an airtight container to keep fresh for up to a week. I prefer mine in the freezer and pull them out 15 minutes before serving."
    },
    {
      "@type": "HowToStep",
      "text": "To make the version without bourbon, simply add your dates to the food processor and process until small bites remain. Then add in almonds, pecans, sea salt and vanilla extract and mix until a dough forms, adding more dates if too dry. Transfer to a parchment lined loaf pan and press down until flat. Top with another sprinkle of sea salt. Pop in freezer to harden for 15 minutes, then cut into 6 equal squares (amount as original recipe is written // adjust if altering batch size). Store in fridge or freezer for optimum freshness."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/boozy-pecan-pie-bars-with-sea-salt"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-12-06T02:35:02.068Z"
}
