{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - savvyshoppergal"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-24T03:17:47.000Z",
  "datePublished": "2022-08-03",
  "description": "Making fresh bread can be fun. I cook mine in the oven. These are very easy to make and taste good too!",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/zh3nldio5ji8nysjpbct:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Rolls",
  "name": "Bread Rolls Recipe | Woolworths",
  "prepTime": "PT110M",
  "recipeCategory": "Appetisers",
  "recipeCuisine": "Australian",
  "recipeId": "a0K0I00000SFaa0UAD",
  "recipeIngredient": [
    "3 cups plain flour",
    "7g dried yeast",
    "2 tsp salt",
    "1.5 cup warm water",
    "100g sesame seeds",
    "1 tbs melted butter",
    "0.5 cup plain flour for dusting"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Sift flour in to a large bowl and add salt and yeast. Stir together."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Create a well in the middle of dry ingredients and add all the water."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Use a wooden spoon to stir ingredients together. Use your hands to bring mixture together properly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put dough on a surface dusted with flour and knead together with lightly floured hands until smooth and pliable.This can take as long as ten minutes and you may need to add more flour to your surface as you knead to ensure the dough doesn't stick."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Brush a large bowl with the melted butter and place dough in the bowl. Roll the dough around in the bowl to ensure it is completely coated in melted butter."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cover the bowl with plastic wrap or a damp tea towel and set the bowl aside, allowing the dough to proof for 45-60 minutes or until it roughly doubles in size."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Just before the dough has finished proofing, preheat the oven to 200°C. Dust flour on a large oven tray and set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "After the dough has doubled in size, remove wrap/tea towel and punch the dough two or three times in the middle. Place the dough on a floured surface and knead for two minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Roll dough in to a cylinder shape rough 30cm long. With a sharp knife or a dough cutter, divided roll into six pieces - This will give you six large rolls. Cut into eight pieces for smaller rolls."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Roll and shape each piece of dough into a circular or bread roll shape. Place each 'bread roll' onto the floured oven tray. Allow rolls to rest on tray uncover for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "With floured hands, gently pick up each roll one at a time and brush with water and sprinkle with sesame seeds. Place each roll back on to the floured tray."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bake in the oven for half an hour or until golden brown and hollow sounding when tapped on the bottom.Once cooked, cool on a cooling rack."
    }
  ],
  "recipeNameId": "bread-rolls",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/bread-rolls"
  ],
  "totalTime": "PT140M",
  "updatedAt": "2022-11-24T00:22:57.588Z",
  "url": "https://www.woolworths.com.au/shop/recipes/bread-rolls"
}
