{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T03:17:40.038Z",
  "datePublished": "2012-10-12T09:45:16+00:00",
  "description": "This is a “dry” stir-fry that doesn’t have much sauce, so it’s best served over seasoned rice or pasta. If you have all your ingredients and cookware prepared, you can have it on the table in about 20 minutes.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2012/10/broccoli-slaw-stirfry-fb.jpg"
  ],
  "keywords": "broccoli slaw salad, vegan stir-fry",
  "name": "Broccoli Slaw Stir-Fry with Tofu",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "212 kcal",
    "carbohydrateContent": "26.9 g",
    "fatContent": "7.8 g",
    "fiberContent": "5.8 g",
    "proteinContent": "17.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "643.6 mg",
    "sugarContent": "3.6 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "14 ounces extra-firm tofu (cut into small cubes)",
    "2 cloves garlic (thinly sliced)",
    "1/4 cup rice wine",
    "2 tablespoons soy sauce or tamari",
    "1 medium onion",
    "1/2 red bell pepper",
    "2 cloves garlic",
    "1 teaspoon minced ginger root",
    "1/8 teaspoon red pepper flakes (or to taste)",
    "1 12-ounce package broccoli slaw",
    "2 tablespoons water",
    "1/2 teaspoon sesame oil (optional, for best flavor)",
    "additional 1 tablespoon soy sauce or tamari (or to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine the tofu, sliced garlic, rice wine, and 2 tablespoons soy sauce in a gallon-sized ziplock bag. Seal bag and turn gently to coat the tofu with the marinade. (You can also do this in a large bowl, carefully stirring the tofu to coat.) Set aside as you chop the vegetables and heat the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Begin heating a large, non-stick skillet or wok over medium-high heat (make sure you have a lid for this pan nearby). While the pan is heating, remove the root and stem ends from the onion, cut it in half top to bottom, and cut each half into thin vertical slices. Slice the bell pepper thinly, and mince the garlic and ginger."
    },
    {
      "@type": "HowToStep",
      "text": "When the pan is hot, drain the tofu, keeping the marinade in a large bowl. Place the tofu in the skillet and cook, turning every minute or so, until it’s beginning to brown on most sides, about 6 minutes. Transfer the tofu to the large bowl with the marinade, stir gently, and cover with a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Add the onion to the hot pan and cook for about 2 minutes. Add the bell pepper, garlic, ginger, and pepper flakes and cook for another minute. Add the broccoli slaw and two tablespoons of water and cover quickly. Steam for 2-3 minutes or until slaw is slightly tender but still crisp. Add the tofu and marinade to the skillet along with the sesame oil and additional soy sauce, and stir well. Heat for just a minute or two and serve immediately."
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://blog.fatfreevegan.com/2012/10/broccoli-slaw-stir-fry-with-tofu.html"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-12-02T03:17:40.037Z"
}
