{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT65M",
  "createdAt": "2022-12-02T01:18:19.622Z",
  "datePublished": "2014-01-23T11:49:16+00:00",
  "description": "You can substitute other vegetables for the green beans. Just make sure they cook in approximately the same time. Cauliflower, broccoli, and Brussels sprouts, while not traditional, would all work here. This is a mild flavored dish, seasoned the traditional way. If you like your paella spicy, feel free to use hot smoked paprika or add some cayenne pepper, and you can add more flavor by throwing in a little cumin.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2014/01/paella-sm.jpg"
  ],
  "keywords": "brown rice paella, vegan paella",
  "name": "Brown Rice Vegetable Paella",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "259 kcal",
    "carbohydrateContent": "57.8 g",
    "fatContent": "1.8 g",
    "fiberContent": "8.4 g",
    "proteinContent": "8.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "356.8 mg",
    "sugarContent": "3.7 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "South American",
  "recipeIngredient": [
    "4 cups warm vegetable broth (divided)",
    "1/2 teaspoon saffron threads (crushed between fingers and added to 1/2 cup warm broth, see note below)",
    "2 cups short-grain brown rice",
    "1 medium-large onion (about 2 cups chopped, chopped)",
    "salt and freshly ground black pepper to taste",
    "6 cloves garlic (minced)",
    "1 15-ounce can diced tomatoes",
    "2 teaspoons smoked or regular sweet paprika",
    "1 1/2 cup cooked butter beans, lima beans, great northern beans, etc (drained)",
    "1 12-ounce package frozen green beans (Italian preferred, thawed and drained)",
    "1/2 large red bell pepper (cut into thin slices)",
    "1 cup canned artichoke heart quarters (rinsed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Before you begin: Make sure you have butter beans, lima, or other dried beans already cooked. Defrost the green beans completely and let drain. Warm the broth; remove 1/2 cup to a small bowl or measuring cup and add the saffron to it. Parboil the rice up to an hour before cooking the paella."
    },
    {
      "@type": "HowToStep",
      "text": "To parboil rice, bring a large pot of water to boil, salted if you want. Add the rice and continue to boil, uncovered, for 15 minutes. Drain water completely (a colander helps) and allow rice to dry for up to an hour."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large, deep skillet or flat-bottomed wok. Add the chopped onion and salt and pepper to taste. Cook, stirring, until onion softens, 4-6 minutes. Add the garlic and tomatoes. Cook, stirring and breaking up large pieces of tomato with the back of the spoon, until mixture thickens and most of the liquid boils off. Stir in the drained rice, paprika, and saffron broth and cook for another couple of minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add 3 cups of the warm broth and the butter beans and bring to a boil. Taste the broth to see if it’s salty enough and add salt and pepper to taste. Reduce heat to a simmer and cook for 20 minutes. Stir in the Italian beans. Increase heat until boiling again, if necessary, and then reduce heat to a simmer. Cook for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange the bell pepper and artichoke hearts over the top of the rice. If the rice seems to be drying around the edges but is still not cooked, drizzle in a little more broth (1/4 to 1/2 cup) around the edges. Cover pan and cook on low for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Check to see if rice is tender and liquid is absorbed. If rice is done but there is still a lot of liquid, remove the cover and cook until liquid boils off. If rice is not done, add a little more broth or water, if necessary, cover, and cook on low until tender. When rice is cooked, if there is excess liquid in the pan, remove the cover and allow it to boil off (paella should be moist but not swimming in liquid)."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from heat, cover, and let stand until ready to serve."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2014/01/brown-rice-vegetable-paella.html"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-12-02T01:18:19.621Z"
}
