{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2021-07-22",
  "description": "Try our easy to follow Bunnicorn Cupcakes recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1803-bunnicorn-cupcakes:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Cupcake",
  "name": "Bunnicorn Cupcakes Recipe | Woolworths",
  "prepTime": "PT60M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "7432",
  "recipeIngredient": [
    "1.5 cup self-raising flour",
    "4-6 drops blue food colouring",
    "4-6 drops green food colouring",
    "2 tbs icing sugar",
    "1 cup sour cream",
    "4-6 drops red food colouring",
    "1 cup cocoa",
    "240g ready to roll icing white",
    "2 tsp vanilla bean paste",
    "1-2 tsp dream flavour for icing",
    "2 eggs",
    "1.5 cup caster sugar",
    "4-6 drops Queen yellow food coloring",
    "4-6 drops rose food colouring",
    "4-6 drops pink food colour",
    "130ml vegetable oil",
    "300g buttercream icing",
    "1 pinch salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bunny Ears – prepare up to five days ahead: Remove one third of a packet of Ready to Roll Icing white and on a bench lightly dusted with icing sugar, knead until smooth and pliable. Seal remaining icing and store in an airtight container in the pantry for up to 8 weeks."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Section off a quarter of the ball, and tint with pink food colouring using a toothpick, kneading until smooth. Roll each icing ball out until 3-4mm thick. Cut out bunny ears from template and place on top, using a sharp knife to cut the inside & outside bunny ears. Remove any excess icing and top large white ears with pink ear pieces, using a dab of water to attach if needed. Gently curve the corner of a few ears, and then set aside to dry for 3-4 hours. Use remaining fondant to cut triangles for bows. Once dry, carefully lift and store in a flat airtight container until ready to use. Do not store fondant in the fridge."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cupcakes: Preheat oven to 180°C (fan forced) and line a 12 cup cupcake tin with cases. In a mixer, add all cupcake ingredients except eggs, mixing on low speed until combined. Add eggs one at a time, mixing well after each addition. Divide batter into patty cases. Bake for 15-20 minutes or until an inserted skewer comes out clean. Allow to cool completely before icing."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Icing: Prepare packet of buttercream icing according to packet instructions, adding Queen Unicorn Dream Flavour for Icing to taste. Divide mixture between 4 small bowls and tint with food colouring to create yellow, pink, purple (mix blue & pink) and aqua, adding colour a drop at a time to achieve a pastel effect."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Decoration: Using a piping bag with an open star tip, add icing to piping bag 1 tbsp at a time, alternating with each colour to create a patchwork effect. Twist top of piping bag and holding upright, pipe from the outside to create double height rainbow buttercream swirls. Top with bunny ears and bow and store in an airtight container at room temperature before serving."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Note: Bunny ear template is available from Oetker.com.au"
    }
  ],
  "recipeNameId": "bunnicorn-cupcakes",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/bunnicorn-cupcakes"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-24T13:28:03.920Z",
  "url": "https://www.woolworths.com.au/shop/recipes/bunnicorn-cupcakes"
}
