{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-11-28T22:47:38.000Z",
  "datePublished": "2017-11-27T10:20:00+00:00",
  "description": "This vegan butternut squash risotto is made with creamy Arborio rice, made extra flavorful with sweet butternut squash, Brussels sprouts and savory sage.",
  "image": {
    "@type": "ImageObject",
    "height": 1050,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2013/11/butternut-squash-risotto-2-of-3.jpg",
    "width": 700
  },
  "keywords": "butternut squash, rice",
  "name": "Butternut Squash Risotto with Roasted Brussels Sprouts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "386 kcal",
    "carbohydrateContent": "63.4 g",
    "fatContent": "10 g",
    "fiberContent": "6.7 g",
    "proteinContent": "9.9 g",
    "saturatedFatContent": "2.8 g",
    "servingSize": "1 serving",
    "sugarContent": "5.7 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 pounds butternut squash, (diced)",
    "3 tablespoons olive oil, (divided)",
    "3/4 cup full-fat coconut milk",
    "3 cups Brussels sprouts, (halved)",
    "1 medium onion, (diced)",
    "3 garlic cloves, (minced)",
    "1 1/2 cups Arborio rice",
    "1/2 cup white wine",
    "4 cups vegetable broth, (heated)",
    "1/4 teaspoons nutmeg",
    "2 tablespoons finely chopped fresh sage",
    "Salt and pepper to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375° and line a couple of baking sheets with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange the squash on one of the baking sheets and drizzle with 1 tablespoon of olive oil. Toss a few times to coat the squash. Bake until tender, 30-35 minutes. Remove from the oven and allow to cool for a few minutes. Leave the oven on."
    },
    {
      "@type": "HowToStep",
      "text": "Place the squash and coconut milk into a food processor or blender and blend until smooth. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange the Brussels sprouts on the other baking sheet and drizzle with 1 tablespoon of olive oil. Toss to coat, and sprinkle the sprouts with salt and pepper. Roast until the sprouts soften up a bit and begin to brown, about 25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the Brussels sprouts roast, coat the bottom of a large pot with the remaining tablespoon of oil and place it over medium heat. When the oil is hot, add the onion and sauté for about 5 minutes, until soft and translucent."
    },
    {
      "@type": "HowToStep",
      "text": "Add the garlic and rice, and sauté another two minutes, until the garlic is very fragrant and the rice begins to become translucent."
    },
    {
      "@type": "HowToStep",
      "text": "Add the wine and cook bring to a simmer. Cook until most of the wine cooks off, stirring frequently, about 2 minutes. Add one cup of broth and bring it to a simmer. Continue to cook, stirring frequently, until most of the broth has cooked off or been absorbed by the rice. Add another cup of broth and continue cooking and adding broth in this manner until the rice is tender and all or almost all of the broth has been added (you can have up to 1/2 cup leftover when the rice is cooked). The total cook time should be about 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the squash mixture and nutmeg, and continue to cook another minute or so, just until heated throughout. Stir in the sage and season with salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the risotto into bowls and top with roasted Brussels sprouts. Serve."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/butternut-squash-risotto"
  ],
  "totalTime": "PT95M",
  "updatedAt": "2022-11-28T16:38:32.871Z"
}
