{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "33",
    "ratingValue": "4.94"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-12-01T07:07:58.286Z",
  "datePublished": "2018-02-19T10:19:21+00:00",
  "description": "Tender pockets of dough are stuffed with a mix of hearty mashed potatoes and sweet caramelized onions, then pan-fried until golden to make these comforting vegan pierogies.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2018/02/vegan-pierogies-3-of-3.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2018/02/vegan-pierogies-3-of-3-500x500.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2018/02/vegan-pierogies-3-of-3-500x375.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2018/02/vegan-pierogies-3-of-3-480x270.jpg"
  ],
  "keywords": "caramelized onions, dumplings, potatoes",
  "name": "Caramelized Onion & Potato Vegan Pierogies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "462 kcal",
    "carbohydrateContent": "68.6 g",
    "fatContent": "15.8 g",
    "fiberContent": "6.5 g",
    "proteinContent": "11.8 g",
    "saturatedFatContent": "2.5 g",
    "servingSize": "4 pierogies",
    "sodiumContent": "647 mg",
    "sugarContent": "4.3 g"
  },
  "prepTime": "PT80M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Polish",
  "recipeIngredient": [
    "3 cups all-purpose flour",
    "1/2 teaspoon salt",
    "1 cup water",
    "1/4 cup vegan butter, (melted)",
    "1 tablespoon olive oil",
    "1 pound yellow onions, (diced (about 2 medium)",
    "1 large (about 1 pound) russet potato, (peeled and diced)",
    "1/4 cup unflavored soy or almond milk",
    "2 tablespoons nutritional yeast flakes",
    "1 teaspoon white wine vinegar",
    "1 garlic clove, (minced)",
    "3/4 teaspoon salt, (plus more to taste)",
    "2-3 tablespoons vegan butter"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To make the dough, stir the flour and salt together in a medium mixing bowl. Stir in the water and butter to form a dough. Transfer the dough to a lightly floured surface and knead for about 6 minutes, until smooth and elastic. Transfer the dough to a lightly oiled bowl and cover. Allow it to rest for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "While the dough rests, caramelize the onions. Place the onions and oil into a medium skillet and stir a few times to coat the onions with oil. Set the skillet over medium-low heat. Allow to cook, stirring occasionally, until the onions become very soft and light brown, about 45 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the dough rests and the onions caramelize, place the potato into a medium pot and cover with water. Place the pot over high heat and bring the water to a boil. Allow to cook until the potato is fork tender, about 15 minutes. Don't overcook it."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the potato into a colander and return it to the pot. Mash the potatoes with a potato masher and stir in the milk, nutritional yeast flakes, white wine vinegar, garlic and salt. When the onions are finished cooking, stir them into the potato mixture."
    },
    {
      "@type": "HowToStep",
      "text": "When the dough has sat for 1 hour, split it into 2 halves. Transfer one of halves to a lightly floured surface and roll to a square of about 14 x 14 inches. Cut 3-inch circles using a drinking glass or pastry cutter. Reroll the dough as needed, and repeat with the other half. You should get about 24 circles."
    },
    {
      "@type": "HowToStep",
      "text": "Place about 1 tablespoon of the potato mixture onto each dough round, then fold in half and seal tightly to form a pierogie. Apply a bit of water if you have trouble sealing the dough."
    },
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of water to a boil and add the pierogies (work in batches if it gets too crowded). Cook the pierogies for 3-4 minutes, until they float, removing each one with a slotted spoon and transferring to a plate as it begins to float."
    },
    {
      "@type": "HowToStep",
      "text": "To fry the pierogies, melt the butter in a large skillet, then add as many pierogies as will fit without crowding. Cook for about 4 minutes on each side, until golden and crisp. Transfer the pierogies to a paper towel-lined plate. Add butter to the skillet between batches as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with sauerkraut, dill, chives, applesauce, and/or vegan yogurt or cashew cream."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-pierogies"
  ],
  "totalTime": "PT135M",
  "updatedAt": "2022-12-01T07:07:58.285Z"
}
