{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-01T12:56:08.121Z",
  "datePublished": "2017-11-18T03:00:36+00:00",
  "description": "An amazing 10-ingredient Vegan Cheesecake Tart with an oat-almond crust, creamy cashew-coconut center, and caramelized apples! The perfect easy, gluten-free, and naturally sweetened holiday dessert.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/10/Caramel-Apple-Tart-SQUARE.jpg"
  ],
  "keywords": "apple tart",
  "name": "Caramel Apple Cheesecake Tart",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "454 kcal",
    "carbohydrateContent": "42 g",
    "fatContent": "30 g",
    "fiberContent": "4.4 g",
    "proteinContent": "9.6 g",
    "saturatedFatContent": "12.7 g",
    "servingSize": "1 slice",
    "sodiumContent": "132 mg",
    "sugarContent": "24 g"
  },
  "prepTime": "PT240M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 cup coconut yogurt",
    "1 cup raw cashews",
    "2-3 Tbsp maple syrup (or sub stevia to taste (~1/4-1/2 tsp as recipe is written)",
    "2 Tbsp lemon juice",
    "2 Tbsp melted coconut oil (if avoiding oil, omit)",
    "1 tsp pure vanilla extract (optional)",
    "1 pinch sea salt",
    "1 1/3 cup gluten-free rolled oats",
    "1 1/3 cup raw almonds",
    "1/2 tsp sea salt",
    "2 Tbsp coconut sugar (plus more to taste (or sub stevia to taste (~1/4 tsp)",
    "1 Tbsp maple syrup",
    "4-5 Tbsp coconut oil",
    "1/2 batch of Cinnamon Baked Apples, figs, berries, etc."
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by making preparations for filling. If making coconut yogurt, do so first. Otherwise, proceed with store-bought or sub coconut milk or cream (see note in instructions about extra lemon juice)."
    },
    {
      "@type": "HowToStep",
      "text": "Next, soak your cashews in very hot water for 1 hour or 6-8 hours in cool water. Then drain and set aside. If using soaked cashews more than 1 hour after draining, cover and refrigerate for up to 4-5 hours (continuing the soak can make them mealy or too soft)."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, prepare crust by preheating oven to 350 degrees F (176 C) and adding oats, almonds, sea salt, coconut sugar and maple syrup to a high-speed blender or food processor. Pulse into a fine meal. Then add coconut oil and and pulse until a crust \"dough\" forms that holds together when you squeeze it between your fingers. If it appears too dry, add more melted coconut oil 1 Tbsp (15 g) at at time and blend. I found 5 Tbsp (75 g // as recipe is written // adjust if altering batch size) to be about right."
    },
    {
      "@type": "HowToStep",
      "text": "Line a 9-inch tart pan with a removable bottom (or sub a pie pan or 8x8-inch baking dish) with parchment paper. I did this by cutting out a circle that fit in the bottom of the pan and just reached the edges (if using an 8x8 dish, extend parchment paper up over the edges)."
    },
    {
      "@type": "HowToStep",
      "text": "Then add the crust mixture to the pan and use your hands to spread it into an even layer, pushing the crust up to the edges of the pan so it contains the filling well. To achieve a uniform layer, cover a flat-bottom object (such as a drinking glass) with parchment paper and press down firmly."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 15 minutes. Then increase heat to 375 F (190 C) and bake for 5-8 minutes more or until the edges are golden brown and there is some browning on the surface. Remove from oven to cool for 5 minutes. Then carefully transfer to the freezer to chill."
    },
    {
      "@type": "HowToStep",
      "text": "Make filling by adding coconut yogurt, soaked and drained cashews, the lesser amount of maple syrup (2 Tbsp (30 ml) as recipe is written), lemon juice, melted coconut oil, vanilla (optional), and sea salt. Blend on high until creamy and smooth. Then taste and adjust flavors as needed, adding more lemon for acidity, maple syrup for sweetness, or vanilla for intense vanilla flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Remove cooled crust from the freezer and pour the filling onto it. Gently tap a few times to release any air bubbles. Then set back in the freezer (I set mine on a baking sheet to keep it flat) and freeze until firm to the touch - about 2-3 hours."
    },
    {
      "@type": "HowToStep",
      "text": "While this happens, prepare desired fruit topping. I went with a half batch (3-4 apples instead of 6-7 // as recipe is written // adjust if altering batch size) Cinnamon Baked Apples, but fresh fruit would also be lovely here. The important thing to remember is the apples (or any baked fruit) need to be cooled completely before being added to the top of the tart or it will melt."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, make sure the tart has set out for at least 1 hour from the freezer so the filling is more the consistency of cheesecake. Store leftovers covered in the refrigerator (freezing isn't necessary) for up to 4 days."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/caramel-apple-cheesecake-tart"
  ],
  "totalTime": "PT265M",
  "updatedAt": "2022-12-01T12:56:08.119Z"
}
