{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-11-30T14:25:20.461Z",
  "datePublished": "2012-11-26T20:24:00+00:00",
  "description": "A homemade creamy garlic sauce and sweet caramelized onions make this mushroom white pizza to die for!&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2012/11/WhitePizzaclose.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2012/11/WhitePizzaclose-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2012/11/WhitePizzaclose-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2012/11/WhitePizzaclose-480x270.jpg"
  ],
  "name": "Caramelized Onion & Mushroom White Pizza",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "551.05 kcal",
    "carbohydrateContent": "58.58 g",
    "fatContent": "27.58 g",
    "fiberContent": "3.35 g",
    "proteinContent": "17.98 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1256.95 mg"
  },
  "prepTime": "PT720M",
  "recipeIngredient": [
    "2 cups all purpose flour ($0.30)",
    "1 tsp salt ($0.05)",
    "1/4 tsp instant yeast ($0.02)",
    "3/4 cup water (approximately) ($0.00)",
    "3 small yellow onions $0.84 ($0.84)",
    "2 Tbsp olive oil $0.24 ($0.24)",
    "a pinch salt and pepper $0.05 ($0.05)",
    "8 oz button mushrooms $1.75 ($1.75)",
    "1/4 tsp dried thyme $0.02 ($0.02)",
    "1 cup shredded mozzarella $0.93 ($0.93)",
    "handful fresh parsley (optional) ($0.10)",
    "1 Tbsp butter ($0.12)",
    "1 clove garlic ($0.08)",
    "4 oz cream cheese ($0.93)",
    "1/2 cup milk ($0.13)",
    "1/4 tsp salt ($0.02)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "The night before, combine the flour, salt, and yeast in a bowl. Stir to combine. Add just enough water to make the mixture form a ball of dough with no dry flour left on the bottom of the bowl. This will be around 3/4 cup of water. Loosely cover the bowl and allow the dough to rest at room temperature for 12-18 hours."
    },
    {
      "@type": "HowToStep",
      "text": "The next day, about an hour and a half before you plan to eat, thinly slice three small (or 2 medium/large) yellow onions. Saute the onions in a skillet over medium-low heat with 2 tablespoons of olive oil for about 45 minutes, stirring the mixture every 2-3 minutes. The end result should be deep golden brown, soft, sweet onions. For a more detailed, step by step photo tutorial on how to caramelize onions, check here."
    },
    {
      "@type": "HowToStep",
      "text": "While the onions are cooking, slice the mushrooms. Take the caramelized onions out of the skillet and add the mushrooms, along with a pinch of salt and pepper and the dried thyme. There should be some residual oil in the skillet to cook the mushrooms, if not add a tad more. Cook the mushrooms until all of the moisture has evaporated away (about 10 minutes over medium heat)."
    },
    {
      "@type": "HowToStep",
      "text": "While the mushrooms are cooking, prepare the cream sauce. Mince a clove of garlic and add it to a pot with 1 tablespoon of butter. Saute over medium heat until softened (about 2 minutes). Next, add the cream cheese, milk, and 1/4 teaspoon of salt. Heat and whisk this mixture until a smooth sauce forms (about 5 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Adjust the rack in your oven to its highest position and begin to preheat to 500 degrees. The dough at this point should be at least double in volume and very bubbly (see photos below). Sprinkle it generously with flour and then scrape it out of the bowl and onto a floured surface. Pat the dough down into a circle about ten inches in diameter. Transfer the dough to a large (16-inch) pizza pan that has been coated with non-stick spray and stretch/press it the rest of the way out to the edges of the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the sauce over the surface of the dough with the back of a spoon. Sprinkle the caramelized onions and sauteed mushrooms over top. Finally, add the shredded mozzarella. Bake the pizza in the fully preheated 500 degree oven for 12-15 minutes or until the crust is golden brown. Sprinkle with chopped fresh parsley after baking, if desired."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/caramelized-onion-mushroom-white-pizza"
  ],
  "totalTime": "PT735M",
  "updatedAt": "2022-11-30T14:25:20.461Z"
}
