{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "5",
    "reviewCount": "1"
  },
  "author": {
    "@type": "Person",
    "name": "She Likes Food"
  },
  "createdAt": "2022-12-03T07:47:49.741Z",
  "datePublished": "2015-03-30",
  "image": [
    "https://www.shelikesfood.com/wp-content/uploads/2017/05/Carrot-Cake-Ice-Cream-Sandwiches-gluten-free-vegan-33061-758x1024-225x225.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2017/05/Carrot-Cake-Ice-Cream-Sandwiches-gluten-free-vegan-33061-758x1024-260x195.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2017/05/Carrot-Cake-Ice-Cream-Sandwiches-gluten-free-vegan-33061-758x1024-320x180.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2017/05/Carrot-Cake-Ice-Cream-Sandwiches-gluten-free-vegan-33061-758x1024.jpg"
  ],
  "name": "Carrot Cake Ice Cream Sandwiches {vegan & gluten free}",
  "recipeCategory": "Dessert",
  "recipeIngredient": [
    "1 cup grated carrots",
    "1 cup plus 2 tablespoons Bob’s Red Mill Gluten Free 1:1 Baking Flour*",
    "1/2 teaspoon baking soda",
    "1 1/2 teaspoon baking powder",
    "1/2 teaspoon salt",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon ground ginger",
    "1/4 teaspoon ground nutmeg",
    "1/2 cup granulated sugar",
    "1 tablespoon brown sugar",
    "1/4 cup vegetable oil, or melted coconut oil",
    "1 teaspoon vanilla extract",
    "1/4 cup applesauce",
    "1/2 cup almond milk",
    "2-3 pints non-dairy ice cream, I used So Delicious Vanilla Coconut Milk Ice Cream**",
    "Chopped walnuts, if desired"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Pre-heat oven to 325 degrees Fahrenheit."
    },
    {
      "@type": "HowToStep",
      "text": "Bring a medium sized pot of water to a boil. Fill a large bowl with ice water and set aside. Once water is boiling, throw in the grated carrots and leave them in for about 45 seconds. Drain carrots and immediately throw them into the ice bath. Once cooled, pat dry, squeeze out any extra water and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium sized bowl add flour, baking soda, baking powder, salt, cinnamon, ginger, and nutmeg and stir. In a large bowl add granulated sugar, brown sugar, and oil. Cream together and then add vanilla, almond milk, and applesauce and mix again. Add dry mixture to wet mixture and beat with an electric mixer until combined. Using a spoon or spatula, stir in carrots."
    },
    {
      "@type": "HowToStep",
      "text": "Line a 9×13 baking dish with parchment paper. Evenly split the carrot cake batter in half. Spread 1/2 of the batter into the baking dish. It works best to go slow and use a plastic spatula to spread it out. It may look like there isn’t enough at first, but there will be!"
    },
    {
      "@type": "HowToStep",
      "text": "Bake the carrot cake for about 20 minutes, until cooked through and then place on a wire rack to cool. Then repeat with the remaining half of the batter. While both cakes are cooling, thaw the ice cream."
    },
    {
      "@type": "HowToStep",
      "text": "Flip one of the carrot cake sheets over and then slide back into a parchment paper lined baking dish. Once ice cream is thawed a bit, place the ice cream in a large bowl and whip with an electric mixture until smooth. Evenly spread the ice cream onto the bottom layer of cake and then slide top layer of cake on the top. Freeze for at least 6 hours, but overnight is ideal."
    },
    {
      "@type": "HowToStep",
      "text": "When ready to eat, let ice cream sandwiches thaw for a few minutes before cutting. Cut them into whatever shape you desire, I used circle cookie cutters and was able to get 8 ice cream sandwiches."
    },
    {
      "@type": "HowToStep",
      "text": "If desired, roll the outside of the ice cream sandwiches in chopped walnuts, it works best when the ice cream is slightly melted."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://shelikesfood.com/carrot-cake-ice-cream-sandwiches"
  ],
  "updatedAt": "2022-12-03T07:47:49.740Z",
  "url": "https://www.shelikesfood.com/carrot-cake-ice-cream-sandwiches/"
}
