{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-30T02:07:09.122Z",
  "datePublished": "2016-08-01T09:52:53+00:00",
  "description": "Tender pan-fried cauliflower steaks are drenched in a luxurious vegan lemon-butter sauce, and served over pasta with capers and fresh parsley to make this mouthwatering cauliflower piccata.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2016/07/cauliflower-piccata-4.jpg"
  ],
  "keywords": "capers, cauliflower, pasta",
  "name": "Cauliflower Piccata",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "300 kcal",
    "carbohydrateContent": "22.3 g",
    "fatContent": "21.6 g",
    "fiberContent": "4.9 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "3.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "422 mg",
    "sugarContent": "3.9 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 medium cauliflower crown",
    "1/2 cup whole wheat or all-purpose flour",
    "1/4 tsp. salt",
    "1/4 tsp. black pepper",
    "about 1/4 cup olive oil",
    "3 tbsp. vegan butter",
    "1 large shallot (minced)",
    "1/4 cup dry white wine",
    "3 tbsp. lemon juice",
    "2 tbsp. capers",
    "salt and pepper to taste",
    "cooked pasta of choice",
    "fresh parsley"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Rinse cauliflower and remove outer leaves. Trim the stem so it's about level with the bottom of the crown. Set the crown on a cutting board, stem side down, and slice in half, making a cut straight down the center. Continue making parallel cuts, about 3/4 inch apart, to cut the cauliflower into about 6 slabs."
    },
    {
      "@type": "HowToStep",
      "text": "Stir flour, salt and pepper together in a shallow dish."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large nonstick skillet generously with oil and place over medium heat. Take one of your cauliflower slabs and dredge each side in the flour mixture. If you have a tough time getting it to stick, try brushing the surface of the cauliflower with a bit of non-dairy milk or water. Place the coated cauliflower slab into the skillet. Repeat for remaining slabs, arranging in a single layer in the skillet and avoiding overcrowding. Cook them in batches if they don't all fit nicely, adding oil to the skillet as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Cook cauliflower slabs for about 5 minutes, gently flip and cook five minutes more on opposite side, until they're just tender. Handle them carefully, as the coating is rather fragile. Remove from skillet and transfer to a paper towel-lined plate."
    },
    {
      "@type": "HowToStep",
      "text": "Place vegan butter into skillet. When butter is melted, add shallot. Lower heat and cook for 5 minutes. Add wine, lemon juice and capers to skillet. Raise heat back up to medium and bring to a simmer. Allow to cook until reduced by half, about 5 minutes. Taste-test and season the sauce with salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Return cauliflower to skillet, and allow to cook just another minute or so, so it tenderizes a bit more and the coating sucks up some of the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Divide pasta onto plates and top with cauliflower. Sprinkle with parsley and serve."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/cauliflower-piccata"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-30T02:07:09.120Z"
}
