{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-11-27T12:33:04.000Z",
  "datePublished": "2022-11-04",
  "description": "It may seem fiddly to skin the hazelnuts, but the skins can be quite bitter and will change the taste of the dish if left on. The sweetness of the roasted nuts contrasts well with the cauliflower and the ripeness of the Manchego.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/gramai170cauhaz_022:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Vegetable dishes,Cauliflower",
  "name": "Cauliflower Hazelnut Polenta Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "Italian",
  "recipeId": "RGR10918",
  "recipeIngredient": [
    "75g hazelnuts",
    "450g cauliflower, cut into florets",
    "1 tbs olive oil",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "0.5 lemon, juice only",
    "2 cup milk",
    "150g coarse polenta",
    "3 tbs unsalted butter",
    "30g Manchego cheese, grated, plus extra to serve",
    "1 handful flat-leaf parsley, roughly chopped, to garnish"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 180°C. Spread the hazelnuts out on a baking sheet, place in the oven, and toast for 10-15 minutes or until they are well browned with the skins peeling off. Leave them to cool slightly. Then place them between two pieces of kitchen paper and rub to remove the skins. Roughly chop the hazelnuts and set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Increase the heat to 200°C. Place the cauliflower on a large baking sheet, drizzle over the oil, and season well. Place in the oven and roast for 30 minutes, stirring occasionally, until golden brown and cooked through. Remove from the heat, drizzle over the lemon juice, and set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the polenta, place the milk and 500 ml of water in a large, lidded saucepan. Add 1/4 teaspoon salt and a good grinding of pepper. Bring to the boil, then reduce the heat to medium-low. Gradually add one-third of the polenta, stirring constantly, until well combined. Then add the remaining polenta, stirring constantly, and cook for about 10 minutes or until it is well combined and smooth."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Reduce the heat to low and cover partially. Cook for a further 15 minutes, stirring occasionally to ensure it does not stick to the bottom, until it is creamy. Add a little more water or milk to the pan if the polenta seems too thick. Then stir in the butter and cheese and mix well to incorporate. Remove from the heat. Spoon the polenta into serving bowls and top with the hazelnuts and cauliflower. Garnish with the parsley and serve immediately."
    }
  ],
  "recipeNameId": "cauliflower-hazelnut-polenta",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/cauliflower-hazelnut-polenta"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-11-27T07:48:58.830Z",
  "url": "https://www.woolworths.com.au/shop/recipes/cauliflower-hazelnut-polenta"
}
