{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "createdAt": "2022-12-01T04:32:59.338Z",
  "datePublished": "2017-05-17T08:42:58+00:00",
  "description": "This vegan risotto is made from cauliflower rice cooked up in creamy cauliflower sauce and served over polenta cakes with sautéed shiitake mushrooms.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2017/05/cauliflower-risotto-2.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2017/05/cauliflower-risotto-2-500x500.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2017/05/cauliflower-risotto-2-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2017/05/cauliflower-risotto-2-480x270.jpg"
  ],
  "keywords": "Cauliflower Risotto, risotto recipe, vegan risotto, vegetarian risotto",
  "name": "Cauliflower Risotto",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "1107 kcal",
    "carbohydrateContent": "117 g",
    "fatContent": "61 g",
    "fiberContent": "14 g",
    "proteinContent": "21 g",
    "saturatedFatContent": "11 g",
    "servingSize": "1 serving",
    "sodiumContent": "2089 mg",
    "sugarContent": "14 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "46 g"
  },
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "5 tablespoons vegan butter",
    "1 tablespoon minced garlic (plus 1 garlic clove)",
    "1 teaspoon salt (plus more as needed)",
    "1/2 teaspoon black pepper (plus more as needed)",
    "1 1/4 cups polenta",
    "1 medium head cauliflower",
    "2 whole shallots plus 2 tablespoons chopped shallot",
    "5 tablespoons olive oil",
    "1/2 cup white wine",
    "1/2 teaspoon salt",
    "3 tablespoons chopped fresh parsley",
    "2 cups sliced shiitake mushrooms"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large pot, combine 1 tablespoon of the vegan butter, the minced garlic, 1 teaspoon of the salt, 1/2 teaspoon of the pepper, and 3 cups water. Bring to a boil. Add the polenta and stir until the water has been absorbed, 1 to 2 minutes. Remove from the pan and spread the polenta over a baking sheet; let cool in the refrigerator."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the cauliflower stem, coarsely chop it, and place it in a food processor. Pulse seven or eight times, or until it is finely minced, similar to the size and consistency of grains of rice. Divide the cauliflower into two equal portions."
    },
    {
      "@type": "HowToStep",
      "text": "Fill a large pot with water and add half the cauliflower, the whole shallots, and the garlic clove. Bring to a boil, and boil for 20 to 25 minutes, or until the cauliflower is soft. Drain the water and transfer the boiled cauliflower, shallots, and garlic to high-speed blender. Blend until smooth."
    },
    {
      "@type": "HowToStep",
      "text": "In a large sauté pan, heat 2 tablespoons of the olive oil over medium-high heat. Add the chopped shallot and sauté for 1 to 2 minutes, then add the rest of the minced cauliflower and stir well. Add the white wine and sauté for 1 to 2 minutes, then add the pureed cauliflower and stir. Add 1 cup water, 1/2 teaspoon salt, and 2 tablespoons of the vegan butter and stir. Add the parsley and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium skillet, heat 2 tablespoons of the olive oil over medium-high heat. Add the mushrooms and a pinch each of salt and pepper. Sauté until the mushrooms begin to brown. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the polenta from the refrigerator and use a large thin-rimmed glass or a cookie cutter to cut it into rounds."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate medium sauté pan, heat the remaining 1 tablespoon of olive oil over medium heat. Add the polenta cakes and sauté for 1 to 2 minutes on each side, or until golden brown on both sides."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble, divide the polenta cakes between two plates, then top with the cauliflower risotto and finally the sautéed mushrooms."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://ohmyveggies.com/cauliflower-risotto"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet",
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-01T04:32:59.336Z"
}
