{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "34",
    "ratingValue": "4.92"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-12-04T17:35:49.562Z",
  "datePublished": "2018-07-30T03:00:41+00:00",
  "description": "Flavorful, wholesome spaghetti squash pasta sautéed with onion and garlic and mixed with a cheesy cashew ricotta-style cheese! The perfect 9-ingredient side or entrée when topped with vegan meatballs!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cheesy-Spaghetti-Squash-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cheesy-Spaghetti-Squash-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cheesy-Spaghetti-Squash-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cheesy-Spaghetti-Squash-SQUARE-480x270.jpg"
  ],
  "keywords": "spaghetti squash pasta",
  "name": "Cheesy Spaghetti Squash Pasta",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "396 kcal",
    "carbohydrateContent": "39 g",
    "fatContent": "26 g",
    "fiberContent": "8 g",
    "proteinContent": "11 g",
    "saturatedFatContent": "4 g",
    "servingSize": "1 serving",
    "sodiumContent": "403 mg",
    "sugarContent": "12 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Side Dish",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup raw cashews",
    "2 Tbsp nutritional yeast (plus more to taste)",
    "2 Tbsp lemon juice",
    "1/2 tsp sea salt (plus more to taste)",
    "1 Dash garlic powder",
    "1/4 cup water (to thin, plus more as needed)",
    "1/4 cup fresh parsley or basil (optional)",
    "1 large spaghetti squash",
    "1 Tbsp olive or avocado oil ( (sub water if avoiding oil)",
    "1 Pinch sea salt",
    "2 Tbsp olive or avocado oil (or sub water if avoiding oil)",
    "1/4 cup diced shallot",
    "2 cloves garlic (minced)",
    "Marinara Sauce (or store-bought)",
    "Vegan Parmesan Cheese",
    "Vegan Meatballs"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin by soaking cashews in very hot water for at least 30 minutes, up to 1 hour. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, preheat oven to 400 degrees F (204 C). Slice spaghetti squash crosswise into 2-inch-wide rings (for longer noodles) OR slice in half lengthwise (for shorter noodles). Scoop out the seeds and strings and rub the flesh with oil (or water) and sea salt."
    },
    {
      "@type": "HowToStep",
      "text": "Lay squash on a baking sheet - cut side down if cut in half lengthwise. Roast until tender - about 40 minutes if roasting “rings” and up to 45 minutes - 1 hour if roasting two large halves. (Time will vary depending on the size of your squash.) Let squash cool slightly and then use a fork to separate the “noodles.\" Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once cashews are soaked, drain and add to a food processor or small blender. Add nutritional yeast, lemon juice, sea salt, garlic powder, and water and blend until smooth and creamy, scraping down sides as needed (~2 minutes). Aim for a mostly puréed mixture with only small bits of cashews intact. Add a bit more water a little at a time if the mixture is having a hard time blending until almost smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more salt for overall flavor, nutritional yeast for cheesiness, and lemon juice for acidity. For even more flavor, you can add some fresh basil or parsley (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large rimmed skillet over medium heat. Once hot, add the oil (or water), shallot, garlic, and a pinch of salt and sauté for 3 minutes, stirring frequently. Turn down heat if garlic is browning."
    },
    {
      "@type": "HowToStep",
      "text": "Add spaghetti squash and toss gently to combine (with tongs if you have them). Sauté for 2-3 minutes, tossing occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "Add the desired amount of cheese sauce. We recommend starting with half and working your way up. You can serve the pasta with any leftover cheese sauce on the side. Continue cooking the cheesy pasta for 2-3 minutes more to combine the pasta and sauce, tossing carefully."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy as is or top with vegan parmesan cheese, marinara sauce, or Vegan Meatballs! You can store leftover cheesy pasta in the refrigerator up to 4 days. We suspect that it would keep in the freezer up to 1 month but haven’t tried it ourselves. (Pasta is usually best fresh.) You can store any leftover cheese sauce covered (separately) in the refrigerator up to 5-7 days."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/cheesy-spaghetti-squash-pasta"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-12-04T17:35:49.560Z"
}
