{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "26",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-11-25T13:59:36.000Z",
  "datePublished": "2019-03-13T14:32:10+00:00",
  "description": "This Cheesy Cottage Pie is chock-full of vegetables in a rich beef gravy, and topped with a layer of super smooth and creamy cheddar mashed potatoes. ",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2019/03/Cheesy-Cottage-Pie-Scoop.jpg",
    "width": 800
  },
  "keywords": "Casserole, Comfort Food",
  "name": "Cheesy Cottage Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "461.77 kcal",
    "carbohydrateContent": "50.82 g",
    "fatContent": "21.38 g",
    "fiberContent": "5.27 g",
    "proteinContent": "19.22 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1036.88 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2.5 lbs. russet potatoes ($0.87)",
    "1 tsp salt, divided ($0.05)",
    "2 Tbsp butter ($0.36)",
    "1/2 cup milk ($0.16)",
    "4 oz. shredded cheddar ($0.85)",
    "2 Tbsp olive oil ($0.23)",
    "1 yellow onion ($0.21)",
    "2 cloves garlic ($0.16)",
    "1/2 lb. ground beef ($2.65)",
    "2 Tbsp all-purpose flour ($0.01)",
    "1 cup beef broth ($0.13)",
    "1/2 Tbsp Worcestershire sauce ($0.03)",
    "1 tsp dried rosemary ($0.10)",
    "1/2 tsp dried thyme ($0.05)",
    "2 cups frozen peas and carrots ($0.26)",
    "1 cup frozen corn ($0.30)",
    "1/2 tsp salt ($0.02)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Peel and chop the potatoes into 1-inch cubes. Rinse them in a colander with cool water, then place them in a pot and add enough fresh water to cover them completely. Add 1/2 tsp salt, place a lid on the pot, and bring it up to a boil over high heat. Boil the potatoes until very tender, about 7-10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the potatoes in a colander and rinse them again briefly with hot water. This removes excess starch and helps give the mashed potatoes a light and fluffy texture."
    },
    {
      "@type": "HowToStep",
      "text": "While the potatoes are draining, add the butter and milk to the pot used to boil the potatoes. Heat the butter and milk over low until the butter is melted and the milk is hot. Add the drained potatoes back to the pot, then mash until smooth. Taste and add salt to taste (about 1/2 tsp). Stir in the shredded cheddar. Set the potatoes aside until you're ready to assemble the casserole."
    },
    {
      "@type": "HowToStep",
      "text": "While the potatoes are cooking, begin to preheat the oven to 350oF and begin the filling for the cottage pie. Dice the onion and mince the garlic. Add the onion and garlic to a large skillet along with the olive oil and sauté over medium until the onions are soft and translucent, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the beef to the skillet and continue to sauté until the beef is fully cooked. Add the all-purpose flour and continue to stir and cook for about 2 minutes more, or until the flour coats the bottom of the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Add the beef broth and stir to dissolve the flour from the bottom of the skillet. The broth will come up to a simmer fairly quickly, at which point it will thicken into a gravy."
    },
    {
      "@type": "HowToStep",
      "text": "Add the Worcestershire sauce, rosemary, thyme, frozen peas and carrots, and frozen corn to the skillet. Heat through, then taste and add salt if needed (I added 1/2 tsp)."
    },
    {
      "@type": "HowToStep",
      "text": "Finally, assemble the cottage pie by transferring the beef and vegetable mixture to the bottom of a 2 quart casserole dish (mine was 9\"x11\"). Top with dollops of the warm cheesy mashed potatoes, spreading it out smooth to cover the surface."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the Cheesy Cottage Pie for 30 minutes in the preheated 350oF oven. If you want extra browning on top, switch the oven to broil after baking and allow it to broil for a few minutes or until the desired browning has been achieved. Let the casserole rest for 5-10 minutes before serving."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://budgetbytes.com/cheesy-cottage-pie"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-25T13:35:47.846Z"
}
