{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "72",
    "ratingValue": "4.78"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-04T17:34:38.873Z",
  "datePublished": "2016-09-16T05:00:03+00:00",
  "description": "Savory, cheesy cauliflower rice and broccoli bake with just 10 ingredients required! The perfect healthy, comforting side dish for holidays and every day!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/11/AMAZING-10-ingredient-Cheesy-Cauliflower-Rice-Broccoli-Bake-Savory-cheesy-HEALTHY-comfort-food-vegan-glutenfree-plantbased-recipe.jpg"
  ],
  "keywords": "cauliflower rice",
  "name": "Cheesy Cauliflower Rice & Broccoli Bake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "231 kcal",
    "carbohydrateContent": "14.5 g",
    "fatContent": "18.4 g",
    "fiberContent": "4.8 g",
    "proteinContent": "6.6 g",
    "saturatedFatContent": "2.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "490 mg",
    "sugarContent": "3.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Side Dish",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 medium-large head cauliflower, shredded or grated into “rice”",
    "2 cups roughly chopped broccoli",
    "1 Tbsp olive, grapeseed or avocado oil",
    "1/4 cup vegan parmesan cheese",
    "~1/2 tsp each sea salt + black pepper (to taste)",
    "4 Tbsp olive, grape seed, or avocado oil (or vegan butter)",
    "5 cloves garlic, minced (3 cloves yield ~2.5 Tbsp)",
    "1/4 cup arrowroot starch (if not gluten free, can sub all purpose flour)",
    "2 cups unsweetened plain almond milk (can sub rice)",
    "1/4 tsp sea salt + black pepper (plus more to taste)",
    "1/4 cup nutritional yeast",
    "1/2 cup vegan parmesan cheese",
    "1 cup cooked chickpeas or quinoa for added protein",
    "1 cup chopped curly kale"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and lightly grease a 9x13 inch (or similar size) baking dish (adjust number/size of pan if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare your cauliflower rice (either with the shredding attachment on your food processor or a box grater). Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly steam your broccoli - just until it has a slight bite - either in the microwave in 45-second increments or on the stovetop using a steamer basket in a saucepan with 1-2 inch of water). Place in refrigerator for later."
    },
    {
      "@type": "HowToStep",
      "text": "Next prepare your sauce. Heat a large, oven-safe skillet over medium heat. Once hot, add oil and minced garlic. Stir and cook for 1-2 minutes, or until light golden brown, then add arrowroot starch and whisk - cook for 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Slowly add almond milk while whisking, then cook for 2 minutes over medium heat, stirring frequently. The sauce will likely look a little clumpy - that’s OK! We’re going to blend it."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a blender, along with 1/4 tsp each salt and pepper (amount as original recipe is written // adjust if altering batch size), nutritional yeast, and vegan parmesan cheese and blend on high until creamy and smooth, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed - you want it pretty well salted + cheesy, so don't be shy with the nutritional yeast, salt, and vegan parmesan cheese."
    },
    {
      "@type": "HowToStep",
      "text": "Return sauce back to skillet from earlier and cook over low heat until warmed and slightly thickened - about 2-3 minutes - whisking occasionally. As it warms back up, it will thicken (see photo). For a thicker sauce, leave it as is. To thin slightly, add almond milk 1 Tbsp at a time until desired consistency is achieved. Turn off heat if it starts bubbling too aggressively or gets too thick."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a separate skillet over medium heat. Once hot, add 1 Tbsp oil (amount as original recipe is written // adjust if altering batch size) and cauliflower rice. Season with salt and pepper and stir to coat. Then cover and let cook/steam for 2 minutes. Remove cover, stir and cook for 1-2 minutes more or until slightly softened. Transfer to a large mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Add the steamed broccoli to the mixing bowl and season liberally with salt, pepper and half of the vegan parmesan cheese (1/4 cup as original recipe is written // adjust if altering batch size). This step is important to infuse plenty of flavor into the dish. Stir to coat. If adding chickpeas or kale, add at this time (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Add all of the sauce to the mixture and stir to coat. Then transfer to your greased baking dish and top with another sprinkle of vegan parmesan cheese."
    },
    {
      "@type": "HowToStep",
      "text": "Cover with foil and bake at 375 degrees F (190 C) for 20 minutes. Then remove foil and bake at 400 degrees F (190 C) for 5-15 minutes more or until bubbly and slightly golden brown. You are looking for golden brown edges and a bubbly center."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from oven and let cool slightly. Then serve as is or with a garnish of more vegan parmesan cheese and/or fresh chopped parsley for some color - optional."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Store leftovers covered in the refrigerator up to 4 days, or in the freezer up to 1 month. Reheat in the oven at 350 degrees F (176 C) until warmed through."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/cheesy-cauliflower-rice-broccoli-bake"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-04T17:34:38.870Z"
}
