{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "52",
    "ratingValue": "4.81"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-04T10:44:30.639Z",
  "datePublished": "2018-08-29T03:00:53+00:00",
  "description": "A vegan version of classic spinach and artichoke dip! Just 10 ingredients required, creamy, cheesy, packed with veggies, and SO delicious!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/06/Spin-Artichoke-Dip-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/06/Spin-Artichoke-Dip-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/06/Spin-Artichoke-Dip-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/06/Spin-Artichoke-Dip-SQUARE-480x270.jpg"
  ],
  "keywords": "Spinach Artichoke Dip",
  "name": "Cheesy Vegan Spinach and Artichoke Dip",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "106 kcal",
    "carbohydrateContent": "9.1 g",
    "fatContent": "6.6 g",
    "fiberContent": "2.9 g",
    "proteinContent": "4.8 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "180 mg",
    "sugarContent": "1.5 g"
  },
  "prepTime": "PT75M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/4 cups raw cashews",
    "2 Tbsp olive oil (sub water if avoiding oil)",
    "5 cloves garlic",
    "3/4 cup chopped shallot",
    "1 1/2 cups unsweetened plain almond milk (or unsweetened rice milk)",
    "5 Tbsp nutritional yeast (adds cheesy flavor)",
    "1/2 tsp each sea salt and black pepper (plus more for spinach and artichokes)",
    "4 cups loosely packed chopped fresh spinach (organic when possible)",
    "1 14-ounce can artichoke hearts (rinsed, drained, dried, and roughly chopped)",
    "2 Tbsp vegan parmesan cheese (plus more for serving)",
    "2 Tbsp gluten-free vegan bread crumbs (we like Ian's brand)",
    "1/4 tsp red pepper flake",
    "Baguette, Pita Chips, or Vegetables"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak cashews for 1 hour in very hot water (uncovered) or in cool water overnight. Then drain and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat a large oven-safe metal or cast-iron skillet over medium heat. Once hot, add oil, garlic, and shallot. Sauté for 1-2 minutes. Then lower heat to medium/low and sauté for 2-3 minutes more or until just golden brown and slightly caramelized. Set off the heat to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Once cashews are soaked and drained, preheat oven to 375 degrees F (190 C). To a blender, add soaked and drained cashews, half of the sautéed garlic and shallot, almond milk, nutritional yeast, sea salt, and pepper and blend into a creamy purée, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed. Dip should be cheesy in flavor and well salted, so consider adding more nutritional yeast for cheesiness or another pinch sea salt for saltiness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the skillet with the remaining shallot and garlic over medium-high heat and add spinach and chopped artichokes. Season with a pinch each salt and pepper and sauté for 4-5 minutes, stirring frequently, to wilt and soften spinach."
    },
    {
      "@type": "HowToStep",
      "text": "Turn heat off and add all of the sauce. Stir to combine. Sprinkle the top with vegan parmesan cheese, bread crumbs (optional), and red pepper flake (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for about 5-8 minutes or until the dip is hot enough to serve. Be careful not to over-bake or the cheese sauce can begin to dry out and lose its creamy texture. Serve hot with assorted vegetables, tortilla chips, crackers, or toasted baguette - tortilla chips being our favorite."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftover dip covered in the refrigerator up to 4-5 days. Reheat in an oven-safe dish at 350 degrees F (176 C) until warmed through (or in the microwave), adding more almond milk as needed if dip has dried out."
    }
  ],
  "recipeYield": "17",
  "sameAs": [
    "https://minimalistbaker.com/cheesy-vegan-spinach-artichoke-dip"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-12-04T10:44:30.639Z"
}
