{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT180M",
  "createdAt": "2022-11-28T12:45:27.000Z",
  "datePublished": "2022-05-17",
  "description": "Try our easy to follow Cherry & Star Anise Glazed Ham recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1811-cherry-and-star-anise-glazed-ham-650x650:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Glazed ham,Ham,Cherry,Roast,Christmas",
  "name": "Cherry & Star Anise Glazed Ham Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Mains",
  "recipeCuisine": "Chinese",
  "recipeId": "8344",
  "recipeIngredient": [
    "2 bay leaves (plus extra, to serve)",
    "dutch carrots, roasted (and steamed beans, to serve)",
    "0.33 cup balsamic vinegar",
    "2 star anise (plus extra, to garnish)",
    "1 ham leg whole (approx. 8kg)",
    "2 tsp salt flakes",
    "1 cup brown sugar, firmly packed",
    "500g frozen cherries"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the glaze, place cherries, sugar, star anise, balsamic, salt, bay leaves and 1 cup water in a large saucepan. Place over medium heat bring to the boil and cook for 12 minutes or until reduced and sticky. Remove and discard star anise. Transfer mixture to a blender and whiz until smooth. Strain through a fine sieve and stand until required."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To prepare the ham, preheat the oven to 160°C. Grease a large, shallow roasting pan. Line with greased foil, then baking paper. Sit the ham on a wire rack over roasting tray. Use a small, sharp knife to cut around ham shank. Add 2 cups water to tray and bake for 20 minutes to help separate the skin from the meat. Remove from oven, then, when cool enough to handle, carefully run knife under the skin, around the edge of the ham. Gently lift off the skin in 1 piece by running your fingers between the rind and the fat. Score ham with a diamond pattern, spacing score marks 5cm apart. Decorate ham crossings with star anise (we used cloves to keep the star anise in place)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Return ham to oven and cook for 45 minutes or until hot and warmed through. Brush with glaze and bake, basting with glaze from pan every 20 minutes, for a further 1 hour and 20 minutes or until ham is caramelised. If ham should begin to burn or colour too much, cover loosely with foil. Fasten shank with paper and string and garnish with bay leaves. Serve with vegetables and any remaining glaze."
    }
  ],
  "recipeNameId": "cherry-and-star-anise-glazed-ham",
  "recipeYield": "24",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/cherry-and-star-anise-glazed-ham"
  ],
  "totalTime": "PT220M",
  "updatedAt": "2022-11-28T05:58:08.996Z",
  "url": "https://www.woolworths.com.au/shop/recipes/cherry-and-star-anise-glazed-ham"
}
