{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "8",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-05T09:25:04.498Z",
  "datePublished": "2015-06-23T05:00:27+00:00",
  "description": "Seriously decadent Vegan Cherry Pie Ice Cream made with just 10 ingredients using simple methods! Real pieces of cherry pie filling and crust swirled throughout.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/06/Cherry-Pie-Ice-Cream-SQUARE.jpg"
  ],
  "keywords": "cherry pie",
  "name": "Cherry Pie Ice Cream",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "334 kcal",
    "carbohydrateContent": "36 g",
    "fatContent": "19 g",
    "fiberContent": "1.1 g",
    "proteinContent": "4.6 g",
    "saturatedFatContent": "8.6 g",
    "servingSize": "1 one-third-cup servings",
    "sodiumContent": "117 mg",
    "sugarContent": "10 g"
  },
  "prepTime": "PT120M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 1/2 cups raw cashews (soaked in cool water for 4-6 hours or overnight, or 1 hour in very hot water, then drained)",
    "1 13.5-ounce can full-fat coconut milk (sub light with less creamy results)",
    "3 Tbsp melted coconut oil or olive oil",
    "1/4 cup maple syrup or agave nectar",
    "1/4 cup organic cane sugar (or sub maple syrup)",
    "1 tsp pure vanilla extract",
    "1 pinch sea salt",
    "3 cups sweet red cherries (pitted and halved // fresh or frozen)",
    "1-2 Tbsp water or orange juice",
    "1-2 Tbsp maple syrup, organic cane sugar, or coconut sugar (to taste)",
    "1 Tbsp flour (for thickening // or sub arrowroot or cornstarch)",
    "1 1/4 cups all-purpose flour",
    "1/4 tsp sea salt",
    "6 Tbsp vegan butter (or semi-firm refined coconut oil that’s scoopable - see notes if liquid)",
    "2-4 Tbsp ice cold water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "The night before, be sure to soak your cashews and place your ice cream maker bowl in the freezer to chill."
    },
    {
      "@type": "HowToStep",
      "text": "To a high speed blender add soaked, drained cashews, coconut milk, oil, maple syrup, cane sugar, vanilla, and sea salt. Blend until creamy and smooth, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust sweetness as needed, adding more cane sugar or maple syrup if desired - I found 1/4 cup maple syrup and 1/4 cup + 1 Tbsp cane sugar to be perfect (amounts as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a mixing bowl and cover. Freeze for 1 1/2 hours to chill."
    },
    {
      "@type": "HowToStep",
      "text": "While the base is chilling, prepare cherry compote by adding cherries, water or orange juice, maple syrup or sugar, and flour to a small saucepan and bringing to a simmer over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "Use a wooden spoon to smash cherries and stir to incorporate. You want to break them down quite a bit so the ice cream scoops easier later on. Turn heat to low and let simmer for 3-5 minutes, or until it resembles cherry pie filling. Remove from heat - set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare crust by adding flour and salt to a blender or food processor (or a mixing bowl). Pulse (or whisk) to combine. Then add cold butter or semi-firm coconut oil and pulse (or use a fork/pastry cutter to mix) until it resembles wet sand, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add cold water 1 Tbsp at a time, intermittently mixing, until a loose dough is formed. Transfer to a floured surface and form into a 1-inch thick disc with your hands, handling as little as possible."
    },
    {
      "@type": "HowToStep",
      "text": "Dust the top of the dough and rolling pin and roll into a large, thin circle the shape of your pie pan, adding more flour as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Gently roll the dough onto the rolling pin from one end to another and transfer to a pie pan (mine is 9 inches, but any similar size will do)."
    },
    {
      "@type": "HowToStep",
      "text": "Drape and form into the pan and crimp the edges, not worrying about appearance as it will be crumbled anyway. Add cherry pie filling and bake on the center rack of your 350 degree oven for 44-47 minutes, or until the filling is bubbly and the crust is golden brown. Set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Assemble your chilled ice cream maker and pour in the chilled ice cream batter. Also add the equivalent of 1 slice of pie with crust (amount as original recipe is written // adjust if altering batch size), crumbling a little. Do this at the beginning of churning to impart more flavor into the base. Then churn until creamy and thick and resembles soft serve - about 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the last 30 seconds of churning, add in the desired amount of remaining pie, crumbling as you add it to ease scooping later. (NOTE: Know that the more pie you add, the more difficult it can be to scoop since the texture becomes more chunky. As an option, you could reserve some to serve with the ice cream instead of adding it to the base.)"
    },
    {
      "@type": "HowToStep",
      "text": "Reserve about 1/4 cup (amount as original recipe is written // adjust if altering batch size) of the crust for serving, if desired. Churn until just incorporated, then turn off machine."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately as soft serve, or transfer ice cream to a freezer-safe container and smooth flat with a spoon."
    },
    {
      "@type": "HowToStep",
      "text": "Cover securely and freeze for 4-5 hours or until firm. Before scooping, set out for 20-30 minutes to soften and use a hot scoop to ease the scooping process. I found this ice cream easier to scoop into balls rather than in rows, since the crust and cherries form little chunks in the ice cream. The extra work is worth the effort!"
    },
    {
      "@type": "HowToStep",
      "text": "Serve with additional pie crust crumbles and a fresh cherry on top (optional) or coconut whipped cream. Keeps in the freezer for up to 1 week, though best within the first few days."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/cherry-pie-ice-cream"
  ],
  "totalTime": "PT170M",
  "updatedAt": "2022-12-05T09:25:04.496Z"
}
