{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths  ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-22T22:53:07.000Z",
  "datePublished": "2022-08-03",
  "description": "With layers of a tart cherry purée, velvety chocolate mousse, and nutty crumble, this is a show-stopper of a dessert. To keep the mousse as fluffy and aerated as possible, be gentle when you stir the chocolate into the egg-white mixture.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/chocol182checho_031:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Mousse,Cherry",
  "name": "Cherry & Chocolate Mousse With Balsamic Glaze Recipe | Woolworths",
  "prepTime": "PT10M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "French",
  "recipeId": "RGR9932",
  "recipeIngredient": [
    "330g cherries, fresh or frozen, pitted",
    "1 tbs icing sugar",
    "90g caster sugar",
    "100g goodquality dark chocolate, 70% cocoa, chopped",
    "0.2 cup goodquality matured balsamic vinegar",
    "3 egg, yolks",
    "0.74 cup double cream",
    "50g unsalted butter",
    "80g plain flour",
    "30g ground hazelnuts",
    "40g demerara sugar",
    "20g vanilla sugar",
    "2 tbs dark chocolate, cut into curls (to decorate)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Blend 100g of the cherries with the icing sugar in a blender or food processor until smooth. Pour the purée into a sieve over a bowl and leave to drain for 5 minutes. Transfer the purée into a small bowl."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the glaze, pour the drained cherry juice into a small saucepan over a mediumlow heat. Add the vinegar and 2 tablespoons of the caster sugar. Simmer, stirring regularly, until the sugar dissolves. Continue until the glaze reduces by two-thirds and is thick and syrupy, about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add 1 tablespoon of the glaze to the cherry purée in the bowl and mix well. Set aside. Add 6 whole cherries to the glaze in the pan, and toss until they are coated, then transfer them to a plate. Set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Melt the chocolate in a heatproof bowl set over a pan of simmering water, stirring until smooth. Do not allow the base of the bowl to touch the water."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the egg yolks and remaining caster sugar in a medium bowl. Beat using a handheld electric whisk until thick, pale, and creamy. In a separate bowl, whisk the cream to form stiff peaks."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Using a silicone spatula, stir a little melted chocolate into the egg mixture, then mix in the rest. Add onethird of the cream and stir. Add the remaining cream, little by little, stirring until no streaks appear."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Divide the remaining, uncoated cherries between the glasses. Add a spoonful of cherry purée to each, then divide the mousse between the glasses. Chill for 1 hour to set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 190°C. Mix all the crumble ingredients in a food processor until combined. Transfer the mix to a lined baking tray in a thin, even layer. Bake for 10 minutes. Allow the crumble to cool for 2minutes, then break into small pieces."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the mousse from the fridge 1015 minutes before serving. Top with the crumble, chocolate curls, and glazed cherries. You can keep the mousse, covered in the fridge without toppings, for up to 2 days."
    }
  ],
  "recipeNameId": "cherry-and-chocolate-mousse-with-balsamic-glaze",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/cherry-and-chocolate-mousse-with-balsamic-glaze"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-22T12:35:59.660Z",
  "url": "https://www.woolworths.com.au/shop/recipes/cherry-and-chocolate-mousse-with-balsamic-glaze"
}
