{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-03T11:06:35.167Z",
  "creator": {
    "@type": "Person",
    "name": "Molly Yeh"
  },
  "dateCreated": "2022-10-07T12:00:00-04:00",
  "dateModified": "2022-10-11T09:09:25-04:00",
  "datePublished": "2022-10-07T12:00:00-04:00",
  "description": "This recipe from Molly Yeh&#x27;s cookbook, Home Is Where the Eggs Are, is an incredibly cute twist on the cozy classic — chicken noodle soup. The adorable (and delicious) egg noodle stars make this dish feel extra special each time.  ",
  "headline": "Chicken and Stars Soup",
  "HowtoTip": {
    "text": "Storage: I store the soup all together and look forward to the next day when the soup will taste even better and the noodles will be even softer. I recognize that not everyone loves a mushy noodle, though, so if you’re in this category and you expect to have leftovers, cook the noodles separately in salted boiling water to your desired doneness and store the drained leftover noodles separately as well. Leftovers will keep in the fridge for up to 3 days or in the freezer for up to 3 months.From Home is Where the Eggs Are by Molly Yeh. Copyright © 2022 by Molly Rebecca Yeh. Reprinted by permission of William Morrow, an imprint of HarperCollins Publishers."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FCookbook%20Club%20Photos%20%2FHome%20is%20Where%20the%20Eggs%20Are%20%2Fchicken_and_stars_soup_Day4_HIWTEA-2233"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FCookbook%20Club%20Photos%20%2FHome%20is%20Where%20the%20Eggs%20Are%20%2Fchicken_and_stars_soup_Day4_HIWTEA-2233"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FCookbook%20Club%20Photos%20%2FHome%20is%20Where%20the%20Eggs%20Are%20%2Fchicken_and_stars_soup_Day4_HIWTEA-2233"
    }
  ],
  "keywords": [
    "Cookbook Recipe",
    "Modern Comfort Food",
    "recipe",
    "chicken",
    "pasta",
    "Main Dish",
    "soup",
    "dinner",
    "lunch",
    "team:food",
    "platform:newsfeeds",
    "platform:search",
    "platform:social",
    "course:main dish",
    "dishtype:soup",
    "mainingredients:poultry",
    "mainingredients:pasta",
    "mainingredients:chicken",
    "meal:lunch",
    "meal:dinner"
  ],
  "name": "Chicken and Stars Soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "627 cal",
    "carbohydrateContent": "46.9 g",
    "cholesterolContent": "0 mg",
    "fatContent": "29.6 g",
    "fiberContent": "5.4 g",
    "proteinContent": "41.5 g",
    "saturatedFatContent": "8.5 g",
    "servingSize": "Serves 6",
    "sodiumContent": "1061.6 mg",
    "sugarContent": "4.4 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 (3 1/2 pound) whole chicken",
    "2 medium yellow onions, 1 quartered and 1 chopped",
    "2 medium parsnips, trimmed, 1 cut into large chunks and 1 cut into 1/4-inch slices",
    "3 large celery stalks, 1 cut into large chunks and 2 cut into 1/4-inch slices",
    "2 garlic cloves, peeled and smashed",
    "2 thyme sprigs",
    "6 flat-leaf parsley springs, 3 whole and 3 chopped",
    "12 dill sprigs, 6 whole and 6 chopped, plus more for serving",
    "2 bay leaves",
    "1 teaspoon whole black peppercorns, plus ground black pepper",
    "Kosher salt",
    "Zest and juice of half a lemon",
    "A few passes of freshly grated nutmeg",
    "2 cups all-purpose flour, plus more for dusting",
    "1 1/2 teaspoons kosher salt",
    "1/4 teaspoon freshly grated nutmeg",
    "2 large eggs",
    "1/4 cup water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large pot, combine the chicken, quartered onion, parsnip chunks, carrot chunks, celery chunks, garlic, thyme, the 3 whole parsley sprigs, the 6 whole dill sprigs, the bay leaves, and the peppercorns. Add cold water to cover and come up just below the top of the pot, about 5 quarts. Bring to a boil and then reduce the heat to simmer at a low bubble, uncovered, until the chicken is very tender, about 1 1/2 hours (or longer if you have the time — up to 6 hours, topping off with more water if the stock dips below the chicken and veggies), skimming off any scum (there won’t be much) and, if desired, some fat."
    },
    {
      "@type": "HowToStep",
      "text": "While the stock simmers, make the stars: In a medium bowl, whisk together the flour, salt, and nutmeg, add the eggs and water and mix to form a dough. Knead for 5 to 7 minutes, until smooth. Cover with plastic wrap or a damp towel and let rest for 20 minutes. On a floured surface, roll out the dough to 1/8 inch thick, dusting with more flour as needed to prevent sticking, and cut out stars with a bite- size star- shaped cookie cutter (or other small cookie cutter!). Dust the stars with flour so they don’t stick together and set them aside on a sheet pan. Reroll the scraps and repeat to use up the rest of the dough. (If you don’t have the patience for all these cutouts, you can also just use a knife to cut long skinny noodles.) Set aside until ready to use."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully strain the stock, discarding all of the solids except for the chicken. You should have 3 1/2 to 4 1/2 quarts of stock. Set the chicken aside to cool briefly while you put together the rest of the soup. Return the strained stock to the pot and bring it to a simmer. Add the chopped onion, sliced parsnip, sliced carrots, sliced celery, chopped parsley, chopped dill, noodles, and 1 tablespoon salt and simmer, covered, until the vegetables and noodles are tender, 30 to 40 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, pull the chicken off the bones and chop it into bite-size pieces. Season the chicken with salt and, when the vegetables and noodles are tender, add it to the soup along with the lemon zest and juice, nutmeg, and ground black pepper. Taste and add more salt if needed. This is important: the amount of salt in a chicken soup can mean the difference between unappetizing chicken tea and the elixir of bubbe love that it should be. So don’t skip this step, and don’t rush it either. Taste your soup. If it doesn’t make you smile reflexively, add more salt, about a 1/2 teaspoon of it, and give it a few good stirs so it can dissolve. Taste and repeat as needed until it tastes good."
    },
    {
      "@type": "HowToStep",
      "text": "Garnish with fresh dill and serve."
    }
  ],
  "recipeYield": 6,
  "sameAs": [
    "https://thekitchn.com/molly-yeh-chicken-and-stars-soup-23457850"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FCookbook%20Club%20Photos%20%2FHome%20is%20Where%20the%20Eggs%20Are%20%2Fchicken_and_stars_soup_Day4_HIWTEA-2233",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-03T11:06:35.165Z",
  "url": "https://www.thekitchn.com/molly-yeh-chicken-and-stars-soup-23457850"
}
