{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-30T04:19:25.172Z",
  "datePublished": "2016-12-07T08:50:26+00:00",
  "description": "These vegan breakfast enchiladas are filled with a savory hash of chickpeas, avocados, and crispy potatoes, smothered in spicy chipotle sauce, and served up with luscious avocado crema.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2016/11/chickpea-avocado-breakfast-enchiladas-5.jpg"
  ],
  "keywords": "chickpeas, vegan enchiladas",
  "name": "Chickpea Avocado Breakfast Enchiladas",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "472 kcal",
    "carbohydrateContent": "66.7 g",
    "fatContent": "20.8 g",
    "fiberContent": "14.1 g",
    "proteinContent": "11 g",
    "saturatedFatContent": "3.8 g",
    "servingSize": "1 serving",
    "sodiumContent": "804 mg",
    "sugarContent": "9.6 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 tablespoons olive oil",
    "1 medium (12 ounce) russet potato, (scrubbed and diced)",
    "1 medium onion, (diced)",
    "2 teaspoons ground cumin",
    "1 teaspoon ground coriander seed",
    "1 green bell pepper, (diced)",
    "1 jalapeño pepper, (seeded and minced (optional)",
    "1 14-ounce can chickpeas, drained and rinsed",
    "3 garlic cloves, (minced)",
    "1 ripe Avocado From Mexico (pitted and diced)",
    "1/4 cup chopped fresh cilantro",
    "1 tablespoon lime juice",
    "Salt and pepper to taste",
    "1 14-ounce can tomato puree",
    "3 tablespoons adobo sauce, (from a can of chipotle peppers)",
    "12 to 14 corn tortillas",
    "1 ripe avocado",
    "1/2 cup unsweetened soy or almond milk",
    "2 tablespoons lime juice",
    "Salt to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the filling by coating the bottom of a large skillet with oil and placing it over medium heat. Add potato, onion, cumin and coriander. Cook for about 15 minutes, until potatoes begin to soften and brown, flipping occasionally. Add bell pepper, jalapeño, and chickpeas. Cook until bell peppers are lightly browned and potatoes are fully softened. Add garlic and cook about 1 minute more, until very fragrant. Remove from heat and add avocado, cilantro, and lime juice. Flip gently a few times to incorporate the ingredients. Season with salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Make the sauce by stirring tomato puree and adobo sauce together in a small bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350°. Ladle about a third of the sauce into the bottom of a 9 x 13 inch baking dish (or a couple of smaller baking dishes). Lightly coat the bottom of a large skillet with oil and place it over medium heat. Place a tortilla into the skillet to warm it up, allowing it to sit in skillet for 30 seconds to 1 minute. Remove the tortilla from the skillet and place it onto a work surface. Spoon 3 to 4 tablespoons of potato mixture into the tortilla and roll. Place rolled tortilla, seam side down, into baking dish and spoon sauce over top, spreading around to coat the entire outside of the tortilla. Repeat until all tortillas are used."
    },
    {
      "@type": "HowToStep",
      "text": "Place the baking dish into the oven and bake until the sauce is bubbly, about 25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the enchiladas bake, place all ingredients for the avocado crema into a blender and blend until smooth and creamy. Add a splash more milk if needed."
    },
    {
      "@type": "HowToStep",
      "text": "When the enchiladas are done baking, divide them onto plates and top with avocado crema, along with a sprinkling of fresh cilantro, if desired. Serve."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/chickpea-avocado-breakfast-enchiladas"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-11-30T04:19:25.171Z"
}
