{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "53",
    "ratingValue": "4.99"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-04T03:08:25.646Z",
  "datePublished": "2016-04-03T10:39:34+00:00",
  "description": "Chickpea flour Tofu. 10 min Non soy tofu made with Chickpea flour or Besan / gram flour. Easy Burmese tofu. Vegan Gluten-free Soy-free Nut-free Recipe. Makes about 3 cups of cubed chickpea tofu.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2016/04/chickpea-tofu-3541.jpg",
    "https://www.veganricha.com/wp-content/uploads/2016/04/chickpea-tofu-3541-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2016/04/chickpea-tofu-3541-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2016/04/chickpea-tofu-3541-480x270.jpg"
  ],
  "name": "Chickpea Flour Tofu Recipe",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "117 kcal",
    "carbohydrateContent": "17 g",
    "fatContent": "2 g",
    "fiberContent": "3 g",
    "proteinContent": "6 g",
    "servingSize": "1 serving",
    "sodiumContent": "315 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "how to",
  "recipeCuisine": "fusion",
  "recipeIngredient": [
    "1 cup chickpea flour/ garbanzo bean flour (use 1 1/4 cup besan/ gram flour)",
    "1/2-3/4 tsp salt",
    "1/4 tsp garlic powder",
    "1/4 tsp turmeric (optional, for color)",
    "1/4 tsp cumin or garam masala (optional)",
    "1 3/4 cup water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Grease a bread pan or line with parchment and keep ready. (9 by 5 rectangle or any similar rectangle or smaller square pan)."
    },
    {
      "@type": "HowToStep",
      "text": "In a bowl whisk all the ingredients under chickpea tofu until there are no lumps, or use a blender.(or you can add the ingredients directly to the pan and whisk to combine). I use a blender for quick and smooth batter."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the chickpea flour mixture into a deep saucepan. Cook over medium heat. Stir continuously. The mixture will start to get lumpy as the pan heats up (see video) and then thicken evenly and considerably. 4 to 5 mins."
    },
    {
      "@type": "HowToStep",
      "text": "Once the mixture is evenly thick and stiff, keep cooking for another 2 minutes so the chickpea flour gets cooked through. Also tap the spoon or spatula to drop the mixture stuck to it to the pan. If the mixture is starting to brown, reduce the heat to medium low. You can taste test the mixture at this point carefully, to ensure that there is no raw chickpea flour flavor and adjust salt if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the mixture into the prepared loaf pan or parchment and even it out using a spatula or another parchment if needed. Let it cool, then refrigerate for atleast an hour to set."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the set slab from the pan. Slice into cubes. Store in an airtight container refrigerated for upto 4 days. The tofu can leak some moisture while it sits. drain and use."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/chickpea-flour-tofu"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-12-04T03:08:25.645Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=nTETZn4sXtQ",
    "description": "Chickpea flour Tofu. No soy! 10 mins active time.\nFULL RECIPE: https://www.veganricha.com/2016/04/chickpea-flour-tofu.html\nMY BOOKS: https://veganricha.com/books\n\n\nMake your own Chickpea flour Tofu. 10 min Non soy tofu made with Chickpea flour or Besan / gram flour.  Vegan Gluten-free Soy-free Grainfree Nut-free Recipe\n\nBurmese (chickpea) tofu is made by cooking split pea flour or chickpea flour in several ways. I make my chickpea tofu with chickpea flour and with less liquid so it is a sturdier, and is a quick version of Burmese tofu. This recipe makes about 2.5 to 3 cups cubed tofu which can be stored for a few days refrigerated.\n\nThe tofu can also be made with Chickpea flour (which is ground garbanzo beans (white chickpeas), pure besan / gram flour (which is flour of brown chickpeas (kala chana) or split brown chickpeas (chana dal)), or mixed flour besan which can have 2 different types of chickpea / split pea flour.  Each of the flours need different amounts of liquid. Besan (gram flour) is also ground finer than white chickpea flour. Depending on the flour used, the resulting tofu cubes might be soft or firm. Use less water for firmer and more water for softer chickpea tofu. \n\nChickpea flour is mixed with water to form a smooth batter. The batter thickens into a thick custard like consistency which sets and can be easily sliced. \n\nMusic: Serini- summer is over\n\nFind us:\nMy blog: http://veganricha.com\nFacebook: http://www.facebook.com/VeganRicha\nInstagram: http://instagram.com/veganricha\nTwitter: http://www.twitter.com/veganricha\nPinterest: https://www.pinterest.com/veganricha/\n\n#veganricha #easyveganrecipes #vegan #veganism #veganrecipes #cooking #chickpeatofu #chickpeaflourtofu",
    "duration": "PT1M25S",
    "embedUrl": "https://www.youtube.com/embed/nTETZn4sXtQ?feature=oembed",
    "name": "CHICKPEA FLOUR TOFU - Soyfree Tofu | Vegan Richa Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/nTETZn4sXtQ/hqdefault.jpg",
    "uploadDate": "2019-01-15T01:31:56+00:00"
  }
}
