{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "28",
    "ratingValue": "4.97"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-12-04T18:48:20.616Z",
  "datePublished": "2015-11-19T15:00:52+00:00",
  "description": "Chickpea Veggie Loaf with spices and a spicy bbq glaze. Chickpea Cannellini bean Veggie \"meat\" loaf for Thanksgiving and the holidays. Easy and delicious. Vegan Recipe. Makes 1 loaf. I use 9 by 5 inch pan, Nut-free, Soy-free, Can be gluten-free",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2015/11/chickpea-veggie-loaf-butternut-pecan-salad-1310-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/11/chickpea-veggie-loaf-butternut-pecan-salad-1310-1-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/11/chickpea-veggie-loaf-butternut-pecan-salad-1310-1-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/11/chickpea-veggie-loaf-butternut-pecan-salad-1310-1-480x270.jpg"
  ],
  "keywords": "chickpea loaf, chickpea meatloaf, meatless meatloaf, vegan meatloaf, vegetarian meatloaf",
  "name": "Chickpea Veggie Loaf - Vegan Meatloaf Recipe",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "446 kcal",
    "carbohydrateContent": "79 g",
    "fatContent": "7 g",
    "fiberContent": "16 g",
    "proteinContent": "19 g",
    "servingSize": "1 serving",
    "sodiumContent": "673 mg",
    "sugarContent": "22 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Main",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 tsp oil",
    "1/2 red onion chopped (3/4 cup)",
    "4 cloves of garlic finely chopped",
    "1/2 cup finely chopped celery (or use other veggies)",
    "1/4 cup chopped red bell pepper (or carrots or both)",
    "2 tbsp dried cranberries (optional)",
    "15 oz can chickpeas (or 1.5 cups cooked)",
    "15 oz can cannellini beans (or other white beans or use more chickpeas or cooked lentils)",
    "2 tbsp chopped fresh cilantro",
    "2 tbsp chopped fresh parsley",
    "1 tsp ground cumin",
    "2 to 4 tbsp my soy free barbecue sauce",
    "1.5 tsp lemon juice",
    "1 tbsp chia seed meal (or 1.5 Tbsp flax seed meal)",
    "1 Tbsp Tahini (optional)",
    "1/4 to 1/2 tsp black pepper",
    "1/4 to 1/2 tsp cayenne (or chipotle pepper powder)",
    "1 tsp dried thyme (or rosemary or 2 tsp fresh)",
    "1/2 tsp dried sage",
    "1/2 to 3/4 tsp salt or to taste",
    "1/2 cup or more breadcrumbs or a mix of half oats and half breadcrumbs (for gf use coarsely ground oats or gluten-free breadccrumbs)",
    "3 tbsp bbq sauce",
    "1 tsp hot sauce",
    "1 tbsp maple syrup",
    "2 tsp ketchup",
    "a generous dash of freshly ground black pepper",
    "1/4 tsp smoked paprika"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat a skillet over medium heat. Add oil, onions and garlic and pinch of salt. Cook until translucent. Add celery, peppers, cranberries and cook for 3 minutes, * You can cook the veggies without oil. Cook onions and garlic in a splash of broth or water until translucent, then add other veggies."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the chickpeas and beans really well. In a food processor, process the chickpeas, beans, cilantro, parsley and half of the cooked veggie mixture. Pulse, process until the mixture is half mashed and half coarsely chunky. You can add a handful of greens in as well at this step."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a bowl. Mix in the chia seed meal into the bbq sauce + lemon juice in a small bowl and let it sit for a minute. Add spices, tahini, bbq sauce mixture, leftover veggies to the beans bowl. Mix in. Add in the breadcrumbs and mix in. The mixture should be like a veggie burger mixture. If too wet, add more breadcrumbs. If too dry, add a tbsp of aquafaba (chickpea brine). or 1 tsp chia/ flax seed meal mixed in 1 tbsp water. Taste the mixture and adjust salt, spice, seasoning."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to parchment lined loaf pan with parchment sheet hanging out to make it easy to remove the loaf. Even it out(by lightly pressing. too much pressing will make a mashed texture loaf ) If you don't have a pan, use a parchment lined baking sheet and shape into a rectangular log."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the glaze by mixing everything and spread over the loaf."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the loaf with parchment, bake at pre-heated 400 degrees F / 200oc for 20 minutes. Remove the cover and continue to bake for another 15 to 25 minutes, till toothpick from the center comes out clean. Bake longer for taller loaf or if you want crispier edges."
    },
    {
      "@type": "HowToStep",
      "text": "Cool for 15 minutes, then remove from the pan. Cool almost completely and slice with a serrated knife."
    },
    {
      "@type": "HowToStep",
      "text": "Or shape into balls and bake for 15 minutes, then flip and bake for another 10-15 minutes. Serve with cranberry sauce, gravy, mashed potatoes or other sides of choice."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/2015/11/chickpea-veggie-loaf.html"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-04T18:48:20.615Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=Q70m223OJAs",
    "description": "Chickpea Veggie Loaf Recipe\n\nGet the WRITTEN RECIPE here - https://www.veganricha.com/chickpea-veggie-loaf/\n\nSUBSCRIBE HERE: https://www.youtube.com/veganricharecipes?sub_confirmation=1\n\nChickpea Veggie Loaf with spices and a spicy bbq glaze. Chickpea Cannellini bean Vegan Meatloaf for Thanksgiving and the holidays or any time. Easy and delicious. Vegan Recipe. Nut-free, Soy-free, Can be gluten-free.\n\nCook some veggies. Pulse the chickpeas and beans, add spices, shape and bake. You can also shape the mixture into fat balls or patties and bake. Use your favorite glaze or my spicy bbq sauce glaze. Serve with cranberry sauce or gravy, some mashed potatoes, other sides and the menu is done! I used up some leftover slices in tacos with guacamole and sprinkled with chipotle pepper.\n\n******MORE THANKSGIVING MAINS RECIPES FROM THE BLOG******\n\nCAULIFLOWER STEAKS WITH MUSHROOM GRAVY: https://www.veganricha.com/cauliflower-steaks-with-mushroom-gravy/\n\nVEGAN LASAGNA BECHAMEL WITH SWEET POTATO AND CAULIFLOWER: https://www.veganricha.com/lasagna-bechamel-with-sweet-potato-and/\n\nVEGAN VEGGIE LASAGNA: https://www.veganricha.com/vegan-veggie-lasagna-for-2/\n\nCOOKBOOKS BY RICHA HINGLE (VEGAN RICHA): https://www.veganricha.com/mybooks/\n\nConnect with me on Social Media:\n\nFACEBOOK: https://www.facebook.com/VeganRicha\n\nINSTAGRAM: https://instagram.com/veganricha\n\nPINTEREST: https://www.pinterest.com/veganricha/\n\nTWITTER: https://twitter.com/veganricha\n\nMusic: epidemic sound \n#veganmeatloaf #chickpealoaf #veganricha #easyveganrecipes",
    "duration": "PT1M28S",
    "embedUrl": "https://www.youtube.com/embed/Q70m223OJAs?feature=oembed",
    "name": "CHICKPEA VEGGIE LOAF RECIPE – VEGAN MEATLOAF - Nutfree | Vegan Richa Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/Q70m223OJAs/hqdefault.jpg",
    "uploadDate": "2020-08-03T19:39:00+00:00"
  }
}
