{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T13:00:52.967Z",
  "datePublished": "2013-04-11T07:57:33+00:00",
  "description": "You see how I used whole asparagus spears in the photo? Don’t do that. They’re hard to cut and your omelet will get torn up in the process. It may look less fancy, but I recommend cutting the asparagus into pieces before you cook it.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2013/04/chickpea-flour-omelets-sm.jpg"
  ],
  "keywords": "vegan omelet",
  "name": "Chickpea Flour Omelets with Asparagus",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "195 kcal",
    "carbohydrateContent": "26.8 g",
    "fatContent": "5 g",
    "fiberContent": "7.5 g",
    "proteinContent": "14.6 g",
    "servingSize": "1 serving",
    "sodiumContent": "438.9 mg",
    "sugarContent": "5.6 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "8 ounces asparagus (ends trimmed and stalks cut into 1-inch pieces)",
    "1/2 cup superfine chickpea flour (also called besan or gram flour)",
    "2 tablespoons nutritional yeast",
    "1 tablespoon ground flax or chia seeds",
    "1 teaspoon dried basil",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon turmeric",
    "1/4 teaspoon salt (or to taste)",
    "1/8 teaspoon black salt kala namak (optional, but gives an “eggy” flavor)",
    "generous grinding of black pepper to taste",
    "3/4 cup water",
    "1 tablespoon fresh chives (or 1 tablespoon minced onion, snipped)",
    "1/2 green or red bell pepper (chopped)",
    "1 small tomato (chopped, or handful of halved grape tomatoes, optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cook the asparagus until it is tender in any way you like. (I roasted it in a 425F oven for about 10 minutes.) Sprinkle with salt to taste, if you like, and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While the asparagus is cooking, mix the chickpea flour with all dry ingredients (nutritional yeast through black pepper) in a medium mixing bowl. Add the water, chives, and bell pepper. Allow to stand and thicken while the asparagus cooks or about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Check the batter and add water by the tablespoon if it is not a pourable consistency. It should be like thick pancake batter."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat a large non-stick or cast iron skillet over high heat. Once it’s hot, reduce the heat to medium and pour half of the batter (about 2/3 cup) into the center of the skillet. Smooth it with the back of a spoon until it’s a circle about 6 inches in diameter. If you’re using tomatoes, sprinkle half of them on top. Cover tightly and cook for 4 minutes or until the top begins to look bread-like rather than liquidy."
    },
    {
      "@type": "HowToStep",
      "text": "Add half the asparagus to one side of the omelet and fold the other half over it. Cover and cook for another 3-4 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat with remaining ingredients for one more omelet. Serve warm."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://blog.fatfreevegan.com/2013/04/chickpea-flour-omelets-with-asparagus.html"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-02T13:00:52.967Z"
}
