{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "42",
    "ratingValue": "4.81"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-01T03:39:34.069Z",
  "datePublished": "2013-05-02T16:43:00+00:00",
  "description": "A smoky, sweet sweet potato patty with tons of flavor and texture!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2013/05/ChipotleSPBurgerdressed.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/05/ChipotleSPBurgerdressed-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/05/ChipotleSPBurgerdressed-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/05/ChipotleSPBurgerdressed-480x270.jpg"
  ],
  "name": "Chipotle Sweet Potato Burgers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "693.28 kcal",
    "carbohydrateContent": "91.95 g",
    "fatContent": "29.7 g",
    "fiberContent": "20.43 g",
    "proteinContent": "18.53 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1268.33 mg"
  },
  "prepTime": "PT50M",
  "recipeIngredient": [
    "1 lb. sweet potato ($1.00)",
    "1/2 cup frozen corn kernels ($0.31)",
    "1 15oz. can black beans ($1.19)",
    "1 whole chipotle pepper in adobo sauce ($0.33)",
    "1/2 cup cornmeal, divided ($0.12)",
    "1/4 tsp garlic powder ($0.02)",
    "1/2 tsp ground cumin ($0.03)",
    "1/2 tsp salt ($0.03)",
    "1/4 bunch fresh cilantro (optional) ($0.19)",
    "1 Tbsp cooking oil (for frying) ($0.02)",
    "4 wheat rolls ($1.42)",
    "1 avocado ($1.19)",
    "1/4 cup mayonnaise (optional) ($0.45)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash the sweet potato well and then poke it several times with a fork so that steam can escape while it cooks."
    },
    {
      "@type": "HowToStep",
      "text": "To cook it in the microwave: wrap it loosely with a paper towel, set it on a microwave safe plate, and microwave on high for five minutes. Carefully squeeze the potato to make sure it is soft all the way through. If it is not, microwave longer, in one minute increments, until it is soft all the way through (mine took 8 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Took cook it in the oven: heat the oven to 400 degrees and then bake the potato for 45-60 minutes, or until it is soft all the way through (either directly on the oven rack or on a baking sheet)."
    },
    {
      "@type": "HowToStep",
      "text": "While the sweet potato is cooling, prepare the rest of the ingredients. Place the frozen corn in a large bowl. Drain and rinse the black beans. Allow as much excess water to drain away as possible, and then add them to the bowl with the corn. Roughly chop the cilantro leaves and then add them to the bowl, along with half of the cornmeal (1/4 cup), garlic powder, cumin, and salt. Take one chipotle pepper out of the can, mince it, and then add it to the bowl along with about one teaspoon of the adobo sauce from the can."
    },
    {
      "@type": "HowToStep",
      "text": "Once the sweet potato is cool enough to handle, scoop out the flesh and add it to the bowl with the rest of the ingredients. Stir everything together and then either use a potato masher or the back of a fork to slightly mash the beans. Cover and chill the mixture for 30 minutes to allow the cornmeal to absorb some of the moisture."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the sweet potato mixture into four (or six) portions and shape each into a patty, approximately 3/4 inch thick. Use the remaining 1/4 cup of cornmeal to coat the outside of the patties. This will provide a nice crunch to the burger."
    },
    {
      "@type": "HowToStep",
      "text": "To cook the patties in a skillet, heat 1/2 tablespoon of cooking oil in a heavy bottomed skillet over medium heat. When the oil is hot (it should look wavy on the surface), add two of the patties. Cook for about 5 minutes on each side or until the patties are golden brown. Add more oil and cook the remaining two patties. Remember to turn the patties carefully as they are quite soft and can fall apart."
    },
    {
      "@type": "HowToStep",
      "text": "To cook the patties in the oven, Preheat the oven to 400 degrees. Line a baking sheet with foil and then coat lightly with non-stick spray. Place the patties on the foil and then spritz the top of the patties lightly with non-stick spray (this will help it crisp up). Bake for 25 minutes, or until the patties are heated through and the bottoms are golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Spread one tablespoon of mayonnaise on each bun and top with a chipotle sweet potato patty. Slice the avocado and place 1/4 of the slices on top of each burger. Top with extra cilantro leaves, if desired."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/chipotle-sweet-potato-burgers"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-01T03:39:34.068Z"
}
