{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "25",
    "ratingValue": "4.45"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-25T10:17:13.542Z",
  "datePublished": "2021-07-21T07:48:05+00:00",
  "description": "This easy one-pot chipotle lime chicken and rice is tangy, smoky, spicy, and incredibly delicious. Makes a great main dish or meal prep!",
  "image": {
    "@type": "ImageObject",
    "height": 900,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2021/07/Chipotle-Lime-Chicken-and-Rice-skillet.jpg",
    "width": 1200
  },
  "keywords": "chicken and rice, chipotle lime, One Pot",
  "name": "Chipotle Lime Chicken and Rice",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "393 kcal",
    "carbohydrateContent": "48 g",
    "fatContent": "9 g",
    "fiberContent": "3 g",
    "proteinContent": "30 g",
    "servingSize": "1 serving",
    "sodiumContent": "887 mg"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "Southwest",
  "recipeIngredient": [
    "1.5 tsp chipotle powder ($0.15)",
    "1 tsp ground cumin ($0.10)",
    "1/2 tsp garlic powder ($0.05)",
    "1/2 tsp onion powder ($0.05)",
    "1/2 tsp salt ($0.05)",
    "1 lime ($0.50)",
    "2 boneless, skinless chicken breast (about 1 lb.) ($5.79)",
    "1 Tbsp cooking oil ($0.04)",
    "1 yellow onion ($0.32)",
    "1 15oz. can diced tomatoes* ($0.59)",
    "1 cup chicken broth ($0.13)",
    "1 cup long grain white rice ($0.62)",
    "2 green onions, sliced ($0.22)",
    "1 oz. Cotija cheese (optional) ($0.55)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine the chipotle powder, cumin, garlic powder, onion powder, and salt in a bowl. Squeeze 2 Tbsp juice from the lime into a separate bowl (this should be about half a lime, save the other half to cut into wedges for garnish)."
    },
    {
      "@type": "HowToStep",
      "text": "Use a rolling pin or a mallet to gently pound the chicken breast to an even thickness (about 3/4 -inch thick). Use half of the prepared spice mix to coat both sides of the chicken pieces (reserve the other half of the spices for later)."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the cooking oil in a large deep skillet over medium. Once hot, add the chicken and cook for a few minutes on each side, or until browned. The chicken does not need to be fully cooked, just browned on both sides. It will continue to cook with the rice."
    },
    {
      "@type": "HowToStep",
      "text": "While the chicken is cooking, dice the onion. Remove the browned chicken from the skillet to a clean plate. Add the diced onion to the skillet and sauté until softened. Add the remaining spices and sauté for one minute more."
    },
    {
      "@type": "HowToStep",
      "text": "Add the diced tomatoes (with juices), rice, chicken broth, and lime juice to the skillet with the onions. Stir to combine and dissolve any browned bits from the bottom of the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Add the browned chicken back to the skillet. Place a lid on the skillet, turn the heat up to medium high, and allow the liquid to come up to a boil."
    },
    {
      "@type": "HowToStep",
      "text": "Once it reaches a boil, turn the heat down to low, and allow the chicken and rice to simmer on low for 15 minutes. After 15 minutes, turn the heat off and let the skillet rest, without lifting the lid, for an additional 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Finally, remove the lid, transfer the chicken to a cutting board. Fluff the rice to stir the tomato and onion back in. Slice the chicken then place it on top of the rice. Sprinkle with slice green onion and Cotija cheese. Add any remaining lime wedges, and serve!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/chipotle-lime-chicken-and-rice"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-11-25T10:17:13.541Z"
}
