{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-24T08:45:23.000Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Chocolate Amaretti Roulade recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp492choama_021:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Roulade,Baking,Chocolate",
  "name": "Chocolate Amaretti Roulade Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "French",
  "recipeId": "RGR35489",
  "recipeIngredient": [
    "6 large eggs, separated",
    "150g caster sugar",
    "50g cocoa powder",
    "icing sugar (to dust)",
    "1.2 cup double cream",
    "2-3 tbs Amaretto",
    "20 Amaretti biscuits (crushed)",
    "2 Amaretti cookies",
    "50g dark chocolate"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 180°C. Line the Swiss roll tin with baking parchment. Put the egg yolks and sugar in a large heatproof bowl set over a pan of simmering water, and whisk with an electric hand whisk until very pale, thick, and creamy. This will take about 10 minutes. Remove from the heat. Put the egg whites in a mixing bowl and whisk with an electric hand whisk (and clean beaters) until soft peaks form."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Sift the cocoa powder into the egg yolk mixture and very gently fold in along with the egg whites. Pour into the tin and smooth into the corners. Bake for 20 minutes, or until just firm to the touch. Carefully turn out on to a sheet of baking parchment well dusted with icing sugar. Remove the tin, but leave the top parchment, and allow to cool for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the cream in a mixing bowl and whisk with an electric hand whisk until soft peaks form. Peel the top parchment from the sponge, trim the sides to neaten them, then drizzle over the Amaretto or brandy. Spread with the cream, scatter with the crushed Amaretti biscuits, then grate over most of the chocolate."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Starting from one of the short sides, roll the roulade up, using the parchment to help keep it tightly together. Place on a serving plate with the join underneath. Crumble over the extra biscuits, grate over the remaining chocolate, and dust with a little icing sugar."
    }
  ],
  "recipeNameId": "chocolate-amaretti-roulade",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/chocolate-amaretti-roulade"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-24T08:02:57.254Z",
  "url": "https://www.woolworths.com.au/shop/recipes/chocolate-amaretti-roulade"
}
