{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - quinn"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-08-03",
  "description": "Subtly sweet milk buns with a touch of cocoa powder.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/om57gkmfiubnom65q5kj:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Bun",
  "name": "Chocolate Milk Buns Recipe | Woolworths",
  "prepTime": "PT150M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Australian",
  "recipeId": "a0K2y000000pFixEAE",
  "recipeIngredient": [
    "243g plain flour",
    "12g cocoa powder",
    "185ml milk",
    "3g instant yeast",
    "30g sugar",
    "1 tsp salt",
    "20g butter"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Weigh out 20g of butter and set aside to soften (do not melt the butter)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Measure/weigh dry ingredients and combine together. Then add the milk."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Combine ingredients together (at this stage, we do not include the butter) until a rough, somewhat sticky dough forms."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Scoop dough out onto a clean bench (do not flour the bench or dough at this stage as it will become less sticky and easier to work with as you knead it). If the dough sticks a lot to the bench, use a spatula or dough scraper to scrape the dough back together into a ball."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Knead dough for about 10 minutes or until you feel that the gluten has formed. This usually occurs when the dough starts to feel smooth and elastic."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Flatten dough out into a small circle (diameter roughly being about the length of your hand). Scoop softened butter into the middle."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bundle the dough up into a dumpling as if the butter were the filling. Slowly and gently knead the dough until the butter is absorbed and the dough becomes smooth again. This usually takes another 10 minutes. At this point, if the dough is too sticky to touch, sprinkle a little bit of flour onto the bench (be careful not to go overboard though. it is okay for the dough to be sticky)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Fashion the dough into a smooth ball and place in a lightly oiled bowl (bowl must be large enough to allow the dough to rise to almost double its size). Cover with cling wrap."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Let rise for about 1hr. Depending on weather conditions, this time can change so you'll have to keep a close eye on the dough past the 40-45 minute mark. In colder weather, it will take longer to rise. Placing it in an oven (turned off) with a bowl of hot water underneath can help during winter."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Once it's done rising, remove dough from bowl. Degas it by gently flattening it into a circle. Divide the dough into 9 equal pieces. It's okay if they're not perfectly even."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Shape each piece by gently folding the dough into itself and then shaping it into a ball. It's difficult to explain using words how to do this properly but thankfully YouTube offers many videos on shaping dough into rolls."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place each roll into a lined square pan (16x16cm) and cover with cling wrap. Let rise for another 1hr (once again, depending on weather conditions, this can change)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 180C."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Lightly dust buns before placing in oven. Cook at 180C for the first 10 minutes then reduce to 150C in the last 10 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/ccfo8irzhmffdc482g6n?wid=2559&hei=1968&fmt=png-alpha",
      "text": "Remove buns from oven and place on cooling rack. Let cool for about 15-20 minutes before eating. Enjoy!"
    }
  ],
  "recipeNameId": "chocolate-milk-buns",
  "recipeYield": "9",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/chocolate-milk-buns"
  ],
  "totalTime": "PT170M",
  "updatedAt": "2022-11-24T13:15:24.120Z",
  "url": "https://www.woolworths.com.au/shop/recipes/chocolate-milk-buns"
}
