{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-24T12:22:48.644Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Chocolate Mousse Cake recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1703-chocolate-mousse-cake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Chocolate cake,Baking,Summer,Chocolate",
  "name": "Chocolate Mousse Cake Recipe | Woolworths",
  "prepTime": "PT45M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "5440",
  "recipeIngredient": [
    "0.66 cup hazelnut liqueur",
    "1 tbs baking powder",
    "2.5 cup plain flour",
    "2 cup milk",
    "464g unsalted butter, melted, cooled (save 80g butter; and 34g butter for later)",
    "1 tbs vanilla extract",
    "50g dark cooking chocolate, chopped",
    "4 tsp powdered gelatine",
    "200g white cooking chocolate, curls (to decorate)",
    "1 cup cocoa",
    "6 eggs, whisked",
    "3 eggs, yolk separated",
    "2 cup caster sugar",
    "418ml thickened cream (save 118ml for later)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 180°C. Grease 4 deep 20cm springform cake pans and line bases with baking paper. Sift flour, cocoa and baking powder together into a large bowl. Stir in sugar."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Whisk egg with butter, milk and vanilla. Pour into flour mixture and beat together until smooth. Measure 1 cup of the cake batter into each of the 4 cake pans. Swirl pans to evenly cover bases. Bake for 15 minutes until cooked. Cool in pans for 5 minutes then turn out onto a wire rack. Clean pans and regrease and line as before. Repeat with remaining cake batter. You will have 8 thin layers."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the mousse, mix gelatine in a small bowl with 3 tbs cold water. Stand in a larger bowl of boiling water, stirring until dissolved. Set aside. Melt chocolate with butter and 1/4 cup of the cream until smooth. Remove from heat and cool for 5 minutes. Beat remaining cream until thick. Whisk egg yolks and gelatine into chocolate, mixing until combined. Fold in cream."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Line 2 baking trays with baking paper. Remove bases from 2 of the cake pans, close hinges and place one onto each tray. Brush 2 of the cake layers with liqueur and place one into each ring. Cover each with 1/2 cup of the mousse. Repeat layers twice more and finish each with a cake layer. Brush tops with liqueur. Reserve the remaining mousse and keep at room temperature. Chill cakes for 1 hour or until well set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, for ganache, place chocolates into a medium bowl. Heat cream and butter together in a small pan until hot. Pour over chocolate, stand for 2 minutes then stir until smooth."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Loosen cakes from rings and place one of the stacks onto a serving plate. Spread reserved mousse over the top layer. Position the second stack on top of the first. Smooth sides if necessary. Slowly pour ganache onto the centre of the cake allowing it to drip down the sides. Chill to set. Decorate with white chocolate curls, if desired."
    }
  ],
  "recipeNameId": "chocolate-mousse-cake",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/chocolate-mousse-cake"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-11-24T12:22:48.641Z",
  "url": "https://www.woolworths.com.au/shop/recipes/chocolate-mousse-cake"
}
