{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT2M",
  "createdAt": "2022-12-02T08:15:22.097Z",
  "datePublished": "2011-11-01T11:32:07+00:00",
  "description": "I normally use Medjool dates in treats like this, but this time I decided to use dried prunes, which give them a much more fruity flavor and contribute around half the calories of dates. Dates would probably make them more authentic-tasting, so feel free to use them if you like.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/11/chocolate-almond-joy-680.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/11/chocolate-almond-joy-680-500x453.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/11/chocolate-almond-joy-680-500x375.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/11/chocolate-almond-joy-680-480x270.jpg"
  ],
  "keywords": "low-sugar, vegan almond joy",
  "name": "Chocolate-Almond Nuggets of Joy",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "47 kcal",
    "carbohydrateContent": "7.9 g",
    "fatContent": "1.9 g",
    "fiberContent": "1.1 g",
    "servingSize": "1 nugget",
    "sodiumContent": "8 mg",
    "sugarContent": "4.1 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 cup D’Noir prunes or medjool dates (about 16 dried prunes)",
    "3/4 cup flaked or shredded coconut (sweetened or unsweetened)",
    "1 1/2 teaspoon cocoa powder",
    "1 tablespoon confectioners sugar",
    "1 tablespoon cocoa powder",
    "24 raw almonds",
    "1/4 cups semi-sweet chocolate chips (dairy-free kind, optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put the prunes or dates, coconut, and 1 1/2 teaspoons cocoa powder into the food processor and blend until you have a sticky blob. Divide the blob and process again briefly to make sure that ingredients are well-distributed. If the mixture doesn’t seem sticky enough, you can add more prunes or dates (but prunes should already be very sticky)."
    },
    {
      "@type": "HowToStep",
      "text": "Scrape the blob out onto a plate, cover with plastic wrap, and flatten it till it’s about 1-inch thick. Keep it covered and refrigerate for about 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the confectioners’ sugar and the tablespoon of cocoa powder on a dinner plate. Scoop out a heaping teaspoon of the coconut mixture, form into an oval shape, press an almond into the middle, and cover it with coconut mixture. Roll each nugget (or as many as you want) in cocoa/confectioners’ sugar, and place on a plate. Repeat about 23 times."
    },
    {
      "@type": "HowToStep",
      "text": "You can serve them immediately or add a chocolate squiggle. Place the nuggets into the freezer for a few minutes while you gently heat the chocolate chips (I used a microwave). As soon as the chips are just barely melted, scrape the chocolate into a pastry bag fitted with a small round tip. Pipe chocolate onto each nugget."
    },
    {
      "@type": "HowToStep",
      "text": "Nuggets keep well covered at room temperature for about 2 days. Refrigerate if you need to keep them longer."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://blog.fatfreevegan.com/2011/11/chocolate-almond-nuggets-of-joy.html"
  ],
  "totalTime": "PT22M",
  "updatedAt": "2022-12-02T08:15:22.096Z"
}
