{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "She Likes Food"
  },
  "cookingMethod": "Microwave",
  "cookTime": "PT5M",
  "createdAt": "2022-12-02T04:52:30.678Z",
  "datePublished": "2022-11-19",
  "description": "\r\n \t2 cups smoky flavored almonds, plus more for topping\r\n \t1 package pitted dates, medjool dates are great if you're not sure which ones to get\r\n \t12 oz package chocolate chips, I used dark chocolate but you can use whatever kind you like\r\n \t1 teaspoon coconut oil, optional\r\n",
  "image": [
    "https://www.shelikesfood.com/wp-content/uploads/2022/11/almond-butter-stuffed-dates-1139-225x225.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2022/11/almond-butter-stuffed-dates-1139-260x195.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2022/11/almond-butter-stuffed-dates-1139-320x180.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2022/11/almond-butter-stuffed-dates-1139.jpg"
  ],
  "keywords": "Almond Butter Stuffed Dates",
  "name": "Chocolate Covered Smoky Almond Butter Stuffed Dates",
  "nutrition": {
    "@type": "nutritionInformation",
    "calories": "21 calories",
    "carbohydrateContent": "3.9 g",
    "cholesterolContent": "0 mg",
    "fatContent": "0.6 g",
    "fiberContent": "0.3 g",
    "proteinContent": "0.2 g",
    "saturatedFatContent": "0.2 g",
    "servingSize": "1 Date",
    "sodiumContent": "20.2 mg",
    "sugarContent": "3.6 g",
    "transFatContent": "0 g"
  },
  "prepTime": "PT3H",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by making the almond butter. Add the almonds to a food processor and turn on high speed. The whole process takes about 5 minutes and you will want to turn it off every now and then to scrape the sides down. You want to blend it until it’s smooth and looks like the photo in the post above. Almond butter can be made days in advance and can be stored in the refrigerator until ready to use because it’s easier to stuff the dates with if it is a little firm."
    },
    {
      "@type": "HowToStep",
      "text": "Lay your dates out on a large plate or sheet pan. If your dates are already pitted they should have a slit down the middle that you can carefully open with your fingers. If you are pitting your own dates, do so by making a slit down the middle that can be used to fan open the date with."
    },
    {
      "@type": "HowToStep",
      "text": "Place a spoonful of the smoky almond butter into each date and place in the freezer. You want to freeze them for at least a few hours so that the dates are easier to handle when coating with the chocolate. I froze mine overnight and it worked great."
    },
    {
      "@type": "HowToStep",
      "text": "Add the coconut oil (optional) to the chocolate chips and melt either over a double boiler or in the microwave. I microwave mine for about 45 seconds at a time until they are almost all melted and then mix until they become melted."
    },
    {
      "@type": "HowToStep",
      "text": "Place the stuffed date into the chocolate and use two forks to toss it around to make sure it is completely coated. Place the chocolate covered date on a sheet pan covered with parchment paper. Once all the dates are covered with chocolate I like to let the chocolate set and then drizzle extra chocolate on top and then sprinkle with finely chopped smokey almonds."
    },
    {
      "@type": "HowToStep",
      "text": "Once the chocolate has cooled completely, dates should be ok to be left out at room temperature or stored in the refrigerator until ready to enjoy."
    }
  ],
  "recipeYield": "15",
  "sameAs": [
    "https://shelikesfood.com/almond-butter-stuffed-dates"
  ],
  "suitableForDiet": "VegetarianDiet",
  "totalTime": "PT3H5M",
  "updatedAt": "2022-12-02T04:52:30.676Z",
  "url": "https://www.shelikesfood.com/almond-butter-stuffed-dates/"
}
