{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T09:18:30.007Z",
  "datePublished": "2011-08-23T02:19:00+00:00",
  "description": "How to make Chocolate Oatmeal Raisin Cookies. Easy Vegan Dairy-free Eggless Recipe.&nbsp;",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2012/01/aug8-2B070.3.jpg",
    "https://www.veganricha.com/wp-content/uploads/2012/01/aug8-2B070.3-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2012/01/aug8-2B070.3-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2012/01/aug8-2B070.3-480x270.jpg"
  ],
  "keywords": "easy cookie recipe, gluten free cookies, vegan cookies",
  "name": "Chocolate Oatmeal Raisin Cookies, Vegan.",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "148 kcal",
    "carbohydrateContent": "25 g",
    "fatContent": "4 g",
    "fiberContent": "2 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "36 mg",
    "sugarContent": "7 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "2 teaspoons flax meal",
    "1 tablespoon hot water",
    "4 tablespoons Raw turbinado sugar or jaggery or sweetener of choice",
    "1 tablespoon Agave syrup",
    "1.5 tablespoon unsweetened cocoa powder (a half tablespoon more for darker, and half less for less chocolatey)",
    "2 tablespoons roasted Almond butter (Homemade nut butter recipes)",
    "1 tablespoon virgin coconut oil (or vegan butter like Earth Balance)",
    "1/2 teaspoon lemon juice",
    "1/4 teaspoon cinnamon powder (or allspice)",
    "1/8 teaspoon salt",
    "1/4 teaspoon baking powder",
    "2/3 cup raisins",
    "2 tablespoons quinoa (blended coarsely or quinoa flour ( or use oats coarse flour, if you don't have quinoa)",
    "2/3 cup oats (Bob’s Red Mill Organic Old Fashioned)",
    "3 tablespoons self rising flour (or gf all purpose flour for gluten free version)",
    "2 tablespoons whole wheat pastry flour (Or Rice Flour for a gluten free version)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a bowl, mix the flax meal and hot water and let sit for a minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add in the room temperature almond butter, coconut oil, sugar, agave and mix well by hand or by hand mixer until the mixture feels light."
    },
    {
      "@type": "HowToStep",
      "text": "The almond butter I used is store bought and it takes a while to mix up. Mix and let sit for a few minutes and then mix again to work that almond butter. I used spoon and woman hand power for the mixing!"
    },
    {
      "@type": "HowToStep",
      "text": "Blend/grind the quinoa to a coarse flour along with the baking powder."
    },
    {
      "@type": "HowToStep",
      "text": "Add in cocoa powder, quinoa, 1/2 cup oats, salt, cinnamon powder and lemon juice and the wheat and self rising flour and mix till just about combined."
    },
    {
      "@type": "HowToStep",
      "text": "Add in more oats and flour if needed to get gooey muffin mixture kind of consistency, Or a very sticky dough. If you added too much flour or oats and the mixture gets too stiff and dry then add in a teaspoon oil and/or lemon juice to make it gooey and mildly stiff."
    },
    {
      "@type": "HowToStep",
      "text": "Oil hands or tablespoon and pick up tablespoon full dough, drop them and flatten on parchment paper. Thinner the better! It can get hard to work with the sticky mixture, so I usually dont make a perfect round shape.:)"
    },
    {
      "@type": "HowToStep",
      "text": "Bake in preheated oven at 350 degrees F for 12-14 minutes(add minutes depending on the thickness of the cookie). The cookies should not be runny or liquidy when done."
    },
    {
      "@type": "HowToStep",
      "text": "Take cookies off baking tray and cool on rack for a few minutes if you can:)"
    },
    {
      "@type": "HowToStep",
      "text": "Store in airtight container for a week or so. Let me know how yours turn out!"
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://veganricha.com/2011/08/chocolate-oatmeal-raisin-cookies-vegan.html"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-04T09:18:30.006Z"
}
