{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-24T03:17:47.000Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Chocolate Orange Profiteroles recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp485choora_023:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Profiterole",
  "name": "Chocolate Orange Profiteroles Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "French",
  "recipeId": "RG176563",
  "recipeIngredient": [
    "50g butter",
    "100g plain flour",
    "2 large eggs, lightly beaten",
    "150g dark chocolate, broken into pieces",
    "1.2 cup single cream",
    "2 tbs golden syrup",
    "1 tbs Grand Marnier",
    "2 cup double cream",
    "1 large orange, zested",
    "2 tbs Grand Marnier"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 220°C. Lightly grease two baking sheets. To make the choux pastry, melt the butter with 300ml water in a pan, then bring to the boil. As soon as the mixture comes to the boil, remove from the heat, and add the flour. Beat hard with a wooden spoon until the mixture is thick and glossy and comes away from the sides of the pan. Gradually beat in the egg a little at a time until the mixture is smooth, thick, and shiny – it should drop easily off the spoon."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spoon the mixture into 12 balls, placing them well spaced apart on the baking sheets. Bake for 10–15 minutes, or until puffed up, then reduce the heat to 190°C and bake for a further 20 minutes, or until they are crisp and golden. Remove from the oven and make slits in the sides for the air to escape. Return to the oven for a few minutes so that the centres dry out. Transfer to a wire rack to cool completely"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chocolate sauce, melt the chocolate, cream, syrup, and Grand Marnier together in a small pan, whisking until the sauce is smooth and glossy. Leave to cool to room temperature, then transfer to a sealed plastic container and freeze. To make the filling, whisk the cream, orange zest, and Grand Marnier in a bowl until just thicker than soft peaks. Fill the profiteroles with the cream using a piping bag or teaspoon. Wrap in foil, or place in a large plastic food bag, and freeze"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To serve, defrost the profiteroles and sauce in the refrigerator overnight. Warm the sauce in a small pan, stirring until smooth. Serve the profiteroles with the hot sauce spooned over."
    }
  ],
  "recipeNameId": "chocolate-orange-profiteroles",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/chocolate-orange-profiteroles"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-24T01:51:15.625Z",
  "url": "https://www.woolworths.com.au/shop/recipes/chocolate-orange-profiteroles"
}
