{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-05T05:15:56.869Z",
  "datePublished": "2011-12-12T06:45:00+00:00",
  "description": "Christmas stollen wreath with cranberries, Pistachios and Candied Orange. Vegan Recipe.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2011/12/pannacotta-dougnut-kalerice-paratha-2B174.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/12/pannacotta-dougnut-kalerice-paratha-2B174-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/12/pannacotta-dougnut-kalerice-paratha-2B174-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/12/pannacotta-dougnut-kalerice-paratha-2B174-480x270.jpg"
  ],
  "keywords": "festive recipe, fruit cake, quick vegan cake",
  "name": "Christmas Stollen Wreath with Cranberries, Pistachios, Candied Orange. Vegan",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "153 kcal",
    "carbohydrateContent": "22 g",
    "fatContent": "6 g",
    "fiberContent": "1 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "5 g",
    "servingSize": "1 serving",
    "sodiumContent": "74 mg",
    "sugarContent": "14 g"
  },
  "prepTime": "PT50M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "3/4 + cup bread flour",
    "3/4 white whole wheat flour",
    "1/2 cup almond or coconut milk (I used So delicious vanilla)",
    "3 Tablespoons coconut oil or organic canola oil",
    "about 1 cup total of dried",
    "2 Tablespoons water",
    "2 teaspoons active yeast",
    "3 Tablespoons raw sugar (I use sugar in the raw, and that is sweeter than regular white sugar)",
    "1/8 teaspoon cardamom",
    "1/2 teaspoon pumpkin pie spice (or spices of choice like ginger bread blend)",
    "1/4 teaspoon salt",
    "1 teaspoon vanilla (skip if using vanilla flavored coconut milk)",
    "zest of 1/2 a lemon or some orange",
    "powdered vegan sugar for topping (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Warm 2 Tablespoons water and add yeast and 1 teaspoon sugar to it, Let sit for 10 minutes or until frothy."
    },
    {
      "@type": "HowToStep",
      "text": "Add to this yeast mix, 3/4 cup bread flour, warm coconut milk, oil and rest of the sugar and combine well."
    },
    {
      "@type": "HowToStep",
      "text": "In another bowl, take the whole wheat flour and add in the rest of the ingredients, and mix well."
    },
    {
      "@type": "HowToStep",
      "text": "Add this flour mix to the bread flour batter and knead for 4-5 minutes. Add bread flour or water to get a soft, not too sticky dough. The dough will be ready when some of the raisins feel like they will fall out. Initially the dough is sticky so the raisins stay inside. (If many dried fruits/nuts fall out, that means the ratio of dried fruits to flour is too high, add more flour and water to help distribute them and form a soft dough ball)"
    },
    {
      "@type": "HowToStep",
      "text": "Let dough sit in a greased and covered container for 2 hours or until doubled. Spritz top with water and spritz oil before covering."
    },
    {
      "@type": "HowToStep",
      "text": "Take it out and punch and knead for a minute, use a little bread flour to help reduce stickiness. shape into somewhat of a rectangle of 1/2 inch thickness."
    },
    {
      "@type": "HowToStep",
      "text": "Roll this like a jelly roll. (you can also sprinkle some marzipan, chocolate chips or cinnamon sugar before rolling)"
    },
    {
      "@type": "HowToStep",
      "text": "If baking a bread loaf, place this roll seam side down in a greased bread pan. If making a wreath, pull the sides of the roll to form a circle and use a little water to stick them to each other by pinching. Use a serrated knife or shears, make cuts at regular intervals."
    },
    {
      "@type": "HowToStep",
      "text": "Spritz top with water and then oil, cover and let rise for 50 minutes or until doubled."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the loaf or wreath in a preheated 360 degrees F for 25-30 minutes until golden and a tap sounds hollow."
    },
    {
      "@type": "HowToStep",
      "text": "Cool on rack for 15 minutes. Sprinkle top with sugar. I like mine without. Slice and serve at room temperature. It tastes yummier the next day! Warm in the oven a little if serving later. Store in a cool place wrapped in foil for a few days."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://veganricha.com/christmas-stollen-wreath-vegan"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-12-05T05:15:56.868Z"
}
