{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT65M",
  "createdAt": "2022-12-02T14:08:42.128Z",
  "datePublished": "2019-12-18T21:33:29+00:00",
  "description": "Christmas Shortbread made simple! Quick, no fuss, no cookie cutters required. Just perfectly short and crumbly, buttery, vegan shortbread bars with a layer of festive mincemeat sandwiched effortlessly through the middle.   ",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Christmas-Shortbread-A-Virtual-Vegan-14.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Christmas-Shortbread-A-Virtual-Vegan-14-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Christmas-Shortbread-A-Virtual-Vegan-14-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Christmas-Shortbread-A-Virtual-Vegan-14-480x270.jpg"
  ],
  "keywords": "dairy-free shortbread, easy shortbread, mincemeat recipe, mincemeat shortbread, shortbread, vegan christmas recipe, vegan shortbread",
  "name": "Christmas Shortbread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "464 kcal",
    "carbohydrateContent": "64 g",
    "fatContent": "21 g",
    "fiberContent": "2 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "5 g",
    "servingSize": "1 serving",
    "sodiumContent": "302 mg",
    "sugarContent": "27 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Snack",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "2 1/2 cups / 312 g all purpose flour (, plain flour in the UK)",
    "packed 1/3 cup / 48 g cornstarch (, cornflour in the UK)",
    "1/2 cup + 2 tablespoons / 125 g white granulated or cane sugar",
    "1/8 teaspoon fine salt",
    "1 packed cup / 240 g vegan butter",
    "1/3 cup / 100 g vegan mincemeat",
    "2 tablespoons flaked almonds (or chopped pistachios)",
    "2 tablespoons dried cranberries"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 320° F (160 °C) and place an oven shelf about 1/3 up from the bottom of the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Grease a 9 x 5 inch (or similar) loaf pan. Place a long thin strip of parchment paper down the middle of the pan, with some overhang over the ends. Once that's in place rub a little grease on it to \"stick\" the next strip. The second strip needs to be wider and go across the pan the other way with some overhang again. The overhang acts as handles for lifting the shortbread out and the grease helps to keep everything in place. To see exactly how to put the paper in see my picture in the post above."
    },
    {
      "@type": "HowToStep",
      "text": "To the bowl of a food processor, add the flour, cornstarch, sugar, salt and butter. Pulse until the mixture looks like coarse breadcrumbs and is just starting to clump. Test to see if it's ready by grabbing a walnut sized piece and squeezing it together in your hand. If it sticks together in a ball it is ready. If it doesn't put the lid on the food processor again and pulse until it is ready."
    },
    {
      "@type": "HowToStep",
      "text": "Take the blade out of the machine, and put roughly half (eyeballing it is fine) of the dough into the loaf pan. Using your hands, compact it down evenly and tightly."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the mincemeat over the top of the shortbread layer with a spoon so it's even, then top with the remaining shortbread and press it down really hard all over so it's even and smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Press the flaked almonds and cranberries into the top, then bake in the oven for about 65 minutes until it is just starting to turn a little golden around the edges."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and leave in the pan for 15 to 20 minutes, then lift out using the parchment paper handles. Leave on the paper, and place on a cutting board. Slice very carefully into portions, then lift it onto a cooling rack using the paper aagin, and allow to cool completely before storing in an airtight container."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/vegan-christmas-shortbread"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-02T14:08:42.125Z"
}
