{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "4.67"
  },
  "author": {
    "@type": "Person",
    "name": "Sarah McMinn"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-11-28T22:47:38.000Z",
  "datePublished": "2019-11-13T07:00:34+00:00",
  "description": "This classic vegan apple pie is the perfect sweet and tart filling baked inside a buttery crust. The filling can be made in advance for a quick and easy fall dessert the whole family will love.",
  "image": [
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/10/Apples5.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/10/Apples5-500x500.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/10/Apples5-500x375.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/10/Apples5-480x270.jpg"
  ],
  "keywords": "Vegan Apple Pie",
  "name": "Classic Vegan Apple Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "449 kcal",
    "carbohydrateContent": "64 g",
    "fatContent": "31 g",
    "fiberContent": "2 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "15 g",
    "servingSize": "1 serving",
    "sodiumContent": "393 mg",
    "sugarContent": "29 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "2 1/2 cup all-purpose flour",
    "1 tbsp. sugar",
    "1 tsp. salt",
    "10 tbsp. non-dairy butter",
    "1/2 cup coconut oil, (solid)",
    "3-5 tbsp ice water",
    "7 cups Granny Smith apple slices, (about 5 large apples)",
    "1 tbsp. lemon juice",
    "1 cup brown sugar, (packed)",
    "3 tbsp. all-purpose flour",
    "1 tsp. ground cinnamon",
    "1/2 tsp ground ginger",
    "1/4 tsp ground nutmeg",
    "1/4 tsp. ground cloves",
    "2 tbsp. vegan butter"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by making your pie crust. Spray a 9\" pie pan with cooking spray and set aside. ​"
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, combine the flour, sugar, and salt. Cut the butter and coconut oil in small pieces - about 1 tablespoon in size - and add to the dry ingredients. Using your hands or a pastry cutter, press the butter and coconut oil into the flour until the fats are evenly distributed and the dough resembles small pea-size pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Dribble 1 tablespoon of ice water over the flour mixer and kneed together with your hands. Add water as necessary. You want a fairly dry dough (this creates the flakiness) but that has enough moisture to roll out and shape."
    },
    {
      "@type": "HowToStep",
      "text": "When you have the right consistency, wrap the dough in plastic wrap and refrigerate for at least 30 minutes. When the dough is firm, divide into half and roll out each half onto a piece of floured parchment paper until your dough is about 1/8\" thick and you have two circles about 12\" across. Place the top crust in the refrigerator to chill."
    },
    {
      "@type": "HowToStep",
      "text": "Placing your hand underneath the parchment paper, gently flip one of the pie crusts into the pie pan. Peel off the parchment paper and press the crust evenly into the pie pan, trimming any edges that hang over. Place in the refrigerator and let chill for at least 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400F."
    },
    {
      "@type": "HowToStep",
      "text": "Peel and thinly slice your apples. Place them in a large bowl and toss them with lemon juice. In a separate bowl, combine brown sugar, flour, and spices. Transfer to bottom crust, mounding the top. Top with the remaining crust, pressing down the sides to seal the top and bottom. Brush with soy milk and make slits in the top for ventilation."
    },
    {
      "@type": "HowToStep",
      "text": "Loosely cover in tin foil and bake 25 minutes. Remove the tin foil and bake an additional 25 minutes until the crust is golden brown and filling is bubbling up."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and let cool completely at room temperature before serving. Serve with coconut whipped cream or non-dairy ice cream."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with coconut whipped cream."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://mydarlingvegan.com/vegan-apple-pie"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-12-02T08:08:50.023Z"
}
