{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-11-24T17:06:44.437Z",
  "datePublished": "2022-11-02",
  "description": "Perhaps the ultimate in home-baked comfort food, this autumnal pie is best served warm with vanilla ice cream.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/famkit335apppie_033:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Apple pie & tart,Apple",
  "name": "Classic Apple Pie Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "British",
  "recipeId": "RGR17462",
  "recipeIngredient": [
    "350g plain flour",
    "0.5 tsp salt",
    "150g lard",
    "3 tbs caster sugar, save 1 tbs for sprinkling",
    "1 tbs milk",
    "1kg tart apples",
    "1 lemon, juice only",
    "2 tbs plain flour",
    "0.5 tsp ground cinnamon",
    "0.25 tsp nutmeg, grated",
    "100g caster sugar"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Sift the flour and salt into a bowl. Add the fat, cutting it in with 2 round-bladed knives. With your fingertips, rub the fat into the flour until crumbs form, lifting the mixture to aerate it. Add the sugar. Sprinkle with 6-7 tbsp of cold water and mix it in with a fork."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Press the crumbs into a ball, wrap, and chill for 30 minutes. Meanwhile, grease a 23cm shallow pie dish. Flour a work surface. Roll two-thirds of the dough out to a round, 5cm larger than the diameter of the dish. Using the rolling pin, drape the pastry over the dish, then gently push it into the contours. Trim any excess pastry, then chill for 15 minutes until firm."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the filling, peel the apples, quarter, and cut out the cores. Set each quarter, cut-side down, on a chopping board and cut into evenly sized thin slices."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the apple slices in a bowl, and pour over the lemon juice. Toss to coat. Sprinkle the flour, cinnamon, nutmeg, and sugar over the apples and toss again to coat. Put the apple in the pie dish and arrange so that they are slightly mounded in the centre."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Brush the rim of the pastry with water. Roll the rest of the dough to a 28cm round. Wrap it around the rolling pin and drape it over the filling. Trim the top crust and press the edges together to seal, crimping them with the back of a knife as you go."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cut an “x” in the top crust and gently pull back the point of each triangle to reveal the filling. Roll out the trimmings, then cut into strips, and moisten. Lay over the pie crust in a criss-cross pattern. Brush the pie with the milk so that it bakes to a golden colour. Sprinkle with sugar and chill for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, preheat the oven to 220°C. Bake for 20 minutes. Reduce to 180°C and bake for 30-35 minutes. Insert a skewer through the steam vent to check the apples are tender (it should meet no resistance). Serve warm."
    }
  ],
  "recipeNameId": "classic-apple-pie",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/classic-apple-pie"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-11-24T17:06:44.434Z",
  "url": "https://www.woolworths.com.au/shop/recipes/classic-apple-pie"
}
