{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "97",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-03T16:45:56.336Z",
  "datePublished": "2016-07-21T05:00:29+00:00",
  "description": "10-ingredient, classic falafels kept vegan and gluten-free and pan fried to perfection! A faster, easy way to make falafel the traditional way!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/07/Classic-Falafel-SQUARE.jpg"
  ],
  "keywords": "vegan falafel",
  "name": "Classic Vegan Falafel (GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "78 kcal",
    "carbohydrateContent": "8.7 g",
    "fatContent": "4 g",
    "fiberContent": "2.4 g",
    "proteinContent": "2.7 g",
    "saturatedFatContent": "0.5 g",
    "servingSize": "1 falafel",
    "sodiumContent": "150 mg",
    "sugarContent": "1.5 g"
  },
  "prepTime": "PT165M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cups dry chickpeas",
    "1/2 cup chopped fresh parsley",
    "1/2 cup chopped white onion",
    "4-7 small cloves garlic",
    "2 Tbsp gluten-free oat flour",
    "1 - 1 1/2 tsp sea salt (plus more to taste)",
    "2-3 tsp ground cumin",
    "1 pinch ground cardamom",
    "1 tsp ground coriander",
    "1 pinch cayenne pepper (optional)",
    "Grape seed (or other high smoke point) oil for pan frying"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Rinse (uncooked) chickpeas in a fine mesh strainer and add to a large pot. Cover with 2 inches water and bring to a boil over high heat. Boil for 1 minute. Then cover, remove from heat, and let set for 1 hour. Then drain and lightly rinse and dry thoroughly (method from the Kitchn)."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add parsley, onion, and garlic to a food processor. Mix until well processed. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the chickpeas are slightly cooled and dried, add to the food processor, along with gluten-free oat flour, salt, cumin, cardamom, coriander, and cayenne (optional). Mix to combine thoroughly, scraping down sides as needed. This may take up to 4-5 minutes to fully incorporate all of the spices and herbs. You're looking for a near paste with only very small bits of chickpeas and herbs."
    },
    {
      "@type": "HowToStep",
      "text": "Sample a small bit and adjust spices/salt/herbs as needed. Then cover and set in the refrigerator for 1 hour to allow the flavors to meld and the texture to become more firm."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooled, remove from refrigerator and scoop out 1 1/2 Tbsp amounts (using this scoop or a Tablespoon) and gently form into small discs using your hands. If the falafel isn't sticking together the mixture may need to be blended more thoroughly, or dusted with a bit more oat flour if too wet."
    },
    {
      "@type": "HowToStep",
      "text": "Once your falafels are formed (~24 total // amount as original recipe is written // adjust if altering batch size), heat a large metal or cast-iron skillet over medium/medium-high heat. Once hot, add enough oil to create a thin layer on the bottom of the pan and wait 1-2 minutes for the oil to heat up. Then place only as many falafel as will fit comfortably in the pan and cook 2-3 minutes on each side. Once the bottom side is browned, flip gently as they can be fragile. Continue until all falafel are cooked. Adjust heat as needed if they're browning too quickly, or aren't cooking quickly enough."
    },
    {
      "@type": "HowToStep",
      "text": "These falafel are delicious on their own with hummus,garlic dill sauce or tahini sauce. I also love garnishing them with chili garlic sauce for heat. Serve over greens, in pita, or enjoy as is!"
    },
    {
      "@type": "HowToStep",
      "text": "To freeze, pan fry falafel and let cool. Then add to a freezer safe container and freeze up to 1 month. Reheat in a 375 degree F (190 C) oven until warmed through."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://minimalistbaker.com/classic-vegan-falafel-gf"
  ],
  "totalTime": "PT180M",
  "updatedAt": "2022-12-03T16:45:56.335Z"
}
