{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT80M",
  "createdAt": "2022-11-28T05:30:01.155Z",
  "datePublished": "2022-11-14T09:27:20+00:00",
  "description": "This vegan pot pie is made with tender veggies simmered in savory herbed sauce and baked up under a flaky pastry crust!",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2022/11/vegan-pot-pie-22-sq-1.jpg",
    "width": 1200
  },
  "keywords": "pie, seitan",
  "name": "Classic Vegan Pot Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "632 kcal",
    "carbohydrateContent": "57.1 g",
    "fatContent": "36 g",
    "fiberContent": "5.5 g",
    "proteinContent": "18.2 g",
    "saturatedFatContent": "8.2 g",
    "servingSize": "1 serving (1/8 of recipe)",
    "sodiumContent": "911 mg",
    "sugarContent": "4.6 g"
  },
  "prepTime": "PT40M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3 tablespoons olive oil, (divided)",
    "10 ounces cremini or button mushrooms, (cleaned and sliced)",
    "1 medium onion, (diced)",
    "1 cups diced carrots, (about 2 medium carrots)",
    "1 cups diced celery, (about 2 medium stalks)",
    "8 ounces seitan, ( cut into 1/2 inch pieces (half a batch if using my seitan recipe)",
    "3 garlic cloves, (minced)",
    "1/2 cup all-purpose flour (or whole wheat flour)",
    "1/2 cup dry white wine (Note 1)",
    "1 1/2 cups vegetable broth",
    "1 cup unsweetened soy or almond milk",
    "2 tablespoons nutritional yeast flakes",
    "1 tablespoon soy sauce",
    "1 tablespoon finely chopped fresh rosemary (Note 2)",
    "1 tablespoon fresh thyme leaves",
    "1 teaspoon rubbed sage",
    "1 cup frozen peas, (thawed)",
    "Salt and black pepper, (to taste)",
    "2 vegan pie crusts (Notes 3 and 4)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large skillet with 2 tablespoons of oil and place it over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "When the oil is hot, add the mushrooms in an even layer and cook them for about 5 minutes, until browned on the bottoms. Flip and cook for about 5 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the mushrooms from the skillet and transfer them to a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining tablespoon of oil to the skillet and give it a minute to heat up."
    },
    {
      "@type": "HowToStep",
      "text": "Add the onion, carrot and celery. Sweat the vegetables for about 10 minutes, stirring occasionally, just until they begin to soften and onions become translucent."
    },
    {
      "@type": "HowToStep",
      "text": "Add the seitan to the skillet, along with any juice the seitan is packaged in. Cook the seitan with the vegetables, stirring frequently, for about 5 minutes, until the pieces begin to brown."
    },
    {
      "@type": "HowToStep",
      "text": "Return the mushrooms to the skillet, add the garlic, then sprinkle in the flour. Stir everything up so that the flour coats the ingredients relatively uniformly. Cook the mixture for about 1 minute, stirring constantly, until the garlic becomes very fragrant."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the wine and bring it to a simmer. The liquid should thicken up very quickly. Allow it to cook for about a minute, stirring frequently."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the broth, milk, nutritional yeast, soy sauce, rosemary, thyme and sage. Raise the heat and bring the mixture to a simmer."
    },
    {
      "@type": "HowToStep",
      "text": "Lower the heat and allow the mixture to cook at a low simmer for about 10 minutes, stirring occasionally, until the veggies are tender and the sauce has thickened up a bit."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the peas."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pot from heat, taste test and season the mixture with salt and pepper to taste. Adjust any other seasonings as desired."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375° and gather a large (deep 10-inch diameter or larger) pie dish. (Note 5)"
    },
    {
      "@type": "HowToStep",
      "text": "Use a rolling pin to roll one of the pie crusts so that it's large enough to fully cover the inside of the dish. Drape the crust in the dish and gently press so it conforms to the inside of the dish. Use a fork to poke a few holes in the bottom and sides of the crust."
    },
    {
      "@type": "HowToStep",
      "text": "Ladle the filling into the bottom crust inside the pie dish."
    },
    {
      "@type": "HowToStep",
      "text": "Roll the second crust so that it's large enough to cover the pie, then drape it over the fillings."
    },
    {
      "@type": "HowToStep",
      "text": "Trim any excess crust and pinch the edges of the two crusts together to form a seal. Optionally crimp the edges with a fork or your fingers. Cut a few slits in the top crust for ventilation."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pot pie in the oven on the center rack. Place a baking sheet or dish on the rack below the pie to catch any drips. Bake the pie until crust is golden brown and the filling is bubbly, about 40 minutes. (Note 6)"
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pie from oven and allow to sit for about 5 minutes before serving."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-chicken-pot-pie"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-11-28T05:30:01.152Z"
}
