{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "4.34"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-01T01:03:18.339Z",
  "datePublished": "2018-07-12T16:14:24+00:00",
  "description": "The special layering technique and low-moisture ingredients keep this Cobb Salad Meal Prep fresh and beautiful for days!&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2018/07/Build-Cobb-Salads-Step-3.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/07/Build-Cobb-Salads-Step-3-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/07/Build-Cobb-Salads-Step-3-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/07/Build-Cobb-Salads-Step-3-480x270.jpg"
  ],
  "keywords": "cold lunch, meal prep, Salad",
  "name": "Cobb Salad Meal Prep",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "689.28 kcal",
    "carbohydrateContent": "31.78 g",
    "fatContent": "43.65 g",
    "fiberContent": "8.75 g",
    "proteinContent": "42.43 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1173.35 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Lunch",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 boneless, skinless chicken breast* (about 2/3 lb.) ($2.00)",
    "1 pinch salt and pepper ($0.05)",
    "1/2 tsp smoked paprika (optional) ($0.05)",
    "1 Tbsp cooking oil ($0.04)",
    "4 large eggs ($0.93)",
    "4 slices bacon ($1.00)",
    "1 15oz. can chickpeas, rinsed and drained ($0.55)",
    "1 pint grape tomatoes ($1.99)",
    "4 oz. cheddar (cubed or shredded) ($0.75)",
    "2 oz. spring mix or baby romaine* ($2.00)",
    "1/2 cup salad dressing* ($0.71)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cook the chicken first, to ensure it has time to cool before you build your salads. Warm chicken will cause the greens to wilt prematurely. Cover the chicken with plastic, then pound with a rolling pin until it an even thickness. This will help the breast cook evenly. Season both sides of the chicken breast with salt, pepper, and smoked paprika."
    },
    {
      "@type": "HowToStep",
      "text": "Heat 1 Tbsp cooking oil in a skillet over medium heat, then swirl to coat the surface of the skillet in oil. Add the chicken to the skillet and cook on each side for 5-7 minutes, or until it is well browned on the outside and cooked through. Transfer the chicken to a clean cutting board, let it rest for five minutes, then dice it into small pieces. Place the chopped chicken in a bowl and refrigerate while you prepare the rest of the ingredients."
    },
    {
      "@type": "HowToStep",
      "text": "Add one inch of water in a pot, place a lid on top, then bring to a boil over high heat. Place four large eggs in a steaming basket, and once the water is boiling, carefully lower the basket into the pot. Replace the lid on top and allow the eggs to steam for 12 minutes. After 12 minutes, transfer the steaming basket and eggs to a bowl full of ice water to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Place four slices of bacon in a skillet and cook over medium heat until brown and crispy (I used the same skillet that was used for the chicken). Once fully browned, transfer to a paper towel covered plate to drain."
    },
    {
      "@type": "HowToStep",
      "text": "To build the salads: Place 2 Tbsp dressing on the bottom of your container. Next, layer the chickpeas, tomatoes, and chopped chicken. Peel the eggs, slice or cut them into quarters, and add them to the dish. Crumble the bacon over top, followed by the cheese. Lastly, place a couple handfuls of fresh greens on top. Be sure not to pack it too tightly. Allowing air-flow will help keep the greens fresh."
    },
    {
      "@type": "HowToStep",
      "text": "The salads will keep about four days (depending on your specific ingredients, containers, and refrigerator environment). To serve, simply stir the salad or shake the closed container to distribute the dressing throughout."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/cobb-salad-meal-prep"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-01T01:03:18.338Z"
}
