{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "4"
  },
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-01T09:57:42.922Z",
  "datePublished": "2014-07-01T01:00:07+00:00",
  "description": "There are a lot of coconut bacon recipes floating around and they all look very good. It's important to note that not all liquid smoke is created equal, so you may want more or less depending on how smokey it is. Mine was made from hickory smoke and a tablespoon was sufficient for a nice and smoky flavour. You can also dial back the maple syrup if you'd prefer your coconut bacon a little less mapley.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2014/06/img_4398.jpg"
  ],
  "name": "coconut bacon - the real maple kind",
  "prepTime": "PT5M",
  "recipeIngredient": [
    "3 cups large coconut flakes",
    "2 Tbsp liquid aminos (I use Bragg's or soy sauce)",
    "1 - 1.5 Tbsp good quality maple syrup",
    "1 Tbsp liquid smoke",
    "1/2 tsp smoked paprika"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by preheating your oven to 325°F / 160°C. Line one large or two standard baking sheets with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, whisk together the liquid aminos, maple syrup, liquid smoke, and smoked paprika."
    },
    {
      "@type": "HowToStep",
      "text": "Place the coconut flakes into a large bowl and drizzle the liquid mixture over the top. Stir for about one minute to ensure the coconut is well coated and the liquid is evenly distributed."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the coconut onto the prepared baking sheet and place in the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Set a timer for 5 minutes. Stir the coconut and redistribute on the tray (you can lift the edges of the parchment to tip all of the coconut towards the centre, then stir, then smooth back out). Repeat two more times, so you're stirring at the 10 and 15 minute marks."
    },
    {
      "@type": "HowToStep",
      "text": "At this point you'll want to start checking the coconut every 1-2 minutes as it can go from browned to burnt very quickly."
    },
    {
      "@type": "HowToStep",
      "text": "The coconut should be dark brown in colour but not burnt."
    },
    {
      "@type": "HowToStep",
      "text": "Remove it from the oven and let the coconut bacon cool on the tray. It will become crispy as it cools."
    },
    {
      "@type": "HowToStep",
      "text": "Store in an airtight container, and use to add bacony deliciousness to all kinds of dishes. Coconut bacon not kept in an airtight container will become soft and will need to be carefully re-crisped in the oven."
    }
  ],
  "sameAs": [
    "https://heynutritionlady.com/coconut-bacon-the-real-maple-kind"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-01T09:57:42.921Z"
}
