{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-12-04T11:34:00.815Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Coconut And Strawberry Pavlova recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/1812-dairy-free-coconut-and-strawberry-pavlova:Square-1300x1300"
  ],
  "keywords": "Pavlova,Pescatarian,Seafood free,Gluten free,Sesame free,Summer,Strawberry,Christmas,Soy free,Vegetarian,Dairy free,Peanut free",
  "name": "Coconut And Strawberry Pavlova Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "8359",
  "recipeIngredient": [
    "0.25 cup tapioca pearls",
    "1 tbs cornflour",
    "0.25 cup pure icing sugar, sifted",
    "250g strawberries, hulled, sliced",
    "1 tsp white wine vinegar",
    "800ml coconut cream",
    "1.5 cup coconut yoghurt",
    "2 tbs coconut flakes, toasted",
    "6 egg whites",
    "1.5 cup caster sugar"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place coconut cream into the refrigerator overnight to chill. Do not shake or turn cans. Preheat oven to 100°C. Draw a 20cm circle on baking paper and place on a baking tray."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Beat egg whites and a pinch of salt with an electric beater until soft peaks form. Gradually add caster sugar, 1 tbs at a time, beating well after each addition until sugar has dissolved and mixture is well combined. Meringue should be glossy and thick. Add cornflour and vinegar and beat until combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spoon meringue into circle on tray and using a palette knife or spatula, shape sides of meringue and level the top. Bake for 11/2 hours or until meringue feels crisp. Turn oven off and leave pavlova to cool in oven with door ajar."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bring 11/4 cups of water to the boil in a small saucepan over a medium heat. Add tapioca and cook, stirring constantly, for 10 minutes or until softened. Remove from heat, cover, and stand for 10 minutes or until soft balls have formed. Stir in 2 tbs caster sugar. Transfer to a bowl and cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove coconut cream from fridge. Remove the solid coconut cream from the top of the cans and place cream into a bowl. Whisk for 30 seconds or until creamy and smooth. Add coconut yoghurt and icing sugar to cream and gently whisk until combined. Spoon cream onto pavlova and top with tapioca pearls, strawberries and coconut flakes. Serve immediately. Note: While every care has been taken to ensure this recipe is dairy-free, always check labels as ingredients differ from brand to brand."
    }
  ],
  "recipeNameId": "coconut-and-strawberry-pavlova",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/coconut-and-strawberry-pavlova"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-12-04T11:34:00.813Z",
  "url": "https://www.woolworths.com.au/shop/recipes/coconut-and-strawberry-pavlova"
}
