{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-11-23T02:35:54.000Z",
  "datePublished": "2021-03-11",
  "description": "Try our easy to follow Coconut Rough Cake recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/1910-coconut-rough-cake:Square-1300x1300"
  ],
  "keywords": "Celebration cake,Microwave,Christmas,Chocolate,Baking",
  "name": "Coconut Rough Cake Recipe | Woolworths",
  "prepTime": "PT120M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "9807",
  "recipeIngredient": [
    "3 tsp baking powder",
    "550g White Wings Premium All Purpose plain flour",
    "0.66 cup thickened cream",
    "4 tbs thickened cream",
    "0.25 cup thickened cream",
    "Assorted coconut and nougat chocolates of your choice (sliced)",
    "500g unsalted butter (at room temperature)",
    "1kg icing sugar mixture",
    "9 free range eggs (lightly beaten)",
    "0.5 cup McKenzie's Moist Coconut Flakes (toasted)",
    "2 cup McKenzie's Moist Coconut Flakes",
    "120g Cadbury Bournville Cocoa",
    "3 tbs Cadbury Bournville Cocoa",
    "3 coconut milk",
    "600g caster sugar",
    "200g Cadbury Baking Milk Chocolate block (melted)",
    "2 Cadbury Milk Chocolate Melts",
    "225g Cadbury Milk Chocolate Melts (melted)",
    "225g Cadbury Milk Chocolate Melts",
    "Dollar Sweets Hip Hip Hooray Cupcake Kit"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 170°C. Grease 3 x 20cm round cake pans and line bases and sides with baking paper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chocolate coconut cake, in a large bowl combine dry ingredients with 1 tsp salt. In a separate large bowl, combine eggs, coconut milk and 450ml water. Add wet ingredients to dry ingredients and whisk until combined. Divide between cake tins and bake for 45 minutes or until a skewer inserted into the centres comes out clean. Set aside to cool completely. Trim tops to level cakes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the ganache filling, place chocolate in a heatproof bowl. Heat cream on the stove until just about to boil, then pour over chocolate. Stir to combine, then cover and refrigerate for 4 hours or until thick and spreadable."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the buttercream icing, beat butter with a pinch of salt for 7 minutes or until thick and pale. Add icing sugar, a little at a time, and mix until fully incorporated. Divide mixture into three. To make darkest-coloured icing, stir in two-thirds of the melted chocolate, 2 tbs cocoa and 2 tbs cream. To make medium-coloured icing, stir in the remaining melted chocolate, 1 tbs cocoa and 1 tbs cream. For lightest-coloured icing, add 1 tbs cream and stir to combine."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To assemble the cake, sandwich cake layers with ganache. Coat with a thin layer of light-coloured icing and refrigerate for 20 minutes or until set. Spoon each colour buttercream into separate piping bags. Pipe darkest buttercream one-third of the way up the sides. Repeat with lighter colours to make an ombre pattern. Use a cake scraper or ruler to scrape icing smooth."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the milk chocolate drip, combine chocolate and cream in a microwave-safe bowl and microwave for 30 seconds. Stir until fully melted. Transfer to a piping bag or zip-lock bag with corner snipped and run around the top edge of cake, creating drips. Fill in the top of cake with remaining chocolate sauce. Allow to set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chocolate coconut shard decorations, spread half the melted chocolate onto a tray lined with baking paper. Top with some of the coconut and freeze until set, then break or cut into shards."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make chocolate curls, spread remaining melted chocolate over a large sheet of baking paper. Roll up into a 3cm-wide roll and freeze for 20 minutes or until set. Unwrap to break into large curls or shards. Freeze until ready to decorate."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Decorate cake with chocolate coconut shards and curls, chocolates and remaining toasted coconut."
    }
  ],
  "recipeNameId": "coconut-rough-cake",
  "recipeYield": "16",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/coconut-rough-cake"
  ],
  "totalTime": "PT165M",
  "updatedAt": "2022-12-02T20:44:27.073Z",
  "url": "https://www.woolworths.com.au/shop/recipes/coconut-rough-cake"
}
