{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - baybee"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-26T02:43:04.000Z",
  "datePublished": "2022-08-03",
  "description": "This slice was inspired by Snowy's yummy slice, just love that coffee taste. Perfect for afternoon tea, or anytime for that matter.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/l0xfzmgdzqrjvwmvzqkr:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Biscuit",
  "name": "Coffee Lattice Slice Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "a0K2y0000012aqHEAQ",
  "recipeIngredient": [
    "2 pkts arnotts lattice biscuits",
    "600ml thickend cream",
    "2 pkts instant vanilla pudding",
    "2 shots espresso coffee",
    "4 tbs coffee syrup (i used caramel flavour)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "If any of you know of Snowy's Lattice Slice, this is a take on that. If you don't know of it then check it out. Gather your ingredients and first thing to make is your Espresso, that way you'll give it time to cool down when added to the cream. Don't wont cream to curdle!"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/wetj00fezjtvxxeahdky?$foodhub-method-images$&fmt=png-alpha",
      "text": "Using a tray 19 x 30 cm, start to pre cut your Lattice Biscuits and place them upside down in tray. You wont use all biscuits but you will have some fall apart on you."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/ivooayddn3bfxsdbzffv?$foodhub-method-images$&fmt=png-alpha",
      "text": "Pop your cream and one packet of pudding in bowl and mix till starts to thicken, start to add in your coffee shot. Do half at a time and stir till blended. You will find that you will need to add more of the 2nd custard mix, just do a bit at a time. Then add more of the cooled coffee shot, mix again. Start to add in the coffee syrup, mine is (Caramel flavoured) this will counter the bitterness of the coffee shots. You wont need all the syrup, you are just adding to your pallet. So taste as you go. I ended up using around 2 1/2 tbsp of syrup and not quite 1/2 a packet of the 2nd instant pudding. You will end up with a light mocha colour filling. Spread evenly over the top of your biscuits."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/wavft1yrol69sorvlnky?$foodhub-method-images$&fmt=png-alpha",
      "text": "Start to layer the top with more of the pre cut Lattice Biscuits. Pressing down on top layer so it is firmly embedded in the filling. I used some of the broken bits to fill in on one side, trust me. No one will complain about the broken bits, but if serving to be fancy pants keep those one's aside for yourself. Pop in the fridge for a few hours, the longer you leave it the softer and easier it will be to slice."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/mjaywtpolglcrd2g23uw?$foodhub-method-images$&fmt=png-alpha",
      "text": "Grandson couldn't wait, so served it up after 4 hours. Biscuit still had some nice crunch to it, and tasted divine. Like a French Vanilla Slice without the icing. Serve it up with a dusting of icing sugar and enjoy. Cheers all."
    }
  ],
  "recipeNameId": "coffee-lattice-slice",
  "recipeYield": "16",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/coffee-lattice-slice"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-26T02:38:23.469Z",
  "url": "https://www.woolworths.com.au/shop/recipes/coffee-lattice-slice"
}
