{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "20",
    "ratingValue": "4.95"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-02T05:53:20.019Z",
  "datePublished": "2017-01-02T05:00:12+00:00",
  "description": "Spring rolls with a twist! Veggies + tofu wrapped in collard greens and served with a spicy-sweet sunflower butter dipping sauce. A satisfying and healthy plant-based snack or side.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/12/Collard-Green-Spring-Rolls-SQUARE.jpg"
  ],
  "keywords": "spring rolls",
  "name": "Collard Green Spring Rolls + Sunflower Butter Dipping Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "95 kcal",
    "carbohydrateContent": "9.7 g",
    "fatContent": "5 g",
    "fiberContent": "2.6 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 rolls",
    "sodiumContent": "172 mg",
    "sugarContent": "3.9 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "10 ounces extra-firm tofu* (optional to brush with tamari + roll in sesame seeds)",
    "1 bundle collard greens (~11-12 large collards per bundle)",
    "1 small red bell pepper (thinly sliced vertically)",
    "1 1/2 cups bean sprouts",
    "1 cup packed basil",
    "1 cup finely sliced red (purple) cabbage",
    "3 medium whole carrots (peeled and very finely chopped // I used my mandolin with the medium blade teeth)",
    "1/3 cup creamy unsalted sunflower seed butter",
    "1 1/2 -2 Tbsp tamari (or soy sauce if not GF)",
    "2-3 Tbsp maple syrup (to taste)",
    "1/2 medium lime, juiced (yields ~2 Tbsp or 30 ml as original recipe is written)",
    "1/2 tsp chili garlic sauce (or 1 thai red chili minced // or 1/4 tsp red pepper flake // amounts as original recipe is written)",
    "Hot water (to thin)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by wrapping your tofu in a clean, absorbent towel and setting something heavy on top (such as a cast-iron skillet) to drain the excess liquid."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prep the collard greens by chopping the stems off and using a small, sharp knife to slightly shave/trim down the thickness of the stems at the base of the leaf. This isn't a necessary step, but it will allow it to fold/roll more easily."
    },
    {
      "@type": "HowToStep",
      "text": "Next, prep vegetables and slice the tofu in long, rectangular cubes. Arrange on a tray or cutting board (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare dipping sauce by adding sunflower seed butter, tamari, maple syrup, lime juice, and chili garlic sauce to a small mixing bowl and whisking to combine. Add enough warm water to thin into a thick but pourable sauce. Taste and adjust flavor as needed, adding more lime juice for acidity, chili garlic sauce for heat, maple syrup for sweetness, or tamari for saltiness."
    },
    {
      "@type": "HowToStep",
      "text": "Next, lay a collard green down on a flat surface, and near the stem, layer on basil, tofu, red pepper, cabbage, bean sprout, and carrot (see photo). Use your hands to fold the collard green over once so the fillings are secured inside, and then tuck in the sides of the collard green and continue rolling until you have a loose spring roll. Lay seam-side down on a serving platter and continue until all fillings are used - about 11-12 rolls (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, I sliced my rolls in half and arranged them in a serving bowl with the dipping sauce (see photo). But you can also just leave them whole!"
    },
    {
      "@type": "HowToStep",
      "text": "These keep extremely well in the refrigerator up to 3 days, and the sauce will keep for up to 5-7 days (stored covered, separately in the fridge)."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/collard-green-spring-rolls-sunbutter-dipping-sauce"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T05:53:20.018Z"
}
