{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "createdAt": "2022-12-03T14:02:42.343Z",
  "datePublished": "2016-06-29T08:53:12+00:00",
  "description": "Reprinted from The Vegetable Butcher, with permission from Workman Publishing. Copyright © 2016, Cara Mangini",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2016/06/corn_fritters_with_summer_bean_ragout_recipe-1.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/06/corn_fritters_with_summer_bean_ragout_recipe-1-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/06/corn_fritters_with_summer_bean_ragout_recipe-1-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/06/corn_fritters_with_summer_bean_ragout_recipe-1-480x270.jpg"
  ],
  "keywords": "Corn Fritters, Corn Fritters with Summer Bean Ragout",
  "name": "Corn Fritters with Summer Bean Ragout",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "243 kcal",
    "carbohydrateContent": "20 g",
    "cholesterolContent": "49 mg",
    "fatContent": "16 g",
    "fiberContent": "3 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "394 mg",
    "sugarContent": "6 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "14 g"
  },
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 tablespoons olive oil",
    "4 garlic cloves (minced)",
    "1 jalapeño pepper (stemmed, seeded (ribs removed), and finely diced)",
    "1 tablespoon tomato paste",
    "3/4 pound mixed string beans (yellow wax, green, purple, and Romano beans, cut on a diagonal into 1-inch lengths)",
    "1 1/2 pounds Roma or plum tomatoes (about 6 medium tomatoes, stemmed, seeded, and coarsely diced)",
    "1 1/2 teaspoons fine sea salt (plus extra as needed)",
    "1/4 teaspoon Black Pepper (plus extra as needed)",
    "1/2 cup dry white wine such as Pinot Grigio or Sauvignon Blanc",
    "2 sprigs fresh thyme 1 to 2 tablespoons unsalted butter (optional)",
    "1/2 cup loosely packed fresh basil leaves (thinly sliced)",
    "3 cups fresh corn kernels (from about 4 ears)",
    "2 tablespoons minced shallots",
    "3 large eggs (lightly beaten)",
    "1/2 cup plus 2 tablespoons all-purpose flour",
    "1/2 cup canola oil",
    "1/4 cup Balsamic Reduction"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat the olive oil in a deep sauté pan over medium heat. Add three quarters of the garlic and cook, stirring often, until it just becomes fragrant, 30 to 60 seconds; do not let it brown. Add the jalapeño and tomato paste, stirring well to break up and incorporate the tomato paste. Turn the heat up to medium high, add the string beans, and cook, stirring to coat, for 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add the tomatoes, 1/2 teaspoon of salt, and 1/? teaspoon of pepper and cook, stirring, until the tomatoes begin to melt, 2 minutes. Add the wine and bring it to a boil. Turn the heat to medium low, add the thyme sprigs, and simmer until the beans are tender and the tomatoes have completely melted into a thick, chunky sauce (there should be no watery liquid remaining), 20 to 25 minutes. Remove the thyme sprigs. Stir in the butter if you wish and half of the basil. Adjust the salt and pepper to taste. Remove from the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, combine the corn kernels, remaining minced garlic, shallots, eggs, remaining teaspoon of salt, and remaining 1/? teaspoon of pepper in a medium-size bowl. Stir well to incorporate the eggs, then stir in the flour until fully incorporated. The batter will be firm enough to hold together but loose enough to spread slightly in the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Place several paper towels on top of a wire cooling rack. Heat the canola oil in a large skillet over medium-high heat until it begins to shimmer, then reduce the heat to medium."
    },
    {
      "@type": "HowToStep",
      "text": "Working in batches, use a large spoon to fill a 1/?-cup measure with the batter and then use the spoon to help release the batter directly into the oil, being careful not to overcrowd the pan. Fry the corn fritters until they are golden brown and crispy, 2 to 2 1/2 minutes on each side. Transfer the fritters to the prepared cooling rack and sprinkle them lightly with salt. Reduce the heat to low between batches and remove any stray corn kernels left in the oil. Bring the heat back up to medium and continue to fry another round of fritters. Reduce the heat again if the fritters brown too quickly at any time or if the corn starts to pop. The fritters are best straight out of the pan, but you can make them ahead and store them, in a single layer on a baking sheet, for up to 2 hours. (Reheat them at 425°F until warmed through and crispy, about 6 minutes.)"
    },
    {
      "@type": "HowToStep",
      "text": "Serve the fritters immediately, topped with hearty spoonfuls of the bean ragout, the remaining basil, and a generous drizzle of Balsamic Reduction."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://ohmyveggies.com/corn-fritters-with-summer-bean-ragout-from-the-vegetable-butcher"
  ],
  "suitableForDiet": [
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T14:02:42.342Z"
}
