{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-11-25T11:24:24.011Z",
  "datePublished": "2022-02-01T10:56:44+00:00",
  "description": "This luxurious and creamy sweet potato soup features warm spices and oven roasted sweet potatoes for maximum flavor and natural sweetness.",
  "image": {
    "@type": "ImageObject",
    "height": 900,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2022/01/Creamy-Sweet-Potato-Soup-single.jpg",
    "width": 1200
  },
  "keywords": "bisque, creamy soup, Potato Soup, sweet potato soup",
  "name": "Creamy Sweet Potato Soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "389 kcal",
    "carbohydrateContent": "51 g",
    "fatContent": "19 g",
    "fiberContent": "7 g",
    "proteinContent": "6 g",
    "servingSize": "1.5 cups",
    "sodiumContent": "1144 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 lbs. sweet potatoes ($1.98)",
    "2 Tbsp olive oil, divided ($0.32)",
    "1 yellow onion ($0.32)",
    "4 cloves garlic ($0.32)",
    "1/2 tsp ground cumin ($0.05)",
    "1/4 tsp smoked paprika ($0.02)",
    "1/8 tsp cayenne ($0.02)",
    "1/8 tsp cinnamon ($0.02)",
    "1/4 tsp freshly cracked black pepper ($0.02)",
    "4 cups chicken broth ($0.52)",
    "1/2 cup heavy cream ($0.50)",
    "1/4 tsp salt (or to taste) ($0.02)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400oF. Line a baking sheet with parchment paper. Slice the sweet potatoes in half lengthwise, then prick the skins a few times with a fork. Rub 1 tablespoon olive oil over all surfaces of the sweet potatoes, then place them face down on the baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the baking sheet to the preheated oven and roast for 30 minutes. After roasting for 30 minutes, check to see if they are tender all the way through (pierce with a fork). If not tender, return them to the oven for about 10 minutes and check again. Total roasting time will depend on the size of your potatoes. Allow the sweet potatoes to cool slightly after roasting."
    },
    {
      "@type": "HowToStep",
      "text": "While the sweet potatoes are cooling, dice the onion and mince the garlic. Add the onion and garlic to a skillet along with the remaining 1 tablespoon olive oil. Sauté the onion and garlic over medium heat until the onions are soft."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cumin, smoked paprika, cayenne, cinnamon, and pepper to the skillet with the onions and garlic, and continue to sauté for about a minute more."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop the slightly cooled sweet potato flesh out of their skins and into a blender (6 cup capacity or larger). Also add the onion mixture and 2 cups chicken broth (swirl a little bit of the broth in the skillet first to pick up all the spices). Purée the mixture until smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the puréed sweet potato mixture to a soup pot and add an additional 1 to 2 cups chicken broth (less for a really thick soup, more for a more liquid soup). Heat the soup through over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "Stir the heavy cream into the soup, then taste and adjust the salt or pepper if needed. Serve hot."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/creamy-sweet-potato-soup"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-11-25T11:24:24.010Z"
}
