{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "31",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T10:46:44.344Z",
  "datePublished": "2014-12-16T05:00:22+00:00",
  "description": "Simple vegan spinach and kale dip made with just 9 ingredients that will please a crowd. Cheesy, hearty, chock-full of greens, and so delicious. Perfect for holiday parties and beyond.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/12/Creamy-kale-and-spinach-dip-SQUARE.jpg"
  ],
  "keywords": "spinach dip",
  "name": "Creamy Kale and Spinach Dip",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "275 kcal",
    "carbohydrateContent": "19 g",
    "fatContent": "19 g",
    "fiberContent": "4.7 g",
    "proteinContent": "11 g",
    "saturatedFatContent": "3.5 g",
    "servingSize": "1 serving",
    "sodiumContent": "466 mg",
    "sugarContent": "1.7 g"
  },
  "prepTime": "PT75M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/4 cups cashews (soaked overnight or in boiling hot water for 1 hour // then thoroughly drained)",
    "2 Tbsp olive oil (divided)",
    "1/2 cup unsweetened plain almond milk (sub up to half with water)",
    "4-6 Tbsp nutritional yeast (to taste)",
    "1 tsp sea salt (divided)",
    "3 cloves garlic (minced)",
    "1 10-ounce package frozen chopped spinach (thawed and squeeze-drained)",
    "3 cups kale (finely chopped // or just double up on spinach)",
    "1/4 cup Vegan Parmesan Cheese",
    "Veggies, crackers, chips, or 1/2 baguette sliced and toasted (optional // for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven’t soaked your cashews yet, do so the night before in room temperature water, or 1 hour before in very hot water. Drain thoroughly."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and lightly grease a small, oven-safe serving dish (see photo for size reference)."
    },
    {
      "@type": "HowToStep",
      "text": "Add soaked and drained cashews to a blender with almond milk and puree into a cream. Add 1/4 cup nutritional yeast and 3/4 tsp sea salt (amounts as original recipe is written // adjust if altering batch size) and mix once more. Taste and adjust seasonings as needed. You want it pretty cheesy and well-salted, so I added the full 6 Tbsp nutritional yeast (amount as original recipe is written // adjust if altering batch size). Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a large skillet over medium heat, sauté garlic in 1 Tbsp olive oil (amount as original recipe is written // adjust if altering batch size) and then add spinach and kale. Season with a healthy pinch (1/4 tsp as original recipe is written // adjust if altering batch size) of sea salt and black pepper and cook for 5 minutes or until wilted, then remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Add 3/4 of the cashew cream (see photo) and toss to combine. If it can take more, add it in. Otherwise, reserve the rest for pasta or other uses. Add 2 Tbsp vegan parmesan cheese for additional texture/flavor and stir."
    },
    {
      "@type": "HowToStep",
      "text": "Add to prepared baking dish and top with remaining vegan parmesan."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 15-20 minutes, or until warmed through and sightly browned on top."
    },
    {
      "@type": "HowToStep",
      "text": "Before serving, top with additional vegan parmesan cheese if desired. Other add-ons might include red pepper flake or hemp seeds."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with assorted vegetables, tortilla chips, crackers, or toasted baguette. Store leftovers covered in the fridge for up to a few days, though best when fresh."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/creamy-kale-and-spinach-dip"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-12-04T10:46:44.343Z"
}
