{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.78"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-04T16:54:27.038Z",
  "datePublished": "2016-11-21T05:00:17+00:00",
  "description": "Insanely delicious kale salad with crispy chickpeas, pan-fried shallot, and a creamy tahini dressing. Just 30 minutes required for this vegan, gluten-free meal!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/10/Creamy-Kale-Salad-with-Chickpeas-SQUARE.jpg"
  ],
  "keywords": "creamy chickpea kale salad",
  "name": "Creamy Kale Salad with Chickpeas, Beets & Dukkah",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "712 kcal",
    "carbohydrateContent": "78.5 g",
    "fatContent": "38.8 g",
    "fiberContent": "15.2 g",
    "proteinContent": "22.1 g",
    "saturatedFatContent": "5.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "400 mg",
    "sugarContent": "22.1 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Salad",
  "recipeCuisine": "Egyptian/Mediterranean",
  "recipeIngredient": [
    "1 15-ounce can chickpeas, drained, rinsed and well dried",
    "1 Tbsp grapeseed or avocado oil",
    "1 tsp ground cumin",
    "1 tsp smoked paprika",
    "1 tsp coconut sugar",
    "1 tsp dried oregano",
    "1/2 tsp ground turmeric",
    "1/4 tsp ground cinnamon",
    "1/4 tsp sea salt",
    "1 pinch each ground cardamom + coriander (optional)",
    "1 cup thinly sliced shallot (3 large shallots yield ~1 cup)",
    "2 Tbsp brown rice (or all-purpose) flour",
    "1 pinch each salt + pepper",
    "Avocado, grape seed, or coconut oil for pan-frying",
    "1/3 cup tahini",
    "2 tsp finely minced garlic",
    "1 medium lemon juiced (yields ~3 Tbsp or 45 ml as original recipe is written)",
    "1 1/2-2 Tbsp maple syrup (or to taste)",
    "Water to thin (~1/4 cup or 60 ml as original recipe is written)",
    "1 large bundle kale (non curly // or sub mixed greens)",
    "1 Tbsp avocado or grape seed oil",
    "1 Tbsp lemon juice",
    "1 medium beet",
    "1/2 cup roasted unsalted hazelnuts",
    "1/3 cup sesame seeds",
    "2 Tbsp coriander seeds (or 1 heaping Tbsp ground coriander per 2 Tbsp seeds)",
    "2 Tbsp ground cumin",
    "1 tsp ground black pepper",
    "1/2 tsp sea salt",
    "1/4 tsp each ground cinnamon + coconut sugar (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and add rinsed, (thoroughly) dried chickpeas to a small mixing bowl. Add oil, cumin, paprika, coconut sugar, oregano, turmeric, cinnamon, sea salt, cardamom and coriander (optional), and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Spread on a bare baking sheet and bake for 22-27 minutes, or until deep golden brown and slightly crispy - they'll crisp up more as they cool."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add shallot to the same small mixing bowl from earlier and top with brown rice flour and a pinch each salt and black pepper. Toss to coat and heat a cast iron or metal skillet over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "Once hot, add enough oil to lightly coat the bottom of the pan and add shallot and all of coating. Sauté, stirring occasionally, until soft and light golden brown - about 4 minutes. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Make the dressing by adding tahini, garlic, lemon juice, and maple syrup to a small mixing bowl and whisking to combine. Add enough water to thin until pourable - about 1/4 cup (amount as original recipe is written // adjust if altering batch size). Whisk until creamy and smooth. Taste and adjust seasonings as needed, adding more lemon juice for acidity, salt + pepper for flavor balance, or maple syrup for sweetness. Garlic will add more bite/spice."
    },
    {
      "@type": "HowToStep",
      "text": "Add kale to a large mixing bowl and top with oil and lemon juice. Massage with hands to soften and coat the kale for about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "If serving with dukkah, prepare by adding hazelnuts to a food processor and pulsing into a fine meal. Next, heat a skillet over medium heat and add sesame seeds. Toast/brown, stirring frequently, until the natural oils begin to release and they turn light brown and become fragrant. Then transfer to the food processor. To the still warm skillet add the coriander seed and toast until some of the seeds begin to pop and they are fragrant. Move off the heat and smash with a pestle or wooden spoon. Then add to food processor along with ground cumin, pepper and sea salt, cinnamon and coconut sugar (optional). Process to combine. Set aside. Store completely cooled leftovers in a sealed container at room temperature up to 3 weeks, though best in the first two weeks."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, add grated beets, chickpeas and shallot to the kale and top with several spoonfuls of dukkah (optional). Add half of the dressing and toss to combine. Divide between servings plates and serve with additional dukkah and leftover dressing. Best when fresh, though leftovers will keep in the refrigerator up to 3 days."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://minimalistbaker.com/creamy-chickpea-kale-salad"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T16:54:27.036Z"
}
