{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "245",
    "ratingValue": "4.74"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-05T12:33:50.613Z",
  "datePublished": "2016-02-27T05:00:14+00:00",
  "description": "Creamy, naturally sweetened vegan lemon bars made with 10 simple ingredients and a delicious gluten-free crust.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/01/CREAMY-Vegan-lemon-bars-SQUARE.jpg"
  ],
  "keywords": "lemon bars",
  "name": "Creamy Vegan Lemon Bars",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "326 kcal",
    "carbohydrateContent": "24.3 g",
    "fatContent": "24.6 g",
    "fiberContent": "3.3 g",
    "proteinContent": "5.9 g",
    "saturatedFatContent": "13.7 g",
    "servingSize": "1 bars",
    "sodiumContent": "61 mg",
    "sugarContent": "11.4 g"
  },
  "prepTime": "PT300M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup raw cashews",
    "1 cup coconut cream* (the hardened portion at the top of full-fat coconut milk)",
    "2 Tbsp arrowroot or cornstarch",
    "1/2 cup lemon juice (2 large lemons yield ~1/2 cup or 120 ml)",
    "1 heaping Tbsp lemon zest (1 large lemon yields ~1 heaping Tbsp or 4 g)",
    "1 pinch sea salt",
    "1/4 cup maple syrup (plus more to taste)",
    "2 Tbsp organic powdered sugar (optional // for topping)",
    "1 cup gluten-free oats",
    "1 cup raw almonds",
    "1/4 tsp sea salt",
    "2 Tbsp coconut sugar",
    "1 Tbsp maple syrup",
    "4-5 Tbsp coconut oil (melted)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add raw cashews to a mixing bowl and cover with boiling hot water. Let rest for 1 hour (uncovered). Then drain thoroughly."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, preheat oven to 350 degrees F (176 C) and line an 8x8 inch baking dish with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Add oats, almonds, sea salt, and coconut sugar to a high speed blender and mix on high until a fine meal is achieved."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a medium mixing bowl and add maple syrup and melted coconut oil, starting with lesser end of range (4 Tbsp or 60 g as original recipe is written // adjust if altering batch size) and adding more if it's too dry. Stir with a spoon to combine until a loose dough is formed. You should be able to squeeze the mixture between two fingers and form a dough instead of it crumbling. If too dry, add a bit more melted coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to parchment-lined baking pan and spread evenly. Then place parchment paper on top and use a flat-bottomed object, such as a drinking glass, to press down firmly until it’s evenly distributed and well packed."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 15 minutes, then increase heat to 375 F (190 C) and bake for 5-8 minutes more, or until the edges are golden brown and there is some browning on the surface. Remove from oven to cool slightly, then reduce oven heat to 350 degrees F (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Once cashews are soaked and drained, add to a high speed blender with coconut cream, arrowroot starch, lemon juice, lemon zest, sea salt, and maple syrup. Mix on high until very creamy and smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed. I added a bit more lemon zest and maple syrup. It should be very lemony, and not overly sweet."
    },
    {
      "@type": "HowToStep",
      "text": "Pour filling over the pre-baked crust and spread into an even layer. Tap on counter to remove any air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 20-23 minutes or until the edges look very slightly dry and the center appears “jiggly” but not liquidy."
    },
    {
      "@type": "HowToStep",
      "text": "Let rest for 10 minutes, then transfer to refrigerator to let cool completely (uncovered) - at least 4 hours, preferably overnight."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, slice and sift with powdered sugar (optional). Store leftovers in the refrigerator, covered, up to 4 days, though best within the first 2 days."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://minimalistbaker.com/creamy-vegan-lemon-bars"
  ],
  "totalTime": "PT345M",
  "updatedAt": "2022-12-05T12:33:50.613Z"
}
