{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "21",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-30T14:25:00.467Z",
  "datePublished": "2015-08-31T15:55:21+00:00",
  "description": "A rich and garlicky spinach cream sauce, artichoke hearts, and melty mozzarella make this thick crust Spinach Artichoke Pizza ultra indulgent!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2015/08/Creamy-Spinach-Artichoke-PIzza-close-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2015/08/Creamy-Spinach-Artichoke-PIzza-close-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2015/08/Creamy-Spinach-Artichoke-PIzza-close-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2015/08/Creamy-Spinach-Artichoke-PIzza-close-1-480x270.jpg"
  ],
  "keywords": "artichoke pizza, pan pizza, spinach pizza, white pizza",
  "name": "Creamy Spinach Artichoke Pizza",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "794.33 kcal",
    "carbohydrateContent": "88.07 g",
    "fatContent": "37.67 g",
    "fiberContent": "12.87 g",
    "proteinContent": "27.7 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1864.57 mg"
  },
  "prepTime": "PT720M",
  "recipeIngredient": [
    "2 cups all-purpose flour ($0.30)",
    "1 tsp salt ($0.05)",
    "1/8 tsp instant yeast ($0.02)",
    "1 Tbsp olive oil ($0.16)",
    "3/4-1 cup water ($0.00)",
    "1/2 lb. frozen chopped spinach ($0.85)",
    "1 Tbsp butter ($0.10)",
    "1 clove garlic ($0.08)",
    "4 oz. cream cheese ($1.00)",
    "1/2 cup milk ($0.19)",
    "1/4 tsp salt ($0.02)",
    "1 Tbsp cooking oil ($0.02)",
    "1/2 15oz. can artichoke hearts ($1.30)",
    "1 pinch crushed red pepper (optional) ($0.05)",
    "1 cup shredded mozzarella ($1.00)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin the dough the night before. In a large bowl stir together the flour, salt, and yeast. Combine the olive oil and 3/4 cup water, then pour it into the bowl with the flour. Stir until a single (slightly wet and sticky) ball of dough forms with no dry flour left on the bottom of the bowl. Add one to two tablespoons more of water, if needed, to form a ball of dough. Loosely cover the dough and let it sit at room temperature for 12-18 hours."
    },
    {
      "@type": "HowToStep",
      "text": "The next day let the spinach thaw and then squeeze out as much moisture as possible. Preheat the oven to 450oF and pour 1 Tbsp of cooking oil into a 10 or 12-inch cast iron skillet. Spread the oil around the skillet, including up the side walls."
    },
    {
      "@type": "HowToStep",
      "text": "To make the sauce, mince the garlic and add it to a small pot along with the butter. Sauté the butter and garlic for 1-2 minutes over medium-low heat, or until the garlic is soft and fragrant. Add the cream cheese, milk, and salt to the butter and garlic. Whisk and cook over medium-low heat until the cream cheese has melted into the milk and a thick sauce forms (3-5 minutes). Finally, stir the squeeze-dried spinach into the sauce, breaking up any clumps as you stir. Remove the sauce from the heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Use the excess oil from the skillet to coat your hands, then scrape the fermented dough out of the bowl. Gently press and stretch the loose dough into the skillet until it evenly covers the bottom."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the creamy spinach sauce over the dough, covering from edge to edge. Drain the artichoke hearts, give them a rough chop, then sprinkle over the creamy spinach sauce. Add a pinch of red pepper flakes, if desired. Finally, top the pizza with the shredded mozzarella."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the pizza in the fully preheated oven for 20-25 minutes, or until the edges are sizzling and the top is golden brown. Remove the pizza from the oven and slide a butter knife around the edges to loosen any melted cheese. Either slide the whole pizza onto a cutting board or carefully slice the pizza in the pan. Cut into six slices and serve."
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://budgetbytes.com/creamy-spinach-artichoke-pizza"
  ],
  "totalTime": "PT745M",
  "updatedAt": "2022-11-30T14:25:00.465Z"
}
