{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "24",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T08:30:25.060Z",
  "datePublished": "2014-05-29T05:00:57+00:00",
  "description": "10-ingredient vegan GF mint ice cream with brownie chunks!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/04/Mint-Brownie-Ice-Cream-SQUARE.jpg"
  ],
  "keywords": "vegan mint ice cream",
  "name": "Creamy Vegan Mint Brownie Ice Cream",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "526 kcal",
    "carbohydrateContent": "52 g",
    "fatContent": "35.2 g",
    "fiberContent": "5.8 g",
    "proteinContent": "8.9 g",
    "saturatedFatContent": "15.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "19 mg",
    "sugarContent": "37.7 g",
    "unsaturatedFatContent": "17.1 g"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup fresh mint (divided)",
    "1 1/2 cups raw cashews (soaked for 8 hours, then drained)",
    "1 14-ounce can full-fat coconut milk (or other non-dairy milk, though full-fat coconut will yield creamiest result)",
    "1/2 - 3/4 tsp peppermint extract (depending on how minty you like it)",
    "1/4 cup cane sugar",
    "1/4 cup agave nectar or maple syrup (or honey if not vegan)",
    "3 Tbsp coconut oil (melted)",
    "1 tps vanilla extract (optional)",
    "1 cup packed dates (pitted // if your dates are dried out, soak them in warm water for 10 minutes to plump them back up then drain)",
    "1 1/4 cups raw walnuts (I used a mix of almonds and walnuts)",
    "1/3 cup cacao OR cocoa powder (though cocoa powder makes it not technically raw)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Set your churning bowl in the freezer the night before to chill. Soak your cashews the night before as well, or for at least 4-6 hours before blending."
    },
    {
      "@type": "HowToStep",
      "text": "OPTIONAL STEP: When ready to prepare ice cream, steep HALF of your fresh mint leaves in the coconut milk. Bring the coconut milk to a simmer in a small saucepan and add the mint leaves, then turn to low. Use a wooden spoon or muddler to puncture the mint so it infuses the coconut milk. Keep on low for 15 minutes, then kill heat and let cool. Once cooled, strain out the mint leaves using a fine mesh strainer and pour the coconut milk right into a blender. (If not doing this step, just add all of the fresh mint and coconut milk right into the blender. The flavor won't be AS strong, but it will still be delicious.)"
    },
    {
      "@type": "HowToStep",
      "text": "Add remaining ingredients, including DRAINED cashews and remaining fresh mint (vanilla extract is optional) and blend until creamy and smooth - about 3-4 minutes, using the \"liquify option\" if you have it. Taste and adjust sweetness/minty-ness as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add mixture to your chilled ice cream maker bowl and churn according to manufacturer’s instructions until thoroughly chilled, about 45 minutes. It should resemble thick soft serve (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "While churning, prepare your raw brownie by processing dates in the food processor until small bits remain - it will likely form into a ball. Remove and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add nuts and process until small bits remain, then add back in dates and cocoa or cacao powder and process until well combined (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a piece of plastic wrap or parchment paper and use hands to form into a \"brick\" shape. Set in freezer to chill."
    },
    {
      "@type": "HowToStep",
      "text": "Once ice cream is done churning, break off chunks of your brownie and stir into the ice cream. I used about 3/4 of my brownie."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer ice cream to a freezer-safe container, cover with plastic wrap and freeze until hard - at least 6 hours, preferably overnight. Will keep in the freezer for up to one week, though best when fresh."
    },
    {
      "@type": "HowToStep",
      "text": "Before serving, let thaw on the counter for 10-15 minutes to soften."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/creamy-vegan-mint-brownie-ice-cream"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-04T08:30:25.058Z"
}
