{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-11-28T15:59:37.260Z",
  "datePublished": "2017-10-30T09:52:58+00:00",
  "description": "Sautéed mushrooms are layered between pasta sheets, creamy vegan ricotta, and gooey truffle-infused bechamel sauce to create this luscious, savory and super creamy vegan mushroom lasagna.",
  "image": {
    "@type": "ImageObject",
    "height": 1050,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2017/10/creamy-vegan-mushroom-lasagna-2-of-3.jpg",
    "width": 700
  },
  "keywords": "mushrooms, pasta",
  "name": "Creamy Vegan Mushroom Lasagna",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "526 kcal",
    "carbohydrateContent": "43.3 g",
    "fatContent": "32.3 g",
    "fiberContent": "3 g",
    "proteinContent": "17.8 g",
    "saturatedFatContent": "5.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "666 mg",
    "sugarContent": "7.8 g"
  },
  "prepTime": "PT40M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "8 ounces lasagna noodles (about 12 noodles)",
    "1/4 cup olive oil",
    "1 cup finely chopped shallots (3-4 shallots)",
    "4 garlic cloves, minced",
    "1 1/2 pounds assorted mushrooms, coarsely chopped (I used a mix of shiitake, oyster, cremini and white button)",
    "3/4 cup dry white wine",
    "1 tablespoon fresh thyme leaves (or 1 teaspoon dried)",
    "1/2 teaspoon salt, (plus more to taste)",
    "Black pepper, (to taste)",
    "1 tablespoon truffle oil (optional but highly recommended)",
    "1/3 cup all-purpose flour",
    "3 cups unflavored and unsweetend soy or almond milk",
    "1 teaspoon salt, (or to taste)",
    "1 1/2 cups raw cashews, (soaked in water 4-8 hours, rinsed and drained)",
    "3/4 cup unflavored and unsweetened soy or almond milk",
    "2 tablespoons lemon juice",
    "1 garlic clove",
    "10.5 ounces firm or extra firm tofu, (drained (3/4 of a 14 ounce package)",
    "1/2 teaspoon salt, (or more to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of salted water to a boil and add the noodles. Cook them according to the package directions, then drain into a colander. Return the noodles to the pot and toss with a few dashes of olive oil to prevent sticking."
    },
    {
      "@type": "HowToStep",
      "text": "To make the mushroom filling, coat the bottom of a large skillet with olive oil and place it over medium heat. When the oil is hot, add the shallots and sauté until soft and translucent, about 5 minutes. Add the garlic and sauté about 1 minute more, until very fragrant. Add the mushrooms and cook for about 10 minutes, flipping once or twice, until they become tender and begin to release their juices."
    },
    {
      "@type": "HowToStep",
      "text": "Add the wine and thyme to the skillet. Raise the heat and bring the mixture to a simmer. Lower heat and allow to cook until the wine has cooked off, about 10 minutes. Remove from heat and stir in salt and pepper. Taste test and add more salt if you like."
    },
    {
      "@type": "HowToStep",
      "text": "To make the bechamel sauce, coat the bottom of a medium saucepan with the olive and truffle oil and place over medium heat. Whisk in the flour and bring the mixture to a simmer. Allow to cook, whisking constantly, for about 3 minutes. Whisk in the milk and bring the mixture back up to a simmer. Lower heat and allow to simmer, whisking frequently, for about 10 minutes, until the mixture is thick and creamy."
    },
    {
      "@type": "HowToStep",
      "text": "To make the vegan ricotta, place the cashews, milk, lemon juice and garlic into the bowl of a food processor and blend until smooth. Add the tofu and pulse until the mixture takes on the texture of ricotta cheese. Mix in the salt, taste test and add more salt if you like."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350° and lightly oil a 9 x 13 inch baking pan."
    },
    {
      "@type": "HowToStep",
      "text": "Ladle about 1 cup of bechamel sauce into the bottom of the prepared baking pan. Layer 3-4 noodles over the sauce layer, then spread half of the ricotta over the noodles and half of the mushrooms over the ricotta. Ladle about 1/2 cup of bechamel sauce over the mushrooms. Repeat with another layer of noodles, then ricotta, mushrooms, and bechamel. Top everything with a final layer of noodles, then ladle any remaining bechamel over the noodles and spread it out into an even layer."
    },
    {
      "@type": "HowToStep",
      "text": "Cover and bake for 30 minutes. Uncover and bake 10 minutes more, until hot and bubbly around the edges."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the lasagna from the oven and allow it to sit for 10 minutes before cutting. Serve."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://connoisseurusveg.com/creamy-vegan-mushroom-lasagna"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-11-28T15:59:37.258Z"
}
