{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "4.5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-01T04:33:39.851Z",
  "datePublished": "2015-01-02T11:05:18+00:00",
  "description": "This cauliflower mushroom soup is made with a rich cauliflower base, seasoned with garlic, leeks and white wine, and loaded with tender sautéed mushrooms.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2015/01/creamy-cauliflower-mushroom-soup-featured.jpg"
  ],
  "keywords": "cauliflower, mushrooms",
  "name": "Creamy Cauliflower Mushroom Soup",
  "prepTime": "PT10M",
  "recipeCategory": "Soup",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 tbsp. olive oil (divided)",
    "2 garlic cloves (minced)",
    "1 large leek (chopped, white and green parts separated)",
    "1 cup dry white wine",
    "5 cups cauliflower florets (about 1 lb.)",
    "4 cups vegetable broth",
    "2 cups unflavored soy or almond milk",
    "1/2 tsp. black pepper",
    "1/4 tsp. salt (or to taste)",
    "1 lb. white button mushrooms (wiped clean, stems removed, and sliced)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large saucepan or Dutch oven with 1 tablespoon of olive oil. Place over medium heat. Add white parts of leeks and garlic. Sautée until leeks are softened, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add wine and raise heat to medium-high. Bring to a simmer, Allow to simmer, stirring occasionally, until reduced by half, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add broth and cauliflower. Bring back to a simmer and allow to cook until cauliflower is tender, about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While cauliflower simmers, coat a large skillet with remaining 1 tablespoon of olive oil and place over medium heat. Add mushrooms in as even a layer as you can get them and cook for 5, minutes, until lightly browned on bottoms. Gently flip and cook another 5 minutes on opposite sides. Remove from heat and transfer to a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Working in batches if needed, transfer cauliflower mixture to blender or food processor and blend until completely smooth. This may take a few minutes. Return to pot."
    },
    {
      "@type": "HowToStep",
      "text": "Add milk, salt and pepper to cauliflower mixture. Place over medium-high heat and cook just until heated throughout. Stir in mushrooms and green parts of leeks."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/creamy-cauliflower-mushroom-soup"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-01T04:33:39.850Z"
}
