{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "24",
    "ratingValue": "4.71"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-06T00:56:56.692Z",
  "datePublished": "2016-07-02T05:00:56+00:00",
  "description": "Creamy lime pie bars with an almond-oat crust and creamy, cashew-based filling! Perfectly tart, naturally sweetened, and so delicious! 10 basic ingredients required.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/06/EASY-Key-Lime-Pie-Bars-vegan-glutenfree-and-naturally-sweetened-Just-10-basic-ingredients-required-lime-dessert-recipe-summer.jpg"
  ],
  "keywords": "lime pie bars",
  "name": "Creamy Lime Pie Bars",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "326 kcal",
    "carbohydrateContent": "26 g",
    "fatContent": "24.3 g",
    "fiberContent": "4.3 g",
    "proteinContent": "6.4 g",
    "saturatedFatContent": "12.2 g",
    "servingSize": "1 bars",
    "sodiumContent": "59 mg",
    "sugarContent": "8.7 g"
  },
  "prepTime": "PT315M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup raw cashews",
    "1 cup coconut cream* (the hardened portion at the top of canned full fat coconut milk or coconut cream)",
    "2 Tbsp arrowroot starch (or cornstarch, though I prefer arrowroot in this recipe)",
    "1/2 cup lime juice (regular or key lime)",
    "1 heaping Tbsp lime zest (2 limes yield ~1 heaping Tbsp or 4 g)",
    "1 pinch sea salt",
    "1/4 cup maple syrup (or agave nectar // plus more to taste)",
    "2 Tbsp organic powdered sugar (optional // for topping)",
    "1 scant cup gluten-free oats",
    "1 scant cup almonds (I mixed almonds and pecans)",
    "1/4 tsp sea salt",
    "1 1/2 Tbsp coconut sugar",
    "3-4 Tbsp coconut oil (melted)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add raw cashews to a mixing bowl and cover with boiling hot water. Let rest for 1 hour (uncovered). Then drain thoroughly."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, preheat oven to 350 degrees F (176 C) and line an 8x8 inch baking dish with parchment paper (adjust number/size of pan if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Add oats, nuts, sea salt, and coconut sugar to a high-speed blender and mix on high until a fine meal is achieved."
    },
    {
      "@type": "HowToStep",
      "text": "Add melted coconut oil, starting with 3 Tbsp (45 ml) and adding more if it's too dry. Pulse/stir with a spoon to combine until a loose dough is formed. You should be able to squeeze the mixture between two fingers and form a dough instead of it crumbling. If too dry, add a bit more melted coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to parchment-lined baking sheet and spread evenly. Then place parchment paper on top and use a flat-bottomed object, such as a drinking glass, to press down firmly until it’s evenly distributed and well packed. A little may go up the sides, which is good!"
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 12 minutes, then increase heat to 375 F (190 C) and bake for 5-8 minutes more or until the edges are golden brown and there is some browning on the surface. Remove from oven to cool slightly. Then reduce oven heat to 350 degrees F (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Once cashews are soaked and drained, add to a high-speed blender with coconut cream, arrowroot starch, lime juice and zest, sea salt, and maple syrup. Mix on high until very creamy and smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed. I added a bit more zest and maple syrup. It should be very citrusy, and not overly sweet."
    },
    {
      "@type": "HowToStep",
      "text": "Pour filling over the pre-baked crust and spread into an even layer. Tap on counter to remove any air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 18-23 minutes or until the edges look very slightly dry and the center appears “giggly” but not liquidy."
    },
    {
      "@type": "HowToStep",
      "text": "Let rest for 10 minutes, then transfer to refrigerator to let cool completely (uncovered) - at least 4 hours, preferably overnight."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, slice and sift with powdered sugar (optional). Store leftovers in the refrigerator, covered, up to 4 days, though best within the first 2-3 days."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://minimalistbaker.com/creamy-lime-pie-bars"
  ],
  "totalTime": "PT360M",
  "updatedAt": "2022-12-06T00:56:56.692Z"
}
