{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "85",
    "ratingValue": "4.71"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-12-02T08:52:47.494Z",
  "datePublished": "2016-11-12T05:00:25+00:00",
  "description": "Crazy-delicious Pumpkin Pie Bars made entirely in the blender with 10 ingredients! Plus, naturally sweetened and a no-fuss crust. The perfect plant-based, gluten-free dessert for fall!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/09/Pumpkin-Pie-Bars-SQUARE.jpg"
  ],
  "keywords": "pumpkin pie",
  "name": "Creamy Pumpkin Pie Bars (V + GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "284 kcal",
    "carbohydrateContent": "28.7 g",
    "fatContent": "18 g",
    "fiberContent": "4.9 g",
    "proteinContent": "5.9 g",
    "saturatedFatContent": "7.6 g",
    "servingSize": "1 bars",
    "sodiumContent": "60 mg",
    "sugarContent": "15.6 g"
  },
  "prepTime": "PT270M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup gluten-free rolled oats",
    "1 1/2 cups almond flour*",
    "1/4 tsp sea salt",
    "2 Tbsp coconut sugar",
    "1 Tbsp maple syrup",
    "4-5 Tbsp melted coconut oil",
    "2 3/4 cups pumpkin purée (DIY here)",
    "1/4 cup maple syrup",
    "1/4 cup coconut sugar",
    "1/4 cup unsweetened plain almond milk",
    "2 1/2 Tbsp cornstarch*",
    "1 3/4 tsp pumpkin pie spice (or sub mix of ginger, cinnamon, nutmeg & cloves)",
    "Coconut Whipped Cream"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and line an 8x8-inch baking dish with parchment paper (adjust number/size of dish if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Make crust by adding oats to a blender (or food processor) and blending/mixing until you reach the consistency of oat flour (if using raw almonds, mix them with the oats at this time)."
    },
    {
      "@type": "HowToStep",
      "text": "Add almond flour (not meal*), sea salt, coconut sugar and mix once more. Then add maple syrup and melted coconut oil and mix/pulse to combine. Depending on device, you may need to use a spoon to scrape around the edges to ensure the crust is completely mixed. If it appears or feels too dry, add more coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Add crust to the parchment-lined baking dish and shake to evenly disperse, then lay down parchment paper on top and use a flat-bottomed object (such as a liquid measuring cup or drinking glass) and pressing down to pack the crust into place, making an even, firmly packed layer."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 20 minutes, then set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add all filling ingredients to the blender (or food processor) and blend until smooth, scraping down sides as needed. Taste and adjust seasonings as needed, adding more maple syrup or coconut sugar for sweetness, or pumpkin pie spice for flavor. I also added a pinch of ground cinnamon. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the crust is baked, pour the filling into the crust and tap on counter to remove air bubbles. Bake for 50 minutes - 1 hour. The filling will still be just a bit jiggly, dark orange in color, and have some cracks on the top - this is normal."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from oven and let cool completely before loosely covering with plastic wrap or foil and transferring to the refrigerator to fully set for 4-6 hours, preferably overnight."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooled, gently lift bars out of dish and slice into 9 bars (amount as original recipe is written // adjust if altering batch size). I also sliced the edges off mine for appearance, but this is optional."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with coconut whipped cream and an additional sprinkle of cinnamon, nutmeg, and/or pumpkin pie spice (optional). Store leftovers in the refrigerator up to 3 days, though best when fresh."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://minimalistbaker.com/creamy-pumpkin-pie-bars-v-gf"
  ],
  "totalTime": "PT345M",
  "updatedAt": "2022-12-02T08:52:47.493Z"
}
