{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Sam Turnbull • It Doesn't Taste Like Chicken"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T11:08:03.505Z",
  "datePublished": "2015-04-28T23:41:26+00:00",
  "description": "Crispy, panko and coconut on the outside, soft and creamy on the inside. The eggplant loses all of those mushy qualities that I hate and becomes this gorgeous, light, munchy snack. Can be baked or fried.&nbsp;",
  "image": [
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2015/04/crispy-coconut-eggplant-nuggets.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2015/04/crispy-coconut-eggplant-nuggets-500x500.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2015/04/crispy-coconut-eggplant-nuggets-500x375.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2015/04/crispy-coconut-eggplant-nuggets-480x270.jpg"
  ],
  "name": "Crispy Eggplant Nuggets",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "159 kcal",
    "servingSize": "1 serving"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 medium eggplant, (peeled and cut into nugget-sized pieces)",
    "1 teaspoon salt",
    "1/2 cup all-purpose flour (gluten-free if preferred)",
    "Salt & pepper",
    "3 tablespoons ground flax or ground chia",
    "2/3 cup warm water",
    "1/2 cup panko",
    "1/2 cup shredded coconut",
    "Oil for frying (if needed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "OVEN: preheat the oven to 450F (230C).AIR FRYER: preheat your air fryer to 400F (200C)."
    },
    {
      "@type": "HowToStep",
      "text": "Put the eggplant nuggets in a colander in the sink, or over a bowl. Sprinkle the salt across the eggplant and toss with your hands to evenly coat. Let the eggplant sit with the salt on them in the colander while you prepare the rest."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime get three medium bowls ready. Bowl 1: add the flour, and season with a pinch of salt, and a few grinds of pepper. Stir to combine. I used whole wheat flour but almost any flour will work here. Bowl 2: mix together the ground flax with the warm water and set aside. The flax mixture will need to rest for about 5-10 minutes to thicken. Bowl 3: mix together the coconut and panko."
    },
    {
      "@type": "HowToStep",
      "text": "Now take your first eggplant nugget and dip it in the flour covering all sides. Shake off excess, then dip it in the flax. Shake off excess, and toss in the coconut and panko. Set the nugget on a plate and continue with this process for the remaining nuggets. I found it easiest to do this with a fork as your fingers will get all goopy. As you go the flax mixture might get too thick, so just stir in a bit of water as needed. If any of the bowls run out, just add more as needed."
    },
    {
      "@type": "HowToStep",
      "text": "If you are baking your nuggets: line a baking sheet with parchment paper. Lay the nuggets out in a single layer so they aren't touching. Bake in a 450F (230C) over for 18-20 minutes, flipping them halfway through, until they are golden on all sides. Serve the nuggets while hot with your favourite dipping sauce."
    },
    {
      "@type": "HowToStep",
      "text": "If you are frying your nuggets: pour about 1/2\" of oil in a pan. Heat up and test that it is ready by dropping in a small piece. If it bubbles and sizzles you are good to go! If the oil starts smoking, lower the heat. Careful! Working with oil is dangerous. Put several nuggets in the pan and fry them for about 2 minutes on each side until they are golden brown all over. Set them on a plate covered in paper towel while you finish the rest. Serve the nuggets while hot with your favourite dipping sauce."
    },
    {
      "@type": "HowToStep",
      "text": "If you are using an Air Fryer: Lay the nuggets in a single layer in the air fryer so that they aren't touching. Fry 14 -16 minutes, flipping them halfway through until they are golden on all sides."
    }
  ],
  "recipeYield": "30",
  "sameAs": [
    "https://itdoesnttastelikechicken.com/2015/04/28/crispy-coconut-eggplant-nuggets"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-03T11:08:03.505Z"
}
