{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "83",
    "ratingValue": "4.11"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T05:59:30.455Z",
  "datePublished": "2017-03-02T05:00:13+00:00",
  "description": "Crispy vegan bacon made with eggplant! Sliced eggplant is brushed with a smoky sauce and baked to perfection! A tasty, plant-based bacon alternative.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/01/Crispy-Eggplant-Bacon-SQUARE.jpg"
  ],
  "keywords": "Vegan bacon",
  "name": "Crispy Eggplant \"Bacon\"",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "21 kcal",
    "carbohydrateContent": "2.8 g",
    "fatContent": "1 g",
    "fiberContent": "0.7 g",
    "proteinContent": "0.4 g",
    "saturatedFatContent": "0.1 g",
    "servingSize": "1 slice",
    "sodiumContent": "139 mg",
    "sugarContent": "1.8 g",
    "unsaturatedFatContent": "0.9 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 medium eggplant (you'll only use half)",
    "1 Tbsp avocado or olive oil",
    "1 1/2 Tbsp tamari",
    "1 Tbsp vegan Worcestershire",
    "1 Tbsp maple syrup",
    "2 tsp liquid smoke",
    "1 tsp smoked paprika",
    "1 pinch sea salt",
    "1 pinch garlic powder",
    "1/2 tsp freshly cracked black pepper (plus more for topping)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 250 degrees F (121 C) - you can turn it to “convection bake” if you have it to speed cooking time. Line 1 large or 2 small baking sheet(s) with parchment paper (amount/size as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Slice an eggplant in half lengthwise and set one half aside for other uses (such as Baba Ganoush, Vegan Queso, or 1-Pot Pasta). Then cut the remaining eggplant in half lengthwise once more so you have two long, skinny pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Use a mandolin to slice into very thin strips (resembling the size/shape of bacon). They should be slightly thicker than paper thin - less than 1/8th inch thick (measure with a ruler for best results). If slices are too thick, they may have trouble crisping up and/or will take longer. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Make sauce by adding avocado oil, tamari, Worcestershire sauce, maple syrup, liquid smoke, paprika, sea salt, garlic powder, and black pepper to a small mixing bowl and whisking to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Use a brush (or a spoon) to brush both sides of the eggplant slices with sauce. Arrange in a single layer on the parchment-lined baking sheet(s) and sprinkle with more black pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 25-30 minutes, then flip eggplant slices over, and bake for an additional 5-15 minutes (or longer if slices are thicker) or until the eggplant is deep red in color, appears dry, and is slightly crispy. If browning too much, but not crispy, reduce temperature and bake longer to dehydrate (this likely means the slices were too thick). Remove from the oven and let cool slightly. It will crisp up the more it cools."
    },
    {
      "@type": "HowToStep",
      "text": "Use immediately on things such as on sandwiches, in salads, or alongside or mixed into a tofu scramble."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooled, store in a sealed container in the refrigerator up to 5 days or in the freezer up to 1 month. To reheat, heat a skillet over medium heat, add a little oil of choice, then heat bacon on both sides until warmed (be careful not to burn)."
    }
  ],
  "recipeYield": "14",
  "sameAs": [
    "https://minimalistbaker.com/crispy-eggplant-bacon"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T05:59:30.454Z"
}
