{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-29T13:28:13.221Z",
  "datePublished": "2022-04-25T10:03:13+00:00",
  "description": "These baked spring rolls are crispy on the outside, bursting with veggies and noodles on the inside! Serve them up with creamy peanut dipping sauce for a scrumptious vegan appetizer that&#039;s sure to be a hit!",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2022/04/baked-spring-rolls-sq.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2022/04/baked-spring-rolls-sq-500x500.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2022/04/baked-spring-rolls-sq-500x375.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2022/04/baked-spring-rolls-sq-480x270.jpg"
  ],
  "keywords": "cabbage, carrots, noodles",
  "name": "Crispy Baked Vegetable Spring Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "223 kcal",
    "carbohydrateContent": "40.7 g",
    "fatContent": "4.8 g",
    "fiberContent": "1.6 g",
    "proteinContent": "5.6 g",
    "saturatedFatContent": "0.6 g",
    "servingSize": "1 spring roll ((1/16 of recipe)",
    "sodiumContent": "306 mg",
    "sugarContent": "1.1 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 ounces rice noodle vermicelli",
    "4 tablespoons peanut oil, (divided)",
    "1 1/2 cups finely chopped shiitake mushroom caps (about 4 ounces)",
    "3 scallions, (white and green parts separated and chopped)",
    "2 garlic cloves, (minced)",
    "1 teaspoon freshly grated ginger",
    "3 cups shredded napa cabbage (about half of a medium head)",
    "1/2 cup julienned carrots (about 1 large carrot)",
    "2 tablespoons soy sauce",
    "1/2 tablespoon rice vinegar",
    "2 teaspoons organic brown sugar",
    "1 teaspoon sesame oil",
    "16 vegan spring roll wrappers (made from wheat flour - not rice paper wraps)",
    "Peanut sauce, (or dipping sauce of choice, for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of water to a boil. Add rice noodles and soak them according to the package directions. Drain the noodles into a colander and rinse them with cold water. Set Aside."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large skillet with 2 tablespoons of peanut oil and place it over medium heat. When the oil is hot, add the shiitakes in an even layer. Allow the mushrooms to cook until softened and lightly browned, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Push the mushrooms to the side. Add white parts of your scallions, garlic and ginger to the center of your skillet. Cook the aromatics for about a minute, until very fragrant, gently stirring to prevent burning."
    },
    {
      "@type": "HowToStep",
      "text": "Raise the heat to high. Add the cabbage, carrots, soy sauce, brown sugar, and rice vinegar to the skillet. Stir-fry the veggies just until the cabbage begins to wilt, about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add the noodles, sesame oil, and green parts of scallions to the skillet. Flip everything a few times to mix the ingredients, then remove the skillet from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 450° and lightly oil a couple of baking sheets."
    },
    {
      "@type": "HowToStep",
      "text": "Fill a small bowl with water. Place a spring roll wrapper on work surface at an diagonal, with one of the corners pointing towards you."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop up 3 to 4 tablespoonfuls of the cabbage mixture, being careful not to pick up too much liquid. Place the mixture in a two inch long strip onto spring roll wrapper, about two inches in from the corner pointing at you, then fold the corner over mixture. Wrap the sides inward over the fold, then roll the filled portion away from you, tucking tightly as you go."
    },
    {
      "@type": "HowToStep",
      "text": "Dip your fingers into the water bowl and moisten the corner farthest from you before folding it over the roll to close everything up. Place the roll, seam side down, on a baking sheet. Repeat until all wrappers and filling are used."
    },
    {
      "@type": "HowToStep",
      "text": "Brush the rolls with the remaining peanut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the spring rolls until golden brown and crispy, 13 to 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately with peanut sauce (or dipping sauce of choice) on the side."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://connoisseurusveg.com/baked-vegetable-spring-rolls"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-29T13:28:13.220Z"
}
