{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "64",
    "ratingValue": "4.85"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-05T23:52:26.919Z",
  "datePublished": "2020-02-09T03:00:19+00:00",
  "description": "Crispy breaded cauliflower wings with a sweet &#x27;n&#x27; spicy glaze! 10 ingredients, simple methods, BIG flavor! The perfect plant-based snack or side!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Crispy-Breaded-Cauliflower-Wings-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Crispy-Breaded-Cauliflower-Wings-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Crispy-Breaded-Cauliflower-Wings-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Crispy-Breaded-Cauliflower-Wings-SQUARE-480x270.jpg"
  ],
  "keywords": "cauliflower wings",
  "name": "Crispy Breaded Cauliflower Wings",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "389 kcal",
    "carbohydrateContent": "34.1 g",
    "cholesterolContent": "93.25 mg",
    "fatContent": "24.3 g",
    "fiberContent": "3.5 g",
    "proteinContent": "13.8 g",
    "saturatedFatContent": "4.7 g",
    "servingSize": "1 servings",
    "sodiumContent": "861 mg",
    "sugarContent": "13.5 g",
    "unsaturatedFatContent": "16.87 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 small-medium head cauliflower (cut into even, bite-size florets)",
    "1 healthy pinch each sea salt and black pepper",
    "2 large eggs, beaten (organic pasture-raised when possible // see notes for vegan option)",
    "1 1/2 cups raw cashews (or sub other nut, such as almonds or almond flour, though we haven’t tested these ourselves)",
    "1 1/4 tsp sea salt (plus more to season cauliflower before coating)",
    "1/4 tsp cayenne pepper (increase for more spice)",
    "3/4 tsp garlic powder",
    "1 tsp smoked paprika",
    "2 Tbsp arrowroot starch, cornstarch, or potato starch",
    "1 spritz avocado oil (optional // from a spray bottle // otherwise omit)",
    "2 Tbsp honey (if vegan, sub maple syrup)",
    "3 Tbsp hot sauce or buffalo sauce",
    "1 pinch red pepper flake (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 425 degrees F (218 C) and line a large baking sheet with parchment paper. If you have a cooling rack that is oven safe, you can place that over the parchment paper; it will help the cauliflower crisp up even more. However, we tested it with and without and both work. The primary difference is when not using a cooling rack, the cauliflower undersides can get a little more brown. But the easy workaround is cooking the cauliflower in the upper third of the oven to prevent the bottoms from burning."
    },
    {
      "@type": "HowToStep",
      "text": "Add cauliflower florets to a large mixing bowl and season with a bit of salt and pepper (pepper optional). Toss to combine and set aside. (Reserve large mixing bowl for use later.)"
    },
    {
      "@type": "HowToStep",
      "text": "Crack eggs into a shallow bowl and whisk until combined. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Next, prepare cashew coating by adding cashews, salt, cayenne pepper, garlic powder, paprika, and arrowroot starch (or cornstarch or potato starch) to a food processor. Mix until a semi-fine meal is achieved. A little texture is okay (see photo), but you want it pretty fine so it coats the cauliflower. Transfer coating to a shallow dish (shallow enough to dip the cauliflower in) and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Dip a few cauliflower florets at a time in the eggs, ensuring all sides are well coated. Then shake off excess. Transfer the cauliflower to the cashew coating and toss until thoroughly coated, using a spoon or your hands to add more coating to any bare spots."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer cauliflower to your prepared baking sheet (with or without a cooling rack). Finally, drizzle or spritz with a little avocado oil to help them crisp up (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for ~20 minutes or until the cauliflower appears golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare glaze. To a large saucepan, add honey and hot sauce and a pinch of red pepper flake (optional). Heat over medium-low heat, stirring frequently, until it bubbles and appears combined. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer cooked cauliflower to the large mixing bowl from earlier and top with the glaze. Gently toss to combine, then serve immediately."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Store leftovers covered in the refrigerator up to 3-4 days. Reheat in a 350 degree F (176 C) oven until hot for best results. Not freezer friendly."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/crispy-breaded-cauliflower-wings"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-05T23:52:26.918Z"
}
