{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "11",
    "ratingValue": "4.73"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-12-05T09:01:57.863Z",
  "datePublished": "2020-09-03T03:00:00+00:00",
  "description": "The BEST way to make perfect french fries that are crispy on the outside, tender on the inside, and oil-free! Simple ingredients, BIG flavor, super versatile!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/06/Crispy-Cajun-Oil-Free-Baked-Fries-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/06/Crispy-Cajun-Oil-Free-Baked-Fries-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/06/Crispy-Cajun-Oil-Free-Baked-Fries-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/06/Crispy-Cajun-Oil-Free-Baked-Fries-SQUARE-480x270.jpg"
  ],
  "keywords": "baked fries",
  "name": "Crispy Cajun Baked Fries (Oil-Free!)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "131 kcal",
    "carbohydrateContent": "29.9 g",
    "fatContent": "0.2 g",
    "fiberContent": "2.4 g",
    "proteinContent": "3.6 g",
    "saturatedFatContent": "0.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "301 mg",
    "sugarContent": "1 g",
    "unsaturatedFatContent": "0.08 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "French-Inspired",
  "recipeIngredient": [
    "3 medium russet potatoes (scrubbed clean // organic when possible)",
    "Water for cooking",
    "1 pinch salt",
    "1 1/2 tsp smoked paprika",
    "1 tsp garlic powder",
    "1 tsp dried oregano (or sub fresh, minced)",
    "3/4 tsp dried thyme (or sub fresh, minced)",
    "1/2 tsp sea salt",
    "1/4 tsp black pepper",
    "1/8 tsp cayenne pepper (omit for less heat)",
    "Ketchup",
    "No-Honey Mustard Sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat oven to 425 degrees F (218 C) and use the convection setting if you have it. This will allow the fries to become more crispy on the edges and cook faster. If you don’t have a convection setting, no worries. You’ll just bake for slightly longer. Convection simply speeds up the process."
    },
    {
      "@type": "HowToStep",
      "text": "Line 1 large or 2 small baking sheet(s) with parchment paper or silicone baking mats and set aside (this is important or the fries will stick). (See notes for best way to cook large batches of fries.)"
    },
    {
      "@type": "HowToStep",
      "text": "Wash and scrub your potatoes clean but leave the skin on. Add to a large saucepan or pot and cover with water by 1 inch. Add a pinch of salt."
    },
    {
      "@type": "HowToStep",
      "text": "Bring to a boil over high heat and cook until a knife slides in easily and is easily removed — ~25-35 minutes depending on the size of your potatoes. You don’t want them to be cracking or falling apart, but you do want them to be tender and pretty much cooked through. Remove from the water and allow to cool on a cutting board (~5-10 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Note: At this point you could store your boiled potatoes (uncovered) in the fridge for up to 3-4 days and then slice and bake. Otherwise, proceed to the next step."
    },
    {
      "@type": "HowToStep",
      "text": "While potatoes are cooking, prepare your spice blend by adding all spices to a small mixing bowl and stirring to combine. Taste and adjust seasonings as needed, adding more salt to taste, cayenne for heat, herbs to taste, smoked paprika for smokiness, or garlic powder for garlic flavor. Set aside. (Leftovers will keep sealed at room temperature for up to 3 months)."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooled to the touch, carefully slice potatoes into even, small wedges or strips. If the fries break apart in places, that’s okay and normal. These are secretly my favorite pieces because they get extra crispy when baked. Just try to handle gently to prevent much breaking. Using a sharp knife and handling gently is key here."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to the lined baking sheet(s) and sprinkle on the Cajun spice blend. Then lift one side of the parchment paper at a time to gently toss the potatoes, coating them with spices. This allows for more gentle handling than hand tossing."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 20-25 minutes, flipping / tossing at the 15-minute mark to ensure even cooking. Turning the pan around can also help them cook more evenly. You’re looking for the fries to be golden brown and crispy on the edges. Keep baking until you achieve desired results!"
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately. If desired, sprinkle with a bit more salt and pepper for added flavor. These fries are delicious on their own, but are also elevated with ketchup or our No-Honey Mustard Sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh, though leftovers can be stored in the refrigerator up to 2-3 days. Reheat on the stovetop or in a 375 degree F (190C) oven. In our experience, these are not freezer friendly (unless the boiled, cut, and seasoned fries are frozen before baking — when cooked from frozen cook time will need to be increased)."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/crispy-cajun-baked-fries-oil-free"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-05T09:01:57.861Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=F0nmAC5HEXI",
    "description": "The BEST way to make perfect french fries that are crispy on the outside, tender on the inside, and oil-free! Simple ingredients, BIG flavor, super versatile!\n\nFull Recipe: https://minimalistbaker.com/crispy-cajun-baked-fries-oil-free/\n\nCajun food originated in southern Louisiana. And cajun seasoning typically includes spices such as paprika, garlic powder, onion powder, salt, pepper, cayenne, and herbs such as thyme and/or oregano. Our blend strays a bit from the traditional, skipping the onion powder and opting for smoked paprika for a more smoky flavor.\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT56S",
    "embedUrl": "https://www.youtube.com/embed/F0nmAC5HEXI?feature=oembed",
    "name": "Crispy Cajun Baked Fries (Oil-Free!) | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/F0nmAC5HEXI/hqdefault.jpg",
    "uploadDate": "2020-09-03T08:00:02+00:00"
  }
}
