{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "37",
    "ratingValue": "4.92"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-03T00:59:44.520Z",
  "datePublished": "2017-02-06T05:00:45+00:00",
  "description": "Tender potatoes smashed, roasted until crispy, then topped with a creamy garlic-herb pesto! A delicious vegan and gluten-free appetizer or snack!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/12/Smashed-Potatoes-Pesto-SQUARE.jpg"
  ],
  "keywords": "smashed potatoes",
  "name": "Crispy Smashed Potatoes with Garlic Pesto",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "274 kcal",
    "carbohydrateContent": "30.7 g",
    "fatContent": "16.1 g",
    "fiberContent": "5.5 g",
    "proteinContent": "5.4 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "304 mg",
    "sugarContent": "2.6 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 pounds baby gold/yellow potatoes",
    "1 1/2 Tbsp olive oil (or sub other neutral oil)",
    "1 healthy pinch each sea salt & black pepper (~1/2 tsp as original recipe is written)",
    "2 heaping cups loosely packed fresh basil (large stems removed)",
    "2 cloves garlic (chopped // 2 cloves yield ~1 Tbsp chopped)",
    "3 Tbsp raw pine nuts or walnuts (for nut allergies, omit)",
    "2 Tbsp lemon juice",
    "1 1/2 Tbsp nutritional yeast*",
    "2-3 Tbsp extra virgin olive oil (or sub other neutral oil)",
    "1 healthy pinch each sea salt & black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add rinsed potatoes to a large pot and cover with water until just submerged. Bring to a boil over high heat. Then reduce to medium-high heat to achieve a low boil. Cook uncovered for 15-20 minutes or until tender and a knife easily slides in and out."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare pesto by adding basil, garlic, nuts, lemon juice, and nutritional yeast to a food processor and blending to combine. Stream in 2-3 Tbsp olive oil (amount as original recipe is written // adjust if altering batch size) a little at at time until a thick paste is formed. If trying to reduce fat, thin the sauce with water instead of additional oil. I like adding a little water to mine to make it more of a pourable sauce, but this is optional."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more lemon juice for acidity, nutritional yeast for cheesy flavor, salt and pepper for overall flavor, or garlic for zing/bite. Transfer to a small serving dish and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 450 degrees F (232 C) and line a baking sheet with parchment paper. When the potatoes are soft and tender, place on the baking sheet and smash down with the bottom of a saucepan. For any larger potatoes, cut in half and then smash so they are still \"bite size.\""
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle the potatoes with 1 1/2 Tbsp oil and season with a healthy pinch each salt and pepper (amounts as original recipe is written // adjust if altering batch size). Roast for 20-25 minutes or until crispy and golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, spoon the pesto over the potatoes (you will have leftovers). Garnish with chopped basil or parsley and additional pine nuts (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Store leftovers separately in the refrigerator. Potatoes will keep for 3-4 days. Pesto will keep for about 1 week (see notes for uses for leftovers). Reheat in a 350-degree oven until hot, then top with any leftover pesto."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/crispy-smashed-potatoes-with-garlic-pesto"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-03T00:59:44.519Z"
}
