{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-09-26",
  "description": "Nothing beats good crackling on roast pork. Simply follow these easy instructions to get it perfect every time.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/famkit299cripor_027:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Pork belly,Seafood free,Wheat free,Egg free,Pork,Sesame free",
  "name": "Crispy Pork Belly With Apple Sauce Recipe | Woolworths",
  "prepTime": "PT10M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "Australian",
  "recipeId": "RGR17411",
  "recipeIngredient": [
    "1 tbs olive oil",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "1 piece skin-on belly pork, boneless",
    "2 cup apple juice",
    "2 cup chicken stock",
    "4 apples, peeled, cored and roughly chopped",
    "2 tbs double cream"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "With a sharp knife, make criss-cross slits all over the skin of the pork, being careful not to cut through to the meat underneath. (You can ask your butcher to do this for you.) Rub the skin dry with kitchen paper and leave the meat to rest, uncovered, in the fridge for at least 4 hours, but preferably overnight. This will help the skin crisp on cooking."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 230°C (Gas 8). Place the meat, skin-side up, on a rack inside a roasting tray. Rub it with the oil and salt all over the top, being sure to get inside the slits in the skin. Pour the apple juice and stock into the roasting tray, being careful not to splash the meat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Roast the pork at the top of the oven for 30 minutes, then reduce the oven temperature to 200°C (Gas 6) and roast it for a further 1 hour until the skin is crispy. Keep an eye on the level of the liquid and top it up with water if it starts to get too low. You should be left with about 1cm of liquid in the tin."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, make the apple sauce. Put the apples and 6 tbs of water into a small saucepan with a tight-fitting lid. Cook over a low heat for 10-15 minutes (depending on the type of apple used), checking them from time to time and adding 1 tbs of extra water if the pan seems dry, until they are completely broken down. Break the apples up with a potato masher, if necessary. If the mixture seems too wet, cook it uncovered to evaporate any excess water, stirring from time to time to make sure it does not scorch, until you have a smooth, thick purée."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the pork from the oven and wrap it in foil to keep it warm while you make the gravy. (It is a good idea to separate the crackling from the pork at this stage as wrapping it in foil will soften it, so leave the crackling uncovered in the turned-off oven.) Skim off and discard as much of the fat as possible from the cooking liquid."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the roasting tin with the meat juices directly on the hob and bring to the boil. Reduce the heat to a simmer and cook for 5 minutes, whisking occasionally, until they have thickened and reduced. Check the seasoning and add the cream (if using)."
    }
  ],
  "recipeNameId": "crispy-pork-belly-with-apple-sauce",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/crispy-pork-belly-with-apple-sauce"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-11-24T18:13:50.395Z",
  "url": "https://www.woolworths.com.au/shop/recipes/crispy-pork-belly-with-apple-sauce"
}
