{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Lindsay Cotter"
  },
  "cookTime": "PT3M",
  "createdAt": "2022-12-01T08:41:26.343Z",
  "datePublished": "2018-04-16T08:00:00+00:00",
  "description": "Reprinted with permission from Lindsay Cotter's Nourishing Superfood Bowls: 75 Healthy and Delicious Gluten-Free Meals to Fuel Your Day",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2018/04/curried-satay.jpg"
  ],
  "name": "Curried Satay Veggie Bowls",
  "prepTime": "PT10M",
  "recipeCategory": "Main Dishes",
  "recipeIngredient": [
    "1 15-oz [425-g] can chickpeas",
    "1 tbsp 15 g red curry paste",
    "1 tsp minced garlic",
    "Pinch fresh grated ginger (or 1/4 tsp ground)",
    "1 tbsp 15 ml avocado or coconut oil",
    "1 tsp mustard",
    "2 to 3 tbsp 45 ml coconut milk",
    "1 tbsp 12 g creamy natural peanut butter",
    "Dash of lime juice or rice vinegar",
    "Fine sea salt or kosher salt (to taste)",
    "Pepper (to taste)",
    "2 small zucchinis (see note)",
    "1 tsp olive oil",
    "1 tsp tamari",
    "Handful ribbon-cut or julienne-sliced veggies (carrot and summer squash work great)",
    "Cilantro",
    "Crushed nuts",
    "Crushed red pepper flakes",
    "Sriracha (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To make the satay sauce, combine the chickpeas, red curry paste, garlic, ginger, oil, mustard and 2 tablespoons (30 ml) coconut milk in a food processor or blender. Blend until mixed. With the food processor on low, slowly add the peanut butter, vinegar, salt and pepper. Blend again until creamy. For thinner sauce, add 1 tablespoon (15 ml) or more of coconut milk. Stop and scrape sides once or twice if needed. Put the sauce in a bowl and set aside. Extra sauce can be stored in the fridge for up to 5 days."
    },
    {
      "@type": "HowToStep",
      "text": "For the bowls, spiralize the zucchini, then press with a paper towel to remove the excess water."
    },
    {
      "@type": "HowToStep",
      "text": "In a large skillet or wok, add the oil and stir-fry the zucchini noodles with the tamari for 2 to 3 minutes, or until zucchini noodles are soft, but not mushy. Remove and place zucchini noodles in one large serving bowl or 2 smaller serving bowls."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle each bowl with the creamy satay sauce and top with a handful of ribbon-cut vegetables, cilantro, crushed nuts and crushed red pepper flakes. Add a dash of Sriracha, if desired."
    },
    {
      "@type": "HowToStep",
      "text": "Once you add the sauce, serve immediately. Due to the high water content in the zucchini noodles, the sauce will become soupy if left to sit. Simply add more zucchini noodles to thicken the sauce, or spoon out a few tablespoons of liquid. But not to worry: even the thinned out sauce is delicious with the noodles. Totally slurp worthy!"
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://helloveggie.co/curried-satay-veggie-bowls"
  ],
  "totalTime": "PT13M",
  "updatedAt": "2022-12-01T08:41:26.333Z"
}
