{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "53",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-04T15:58:55.017Z",
  "datePublished": "2018-08-08T03:00:18+00:00",
  "description": "Easy to make, perfectly tender, 10-ingredient chickpea burgers infused with the flavors of curry. The perfect plant-based, gluten-free entrée for Indian night and beyond!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Curried-Burgers-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Curried-Burgers-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Curried-Burgers-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Curried-Burgers-SQUARE-480x270.jpg"
  ],
  "keywords": "Chickpea Burger",
  "name": "Curried Quinoa Chickpea Burgers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "392 kcal",
    "carbohydrateContent": "46.8 g",
    "fatContent": "18.5 g",
    "fiberContent": "9.1 g",
    "proteinContent": "12 g",
    "saturatedFatContent": "2.7 g",
    "servingSize": "1 Burgers",
    "sodiumContent": "823 mg",
    "sugarContent": "4 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup cooked and cooled quinoa ( (make sure it's cooked and completely cooled before using)",
    "1 15-oz can chickpeas* (rinsed, drained, and dried)",
    "1 Tbsp avocado or coconut oil (omit if avoiding oil)",
    "1 Pinch Sea Salt",
    "1 tsp Curry Powder (or store-bought)",
    "1 1/2 cups small diced, peeled yellow potatoes",
    "1 Tbsp avocado or coconut oil (plus more for cooking burgers*)",
    "1 Pinch sea salt",
    "3-4 Tbsp water",
    "2/3 cup raw or roasted cashews (sub seeds if nut sensitive)",
    "1 small serrano pepper, deseeded and minced ( (optional)",
    "2 Tbsp fresh minced ginger (skin removed)",
    "4 cloves garlic, minced",
    "3/4 tsp sea salt (divided)",
    "2 Tbsp harissa paste (sub tomato paste for less heat, or a curry paste of choice)",
    "1/2 cup chopped fresh cilantro ( (optional)",
    "Butter Lettuce Leaves or Mixed Greens",
    "Sliced Red Onion",
    "Spicy Mango Chutney",
    "Vegan Naan"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven’t prepared your quinoa yet, do so now (make sure it’s cooked and cooled completely before use)."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C). Add rinsed, dried chickpeas to a parchment-lined baking sheet and toss with oil, salt, and curry powder. Bake for 20 minutes or until chickpeas appear cracked and feel dry to the touch. Remove chickpeas from the oven and set aside. Keep oven on."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add diced potatoes (smaller / bite size) to a rimmed, oven-safe medium skillet along with oil, salt, and curry powder. Cover and cook for 4 minutes. Then decrease heat to medium low, add water, and cover again. Continue cooking potatoes until browned on the edges and tender. Then turn off heat and use a fork or potato masher to mash them until nearly creamy (as few chunks as possible). Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add cooked chickpeas to a food processor along with cashews, serrano pepper (optional), ginger, garlic, salt, curry powder, harissa paste, and cilantro (optional) and blend into a semi-loose dough. Then add cooked/cooled quinoa and pulse to combine until a textured dough forms (you're not looking for a purée)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a mixing bowl and add mashed potatoes. Stir to combine (it’s important not to add the potatoes to the food processor or they can become gummy when overmixed). Taste and adjust flavor as needed, adding more curry powder for intense curry flavor, salt for saltiness, or harissa paste for more spice."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the mixture into roughly 2/3-cup portions and form into discs about 3/4-inch in height.*"
    },
    {
      "@type": "HowToStep",
      "text": "Heat the rimmed, oven-safe medium skillet (from earlier) over medium heat. Once hot, add a little oil and the burgers and cook for 2-3 minutes or until bottom side is golden brown. Flip and then transfer pan to the oven to bake for 12-15 minutes (baking in the oven is an optional step, but one that ensures the center is fully cooked)."
    },
    {
      "@type": "HowToStep",
      "text": "For serving, enjoy in a traditional bun, with naan, on a salad, or wrapped in a butter lettuce leaf. Add (optional) sliced red onions and mango chutney (total swoon)."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftover patties covered in the refrigerator up to 3-4 days. If you want to freeze them, either freeze once cooked and cooled OR before sauteing and baking. Add patties to a freezer-safe container and freeze up to 1 month. Reheat in a 375-degree F (190 C) oven until warmed through."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/curried-quinoa-chickpea-burgers"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-04T15:58:55.016Z"
}
