{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths  ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-11-21T23:12:32.631Z",
  "datePublished": "2022-11-02",
  "description": "Beer and chocolate make a delicious combination when balanced carefully. We’ve showcased the flavour pairing in this recipe - the bitter tang of stout brings an added dimension to the rich, moist sponge cake. ",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/chocol180darcho_035:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Chocolate cake",
  "name": "Dark Chocolate & Stout Cake Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "American",
  "recipeId": "RGR9931",
  "recipeIngredient": [
    "325g unsalted butter (save 25g for greasing)",
    "1.32 cup stout",
    "580g caster sugar",
    "270g plain flour",
    "85g cocoa powder",
    "1 tsp baking powder",
    "1 seeds from vanilla pod",
    "130g honey",
    "5 eggs",
    "75g buttermilk",
    "175g dark chocolate, 70% cocoa, finely grated",
    "340g dark chocolate, 70% cocoa, finely grated",
    "255g double cream",
    "0.34 cup stout",
    "45g unsalted butter, softened",
    "1 generous pinch salt",
    ".25 cup dark chocolate, cut into curls (to decorate)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 160°C. Grease and line the tins with baking parchment. Bring 80ml of the stout to the boil in a small saucepan over a medium heat. Add 80g of the sugar and stir until dissolved. Remove the syrup from the heat and leave to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Sift the flour, cocoa powder, and baking powder into a bowl. Cream the butter, remaining sugar, salt, and vanilla in the mixer until pale and fluffy. Add the honey, then the eggs, one at a time, pulsing until combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Divide the batter evenly between the 2 cake tins and bake for 50 minutes, or until a toothpick inserted into the middle comes out clean. Remove the sponges from the oven and allow to cool in their tins."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "While the sponges are cooling, prepare the ganache. Place the chopped chocolate in a medium heatproof bowl. Combine the cream and stout in a saucepan, and bring to a simmer, ensuring that it does not boil."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the mixture from the heat and pour it over the chocolate in the bowl. Allow to stand for 12 minutes. Add the butter to the bowl and begin stirring the mixture, starting in the middle and moving outwards in small circular motions, until combined. Pour the mixture into the mixer, allow to cool a little, and whisk until spreadable."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the cooled sponges from their tins. Brush a generous amount of the stout syrup onto the top of one of the sponges using a palette knife, then spread a few generous spoonfuls of more ganache on top."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Layer the second sponge on top of the first, and soak it with syrup. Cover the whole cake very thinly with ganache using a palette knife. Refrigerate for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the cake from the fridge and cover with the remaining ganache. Decorate with chocolate curls and serve. You can cover and store the cake in the fridge for up to 2 days, allowing the cake to return to room temperature before serving."
    }
  ],
  "recipeNameId": "dark-chocolate-and-stout-cake",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/dark-chocolate-and-stout-cake"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-21T23:12:32.629Z",
  "url": "https://www.woolworths.com.au/shop/recipes/dark-chocolate-and-stout-cake"
}
