{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Yup, it's Vegan"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-01T09:54:31.991Z",
  "datePublished": "2022-04-01T10:57:03+00:00",
  "description": "These adorable little deviled potatoes are instantly reminiscent of deviled eggs, with their creamy, herb-flecked filling. Completely egg-free, vegan and gluten-free. Everyone at your Easter table can partake!",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2022/03/deviled-potatoes-square.jpg",
    "https://yupitsvegan.com/wp-content/uploads/2022/03/deviled-potatoes-square-500x500.jpg",
    "https://yupitsvegan.com/wp-content/uploads/2022/03/deviled-potatoes-square-500x375.jpg",
    "https://yupitsvegan.com/wp-content/uploads/2022/03/deviled-potatoes-square-480x270.jpg"
  ],
  "keywords": "deviled potatoes, vegan deviled eggs",
  "name": "Deviled Potatoes (Vegan Deviled Eggs)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "37 kcal",
    "carbohydrateContent": "5 g",
    "fatContent": "1 g",
    "fiberContent": "0.5 g",
    "proteinContent": "2 g",
    "servingSize": "1 piece",
    "sodiumContent": "100 mg",
    "unsaturatedFatContent": "1 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "24 oz small yellow or red potatoes (1 and 1/2 pounds / about 12 potatoes) scrubbed, with any eyes or blemishes removed)",
    "1/2 tbsp olive oil",
    "1/2 tsp salt",
    "1/4 cup plant-based mayonnaise",
    "2 tsp finely chopped dill pickle or prepared relish",
    "1 tsp dijon mustard",
    "1 tsp finely chopped fresh dill",
    "1 tsp finely chopped fresh parsley (optional)",
    "1/4 tsp salt",
    "1/8 tsp kala namak (black salt) (optional)",
    "freshly ground black pepper (to taste)",
    "fresh dill (roughly chopped)",
    "paprika",
    "fresh chives (thinly sliced)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 degrees Fahrenheit. Line a baking sheet with parchment paper if available, for easy cleanup."
    },
    {
      "@type": "HowToStep",
      "text": "In a mixing bowl, drizzle the potatoes with olive oil until lightly coated - about 1/2 tbsp. Add 1/2 tsp salt and toss to evenly coat. Transfer the potatoes to the baking sheet, and bake for about 45-55 minutes, or until fork-tender. (Exact baking time and oil amount will depend on the size, shape, and variety of your potatoes.)"
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, in a small bowl stir together the rest of the filling ingredients until evenly mixed. Transfer to the fridge to keep cold."
    },
    {
      "@type": "HowToStep",
      "text": "After the potatoes are cooked through, and cool enough to handle, slice each potato in half. Using a melon baller, small cookie scoop, or metal spoon, carefully scoop out the inside flesh of the potato, leaving about 1/4 inch of potato intact around the edges (see photos). Transfer the potato flesh to the mixing bowl from before."
    },
    {
      "@type": "HowToStep",
      "text": "Using a potato masher or a strong fork, mash the potato flesh until relatively smooth. Stir in the other filling ingredients. Taste for salt. Keep in mind, the flavor of the filling will develop much more after it is cooled in the refrigerator completely."
    },
    {
      "@type": "HowToStep",
      "text": "(Optional) if desired, to firm up the potato shells, return them to the oven for an additional 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully spoon the filling evenly into the potato shells. If desired, garnish each deviled potato with a sprinkle of paprika, a pinch of dill, and a pinch of chives. Cool completely in the refrigerator until ready to serve.Leftovers can be stored in a closed container in the refrigerator for several days until ready to serve. Moisture may collect at the bottoms of the potatoes from storage; wipe gently with a paper towel if needed."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://yupitsvegan.com/deviled-potatoes"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-12-01T09:54:31.990Z"
}
