{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Sarah McMinn"
  },
  "createdAt": "2022-12-02T19:54:36.979Z",
  "datePublished": "2019-05-20T07:00:30+00:00",
  "description": "Make your own vegan ice cream sundae bar at home. With recipes for chocolate ganache, coconut caramel sauce, and coconut whipped cream, this delicious DIY sundae bar is one everyone can enjoy! ",
  "image": [
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/04/DIY12.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/04/DIY12-500x500.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/04/DIY12-500x375.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/3019/04/DIY12-480x270.jpg"
  ],
  "keywords": "Vegan Ice Cream Sundae",
  "name": "DIY Vegan Ice Cream Sundae Bar",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "363 kcal",
    "carbohydrateContent": "31 g",
    "fatContent": "17 g",
    "fiberContent": "1 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "8 g",
    "servingSize": "1 serving",
    "sodiumContent": "96 mg",
    "sugarContent": "27 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 pint Coconut Bliss Madagascan Vanilla Bean or Dark Chocolate",
    "1/2 cup vegan ganache, (recipe follows)",
    "1/4 cup vegan caramel sauce (recipe follows)",
    "1 batch coconut whipped cream, (recipe follows)",
    "1 (10 ounce) bag vegan chocolate chips",
    "1 cup full-fat coconut milk",
    "1 cup vegan granulated sugar",
    "1/2 cup water, (or just enough to cover the sugar completely)",
    "1/2 cup coconut milk",
    "1/2 tsp. salt",
    "1 can full-fat coconut milk, (solids only)",
    "1/4 cup vegan powdered sugar",
    "1 tsp. vanilla extract",
    "1/4 cup nuts of choice, (optional)",
    "4 Maraschino cherries",
    "1 banana, (cut into slices)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by making the chocolate ganache. In a small pan, heat the creamer to a scald (just before boiling point). Place the chocolate chips in a small bowl. Once creamer is ready, pour over the chocolate chips and cover for 3-5 minutes. Remove cover and stir together with a spatula until the chocolate and cream come together to create a homogeneous thick sauce. Be careful not to over mix."
    },
    {
      "@type": "HowToStep",
      "text": "While your chocolate ganache cools, make your caramel sauce. Place the sugar and water in a very clean medium-sized pot set over high heat and bring to a boil. Do not stir. Agitating the sugar will cause crystallization. Continue boiling for about 10 minutes until the sugar has melted and begins to turn a rich golden brown. Immediately remove from heat and slowly add coconut milk while whisking. Whisk until combined. If the sugar starts to clump together, return the caramel sauce to a low heat while continuing to stir."
    },
    {
      "@type": "HowToStep",
      "text": "Pour caramel through a sieve into a jar and allow to cool to room temperature. The caramel will thicken as it cools."
    },
    {
      "@type": "HowToStep",
      "text": "Let the ganache and caramel sauce cool at room temperature for at least 2 hours before serving your ice cream sundaes."
    },
    {
      "@type": "HowToStep",
      "text": "When the ganache and caramel sauce has cooled, make the coconut whipped cream. Skim off the solid top half of chilled coconut milk. Make sure your coconut milk has separated, otherwise you will not get the right consistency. Add the powdered sugar and vanilla extract, and whip together with a handheld mixer."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble, divide Coconut Bliss Frozen Dessert between 4 bowls. Add chocolate ganache, caramel sauce, coconut whipped cream, and toppings of choice. Serve immediately."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://mydarlingvegan.com/diy-ice-cream-sundae-bar"
  ],
  "totalTime": "PT140M",
  "updatedAt": "2022-12-02T19:54:36.978Z"
}
