{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT3000S",
  "createdAt": "2022-12-04T02:18:02.980Z",
  "creator": {
    "@type": "Person",
    "name": "Dorie Greenspan"
  },
  "dateCreated": "2021-11-02T19:15:00-04:00",
  "dateModified": "2021-11-16T15:31:41-05:00",
  "datePublished": "2021-11-02T19:15:00-04:00",
  "description": "This simple apple galette has a caramel surprise. ",
  "headline": "Dorie Greenspan&#8217;s Apple Galette",
  "HowtoTip": {
    "text": "Make ahead: Kept covered in the refrigerator, the applesauce will be delicious for at least 3 weeks.The rolled-out dough can be refrigerated, well wrapped, for up to 3 days or frozen for up to 2 months; thaw before using.Storage: You can keep leftover galette at room temperature overnight and munch a slice, still cold, for breakfast, or reheat briefly in a 350ºF oven before serving.Excerpted from BAKING WITH DORIE: Sweet, Salty, &amp; Simple © 2021 by Dorie Greenspan. Photography © 2021 by Mark Weinberg. Reproduced by permission of Mariner Books, an imprint of HarperCollins Publishers. All rights reserved."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FLarge%20Packages%2F2021-11-Food%20Fest%2FDorie%20Greenspan%20French%20Menu%2FApple_Galette_1"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FLarge%20Packages%2F2021-11-Food%20Fest%2FDorie%20Greenspan%20French%20Menu%2FApple_Galette_1"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FLarge%20Packages%2F2021-11-Food%20Fest%2FDorie%20Greenspan%20French%20Menu%2FApple_Galette_1"
    }
  ],
  "keywords": [
    "apples",
    "french",
    "pie",
    "recipe",
    "thanksgiving",
    "Thanksgiving Food Fest 2021",
    "pantry",
    "dairy",
    "autumn",
    "dessert",
    "baked goods",
    "stovetop",
    "baking",
    "snacks",
    "team:food",
    "platform:newsfeeds",
    "platform:search",
    "platform:social",
    "course:dessert",
    "dishtype:baked good",
    "dishtype:tart",
    "timing:extended",
    "occasion:autumn",
    "occasion:friendsgiving",
    "occasion:thanksgiving",
    "mainingredients:butter",
    "mainingredients:pantry",
    "mainingredients:sugar",
    "mainingredients:fruit",
    "mainingredients:dairy",
    "mainingredients:apples",
    "method:baked",
    "method:stovetop",
    "meal:snack"
  ],
  "name": "Dorie Greenspan’s Apple Galette",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "394 cal",
    "carbohydrateContent": "71.2 g",
    "cholesterolContent": "0 mg",
    "fatContent": "12.1 g",
    "fiberContent": "5.7 g",
    "proteinContent": "3.1 g",
    "saturatedFatContent": "7.4 g",
    "servingSize": "Serves 8",
    "sodiumContent": "182.3 mg",
    "sugarContent": "45.5 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT2100S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dessert",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 stick (8 tablespoons) very cold unsalted butter",
    "4 tablespoons ice water, divided",
    "1 1/2 cups all-purpose flour",
    "2 tablespoons granulated sugar",
    "3/4 teaspoon kosher salt",
    "2 to 2 1/2 pounds apples (4 large or 5 medium)",
    "2/3 cup granulated sugar",
    "2 tablespoons water (optional)",
    "1 1/4 pounds sweet apples (3 to 4 medium), such as Golden Delicious, Fuji, Gala, or Mutsu",
    "1/2 medium lemon",
    "1 tablespoon granulated sugar, plus more as needed",
    "1/4 teaspoon ground cinnamon",
    "1/4 teaspoon ground ginger",
    "1/2 cup Caramel Applesauce or other thick applesauce",
    "1 1/2 teaspoons turbinado, sanding, or granulated sugar",
    "1 tablespoon or so honey or apple jelly, for glazing (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cut 1 stick very cold unsalted butter into 16 pieces. Prepare a small bowl of ice water. Place 1 1/2 cups all-purpose flour, 2 tablespoons granulated sugar, and 3/4 teaspoon kosher salt in a food processor fitted with the blade attachment. Pulse a couple of times to blend. Scatter the pieces of butter over the dry ingredients and pulse until the butter is cut into the flour, about 10 pulses. At first you’ll have a mixture that looks like coarse meal and then, as you pulse more, you’ll get small flake-size pieces and some larger pea-sized pieces too."
    },
    {
      "@type": "HowToStep",
      "text": "Add 2 tablespoons of the ice water and pulse, then add the remaining 2 tablespoons ice water and pulse and continue until all of the water is in. Then work in longer pulses, stopping to scrape the sides and bottom of the bowl if needed, until you have a dough that forms nice, bumpy curds that hold together when you pinch them."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the dough out onto a work surface and knead it gently to bring it together. Gather the dough into a ball, flatten it into a disk, and put it between two large pieces of parchment paper. Immediately roll the dough into an 11- to 12-inch round. Don’t worry too much about getting the exact size or about having the edges of the round be perfect—ragged is pretty for a galette or other rustic tart. The dough will be thicker than you think it should be, and that’s fine—it’s what you need for a free-form pastry."
    },
    {
      "@type": "HowToStep",
      "text": "Slide the rolled-out dough, still between the sheets of paper, onto a baking sheet or cutting board and refrigerate for at least 2 hours. Meanwhile, make the applesauce."
    },
    {
      "@type": "HowToStep",
      "text": "Peel 2 to 2 1/2 pounds apples. Halve, core, and then quarter the apples."
    },
    {
      "@type": "HowToStep",
      "text": "Pour 2/3 cup granulated sugar into a skillet that’s about 9 inches in diameter (I prefer nonstick) and spread it evenly over the bottom of the pan. (If you’re new to making caramel, you might want to moisten the sugar with a tablespoon or two of water. Adding water slows the process, giving you a bit more time to judge the color.)"
    },
    {
      "@type": "HowToStep",
      "text": "Turn the heat on to medium-high and stay close. As soon as you see the sugar changing color around the edges of the pan, either swirl the pan or use a silicone spatula or wooden spoon to stir small circles around the pan’s circumference, drawing the unmelted sugar to the edges little by little. (Don’t worry if the sugar clumps, it will melt again.) When all the sugar has melted and turned a light amber color — if it’s smoking, don’t be alarmed — take the pan off the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange the apples snugly in the pan in a single layer. Return the pan to medium-high heat and bring the caramel to a boil. Reduce the heat to medium and cook for about 10 minutes—no need to do anything but keep an eye on the pan and turn the heat down if there’s spattering. When you can easily pierce the apples with a knife, use a spoon to turn them over (don’t worry if they break), and cook for 5 more minutes."
    },
    {
      "@type": "HowToStep",
      "text": "The apples are scalding hot, so you might want to let them cool a bit before puréeing them. Scrape the warm apples into a food mill and purée them into a bowl, beat them with a spoon until they’re saucy, or blend them with a stand or immersion blender. It’s unlikely, but if the applesauce isn’t as thick as you’d like it now, scrape it into a saucepan and cook it down a bit."
    },
    {
      "@type": "HowToStep",
      "text": "Measure out 1/2 cup of the applesauce for the galette, then spoon the remaining applesauce into a heatproof container and once it cools, cover it tightly — or serve."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange a rack in the middle of the oven and heat the oven to 400oF."
    },
    {
      "@type": "HowToStep",
      "text": "Peel, halve, and core about 1 1/4 pounds sweet apples. Working with one half apple at a time, place cut-side down on a cutting board and slice crosswise into pieces that are about 1/4-inch thick (a little thinner is fine). Toss the slices into a large bowl and squeeze most of the juice from 1/2 medium lemon (about 2 tablespoons) over the apples."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 tablespoon granulated sugar, 1/4 teaspoon ground cinnamon, and 1/4 teaspoon ground ginger, and stir everything around until the apples are coated. Taste a slice to see if you want more lemon juice or sugar. (You can keep the apples at room temperature for up to 1 hour.)"
    },
    {
      "@type": "HowToStep",
      "text": "Slide the galette dough onto a baking sheet. Remove the top sheet of parchment and let it sit at room temperature for a few minutes, just so that it’s pliable enough to lift and fold without cracking."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon 1/2 cup applesauce onto the center of the dough and spread it out evenly, leaving a band of about 2 inches bare all around. Using a slotted spoon (or your hands), lift the apples out of the bowl and onto the applesauce, mounding them in the middle."
    },
    {
      "@type": "HowToStep",
      "text": "Pick up the edges of the dough and fold them up against the apples. As you fold, the dough will bend, ruffle and pleat on itself, and that’s what you want. Don’t worry about being neat or about getting everything even. If you see any cracks, fix them by smoothing them with a little water on your finger. If there’s any liquid left in the bowl, pour it over the apples. (You shouldn’t have a lot, but if you do, just pour over 1 to 2 tablespoons of it.)"
    },
    {
      "@type": "HowToStep",
      "text": "Brush the dough lightly with water and then sprinkle with 1 1/2 teaspoons turbinado sugar."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the galette until the apples are tender—poke them with a skewer or the tip of a paring knife to test, 45 to 50 minutes. (Check at 30 minutes and loosely tent the crust or the apples with aluminum foil if you think the crust or apples are browning too quickly.)"
    },
    {
      "@type": "HowToStep",
      "text": "Place the baking sheet onto a wire rack. If you want to glaze the apples, warm 1 tablespoon honey or jelly (add a splash of water to the jelly) until it liquefies (you can do this in the microwave or on the stovetop), then brush a thin layer over the apples. Wait until the galette is just warm or reaches room temperature to serve."
    }
  ],
  "recipeYield": 8,
  "sameAs": [
    "https://thekitchn.com/dorie-greenspan-apple-galette-23242811"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FLarge%20Packages%2F2021-11-Food%20Fest%2FDorie%20Greenspan%20French%20Menu%2FApple_Galette_1",
  "totalTime": "PT5100S",
  "updatedAt": "2022-12-04T02:18:02.977Z",
  "url": "https://www.thekitchn.com/dorie-greenspan-apple-galette-23242811"
}
