{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Sophia DeSantis"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-03T07:31:38.044Z",
  "datePublished": "2019-08-03T02:00:11+00:00",
  "description": "There is nothing quite like fresh, warm donuts, and with this recipe, you get perfectly soft and fluffy donuts with no deep-frying. They are baked in the oven, but by the time they have been dipped in melted vegan butter, and rolled in their warming, comforting cinnamon-y sugary coating, they taste as if they had been fried. If you cook oil-free, I give instructions for how to make them without the butter; and if you don’t own a donut pan, don’t worry. You can bake them as muffins or as donut holes in a mini muffin pan instead.",
  "image": [
    "https://www.veggiesdontbite.com/wp-content/uploads/2019/08/baked-vegan-cinnamon-sugar-donuts-27.jpg",
    "https://www.veggiesdontbite.com/wp-content/uploads/2019/08/baked-vegan-cinnamon-sugar-donuts-27-500x500.jpg",
    "https://www.veggiesdontbite.com/wp-content/uploads/2019/08/baked-vegan-cinnamon-sugar-donuts-27-500x375.jpg",
    "https://www.veggiesdontbite.com/wp-content/uploads/2019/08/baked-vegan-cinnamon-sugar-donuts-27-480x270.jpg"
  ],
  "keywords": "baked donuts, easy donuts",
  "name": "Drool-Worthy Cinnamon Donuts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "245 kcal",
    "carbohydrateContent": "44 g",
    "fatContent": "6 g",
    "fiberContent": "4 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "190 mg",
    "sugarContent": "18 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "Vegan butter or coconut oil (, to keep the donuts from sticking to the pan)",
    "19 tablespoons oat flour (1 cup plus 3 tablespoons) (, gluten-free (original recipe uses 1 cup plus 3 tablespoons all-purpose flour)",
    "1/4 cup finely ground almond flour",
    "1/2 cup cane or granulated white sugar (, I used coconut sugar)",
    "1 1/4 teaspoons baking powder",
    "1/8 teaspoon tsp baking soda",
    "1/4 teaspoon sea salt",
    "1/4 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg (, I also tried subbing ground cloves with a great result)",
    "2 teaspoons vanilla extract",
    "1 tablespoon apple cider vinegar",
    "11 tablespoons canned light coconut milk (1/2 cup plus 3 tablespoons)",
    "1/2 cup vegan butter (, optional)",
    "2 tablespoons ground cinnamon"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°F (176°C) and grease 6 wells of a donut pan with a little vegan butter or coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Sift the flour into a bowl. Add the sugar, baking powder, baking soda, salt, cinnamon and nutmeg; then whisk together to combine. (I skipped this and just combined everything in one bowl)"
    },
    {
      "@type": "HowToStep",
      "text": "In another bowl, combine the vanilla, vinegar and coconut milk. Stir them together, and pour into the flour mixture. Gently stir until all of the flour is absorbed and you can no longer see any dry flour. Do not overmix or beat the batter. It will be a thick batter. (This doesn't matter as much for the gluten-free version)."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon carefully and evenly into the prepared donut pan and level/tidy up the batter with the back of a teaspoon."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 12 to 15 minutes, or until the donuts are coming away from the edge of the pan and a toothpick inserted into a donut comes out clean. Remove from the oven, allow to cool in the pan for a few minutes and then gently turn them out onto a cooling rack."
    },
    {
      "@type": "HowToStep",
      "text": "If you do not have a donut pan, divide the batter among 6 greased wells of a muffin pan and bake at 350°F (176°C) for 20 to 23 minutes, or until a toothpick inserted into the middle of a muffin comes out clean. For donut holes, divide the batter among the wells of a mini muffin pan and bake at 350°F (176°C) for 8 to 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the donuts. While the donuts are still a little warm, gently melt the vegan butter in a microwave or in a pan over a very low heat on the stovetop. In a bowl big enough to fit the donuts into for dipping, combine the sugar and cinnamon. Using the butter ensures a good amount of sugar sticks to the donuts and helps give a “fried” flavor. However, if you want to keep the recipe oil-free, you can omit the butter, dipping the donuts into the cinnamon-sugar mixture while they are hot, and it will stick to them quite well."
    },
    {
      "@type": "HowToStep",
      "text": "Take each donut and dip it into the butter on each side and all around the edges then immediately place in the cinnamon-sugar mixture and coat on all sides. Be really generous with the sugar coating."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veggiesdontbite.com/baked-vegan-cinnamon-sugar-donuts"
  ],
  "suitableForDiet": [
    "https://schema.org/GlutenFreeDiet",
    "https://schema.org/VeganDiet",
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T07:31:38.043Z"
}
