{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "4",
    "reviewCount": "1"
  },
  "author": {
    "@type": "Person",
    "name": "https://mayihavethatrecipe.com"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-03T21:18:59.633Z",
  "datePublished": "2012-12-10",
  "image": [
    "https://mayihavethatrecipe.com/wp-content/uploads/2017/11/dsc_0306-225x225.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2017/11/dsc_0306-260x195.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2017/11/dsc_0306-320x180.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2017/11/dsc_0306.jpg"
  ],
  "name": "Dulce de Leche and Eggnog Filled Donut Holes (Sufganiot) & Hanukkah recipe roundup",
  "prepTime": "PT15M",
  "recipeCategory": "Dessert",
  "recipeIngredient": [
    "FOR THE DOUGH",
    "1- 1/4oz pack active dry yeast (about 1 tablespoon)",
    "2 tbsp sugar",
    "3/4 cup dairy free \"eggnog\", slightly warm",
    "2 cups self rising flour",
    "1 egg",
    "3 tbsp coconut oil, melted",
    "2 1/2 cups vegetable oil for frying",
    "1/2 cup sugar plus 1 1/2 tbsp ground cinnamon for coating",
    "Dairy free \"eggnog\" cream filling (recipe follows)",
    "Dulce de leche filling (recipe follows)",
    "Dairy Free \"Eggnog\" Cream Filling (makes about 1 cup):",
    "1 1/2 cup dairy free \"eggnog\"",
    "2 1/2 tbsp corn starch",
    "1/2 tbsp coconut oil",
    "\"Dulce de leche\" Filing:",
    "1-14oz can sweetened condensed milk"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, combine warm dairy free \"eggnog\", sugar and yeast. Set aside for a few minutes until some bubbles start to form"
    },
    {
      "@type": "HowToStep",
      "text": "Combine flour, egg and yeast mixture in a standing mixer bowl with a dough hook attachment. Mix until all the ingredients are well combined. Slowly pour the melted coconut oil and keep mixing until well incorporated. If the dough is too wet, add more flour, 1 tablespoon at a time"
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the dough to a lightly oiled bowl, cover with a clean towel and let it rise for about an hour and a half*"
    },
    {
      "@type": "HowToStep",
      "text": "Using your hands and working with about 2 tablespoons of dough at a time, form small balls (about 30 of them) and place them on a tray lined with parchment paper and slightly greased. Cover with a clean towel and let it rise for 30 minutes"
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat the oil in a 3-quart saucepan. You'll know the oil is ready when you insert the bottom of a wooden spoon and small bubbles start to form. Reduce the heat to medium low"
    },
    {
      "@type": "HowToStep",
      "text": "Drop about 4-5 donuts in the oil at a time, moving them around with a wooden spoon so they brown evenly. Cook until golden brown (about a minute) and place them on a try lined with a few paper towels to absorb the excess oil. Roll each one in cinnamon sugar"
    },
    {
      "@type": "HowToStep",
      "text": "Using s pipping bag, make a small hole in each donut and squeeze in the filling of your choice."
    },
    {
      "@type": "HowToStep",
      "text": "In a small saucepan, heat 1 1/4 cups dairy free \"eggnog\" just until small bubbles start to appear on the sides."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, in a small bowl whisk together 1/4 cup dairy free \"eggnog\" and corn starch until well incorporated."
    },
    {
      "@type": "HowToStep",
      "text": "Off the heat, add corn starch mixture to warm \"eggnog\". Bring saucepan back to the stove and cook the cream at medium-low heat, whisking constantly, until it thickens (this will happen quickly, in 30 to 45 seconds). Turn off heat and add 1/2 tablespoon of coconut oil, mixing well until it melts completely. Set aside to cool (if using right away, do not refrigerate). Cover the surface with plastic wrap (so it touches the cream)"
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 425F"
    },
    {
      "@type": "HowToStep",
      "text": "Pour condensed milk into a heat proof bowl. Cover with foil and place in a larger oven proof, deep dish or roasting pan. Add enough water to go up to approximately 3/4 of the bowl containing the condensed milk to create a water bath. Place in the oven for an hour and a half to two hours, stirring occasionally so it cooks evenly"
    },
    {
      "@type": "HowToStep",
      "text": "Once it's done, the condensed milk will turn a caramel color. If you see any lumps, carefully (it will be extremely hot!) whisk it until smooth. Let cool before using"
    }
  ],
  "recipeYield": "30",
  "sameAs": [
    "https://mayihavethatrecipe.com/2012/12/10/dulce-de-leche-and-eggnog-filled-donut-holes-sufganiot-hanukkah-recipe-roundup"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-04T10:25:56.575Z",
  "url": "https://mayihavethatrecipe.com/dulce-de-leche-and-eggnog-filled-donut-holes-sufganiot-hanukkah-recipe-roundup/"
}
