{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-29T17:15:35.719Z",
  "datePublished": "2021-03-11",
  "description": "Try our easy to follow Dumplings 3 Ways recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/1912-dumplings-3-ways:Square-1300x1300"
  ],
  "keywords": "Dumpling,Christmas,Prawn,Mince,Pork,Dec 2019,Spinach,Mushroom",
  "name": "Dumplings 3 Ways Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Appetisers",
  "recipeCuisine": "Chinese",
  "recipeId": "9891",
  "recipeIngredient": [
    "1.75 cup plain flour",
    "1 tsp sesame oil",
    "2 cm piece ginger (finely grated)",
    "1 tsp finely grated ginger",
    "200g pumpkin (chopped)",
    "2 spring onions (finely chopped)",
    "100g Swiss brown mushrooms (finely chopped)",
    "2 tbs hoisin sauce",
    "60g baby spinach leaves (finely chopped)",
    "sesame seeds (to serve)",
    "250g peeled garlic green prawns (finely chopped)",
    "soy sauce (to serve)",
    "250g pork mince",
    "1 garlic clove",
    "2 garlic cloves",
    "1 tbs vegetable oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the dough, place flour into a large bowl. Add 1/4 cup boiling water and oil and stir until combined. Gradually add a further 1/2 cup boiling water, stirring until dough starts to come together. Add 2 tbs cold water and stir until combined. Turn out onto a lightly floured surface and knead for 5 minutes or until smooth, adding a little more flour if dough is too sticky. Cover in plastic wrap and rest for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make prawn or pork fillings, combine all the ingredients for each in two separate bowls. To make the pumpkin filling, steam pumpkin until tender, then mash and combine with remaining ingredients."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Line 2 large baking trays with baking paper. Roll 2 tsp dough into a ball then roll out to a thin 11cm-wide round. Place onto tray and keep covered with a damp tea towel. Repeat with remaining dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place 1 tbs filling mixture into the centre of each. Bring edges together, pinching the top to seal. To make other shapes, fold rounds in half and pinch edges together to seal, and bring edges up to the centre, pressing together to form a star shape. Place onto tray. Repeat with remaining dough and filling. Cover with a damp tea towel to prevent drying out."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bring a saucepan or wok of water to the boil. Line a large bamboo steamer with baking paper. Add dumplings to steamer, in batches, leaving space between each. Cover and steam for 8-10 minutes or until cooked through. Serve with soy and sesame seeds."
    }
  ],
  "recipeNameId": "dumplings-3-ways",
  "recipeYield": "40",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/dumplings-3-ways"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-29T17:15:35.719Z",
  "url": "https://www.woolworths.com.au/shop/recipes/dumplings-3-ways"
}
