{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "31",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-06T02:25:16.792Z",
  "datePublished": "2016-06-30T05:00:09+00:00",
  "description": "8-ingredient, naturally sweetened no-bake fig newtons with nut-date cookie dough and a simple dried fig center. An incredibly tender, delicious take on classic fig newtons.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/06/AMAZING-Easy-Healthy-Fig-Newtons-made-with-dates-nuts-oats-and-figs-SO-easy-and-DELICIOUS-vegan-glutenfree-fignewton-cookie-recipe-figs.jpg"
  ],
  "keywords": "fig newtons",
  "name": "Easy Fig Newtons (GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "115 kcal",
    "carbohydrateContent": "16.9 g",
    "fatContent": "5.5 g",
    "fiberContent": "3 g",
    "proteinContent": "2.1 g",
    "saturatedFatContent": "0.5 g",
    "servingSize": "1 cookies",
    "sodiumContent": "32 mg",
    "sugarContent": "12.2 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "British-Inspired",
  "recipeIngredient": [
    "1/4 cup gluten-free oats",
    "1 cup raw almonds",
    "1 cup raw pecans",
    "1/4 tsp sea salt",
    "1 1/4 cups firmly packed pitted dates (~23-26 dates make 1 1/4 cups // weight measured after pitting)",
    "8 ounces dried black mission figs (stems removed // plus hot water for soaking)",
    "1 tsp orange zest",
    "1/4 tsp ground cinnamon",
    "1 pinch sea salt",
    "8-10 whole pitted dates (to sweeten)",
    "1-2 Tbsp coconut sugar (optional // to sweeten)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and arrange oats and nuts on a baking sheet. Bake for 8-12 minutes, rotating the pan near the the halfway mark to ensure even cooking, until golden brown and fragrant. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once slightly cooled, add oats, nuts, and sea salt to a food processor and process into a fine meal with salt. Remove from processor and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add pitted dates to food processor and mix/pulse until small bits remain or it forms a ball. Scoop out and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add nuts and oats back to food processor and spoon in the mixed dates. Mix/pulse until a loose dough is formed when squeezed between two fingers."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the “dough” onto a clean parchment-lined surface and top flatten down with hands. Then top with another piece of parchment paper and use a rolling pin to flatten into a 1/4-inch thick sheet. Remove top sheet of parchment paper and use hands to form into a rectangle. Then halve with a knife so there are two equal strips."
    },
    {
      "@type": "HowToStep",
      "text": "Add figs (stems removed) to a mixing bowl and cover with hot (not boiling) water. Soak for 3 minutes, then drain but reserve fig water for later (to thin filling)."
    },
    {
      "@type": "HowToStep",
      "text": "Add figs to food processor and blend into a ball (see photo), then add orange zest, ground cinnamon, salt and mix. Add reserved date water a little at a time until it starts to form a paste, but be careful not to add too much - you want it to be thick but spreadable."
    },
    {
      "@type": "HowToStep",
      "text": "Next add as many dates and/or coconut sugar as desired to sweeten and blend to combine. I used 10 dates and 1 1/2 Tbsp coconut sugar (amount as original recipe is written // adjust if altering batch size). However, you could also leave it as is."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the fig paste (or transfer spread into a plastic or piping bag and “pipe”) into 1-inch-thick lines down the center of your two date-nut strips. Be careful not to add too much filling that your cookie dough can’t fold over. You may have leftover filling (which can be reserved to add to baked goods, oatmeal, or future cookies)."
    },
    {
      "@type": "HowToStep",
      "text": "Next use the parchment paper to gently roll the edges of the dough over the fig filling until your two dough ends meet. The dough may crack a little, but because it’s moist it will reform as you continue rolling/forming. Like sushi, use the parchment paper to tighten and gently form the seams of the dough together."
    },
    {
      "@type": "HowToStep",
      "text": "For ease of transfer, cut both of the cookie logs in half and use a spatula or pie server to gently transfer to a parchment-lined baking sheet. Freeze for at least 30 minutes (up to 1 hour or overnight) to set/firm up. Then use a sharp knife to slice into roughly 1-inch slices. There should be about 22-24 cookies (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately. Store in the refrigerator in a well-sealed container up to 1 week or in the freezer up to 1 month! They’re delicious and tender right out of the fridge."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://minimalistbaker.com/healthy-fig-newtons-gf"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-06T02:25:16.791Z"
}
