{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "4.74"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-12-05T11:34:28.870Z",
  "datePublished": "2020-02-15T03:00:39+00:00",
  "description": "Green Chile Chicken Tamales that are lard-free, dairy-free, gluten-free, easy to make, and incredibly delicious. 10 ingredients and perfect for meal prepping and freezer meals. The ultimate comfort food!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Green-Chili-Chicken-Tamales-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Green-Chili-Chicken-Tamales-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Green-Chili-Chicken-Tamales-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Green-Chili-Chicken-Tamales-SQUARE-480x270.jpg"
  ],
  "keywords": "tamales",
  "name": "Easy Green Chile Chicken Tamales",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "99 kcal",
    "carbohydrateContent": "8.3 g",
    "cholesterolContent": "16.17 mg",
    "fatContent": "4.2 g",
    "fiberContent": "1 g",
    "proteinContent": "6.9 g",
    "saturatedFatContent": "0.7 g",
    "servingSize": "1 tamales",
    "sodiumContent": "232 mg",
    "sugarContent": "0.6 g",
    "transFatContent": "0.02 g",
    "unsaturatedFatContent": "3.24 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Dairy-Free",
  "recipeIngredient": [
    "2 cups masa harina (not cornmeal // masa harina has been cooked and soaked in lime water, then ground into flour)",
    "1 3/4 cups water",
    "1 1/2 tsp sea salt",
    "1 3/4 tsp baking powder",
    "4 1/2 Tbsp avocado oil (or sub dairy-free butter or organic dairy butter as tolerated)",
    "2/3 - 3/4 cup chicken broth, vegetable broth, bone broth, or water (warm temperature is best)",
    "1-2 Tbsp avocado oil",
    "1/2 cup white or yellow onion, diced",
    "4 cloves garlic, minced",
    "1 healthy pinch sea salt, plus more to taste",
    "1 cup hatch (mild green) chiles, diced (canned or freshly roasted, peeled, and diced)",
    "1 1/2 Tbsp masa harina (for thickening)",
    "2 - 2 1/2 cups shredded chicken",
    "1/2 - 3/4 cup chicken broth, bone broth, or vegetable broth",
    "1 small package dried corn husks (as recipe is written, ~26 corn husks)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add masa harina to a large mixing bowl and pour the water over it. Stir to combine — it will appear dry, that's okay. Let rest 15 minutes to hydrate."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add dried corn husks to a large mixing bowl and cover with room temperature water. Set something on top to submerge them (such as a small skillet). Let soak at least 15 minutes and up to 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat a pot, Dutch oven, or large rimmed skillet over medium heat. Once hot, add oil, onion, and garlic. Season with a healthy pinch of salt and sauté for 4-5 minutes, stirring occasionally, until tender and slightly browned."
    },
    {
      "@type": "HowToStep",
      "text": "Add green chiles and masa harina and stir to coat. Cook for 1 minute. Then add shredded chicken and stir."
    },
    {
      "@type": "HowToStep",
      "text": "Add broth a little at a time until a saucy mixture is achieved. It shouldn't appear dry, nor should it be soupy (see photo). Cook over medium heat for 5-8 minutes (the broth will reduce — add more as needed). Stir occasionally. Then taste and adjust flavor as needed, adding more salt to taste. Turn off heat and set aside to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "To the soaked masa mixture add salt, baking powder, and avocado oil and stir. Then add broth (warm or room temperature for best results) a little at a time until a thick paste is achieved. It shouldn't be liquidy or crumbly (see photo). Be sure to stir well so it's fully combined. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Remove corn husks from water and pat dry. Then take one husk in your non-dominant hand (or place on a flat, clean surface) with the wider edge toward you (narrow end away from you). Add 2 - 2 1/2 Tbsp masa in the center near the bottom (closest end toward you), then use the back of a spoon to spread the mixture from the bottom 1/3 center of the husk to the right edge (see photo). A semi-thin layer is ideal (not too thin, not too thick)."
    },
    {
      "@type": "HowToStep",
      "text": "Then add 1 1/2 Tbsp of the green chile chicken filling to the center of the masa. Fold the right edge of the corn husk over the chicken filling (toward the masa's left edge) and tuck right where the masa ends on the left. Then continue rolling until the husk’s seams meet. Next, fold the narrow edge of corn husk tightly toward the opposite side of where the seams meet and set in a loaf pan or dish that will keep your tamales upright (see photo). Continue until you have used all your masa mixture and filling (as recipe is written, ~26 tamales)."
    },
    {
      "@type": "HowToStep",
      "text": "To a large pot or Dutch oven, add a steamer basket. Fill a pot with water until it almost touches the base of the steamer basket. Then add the tamales, keeping them upright if possible (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the heat to high, then once boiling, reduce heat to low, cover, and simmer to steam the tamales for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooked, remove the lid and let steam escape. Then they're ready to enjoy! Top with desired garnishes. We loved guacamole, hot sauce, diced red onion, and a little dairy-free yogurt (Culina plain)."
    },
    {
      "@type": "HowToStep",
      "text": "Store cooled tamales covered in the refrigerator up to 4-5 days. Reheat in the microwave or in a cast iron skillet on the stovetop until hot."
    },
    {
      "@type": "HowToStep",
      "text": "Or, to freeze, let tamales cool, then add to a parchment-lined baking sheet and arrange in a single layer. Freeze until firm, then transfer to a well-sealed container where they should keep for at least 1 month, oftentimes longer. To cook from frozen, either let thaw then heat in the microwave or a cast iron skillet on the stovetop until hot, or microwave for 1 minute, remove husk, then continue heating in the microwave or in a cast iron skillet on the stovetop until hot."
    }
  ],
  "recipeYield": "26",
  "sameAs": [
    "https://minimalistbaker.com/easy-green-chile-chicken-tamales"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-12-05T11:34:28.869Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=_fSQDRCDAPI",
    "description": "Green Chile Chicken Tamales that are lard-free, dairy-free, gluten-free, easy to make, and incredibly delicious. 10 ingredients and perfect for meal prepping and freezer meals. The ultimate comfort food!\n\nFull Recipe: https://minimalistbaker.com/easy-green-chile-chicken-tamales/\n\nTamales are believed to have originated in Mesoamerica (a region that includes parts of Mexico and Central America). They consist of a corn-based (masa) shell and flavorful filling (vegan, vegetarian, or meat-based) that’s wrapped in either a corn husk or a banana leaf and then steamed.\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M24S",
    "embedUrl": "https://www.youtube.com/embed/_fSQDRCDAPI?feature=oembed",
    "name": "Easy Green Chile Chicken Tamales | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/_fSQDRCDAPI/hqdefault.jpg",
    "uploadDate": "2020-02-15T09:00:10+00:00"
  }
}
