{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "23",
    "ratingValue": "4.92"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-03T00:17:33.436Z",
  "datePublished": "2019-02-05T03:00:44+00:00",
  "description": "How to make harissa paste in less than 30 minutes! Enjoy using this North African spicy red sauce to add heat to dressings, sauces, soups, and more!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/12/Harissa-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/12/Harissa-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/12/Harissa-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/12/Harissa-SQUARE-480x270.jpg"
  ],
  "keywords": "Harissa Paste",
  "name": "Easy DIY Harissa Paste",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "123 kcal",
    "carbohydrateContent": "9.8 g",
    "fatContent": "8.3 g",
    "fiberContent": "4.2 g",
    "proteinContent": "1.8 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 two-Tbsp servings",
    "sodiumContent": "266 mg",
    "sugarContent": "2.9 g",
    "unsaturatedFatContent": "5.9 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Sauce",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "10 dried New Mexico chiles (or other large dried chile with mild-to-medium spiciness)",
    "7 dried chiles de arbol (increase for more heat, decrease for less heat)",
    "1 Tbsp (heaping) cumin seeds ( (or sub slightly less ground // if using ground, skip the toasting step)",
    "2 tsp coriander seeds (or sub slightly less ground // if using ground, skip the toasting step)",
    "1 tsp caraway seeds (not essential, but added to most traditional harissa)",
    "4 cloves garlic, minced",
    "1 1/2 tsp smoked paprika",
    "1 tsp sea salt",
    "2 Tbsp lemon juice",
    "1 Tbsp white wine vinegar or apple cider vinegar",
    "1 Tbsp tomato paste (or sub finely chopped sun-dried tomatoes)",
    "1/4 cup olive oil (if avoiding oil, sub water or omit)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add dried chilies to a mixing bowl or measuring cup and cover with hot water. (We used a mix of mild New Mexico chiles and hot peppers (chiles de arbol). Adjust the ratio to preferred spice level.) Once submerged, cover and steam for 15-20 minutes to rehydrate. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add cumin and coriander seeds to a small skillet and toast over medium heat for a few minutes, or until fragrant and they start to pop. Then transfer to a mortar and pestle (if you don't own one, just add to a food processor to mix later), and crush into a fine powder."
    },
    {
      "@type": "HowToStep",
      "text": "Next add caraway seeds, minced garlic, smoked paprika, and salt, and mix. Then add lemon juice and vinegar and mix again until you've achieved a paste. Transfer paste to food processor and add the tomato paste. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once chiles are rehydrated, drain and remove the stems and seeds (I recommend wearing gloves to protect your hands), then add to food processor. At this point, all ingredients (besides olive oil) should be in the food processor."
    },
    {
      "@type": "HowToStep",
      "text": "Blend for 1-2 minutes, scraping down sides as needed until a smooth paste is achieved. Then stream in 1/4 cup olive oil while blending to create a saucier consistency (see photo). (Add more oil (or water) as needed until desired consistency is achieved.)"
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more lemon or vinegar for acidity, paprika for smokiness, tomato paste for depth of flavor, or salt to taste. If it's not spicy enough at this point, you can either add more chiles de arbol (rehydrated and seeds removed) or cayenne pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop paste into a jar to store in the refrigerator for up to 1 month. If storing in the freezer, we recommend scooping into an ice cube tray, freezing, and storing in a freezer-safe container up to 2 months. Add cubes directly to warm foods (like stews or cooked sauces). If adding to cold foods (like dressings or dips), let thaw before adding."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/easy-diy-harissa-paste"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T00:17:33.435Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=PAS2uaq5wiI",
    "description": "How to make harissa paste in less than 30 minutes! Enjoy using this North African spicy red sauce to add heat to dressings, sauces, soups, and more!\n\nFull Recipe: https://minimalistbaker.com/easy-diy-harissa-paste/\n\nHarissa is a hot chili paste that originated in Tunisia, North Africa. It is commonly used as a dip or marinade, or to add to dishes like stews to add vibrant red color and heat. Chili peppers were originally imported to Tunisia in the 16th century during the Spanish occupation, and shortly thereafter harissa quickly became a staple part of Tunisian (and Middle Eastern) cuisine.\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT59S",
    "embedUrl": "https://www.youtube.com/embed/PAS2uaq5wiI?feature=oembed",
    "name": "Easy DIY Harissa Paste | Minimalist Baker",
    "thumbnailUrl": "https://i.ytimg.com/vi/PAS2uaq5wiI/hqdefault.jpg",
    "uploadDate": "2019-02-05T15:36:03+00:00"
  }
}
