{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "38",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-05T11:22:31.625Z",
  "datePublished": "2018-05-16T03:00:10+00:00",
  "description": "Easy-to-make vegan cheese with probiotics for an extra tangy, cheesy flavor! Just 6 ingredients and simple methods required. The perfect party appetizer, snack, or spread!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cultured-Vegan-Cheese-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cultured-Vegan-Cheese-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cultured-Vegan-Cheese-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Cultured-Vegan-Cheese-SQUARE-480x270.jpg"
  ],
  "keywords": "vegan cheese",
  "name": "Easy Probiotic-Cultured Vegan Cheese",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "125 kcal",
    "carbohydrateContent": "7.3 g",
    "fatContent": "9.5 g",
    "fiberContent": "1.1 g",
    "proteinContent": "4.7 g",
    "saturatedFatContent": "1.7 g",
    "servingSize": "1 serving",
    "sodiumContent": "101 mg",
    "sugarContent": "1.3 g",
    "unsaturatedFatContent": "6.81 g"
  },
  "prepTime": "PT2970M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 cups raw cashews or blanched slivered almonds",
    "1 Tbsp - 2 garlic cloves, minced",
    "2 Tbsp lemon juice",
    "2 Tbsp nutritional yeast",
    "1/2 tsp sea salt",
    "1/2 cup water",
    "2 probiotic capsules*",
    "2 Tbsp finely minced fresh dill",
    "Freshly ground black pepper or spice mix"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place cashews in a bowl and cover with cool water. Soak for at least 6 hours. In a pinch, soak in very hot water for 1 hour. If using almonds, no need to soak!"
    },
    {
      "@type": "HowToStep",
      "text": "Once soaked, drain cashews thoroughly and add to food processor (if using almonds, add unsoaked to a high-speed blender for creamiest texture). Add minced garlic, lemon juice, nutritional yeast, and sea salt and process until very creamy and smooth, scraping down sides as needed. Add the water a little at a time until a creamy consistency is reached."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed, adding more lemon juice for acidity, nutritional yeast for cheesiness, garlic for zing, or salt for saltiness."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a mixing bowl and add the probiotics (by pulling open the probiotic capsule and only adding the powder from inside the capsule). Stir to combine with a wooden or plastic spoon (not metal, as it can tamper with the effectiveness of the probiotics)."
    },
    {
      "@type": "HowToStep",
      "text": "Place a fine mesh strainer (or colander) over a small or medium mixing bowl and lay down two layers of cheesecloth (or a clean, fine, absorbent towel)."
    },
    {
      "@type": "HowToStep",
      "text": "Use a spatula to scoop the cheese mixture over the cheesecloth. Then gather the corners and gently twist the top to form the cheese into a \"disc.\" Secure with a rubber band."
    },
    {
      "@type": "HowToStep",
      "text": "Leave to set on the countertop at room temperature for at least 24 hours, up to 72. We found 48 hours to be the sweet spot. The longer it sits, the firmer and tangier it will become."
    },
    {
      "@type": "HowToStep",
      "text": "Once the cheese has cultured enough for taste, transfer to the refrigerator to set for at least 6 hours to firm/harden and chill."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, carefully unwrap from cheesecloth and gently invert onto a serving platter. Reform with hands or cheesecloth as needed. Then coat with chopped herbs, black pepper, or spice mix (optional). It can be fragile, so handle gently."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy chilled with crackers or vegetables. Cheese will hold its form for several hours out of the refrigerator, but best when chilled. Leftovers keep well covered in the refrigerator up to 7 days (sometimes longer) - you'll know it's bad when mold has formed or the taste is no longer appetizing."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/easy-probiotic-cultured-vegan-cheese"
  ],
  "totalTime": "PT2970M",
  "updatedAt": "2022-12-05T11:22:31.624Z"
}
