{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "37",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT18M",
  "createdAt": "2022-12-01T12:48:17.448Z",
  "datePublished": "2019-05-10T23:32:29+00:00",
  "description": "A super easy, soft, light and fluffy flatbread recipe that is really versatile and perfect for beginners to bread making. ",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Easy-Flatbread-Recipe-A-Virtual-Vegan-7.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Easy-Flatbread-Recipe-A-Virtual-Vegan-7-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Easy-Flatbread-Recipe-A-Virtual-Vegan-7-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Easy-Flatbread-Recipe-A-Virtual-Vegan-7-480x270.jpg"
  ],
  "keywords": "bread, flatbread",
  "name": "Easy Flatbread Recipe",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "256 kcal",
    "carbohydrateContent": "41 g",
    "fiberContent": "2 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "7 g",
    "servingSize": "1 flatbread",
    "sodiumContent": "396 mg",
    "sugarContent": "1.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Baked Goods",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1 1/2 teaspoons active dry yeast (, or instant/quick action yeast)",
    "approx 1 cup & 1 tablespoon (255 mls) warm water (not hot!)",
    "2 teaspoons sugar (, white sugar or cane sugar)",
    "2 1/2 cups (310 grams) all purpose flour or bread flour (, (strong flour in the UK)",
    "1 teaspoon fine salt",
    "3 tablespoons (45 mls) olive oil (, or any other liquid oil like vegetable, avocado, sunflower etc)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you are using active dry yeast you first need to activate it. (If you are using instant or quick action yeast skip to the next step). In a small jug or bowl, add the active dry yeast, the sugar and about 120 mls / 1/2 cup of the warm water. The water should be somewhere between 95°F and 115°F. If you drop some on the inside of your wrist it should feel warm but not hot. Stir it together and leave for 5 or 6 minutes. It will take about 2 to 3 minutes for the yeast to become thoroughly dissolved and 2 or 3 more for it to begin to show signs of life and start bubbling. Once that has happened you are set to continue."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour and salt to a large mixing bowl. If you are using instant or quick action yeast add the sugar. Mix together. Next add the yeast mixture or instant/quick acting yeast and the oil. Stir it all together with a spoon then add just enough of the remaining water to form a slightly sticky dough (you might not need all of the water and you may need a tiny bit more). Keep stirring as you add it, then start using your hands to bring it all together. The dough will stick to your hands at first but keep kneading it around in the bowl until it comes together in a ball. If you prefer you can use a stand mixer but it's so quick and easy by hand that I never bother. If the dough feels too sticky, add a little more flour. It should only take 2 to 3 minutes of relaxed kneading to get a smoothish ball of dough. It doesn't need kneading as thoroughly as a loaf of bread might."
    },
    {
      "@type": "HowToStep",
      "text": "Scrape the ball of dough loose from the bowl with your fingers and lift it out for a second, then with your other hand, pour a drop of oil into the bottom of the bowl. Put the dough back in and turn it all around so all sides have a layer of oil. Run a clean dish towel under warm water and wring it out, then place it over the top of the bowl. Leave on your kitchen counter for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "After 1 hour, lightly flour your work surface and tip the dough out onto it. Punch the air out of it, then form into an even round ball. Using a sharp knife, cut into 6 evenly sized pieces. Roll each one into a ball then use a rolling pin, roll each ball into a disc or oval shape about 3-4 mm thick."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a griddle, skillet or frying pan over a medium high heat for a few minutes until very hot. No oil is necessary. Gently and carefully place each flatbread on the hot surface (you can do more than one at a time if you have space). Stay close by as it all happens pretty fast. Watch as bubbles start appearing and it puffs up. After 2 to 3 minutes, use a spatula to gently peek underneath Once the underside is golden in places (or slightly charred if you prefer - just cook for slightly longer) flip it over and cook for another 2 to 3 minutes on the other side. Wrap the cooked flatbreads in a clean dish towel to keep extra soft, or place on a cooling rack. Continue until they are all cooked."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://avirtualvegan.com/flatbread-recipe"
  ],
  "totalTime": "PT93M",
  "updatedAt": "2022-12-01T12:48:17.447Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/iWzm3sP4.mp4",
    "description": "A super easy, soft, light and fluffy flatbread recipe that is really versatile and perfect for beginners to bread making.",
    "name": "Easy Flatbread Recipe",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/iWzm3sP4-720.jpg",
    "uploadDate": "2019-05-11T00:00:00.000Z"
  }
}
