{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-04T13:49:01.624Z",
  "datePublished": "2020-06-17T03:00:00+00:00",
  "description": "Easy 1-pot refried beans with minimal ingredients. Try our step-by-step methods for getting ultra creamy texture and classic flavor FAST! Perfect for canned pinto beans or beans made from scratch.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/05/Creamy-1-Pot-Refried-Beans-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/05/Creamy-1-Pot-Refried-Beans-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/05/Creamy-1-Pot-Refried-Beans-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/05/Creamy-1-Pot-Refried-Beans-SQUARE-480x270.jpg"
  ],
  "keywords": "refried beans",
  "name": "Easy 1-Pot Refried Beans",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "151 kcal",
    "carbohydrateContent": "20.3 g",
    "fatContent": "5.4 g",
    "fiberContent": "5.2 g",
    "proteinContent": "6.4 g",
    "saturatedFatContent": "0.7 g",
    "servingSize": "1 half-cup serving",
    "sodiumContent": "421 mg",
    "sugarContent": "1.6 g",
    "unsaturatedFatContent": "4.26 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3 cups cooked pinto beans (see instructions for canned, from scratch, and Instant Pot)",
    "2 Tbsp avocado oil (or sub water but double the amount and add more as needed)",
    "3/4 cup diced white onion",
    "3 cloves garlic, minced",
    "1/4-1 cup vegetable broth (or store-bought // amount will vary depending on method of cooking beans)",
    "1/2 tsp sea salt, plus more to taste",
    "Lime juice",
    "Hot sauce",
    "Freshly chopped cilantro",
    "Diced red onion",
    "Vegan Mexican-style Queso"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "CANNED: If starting with canned beans, simply open cans and set aside. As the original recipe is written, about 2 15-oz (425-g) cans will yield 3 cups cooked beans."
    },
    {
      "@type": "HowToStep",
      "text": "FROM SCRATCH: If cooking pinto beans from scratch, we recommend this recipe, which yields 5 cups cooked beans. We recommend reducing the serving size to six 1/2-cup servings (rather than 10 servings), which would yield 3 cups cooked beans. The spices and diced tomatoes with green chilies are optional."
    },
    {
      "@type": "HowToStep",
      "text": "INSTANT POT: If cooking pinto beans in an Instant Pot, we recommend following this recipe but swapping the black beans for pinto beans. Be sure to save any leftover cooking liquid."
    },
    {
      "@type": "HowToStep",
      "text": "REFRIED BEANS: To prepare refried beans, heat a large pot or Dutch oven over medium heat. Once hot, add oil (or water) and onion. Sauté, stirring occasionally, until translucent and tender — about 4-5 minutes. Then add minced garlic and cook for 2 minutes more. Turn down heat if browning too quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Next add your cooked beans and any of the cooking liquid. Depending on your cooking method, your beans may be looking somewhat dry or they may be submerged in cooking liquid. Because we’re going to simmer the beans even more, you want them to be just submerged, so add only as much vegetable broth as needed to just cover the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Bring to a low boil over medium heat. Then add your salt. Cover and reduce heat to low. Simmer for 20 minutes to further cook and tenderize the beans. If they begin looking dry or stick to the bottom of the pan at any point, add more vegetable broth to moisten."
    },
    {
      "@type": "HowToStep",
      "text": "Your beans should now be tender. Our preferred way of mashing is with an immersion blender. If using an immersion blender, tip the pot to one side so the blade can be submerged and blend until the beans are creamy and smooth. If you don’t have an immersion blender, a bean or potato masher will also work. It just takes more work and they won’t get quite as creamy."
    },
    {
      "@type": "HowToStep",
      "text": "If you’re blending or mashing and your beans have become too thick, thin with more vegetable broth as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed, adding more salt to taste. We didn’t find the beans needed more than this. However, you could add chili powder or chipotle pepper in adobo for some heat, or some ground cumin for smokiness."
    },
    {
      "@type": "HowToStep",
      "text": "Serve as is, or garnish with desired toppings (lime juice, hot sauce, cilantro, red onion, or this vegan Mexican-style queso would be delicious)."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers covered in the refrigerator up to 4-5 days or in the freezer for up to 1 month. To reheat, warm in a pot or saucepan, adding more broth as needed."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/easy-1-pot-refried-beans"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-04T13:49:01.623Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=9shZJjrEbus",
    "description": "Easy 1-pot refried beans with minimal ingredients. Try our step-by-step methods for getting ultra creamy texture and classic flavor FAST! Perfect for canned pinto beans or beans made from scratch.\n\nFull Recipe: https://minimalistbaker.com/easy-1-pot-refried-beans/\n\nFrijoles refritos are believed to have originated in the early 1900s in Northern Mexico. And while the name directly translates to English as “well-fried beans”, when the dish spread to the southern United States, it became “refried beans.” This recipe is not a traditional method of making refried beans, but is our Mexican-inspired version made without lard.\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT54S",
    "embedUrl": "https://www.youtube.com/embed/9shZJjrEbus?feature=oembed",
    "name": "Easy 1-Pot Refried Beans | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/9shZJjrEbus/hqdefault.jpg",
    "uploadDate": "2020-06-17T08:00:04+00:00"
  }
}
