{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "383",
    "ratingValue": "4.49"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-01T12:45:28.277Z",
  "datePublished": "2017-07-18T05:00:41+00:00",
  "description": "Easy, vegan, and gluten-free coconut yogurt with just 2 ingredients and 1 bowl! Thick, rich, tangy, creamy, and perfect for snacking!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/06/Coconut-Yogurt-SQUARE.jpg"
  ],
  "keywords": "coconut yogurt",
  "name": "Easy 2-Ingredient Coconut Yogurt",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "120 kcal",
    "carbohydrateContent": "2 g",
    "fatContent": "12 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "10 g",
    "servingSize": "1 quarter-cup servings",
    "sodiumContent": "25 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT1800M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 (14-ounce) can full fat coconut milk*",
    "2 capsules vegan-friendly probiotic* (they need to be capsules, not pills, which have to be crushed, see below for recommendations // capsules can be easily opened and emptied)",
    "Maple syrup, stevia, or agave nectar for sweetening",
    "Vanilla extract or vanilla bean powder",
    "Fruit or Fruit Compote"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "SEE NOTES ABOVE FOR MORE TIPS! It's important to select a coconut milk that's creamy and smooth (not grainy or clumpy) to ensure that the yogurt is creamy and smooth. Our favorite brands are: Savoy Coconut Cream, Aroy-D Coconut Milk, and Whole Foods 365 full fat (BPA-free). Native Forest Full Fat (BPA-free) isn't as creamy, but it still makes tasty yogurt. We would not recommend Trader Joe's (BPA-free), which was recently reformulated and is now chunky/grainy."
    },
    {
      "@type": "HowToStep",
      "text": "Shake your coconut milk well. Then open and pour into a clean, sterilized, dry glass jar or bowl. You can easily sterilize clean jars by rinsing throughly with boiling water and letting dry completely. Just let them cool back down to room temperature before adding ingredients. For jars, I like this one from Weck. Sometimes the coconut milk is separated, so after adding it to the jar, I stir with a whisk to get it completely smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Empty your probiotic capsules (see brand recommendations below) into the yogurt and (important:) use a wooden or plastic spoon to stir, not metal, as a metal spoon can react negatively with the probiotics. Stir until creamy and smooth, pushing the probiotic up against the side with your spoon to evenly disperse."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the mixture with cheesecloth (or a very thin, clean dish towel - something that lets air in but keeps bugs out) and secure with a rubber band."
    },
    {
      "@type": "HowToStep",
      "text": "Let the yogurt activate for at least 24 hours and up to 48 hours (sometimes longer - 48 hours is my sweet spot for thickness and tang) in a warm place. The longer it rests, the tangier the yogurt will become. In warmer climates and summer it's easy to make yogurt if your house is warm (75 degrees F / 23 C and above). But in cooler climates or seasons, place the yogurt in the oven with the light on (do not turn on the oven), where it should have the right amount of heat to activate."
    },
    {
      "@type": "HowToStep",
      "text": "That's it! Once the yogurt has reached the right amount of tanginess and thickness for your liking (be sure to sample with a wooden spoon), cover securely with a lid and refrigerate until cold. Refrigerating will also thicken the yogurt even more, almost to a Greek yogurt consistency (depending on the brand of coconut milk you used)! For even thicker yogurt, line a fine mesh strainer with two layers of cheesecloth and set over a mixing bowl. Pour in the yogurt, then loosely cover with a lid or plastic wrap and let rest in the refrigerator overnight or for 12+ hours. It should thicken up quite a bit more."
    },
    {
      "@type": "HowToStep",
      "text": "You have coconut yogurt (!), which can be enjoyed plain as I prefer it, with fruit, or even with Fruit Compote. You can also add a bit of sweetener or flavor at this point, such as maple syrup and/or vanilla extract."
    },
    {
      "@type": "HowToStep",
      "text": "Store covered in the refrigerator for several days (mine kept for 7 days). You'll know it's gone bad when the smell is off-putting or there is mold."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/easy-2-ingredient-coconut-yogurt"
  ],
  "totalTime": "PT1800M",
  "updatedAt": "2022-12-01T12:45:28.274Z"
}
