{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "12",
    "ratingValue": "4.59"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-05T12:05:36.588Z",
  "datePublished": "2021-11-10T03:00:00+00:00",
  "description": "Creamy, dreamy vegan chocolate cheesecake with optional raspberry sauce! Super chocolaty, decadent, and gluten-free. Just 9 ingredients required!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2021/09/Chocolate-Cheesecake-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/09/Chocolate-Cheesecake-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/09/Chocolate-Cheesecake-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/09/Chocolate-Cheesecake-SQUARE-480x270.jpg"
  ],
  "keywords": "chocolate cheesecake, chocolate cheesecake recipe, chocolate raspberry cheesecake, vegan cheesecake, vegan cheesecake chocolate, vegan chocolate cheesecake",
  "name": "Easy Baked Chocolate Cheesecake (Vegan + GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "439 kcal",
    "carbohydrateContent": "38.9 g",
    "fatContent": "30.3 g",
    "fiberContent": "6.2 g",
    "proteinContent": "9.7 g",
    "saturatedFatContent": "13.1 g",
    "servingSize": "1 slice",
    "sodiumContent": "207 mg",
    "sugarContent": "20.6 g",
    "unsaturatedFatContent": "10.9 g"
  },
  "prepTime": "PT390M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup almond flour",
    "1/4 cup arrowroot starch",
    "3 Tbsp cocoa powder",
    "1/4 tsp sea salt",
    "3 Tbsp refined coconut oil (solid, not melted)",
    "3 Tbsp maple syrup",
    "1 cup raw cashews",
    "1 cup coconut cream",
    "8 oz. plain vegan cream cheese (Miyokos is best, but Tofutti or Kite Hill also work)",
    "1 Tbsp arrowroot starch",
    "2/3 cup maple syrup",
    "1 Tbsp melted refined coconut oil",
    "1/2 scant cup cocoa powder",
    "1/8 tsp sea salt",
    "12 oz. fresh or frozen raspberries (~2 cups)",
    "2-3 Tbsp maple syrup",
    "1 1/2 tsp arrowroot starch"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 degrees F (176 C) and line a standard loaf pan (or 8×8 inch baking dish) with parchment paper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "CRUST: To a medium bowl add almond flour, arrowroot starch, cocoa powder, and salt and stir to combine. Add solid coconut oil and cut it into the dry ingredients using a pastry cutter, fork, or clean hands. The mixture should look like wet sand and hold together when squeezed. Add the maple syrup and stir until combined."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to parchment-lined loaf pan and spread evenly to distribute. Then place parchment paper on top and use a flat-bottomed object, like a drinking glass, to press down firmly until it’s evenly distributed and well packed."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the crust for 15 minutes or until dry and slightly firm to the touch — it’s okay if it still feels a little soft. Remove from oven and set aside to cool slightly. At this time, turn your oven temperature down to 325 F (162 C)."
    },
    {
      "@type": "HowToStep",
      "text": "FILLING: While the crust cools, add all of the filling ingredients (cashews, coconut cream, vegan cream cheese, arrowroot starch, maple syrup, coconut oil, cocoa powder, and salt) to a high-speed blender. Blend on high until very smooth and creamy — about 1 minute — scraping down the sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more maple syrup for sweetness, salt for balance, or cocoa powder for a richer chocolate flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the filling onto the pre-baked crust and tap it down on the counter to release any air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 45-50 minutes, until the top looks and feels tacky and the center is still a little jiggly. The center might sink slightly when you remove it from the oven — that’s okay!"
    },
    {
      "@type": "HowToStep",
      "text": "RASPBERRY SAUCE: While your cheesecake is baking, make your raspberry sauce (if using). Place your raspberries in a medium saucepan and turn the heat to low. Begin smashing the raspberries with a wooden spoon until no large pieces remain, then add the maple syrup and arrowroot starch and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the heat up to medium-high and stir constantly until the mixture begins to bubble slightly. Lower the heat to medium (you want it steaming a bit, but not bubbling) and continue stirring for 5-10 minutes until the sauce begins to thicken and is a rich, red color. At this point, you can set it aside to cool or strain the seeds out using a fine mesh strainer for an extra smooth sauce (we prefer straining)! Let sauce cool completely before serving, and store in the refrigerator."
    },
    {
      "@type": "HowToStep",
      "text": "When your cheesecake is baked, remove it from the oven and let it rest for 20 minutes at room temperature, then transfer to the refrigerator (uncovered) to let cool completely. Once cooled, cover (waiting until cool will prevent condensation) and continue refrigerating for a total of 5-6 hours, preferably overnight."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, lift out of pan with parchment paper and cut into bars or triangles (we carefully cut off the very end pieces because they weren’t as creamy as the center pieces.) Drizzle slices with the raspberry sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers in the refrigerator, covered, up to 3-4 days, though best within the first 2 days."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://minimalistbaker.com/easy-baked-vegan-chocolate-cheesecake-gluten-free"
  ],
  "totalTime": "PT450M",
  "updatedAt": "2022-12-05T12:05:36.587Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=2GnDcGE8p3Q",
    "description": "Creamy, dreamy vegan chocolate cheesecake with optional raspberry sauce! Super chocolaty, decadent, and gluten-free. Just 9 ingredients required!\n\nFull Recipe: https://minimalistbaker.com/easy-baked-vegan-chocolate-cheesecake-gluten-free/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M13S",
    "embedUrl": "https://www.youtube.com/embed/2GnDcGE8p3Q?feature=oembed",
    "name": "Easy Baked Chocolate Cheesecake (Vegan + GF) | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/2GnDcGE8p3Q/hqdefault.jpg",
    "uploadDate": "2021-11-10T09:00:03+00:00"
  }
}
