{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "28",
    "ratingValue": "4.83"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-05T12:39:25.982Z",
  "datePublished": "2019-05-21T03:00:46+00:00",
  "description": "A Korean-inspired dish that's simple, healthy, and customizable depending on the season. It's also an affordable meal and the sauce can be made ahead of time to ensure speedy future preparations! Add some homemade (or store-bought) kimchi for the ultimate feast. Just 10 ingredients required.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2019/05/Bibimbap-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2019/05/Bibimbap-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2019/05/Bibimbap-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2019/05/Bibimbap-SQUARE-480x270.jpg"
  ],
  "keywords": "bibimbap",
  "name": "Easy Bibimbap with Gochujang Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "519 kcal",
    "carbohydrateContent": "73.2 g",
    "fatContent": "22 g",
    "fiberContent": "8.9 g",
    "proteinContent": "14.9 g",
    "saturatedFatContent": "3.8 g",
    "servingSize": "1 Servings",
    "sodiumContent": "528 mg",
    "sugarContent": "12.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 cup short-grain brown or white rice, rinsed (soaking for 12-24 hours to speed cooking is optional*)",
    "1 1/2 cups water (if rice was soaked, reduce water by about 1/4 cup (60 ml) as recipe is written)",
    "1 pinch sea salt",
    "2-3 Tbsp sesame oil, DIVIDED (toasted for more flavor, untoasted works, too*)",
    "3 cups packed mixed vegetables (such as finely shredded carrot, thinly sliced zucchini, or spinach)",
    "1 heaping cup bean sprouts (if you can’t find, sub more mixed vegetables)",
    "2 stalks green onion, sliced on an angle",
    "2 cloves garlic, minced",
    "2 Tbsp coconut aminos, DIVIDED (or sub tamari to taste, or sea salt)",
    "2 large eggs* (we recommend organic, pasture-raised, and as ethically sourced as possible, such as Vital Farms)",
    "2-4 Tbsp Korean Gochujang Sauce",
    "Kimchi (optional)",
    "Toasted or raw sesame seeds (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Optional: If soaking rice, rinse, drain, and add to a mixing bowl and cover with cool water. Soak for 12 hours or overnight. For a quicker soak, cover in hot water for 1 hour. Then rinse and drain."
    },
    {
      "@type": "HowToStep",
      "text": "To a medium saucepan, add cooking water (if you soaked your rice, start with 1 1/4 cups water as recipe is written), rinsed rice, and salt. Heat over high heat and bring to a boil, reduce heat to simmer, and cover. Cook for 15-20 minutes or until water is absorbed and rice is tender and fluffy. Soaked rice generally takes less time to cook. Unsoaked rice can take up to 30 minutes or more. Keep covered and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare Gochujang sauce. Skip if using store-bought."
    },
    {
      "@type": "HowToStep",
      "text": "While the rice finishes cooking, heat a large skillet over medium heat (stainless steel or cast iron are best). Once hot, add 1 tsp of sesame oil or enough to just coat the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Once the oil is hot, add vegetables one type at a time and cook in batches until lightly browned (1-2 minutes), seasoning each with a little minced garlic and a dash of coconut aminos, tamari, or sea salt. Cooking in batches allows you to arrange vegetables separately over the rice for visual effect. We cooked the zucchini first, then carrots, green onion, bean sprouts, and spinach. Add more oil to the pan as needed between vegetables."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange cooked vegetables in individual piles on a serving plate and cover gently to keep warm until serving."
    },
    {
      "@type": "HowToStep",
      "text": "To cook eggs (if vegan, see notes for options!), heat the same pan over medium heat. Once hot, add a little more oil (sesame or otherwise), and carefully crack eggs. For sunny-side up (our preference), cover briefly with a lid to steam for 1 minute, then remove lid and continue cooking until whites are cooked but yolks are still runny. Turn off heat and set aside (uncovered)."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, divide desired amount of rice between serving bowls (see notes for traditional dolsot recommendations and crispy rice hacks!) and top with portions of cooked veggies and egg."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with 1-2 Tbsp Gochujang, kimchi (optional), and a dash of sesame seeds (optional). Bibimbap means “mixed rice,” so once your egg and Gochujang sauce are added, use a spoon or your chopsticks to stir everything together and mix the flavors. Then enjoy!"
    },
    {
      "@type": "HowToStep",
      "text": "This dish is best fresh, but leftovers can be stored in the refrigerator up to 2 days and be reheated on the stovetop over medium heat as a stir fry. Not freezer-friendly."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://minimalistbaker.com/easy-bibimbap-with-gochujang-sauce"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-05T12:39:25.981Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=fTysq5mUuw4",
    "description": "A Korean-inspired dish that's simple, healthy, and customizable depending on the season. It's also an affordable meal and the sauce can be made ahead of time to ensure speedy future preparations! Add some homemade (or store-bought) kimchi for the ultimate feast. Just 10 ingredients required.\n\nFull Recipe: https://minimalistbaker.com/easy-bibimbap-with-gochujang-sauce/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M11S",
    "embedUrl": "https://www.youtube.com/embed/fTysq5mUuw4?feature=oembed",
    "name": "Easy Bibimbap with Gochujang Sauce | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/fTysq5mUuw4/hqdefault.jpg",
    "uploadDate": "2019-05-21T08:00:05+00:00"
  }
}
