{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T02:55:18.155Z",
  "datePublished": "2016-01-27T03:00:48+00:00",
  "description": "A healthy, green, delicious burger made with edamame, spinach, rice, and savory spices.",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2016/01/Edamame-Rice-Burger-8-2.jpg",
    "https://www.veganosity.com/wp-content/uploads/2016/01/Edamame-Rice-Burger-8-2-500x500.jpg",
    "https://www.veganosity.com/wp-content/uploads/2016/01/Edamame-Rice-Burger-8-2-500x375.jpg",
    "https://www.veganosity.com/wp-content/uploads/2016/01/Edamame-Rice-Burger-8-2-480x270.jpg"
  ],
  "name": "Edamame Rice Burger",
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "14 ounces of edamame",
    "1 cup of rice plus two cups of water",
    "2 tablespoons of ground flax seed plus 6 tablespoons of water – mix them together in a small bowl until the mixture becomes thick and sticky. Let sit for ten minutes.",
    "2 cups of chopped spinach",
    "1 clove of garlic",
    "1 teaspoon of ground cumin",
    "1 teaspoon of smoked paprika",
    "1 teaspoon of ground turmeric",
    "1/2 of a teaspoon of dried oregano",
    "1/4 of a teaspoon of cayenne pepper (optional, add only if you like spicy food)",
    "Ground sea salt and ground black pepper to taste."
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "For the rice:"
    },
    {
      "@type": "HowToStep",
      "text": "Bring the water to a boil and add the rice. Stir well and reduce the heat to simmer. Cover and simmer for 15 minutes. Remove from the heat and set aside. Keep covered."
    },
    {
      "@type": "HowToStep",
      "text": "Bring a medium pot of water to a boil and add the edamame. Boil for 5 minutes, drain the water, and rinse with cold water. When the edamame is cool enough to touch remove the beans from the pods and place them in a bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Add the edamame beans to a food processor and process until it looks like tiny pebbles. Add the spinach, rice, flax eggs, garlic, cumin, paprika, turmeric, oregano, cayenne pepper (only if you like hot food), sea salt and pepper to a food processor and process until the mixture starts to form a ball."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the blade from the processor and form the mixture into patties. Make them as large or as small as you’d like."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet on medium heat and drizzle with a teaspoon of avocado oil (optional if you have a non-stick pan). When the oil is got add the edamame burger and cook for four to five minutes or until firm and browned. Flip and cook the other side for four to five minutes. You can also bake in a 375° oven for fifteen to twenty minutes or until they begin to brown on top."
    },
    {
      "@type": "HowToStep",
      "text": "Serve on a bun with lettuce and tomato and your favorite condiments or serve the patty on a bed of spinach with a drizzle of sriracha, or serve as a patty and dip in soy sauce."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganosity.com/edamame-rice-burger"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-02T02:55:18.154Z"
}
