{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "10",
    "ratingValue": "4.7"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T23:10:12.753Z",
  "datePublished": "2016-05-16T09:54:32+00:00",
  "description": "This vegan eggplant cacciatore is made with melt-in-your mouth slabs of roasted eggplant simmered in a light white wine tomato sauce with savory mushrooms, garlic and bell peppers.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2016/05/eggplant-cacciatore-3.jpg"
  ],
  "keywords": "bell peppers, eggplant, rosemary",
  "name": "Eggplant Cacciatore",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "497 kcal",
    "carbohydrateContent": "68.4 g",
    "fatContent": "16.6 g",
    "fiberContent": "10.8 g",
    "proteinContent": "16 g",
    "saturatedFatContent": "2.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "677 mg",
    "sugarContent": "15.6 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 lb. Italian eggplant, (sliced into 1/4 inch thick slabs (see note)",
    "3 tbsp. olive oil, (divided)",
    "6 oz. dried penne pasta",
    "1 lb. cremini mushrooms, (cleaned, stemmed and sliced)",
    "1 small onion, (sliced)",
    "1 bell pepper, (any color, sliced into strips)",
    "3 garlic cloves, (minced)",
    "1/2 cup dry white wine",
    "1 14 oz. can diced tomatoes",
    "1/2 cup crushed tomatoes",
    "2 tbsp. capers",
    "1 tbsp. fresh rosemary, (or 1 tsp. dry)",
    "1/2 tsp. dried oregano",
    "1/2 tsp. red pepper flakes",
    "salt and pepper to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400°. Line a baking sheet with parchment paper. Rub eggplant slabs with about 1 tablespoon of olive oil and arrange on baking sheet. Bake until eggplant slabs are lightly browned and tender, but not falling apart, about 20 minutes. Remove from oven and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While eggplant bakes, bring a large pot of water to a boil. Add pasta and cook according to package directions. Drain into a colander, return to the pot and toss with a bit of olive oil. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While eggplant bakes and pasta cooks, coat the bottom of a large skillet with 1 tablespoon of olive oil and place over medium heat. Add mushrooms to skillet in an even layer. Cook about 5 minutes on each side, until slightly browned and tender. Remove from skillet and transfer to a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Add remaining 1 tablespoon of olive oil to skillet. Add bell onion and bell pepper. Sauté about 5 minutes, until tender. Add garlic and sauté 1 minute more. Add wine and bring to a simmer. Allow to cook until liquid is reduced by about half, 3 to 4 minutes. Add diced tomatoes, crushed tomatoes, capers, rosemary, oregano and red pepper flakes to skillet. Return mushrooms to skillet. Give everything a stir and bring to a simmer. Allow to cook about 5 minutes. Gently stir roasted eggplant into mixture and bring back to a simmer. Allow to cook until all veggies are tender and sauce thickens up just a bit, about 5 minutes more. Remove from heat and season with salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Divide pasta among 3 or 4 plates and top with eggplant mixture, serve."
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://connoisseurusveg.com/eggplant-cacciatore"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-01T23:10:12.752Z"
}
