{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "8",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "createdAt": "2022-11-30T03:12:02.726Z",
  "datePublished": "2010-06-07T20:03:00+00:00",
  "description": "This tasty eggplant parmesan is baked, not fried, but still full of flavor and texture!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2010/06/Eggplant20Parm20close.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2010/06/Eggplant20Parm20close-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2010/06/Eggplant20Parm20close-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2010/06/Eggplant20Parm20close-480x270.jpg"
  ],
  "keywords": "Eggplant Recipe",
  "name": "Eggplant Parmesan",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "301.62 kcal",
    "carbohydrateContent": "35.52 g",
    "fatContent": "10.41 g",
    "fiberContent": "4.69 g",
    "proteinContent": "14.07 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1376.1 mg"
  },
  "prepTime": "PT120M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "Italian",
  "recipeIngredient": [
    "2 lbs medium eggplant ($2.08)",
    "1 Tbsp salt ($0.05)",
    "1/3 cup all-purpose flour ($0.02)",
    "3 large eggs ($0.36)",
    "2 cups breadcrumbs ($0.72)",
    "1/2 tsp garlic powder ($0.05)",
    "1 tsp parsley flakes ($0.05)",
    "1/2 cup grated parmesan ($0.47)",
    "3 cups homemade marinara (1/2 batch) ($1.90)",
    "2 cups shredded mozzarella ($1.98)",
    "as needed non-stick spray ($0.15)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash the eggplant and slice into 1/2 inch thick rounds. Place it in a colander, sprinkle with 1 Tbsp of salt, toss to coat and let sit for about 45 minutes. The salt will draw out moisture from the eggplant allowing for more crisp slices once breaded and baked. After 45 minutes, give the colander a good shake to let extra water drip out the bottom (it will look brown)."
    },
    {
      "@type": "HowToStep",
      "text": "Press the eggplant slices between a few sheets of paper towel (or a clean, lint-free cloth) to absorb excess water. Place the slices in a ziplock bag with 1/3 cup of all-purpose flour. Toss the bag so that the slices become coated with the flour."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the second two steps in the breading process as follows. Lightly beat three eggs in a bowl until they become a fairly even consistency. In another bowl combine the bread crumbs, parmesan cheese, garlic powder and parsley flakes. If you have Italian seasoned bread crumbs, you can skip the parsley flakes and/or the garlic powder. Dip each slice of eggplant into the egg (turning to coat both sides) then into the bread crumb mixture (coating each side again). Place the breaded slices on a plate or baking sheet until all slices have been breaded."
    },
    {
      "@type": "HowToStep",
      "text": "Position your oven racks on the top third and bottom third of the oven so that they have at least 6 inches between them for air to flow. Preheat your oven to 425 degrees. Place two baking sheets in the oven (one on each rack) as it preheats so they will be preheated as well (this helps with crisping)."
    },
    {
      "@type": "HowToStep",
      "text": "Once all of your eggplant slices are breaded and the oven/baking sheets are preheated, carefully remove the baking sheets and coat them with non-stick spray. Arrange the eggplant slices in a single layer on the sheets and spray the tops of them with another coat of non-stick spray. Place the sheets back in the oven and bake for about 30 minutes. Switch the position of the baking sheets half way through (the top rack is often hotter and browns faster than the bottom)."
    },
    {
      "@type": "HowToStep",
      "text": "After the slices have baked, reduce the oven heat to 350 degrees. Spray a large casserole dish with non-stick spray. Place 1 cup of marinara sauce in the bottom of the dish. Arrange eggplant slices in a single layer over the marinara. Top with a second cup of marinara and one cup of mozzarella. Arrange the rest of the eggplant slices over top and then cover with a third cup of marinara and a second cup of mozarella. Sauce, eggplant, sauce, cheese, eggplant, sauce, cheese. Got it?"
    },
    {
      "@type": "HowToStep",
      "text": "Bake the casserole for about 30 minutes or until the cheese on top is melted and bubbly. Garnish with fresh chopped parsley if desired."
    },
    {
      "@type": "HowToStep",
      "text": "Relax a minute after all of that baking, enjoy a heaping portion of Eggplant Parmesan and try not to go back for seconds!"
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://budgetbytes.com/eggplant-parmesan"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-11-30T03:12:02.724Z"
}
