{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-09-26",
  "description": "A speciality of Galicia in northwest Spain, this satisfying pie is baked daily in bakeries and sold to hungry workers at midday.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/medcoo213empgal_028:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Empanada",
  "name": "Empanada Gallega Recipe | Woolworths",
  "prepTime": "PT10M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "Spanish",
  "recipeId": "RGR11414",
  "recipeIngredient": [
    "280g self-raising flour, save 5g for dusting",
    "0.5 tsp salt",
    "2 tbs white wine",
    "0.6 cup milk",
    "4 tbs olive oil (plus extra for greasing)",
    "1 egg yolk, beaten with a little water (to glaze)",
    "5-6 tbs olive oil",
    "1 large onion, finely sliced",
    "1-2 garlic cloves, chopped",
    "350g pork shoulder, diced",
    "2 tbs diced Serrano ham",
    "2 large potatoes, peeled and diced",
    "2 red peppers, deseeded and diced",
    "1 tsp dried thyme",
    "1 glass white wine or cider",
    "1 pinch salt",
    "1 pinch freshly ground black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the filling, heat the oil in a large frying pan and gently cook the onion and garlic for 5-10 minutes, until soft. Add the meats and cook for a further 10 minutes, then add the potatoes, peppers, and thyme. Season and simmer for 15-20 minutes until the juices have evaporated and the mixture begins to fry. Add the wine and bring to the boil on a high heat. Then reduce the heat to low and cook for a further 10 minutes, until the potatoes have softened but are still a little firm, and the juices have nearly all evaporated. Remove from the heat and leave to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the pastry, sift the flour with the salt in a bowl and make a well in the middle. In a small pan, heat the wine, milk, and oil on a low heat until warm to the touch. Pour the liquid into the well in the flour. Working fast, draw in the dry ingredients and knead until you have a smooth, elastic dough. Add a little more flour, if necessary. Lightly dust a board and rolling pin with flour, and roll out the dough into a rectangle, about 25 x20cm. Cut the rectangle across the short side into 2 pieces, one measuring 20 x 10cm and the other 20 x 15cm."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 200°C. Transfer the larger piece to a greased baking tray and spread the filling all over, leaving a margin of about 2.5 cm. Place the smaller piece on top of the filling, then bring up the sides of the larger pastry to meet the lid. Using your forefinger and thumb, pinch the two edges to seal. Take care not to leave any gaps - spoon out some of the filling, if necessary. Make a small hole in the top to let out the steam, and brush with egg wash."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bake for 10-15 minutes, until the pastry is set but still pale. Turndown the heat to 180°C and bake for a further 30-40 minutes, until the filling is heated right through and the pastry is golden brown. Serve hot or cool."
    }
  ],
  "recipeNameId": "empanada-gallega",
  "recipeYield": "2",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/empanada-gallega"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-11-24T14:00:37.692Z",
  "url": "https://www.woolworths.com.au/shop/recipes/empanada-gallega"
}
