{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 4
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-02T22:16:28.601Z",
  "creator": {
    "@type": "Person",
    "name": "Nealey Dozier"
  },
  "dateCreated": "2013-11-18T11:00:00-05:00",
  "dateModified": "2019-05-02T03:58:01-04:00",
  "datePublished": "2013-11-18T11:00:00-05:00",
  "headline": "Essential Recipe: Double-Crust Apple Pie",
  "HowtoTip": {
    "text": "For a step-by-step guide to making pie, see: How to Make a Pie from Start to Finish To freeze, prepare the pie through all of the steps including shaping and venting the top crust. Cover the entire pie in plastic wrap, then slide it into a large plastic bag and seal with a twist tie. Only freeze pies in a metal or disposable aluminum pie pan; glass and ceramic pie plates will shatter when they hit the oven. If you freeze your pie ahead, add 20 to 45 minutes to cooking time. Bake the pie within four months for best quality."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F9cf5f22a501b3aa81a06f371f8e711709ef4317b"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F9cf5f22a501b3aa81a06f371f8e711709ef4317b"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F9cf5f22a501b3aa81a06f371f8e711709ef4317b"
    }
  ],
  "keywords": [
    "autumn",
    "baked goods",
    "baking",
    "butter",
    "christmas",
    "dessert",
    "fruit",
    "Party Food",
    "recipe",
    "sweets",
    "thanksgiving",
    "course:dessert",
    "dishtype:sweets",
    "dishtype:baked good",
    "method:baked",
    "diet:low-calorie",
    "diet:under 400 calories",
    "diet:low-fat",
    "diet:under 500 calories",
    "updated:2019-05-02"
  ],
  "name": "Essential Recipe: Double-Crust Apple Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "335 cal",
    "carbohydrateContent": "48.1 g",
    "cholesterolContent": "0 mg",
    "fatContent": "14.9 g",
    "fiberContent": "4.5 g",
    "proteinContent": "3.0 g",
    "saturatedFatContent": "9.1 g",
    "servingSize": "Serves 16",
    "sodiumContent": "81.1 mg",
    "sugarContent": "26.6 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dessert",
  "recipeCuisine": [],
  "recipeIngredient": [
    "8 ounces (2 sticks) unsalted butter",
    "12 1/2 ounces all-purpose flour (about 2 1/2 cups)",
    "1/2 teaspoon kosher salt",
    "1/2 to 2/3 cup ice water",
    "2 ounces (4 tablespoons) unsalted butter",
    "1/2 cup granulated sugar",
    "1/2 cup packed brown sugar",
    "1 teaspoon vanilla bean paste or pure vanilla extract",
    "1/4 teaspoon ground cinnamon, or to taste",
    "1/8 teaspoon freshly ground nutmeg, or to taste",
    "5 pounds various sweet and tart apples, peeled, cored, and sliced into 1/4 to 1/2-inch slices",
    "2 tablespoons apple cider vinegar",
    "1 tablespoon tapioca flour",
    "2 teaspoons cornstarch",
    "1 egg white, lightly whisked",
    "Coarse sugar, for sprinkling",
    "Ice cream for serving (vanilla bean, caramel, and cinnamon would all be good)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cut the butter into 1/2-inch cubes and place in the freezer for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Combine flour and salt in the bowl of a food processor and pulse to combine. Add the butter and continue pulsing until the majority resembles coarse meal and the remainder of butter is the size of small peas, 5 to 10 quick pulses."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to a large mixing bowl. Run your hands through the flour, using your fingers to pinch any remaining larger pieces of butter into smaller crumbles. Add 1/2 cup of cold water to the mixture and toss with your hand until shaggy clumps begin to form. Sprinkle more water over the flour, 1 tablespoon at a time, until about three quarters of the dough holds together when squeezed with your fingertips; the remainder should still quite dry and crumbly. Turn the entire mixture onto a work surface. Gather the loose bits into the dough and use the heel of your hand to press, i.e. smear, the dough out in a few forward, sharp motions."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the dough in half with a bench scraper and transfer each section to a sheet of plastic wrap. Gather the edges of the plastic wrap tightly to form a round mass. Use the heel of your hand to flatten the ball into a disk — this allows you to shape the dough and collect any remaining crumbs. Chill the dough for at least one hour, or overnight."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the disks from the refrigerator, unwrap, and place on a lightly floured work surface. (If refrigerated longer than one hour, let sit for 15 to 20 minutes until pliable.) Begin rolling out the first disk, rotating the dough a quarter of a turn after every few rolls and lightly dusting the underside with additional flour to prevent sticking. Continue rolling until the diameter of the dough is 3 to 4 inches larger than a 9-inch pie pan and about 1/8\" to 1/4\" thick."
    },
    {
      "@type": "HowToStep",
      "text": "Use a bench scraper to gently loosen the dough from the work surface. Fold the dough in half away from you, lift, and carefully arrange over the pie plate, aligning the seam with the center of the pan. Open it up and gently ease the dough into the bottom and sides of the pan. Roll out the other portion of dough into a circle about 1-inch larger than the pan. Transfer this round to a parchment-lined baking sheet. Refrigerate both the bottom crust and the top crust for at least 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Melt the butter in a large Dutch oven (or divide into two skillets if necessary) over medium heat until foaming. Add the sugar, brown sugar, vanilla, cinnamon, and nutmeg to the butter and stir until combined. Gently fold in the apples."
    },
    {
      "@type": "HowToStep",
      "text": "Cover and cook the apples, stirring occasionally, until the liquid is boiling and the apples have started to soften, about 10 minutes. Meanwhile, whisk together the cider vinegar, tapioca flour, and cornstarch in a small bowl. Make a well in the apples and pour the mixture into the bottom of the pot. Gently toss to combine. Continue cooking for another 5 to 10 minutes; you want the apples to become tender but still have a little bite. Allow the warm filling to cool at least 30 minutes, or overnight, before continuing."
    },
    {
      "@type": "HowToStep",
      "text": "Place a parchment-lined baking sheet on the center rack in the oven and preheat to 425° F."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pie pan from the refrigerator and brush the insides of the pie shell with a thin layer of egg whites (to help prevent it from becoming soggy and to improve crispness). Using a slotted spoon or spider, transfer the cooled apples to the pie, creating a tall mound in the center. Pour the excess juices from the Dutch oven into a liquid measuring cup. Drizzle 1/2 cup of the liquid over the apples and discard the rest."
    },
    {
      "@type": "HowToStep",
      "text": "Drape the second round of dough over the pie. Use kitchen shears to trim the excess to about 3/4-inch. Fold the edge of the top crust over the bottom crust and gently pinch to seal. Use the index finger of one hand and the thumb and index finger of the other to create a fluted edge. Cut 5 slits into a star pattern in the center. Brush the top crust with remaining egg whites and sprinkle with coarse sugar.→ If at any point during these steps the dough begins to feel too warm, put the pan in the freezer for a few minutes to firm back up. The assembled pie can also be completely frozen for four months (see Recipe Notes)."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pie on the preheated baking sheet and cook for 25 minutes. Reduce heat to 325°F and cook until golden brown and bubbling, about 45 minutes. Cool the pie on a wire rack for a minimum of three hours, or overnight, before slicing. As it rests, the fruit will reabsorb some of the juices; if you cut too soon, the pie will be soupy. Serve with ice cream."
    },
    {
      "@type": "HowToStep",
      "text": "The pie will keep at room temperature, covered, for up to 2 days and refrigerated for up to five days. Reheat in a 350°F oven until warmed through."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/thanksgiving-recipe-classic-double-crust-apple-pie-recipes-from-the-kitchn-197242"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F9cf5f22a501b3aa81a06f371f8e711709ef4317b",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-02T22:16:28.599Z",
  "url": "https://www.thekitchn.com/thanksgiving-recipe-classic-double-crust-apple-pie-recipes-from-the-kitchn-197242"
}
