{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T00:20:05.035Z",
  "datePublished": "2022-11-02T03:00:00+00:00",
  "description": "Flaky, buttery, and reliable GLUTEN-FREE pie crust that’s also vegan! Just 4 ingredients and 15 minutes of chill time required!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2022/09/Flaky-Gluten-Free-Pie-Crust-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2022/09/Flaky-Gluten-Free-Pie-Crust-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2022/09/Flaky-Gluten-Free-Pie-Crust-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2022/09/Flaky-Gluten-Free-Pie-Crust-SQUARE-480x270.jpg"
  ],
  "keywords": "best gluten free pie crust, easy gluten free pie crust, flaky pie crust, gluten free dairy free pie crust, gluten free pie crust, gluten free pie crust recipe, homemade pie crust, how to make gluten free pie crust, vegan gluten free pie crust, vegan pie crust",
  "name": "Flaky Gluten-Free Pie Crust (Vegan)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "136 kcal",
    "carbohydrateContent": "17.1 g",
    "fatContent": "7 g",
    "fiberContent": "0.6 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "5.4 g",
    "servingSize": "1 of 12 slices",
    "sodiumContent": "93 mg",
    "sugarContent": "1.1 g",
    "unsaturatedFatContent": "0.2 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cup Minimalist Baker Gluten-Free Flour Blend*",
    "1/4 tsp sea salt",
    "1/2 cup cold vegan butter, cut into 1/2 inch cubes",
    "1 Tbsp maple syrup",
    "3-4 Tbsp ice cold water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C), and set out a standard size (9-inch) pie pan."
    },
    {
      "@type": "HowToStep",
      "text": "To a small mixing bowl, add a handful of ice cubes and cover with water. Set nearby. In a medium mixing bowl, combine the gluten-free flour and salt and whisk to combine. Working quickly, add in the cold vegan butter and use clean hands to begin pressing the butter into the flour. Avoid crumbling up the butter and instead try to press each piece into a flat “flake” — this will help create the best flaky crust! Continue until there are no large chunks of butter remaining."
    },
    {
      "@type": "HowToStep",
      "text": "Add the maple syrup and 1 Tbsp (15 ml) of the ice cold water. Use a fork to gently toss the mixture together, doing your best to evenly distribute the liquid without breaking the butter down any further. Continue adding water until the mixture looks evenly moist and soft and sticks together easily when pressed between your fingers. It might look a little crumbly, but resist the temptation to add more water!"
    },
    {
      "@type": "HowToStep",
      "text": "On a clean work surface, lay out a piece of parchment or wax paper and transfer the dough. Gather it together and press it into a “disc” about 1 inch tall by 6 inches wide. Wrap the paper around it and transfer to the refrigerator for 15 minutes. If you want to make your crust ahead of time, stop at this point and you can refrigerate for up to 2 days or freeze for up to 1 month, just make sure to thaw the crust (until slightly soft when poked) before rolling out."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully remove the crust from the refrigerator and work quickly to prevent the butter from melting. Unwrap the dough, leaving the paper underneath as a work surface. Sprinkle the top of the crust with a very light dusting of flour, then place another piece of parchment or wax paper on top of the crust and begin rolling it out until it’s ~11 inches wide and 1/4 inch thick. It can be helpful to start by “whacking” the dough to spread it out, then switching to rolling. If the crust is cracking a lot, give it a couple minutes to warm up slightly."
    },
    {
      "@type": "HowToStep",
      "text": "To transfer your crust, gently roll it up onto your rolling pin and unroll in the pie pan, or quickly (and confidently!) flip it into the pan. We chose to flip it. Press the crust into the pie pan so the bottom edges are smooth and patch any cracks with excess dough. Crimp the edges together with your fingers or press with a fork."
    },
    {
      "@type": "HowToStep",
      "text": "If making a pie with a filling that requires baking (i.e. pumpkin pie, pecan pie, apple pie, berry pie), par-bake the crust for 20 minutes, until pale and dry to the touch. Then add your filling of choice and bake for another 30-45 minutes, or according to the recipe’s instructions. If making a pie with a raw/chilled filling (i.e. chocolate cream pie) you will want to par-bake the crust on its own for at least 30-35 minutes total, until the edges are golden and beginning to crisp, before adding your filling and chilling."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://minimalistbaker.com/flaky-gluten-free-pie-crust-vegan"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-02T00:20:05.034Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=9kRFKT1Quuo",
    "description": "Flaky, buttery, and reliable GLUTEN-FREE pie crust that’s also vegan! Just 4 ingredients and 15 minutes of chill time required!\n\nFull Recipe: https://minimalistbaker.com/flaky-gluten-free-pie-crust-vegan/\n\nSHOP the GF Flour Blend: https://shop.minimalistbaker.com/products/minimalist-baker-gluten-free-flour-blend\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT43S",
    "embedUrl": "https://www.youtube.com/embed/9kRFKT1Quuo?feature=oembed",
    "name": "Flaky Gluten-Free Pie Crust (Vegan) | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/9kRFKT1Quuo/hqdefault.jpg",
    "uploadDate": "2022-11-02T07:00:05+00:00"
  }
}
