{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T17:39:49.329Z",
  "datePublished": "2011-11-09T22:01:00+00:00",
  "description": "Fluffy White Dinner Rolls (burger buns). An easy recipe for fluffy, soft and light dinner rolls. Great as a side, with burgers or your favorite sandwich filling. Vegan Recipe.&nbsp;",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2011/11/sept-253D10-buns-2B057.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/11/sept-253D10-buns-2B057-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/11/sept-253D10-buns-2B057-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/11/sept-253D10-buns-2B057-480x270.jpg"
  ],
  "keywords": "burger buns, vegan bread recipe",
  "name": "Fluffy White Dinner Rolls (Burger Buns) Vegan.",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "256 kcal",
    "carbohydrateContent": "40 g",
    "fatContent": "6 g",
    "fiberContent": "1 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "246 mg",
    "sugarContent": "5 g"
  },
  "prepTime": "PT50M",
  "recipeCategory": "Bread",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "3 cups + cups bread flour",
    "2 teaspoon vital wheat gluten (optional, for better gluten formation and some extra protein)",
    "3 Tablespoons raw sugar or equivalent jaggery/agave/maple syrup or other sweetners.",
    "2 teaspoons active yeast",
    "1 cup warm water (roughly)",
    "2 Tablespoons Virgin olive oil",
    "2 Tablespoons softened vegan butter like earth balance (use soy free spread for a soy free dinner roll)",
    "4 Tablespoons Cashew Yogurt or Cashew cream or Soy yogurt or non dairy yogurt (the secret ingredient!)",
    "3/4 teaspoon salt or to taste (more if making a herbed roll)",
    "1/2 teaspoon baking powder",
    "add dried herbs like chives (basil, parsley, or some poppy seeds, or minced garlic and for variations.)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add the yeast and sugar to 1/4 cup (60ml) warm water and mix well. Let stand for 10 minutes or until frothy."
    },
    {
      "@type": "HowToStep",
      "text": "In a bowl add 2.5 cups (320g) flour, salt, wheat gluten, baking powder and mix."
    },
    {
      "@type": "HowToStep",
      "text": "Add in the yeast mixture, softened butter, olive oil, yogurt and give it a mix. Add 1/4 cup (60ml) water, at a time to get a soft clump."
    },
    {
      "@type": "HowToStep",
      "text": "Knead the dough for 6-8 minutes by hand or in mixer, scraping sides every 2 minutes if using a stand mixer. Add more bread flour or water in little quantities if needed and form and soft non sticky ball."
    },
    {
      "@type": "HowToStep",
      "text": "Spritz the top of dough with some oil spray. Place dough in a greased covered container in a warm place for 2 hours. (rise time depends on the ambient temperature, keep for 1.5 hours if warm 70+ degree F climate)"
    },
    {
      "@type": "HowToStep",
      "text": "Punch the dough lightly. Use a little flour to work the stickyness. Knead and shape by rolling it out into a rectangle and rolling the rectangle from one side and tucking the other edge under like a jelly roll."
    },
    {
      "@type": "HowToStep",
      "text": "Slice the jelly roll into equal parts, roll into a ball( or pull and tuck under) and place on baking sheet 2 inches apart. Or shape any other way, like a wedge roll or knots. Keep each ball size half of what size you want your each roll. You can also roll them out into flat breads and cook on a thick bottom super hot pan/girdle."
    },
    {
      "@type": "HowToStep",
      "text": "Spritz the top with water and then spritz oil spray, and cover with a towel."
    },
    {
      "@type": "HowToStep",
      "text": "Place it in a warm place or warm oven for 45-50 minutes or until Doubled and when pressed, the dough does not bounce back immediately."
    },
    {
      "@type": "HowToStep",
      "text": "Remove towel, spritz top with some water. Top with sesame or poppy seeds(optional). and bake at preheated 370 degrees F for 18-25 minutes or until the bread sounds hollow and is golden. Time depends on the size and shape of the rolls."
    },
    {
      "@type": "HowToStep",
      "text": "Remove buns from sheet and let cool on rack for atleast 15 minutes. Brush some melted vegan butter on top for extra sheen while cooling."
    },
    {
      "@type": "HowToStep",
      "text": "Pull the buns/rolls apart and dunk super soft dinner rolls in a warm fall soup or herbed olive oil! Try variations with herbs, make them sweeter or savory!"
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://veganricha.com/2011/11/fluffy-white-dinner-rolls-or-burger.html"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-03T17:39:49.328Z"
}
