{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "85",
    "ratingValue": "4.86"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-02T07:34:38.114Z",
  "datePublished": "2016-12-02T05:00:24+00:00",
  "description": "Fluffy, perfectly sweet sugar cookies made in 1 bowl! Roll out and cut into shapes or roll into easy circles. Entirely vegan and gluten-free, and perfect for the holidays and beyond!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/11/Vegan-Gluten-Free-Sugar-Cookies-SQUARE.jpg"
  ],
  "keywords": "sugar cookies",
  "name": "Fluffy 1-Bowl Sugar Cookies (Vegan + GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "122 kcal",
    "carbohydrateContent": "17 g",
    "fatContent": "5.6 g",
    "fiberContent": "0.8 g",
    "proteinContent": "1.3 g",
    "saturatedFatContent": "2.6 g",
    "servingSize": "1 cookies",
    "sodiumContent": "48 mg",
    "sugarContent": "5.8 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup softened vegan butter* (1/2 cup = 1 stick // or dairy butter if not vegan)",
    "2/3 cup organic cane sugar*",
    "1 tsp pure vanilla extract",
    "3 Tbsp aquafaba",
    "3/4 tsp baking powder",
    "1/4 tsp sea salt",
    "1 2/3 cups gluten-free flour blend*",
    "2/3 cup almond flour",
    "1/3 cup cornstarch or arrowroot",
    "1 Tbsp unsweetened almond milk",
    "1/2 cup vegan butter (softened // 1/2 cup = 1 stick) )",
    "1 1/2 - 2 cups sifted organic powdered sugar (to ensure vegan friendly)",
    "1/4 tsp vanilla extract",
    "1-2 Tbsp unsweetened almond milk",
    "Natural food dyes"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and line two baking sheets with parchment paper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add softened vegan butter (make sure it's softened - not melted or cold) to a large mixing bowl and beat or whisk until creamy and smooth - about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add sugar and mix on medium speed until fluffy and light - about 1 minute. Then add chickpea brine (or other egg substitute*) and vanilla and mix again, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add baking powder and sea salt and blend or whisk to combine. Then add gluten-free flour blend, almond flour, and cornstarch and mix on low until the ingredients are combined. I had to switch to a wooden spoon toward the end. Add almond milk and stir once more."
    },
    {
      "@type": "HowToStep",
      "text": "The dough should be thick, moldable and a little difficult to mix at this point (see photo). If too soft, continue adding a mixture of gluten-free flour blend, almond flour, and cornstarch until a thick, moldable dough is formed. If too thick, thin with a bit more almond milk."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer dough to the refrigerator and chill for 15 minutes*. Once chilled, use a cookie scooper (I like this one) or a Tablespoon to measure out 1 1/2 Tbsp amounts of dough and gently roll into balls - the dough will still be soft so be gentle. Arrange on the parchment-lined baking sheets with 1 inch room between each and press down gently with the palm of your hand to smash slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Alternatively, roll out the dough on a well-floured surface until about 1/4-inch thick and dip cookie cutters in gluten-free flour before pressing into the dough. Use a floured spatula to gently scoop onto baking sheets. This recipe works well with both cut outs and traditional circles!"
    },
    {
      "@type": "HowToStep",
      "text": "Bake cookies for 10-12 minutes or until the cookies appear fluffy and the edges are slightly beginning to dry out. Let cool on baking sheet for 10 minutes before transferring to a plate to cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "To make frosting (optional), add softened vegan butter to a mixing bowl and whisk or beat until soft and fluffy - about 1 minute. Then sift in powdered sugar in small amounts and mix. Around the 1-cup mark, add the vanilla extract and whisk. Continue adding powdered sugar until you have spreadable frosting (I used about 2 cups powdered sugar // amount as original recipe is written // adjust if altering batch size). If you prefer a thinner frosting, add a little almond milk to thin. If it becomes too thin, add more powdered sugar. If it becomes too thick, add more almond milk. Add natural food coloring at this time (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Frost cookies or leave plain! I decorated with some naturally-dyed sugar sprinkles like these. Organic cane sugar as a base should ensure vegan friendliness."
    },
    {
      "@type": "HowToStep",
      "text": "Storage: Once cooled, store leftover cookies covered at room temperature for 3-4 days or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://minimalistbaker.com/fluffy-1-bowl-sugar-cookies-vegan-gf"
  ],
  "totalTime": "PT37M",
  "updatedAt": "2022-12-02T07:34:38.113Z"
}
