{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-11-22T12:23:57.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Football Cake recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1909-football-cake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Celebration cake,Seafood free,Sesame free,Baking",
  "name": "Football Cake Recipe | Woolworths",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "462 calories",
    "carbohydrateContent": "71.7 g",
    "sodiumContent": "390 millig",
    "sugarContent": "50.8 g"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "9709",
  "recipeIngredient": [
    "0.5 tsp green food colouring",
    "220g unsalted butter (softened)",
    "1.5 cup milk (plus extra 2 tbs)",
    "1 cup icing sugar (sifted)",
    "80g unsalted butter (chopped)",
    "0.25 cup cocoa powder (sifted)",
    "400g marshmallows",
    "150g Smarties",
    "250g Coco Pops",
    "4 free range eggs",
    "3 tsp cocoa powder",
    "2 vanilla cake with frosting"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the football, cover a 12cm bowl with plastic wrap and spray lightly with oil. Position in the centre of a chopping board. Place Coco Pops and cocoa into a large bowl. Stir butter and marshmallows in a large saucepan over low heat for 5 minutes or until melted and smooth. Pour over Coco Pops mixture and stir with a wooden spoon until well combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Using damp hands, mould the mixture over the bowl, forming the shape of half a football – about 22cm long. Refrigerate for 1 hour or until firm."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make the cake, preheat oven to 160°C. Grease and line the base of a 22x32cm (4.5cm deep) baking pan. Remove frosting sachets from cake packets and set aside. Prepare both cake mixes together, following packet instructions, and using 120g butter, eggs and milk. Pour cake mixture into pan. Bake for 40-45 minutes or until a skewer inserted into centre comes out clean. Stand in pan for 10 minutes before turning out onto a wire rack to cool completely. Trim top of cake to level, if necessary. Place onto a large cake board. Refrigerate."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, empty reserved frosting sachets into a bowl. Add remaining butter, extra milk and icing sugar. Beat on low speed for 30 seconds. Increase speed to medium and beat for 3 minutes or until light and fluffy."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Transfer 1/2 cup frosting to a small bowl and set aside. Add food colour to remaining frosting and stir well to combine. Fit a piping bag with a wide, flat-ridged nozzle and fill with green frosting. Pipe frosting over cake to resemble grass. Return to the fridge."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove football from fridge and carefully remove bowl and plastic. Pile Smarties onto centre of green cake base. Position football over Smarties, pressing down firmly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Mix 2 tbs reserved frosting with cocoa. Transfer to a snap-lock bag and snip off the corner. Pipe a line along the centre of the ball for the seam. Transfer remaining white frosting to a snap-lock bag and pipe laces on top of football. Refrigerate for 10 minutes to set. Serve."
    }
  ],
  "recipeNameId": "football-cake",
  "recipeYield": "24",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/football-cake"
  ],
  "totalTime": "PT110M",
  "updatedAt": "2022-11-24T12:24:54.111Z",
  "url": "https://www.woolworths.com.au/shop/recipes/football-cake"
}
