{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "16",
    "ratingValue": "4.82"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-28T12:45:27.000Z",
  "datePublished": "2020-03-15T10:11:00+00:00",
  "description": "Make ahead breakfast burritos are an easy reheatable and portable breakfast meal prep idea. Including options for vegetarian or other add-ins! BudgetBytes.com",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2011/01/Freezer-Breakfast-Burritos-inside.jpg",
    "width": 800
  },
  "keywords": "Breakfast Burrito, Breakfast Meal Prep, Easy Breakfast, Freezer Food, Make Ahead Breakfast",
  "name": "Freezer Friendly Breakfast Burritos",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "670.26 kcal",
    "carbohydrateContent": "55.55 g",
    "fatContent": "37.98 g",
    "fiberContent": "4.23 g",
    "proteinContent": "39.69 g",
    "servingSize": "1 burrito",
    "sodiumContent": "1434.13 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "8 oz. cheddar ($1.69)",
    "1 yellow onion ($0.32)",
    "1 bell pepper ($1.00)",
    "2 Tbsp butter, divided ($0.26)",
    "2 pinches salt and pepper ($0.05)",
    "1 lb. cooked ham ($3.75)",
    "12 large eggs ($2.79)",
    "8 large flour tortillas (burrito size) ($1.39)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin by preparing all of the filling ingredients for the breakfast burritos. Shred the cheddar, if not purchased pre-shredded."
    },
    {
      "@type": "HowToStep",
      "text": "Dice the onion and bell pepper. Add the onion and bell pepper to a large skillet with 1/2 Tbsp butter and sauté over medium heat until the onions are soft and translucent (about 5 minutes). Season the bell pepper and onion with a pinch of salt and pepper. Transfer the bell pepper and onion to a bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Dice the ham, then add it to the skillet with another 1/2 Tbp butter. Sauté the ham over medium heat until it is browned (about 5 minutes). Transfer the ham to a separate bowl and clean the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Crack 12 eggs into a bowl and lightly whisk. Add the last tablespoon butter to the skillet and heat over medium. Once the skillet is hot, spread the butter to coat the surface, then pour in the whisked eggs."
    },
    {
      "@type": "HowToStep",
      "text": "Push the eggs in toward the center of the skillet as they set on the bottom, until most of the eggs have set, but the eggs still look moist. Do not over cook the eggs or they'll become dry. Season the eggs with a pinch of salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble the burritos, add a scoop of scrambled eggs to the middle of each tortilla, then top with a scoop of cooked bell pepper and onion, a handful of cheese, and some of the cooked ham."
    },
    {
      "@type": "HowToStep",
      "text": "To roll the burritos, first fold the tortilla up from the bottom, then fold in the sides, and then finish rolling the burrito up until it has closed. Wrap each burrito in parchment paper using the same folding and rolling method (bottom up, sides in, finish rolling up). Label each burrito on the parchment paper or on masking tape"
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the wrapped burritos to freezer bags, label and date the bags, then place in the freezer."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/freezer-breakfast-burritos"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-28T08:20:10.268Z"
}
