{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-01T07:04:50.773Z",
  "datePublished": "2016-04-12T05:00:33+00:00",
  "description": "30-minute tofu salad rolls with fresh veggies, basil, and tofu, served with a savory-sweet cashew sauce. A hearty plant-based entrée or side!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/03/Thai-Spring-Rolls-SQUARE.jpg"
  ],
  "keywords": "salad rolls",
  "name": "Fresh Tofu Salad Rolls with Cashew Dipping Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "186 kcal",
    "carbohydrateContent": "28 g",
    "fatContent": "5.2 g",
    "fiberContent": "2.5 g",
    "proteinContent": "7.4 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 rolls",
    "sodiumContent": "345 mg",
    "sugarContent": "3.8 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 tsp finely minced garlic",
    "1/4 cup cashew butter (salted - if unsalted, add a bit more tamari)",
    "1 Tbsp tamari (or soy sauce if not GF)",
    "1 Tbsp maple syrup (plus more to taste)",
    "1 Tbsp lime juice (plus more to taste)",
    "1 pinch red pepper flakes",
    "Hot water (to thin)",
    "2 cups kale (torn into small pieces // I also used some green lettuce, which is optional)",
    "1 tsp sesame oil (or sub avocado or olive oil)",
    "1 tsp tamari",
    "6 ounces extra-firm tofu",
    "4 medium radishes",
    "1 cup thinly sliced red bell pepper",
    "1 cup thinly sliced carrot",
    "1 cup fresh basil (rinsed and dried // large stems removed)",
    "6-8 spring roll rice papers (I like this brand)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wrap tofu in a clean, absorbent towel and set something slightly heavy on top - such as a saucepan - to begin \"pressing\" and drawing out excess moisture."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare sauce by adding minced garlic, cashew butter, tamari, maple syrup, lime juice, and red pepper flake to a small mixing bowl and whisking to combine. Add hot water until you've reached a semi-thick sauce consistency."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more lime juice for acidity, red pepper flake for heat, tamari for saltiness, or maple syrup for sweetness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add clean, dry kale to a medium mixing bowl and top with sesame oil and tamari. Massage with hands to soften and infuse some flavor. This step is optional, but results in a more flavorful roll in my opinion."
    },
    {
      "@type": "HowToStep",
      "text": "Prep remaining vegetables and cut tofu into rectangular strips (see photo). Arrange on a platter so they're easy to access. Also ready a cutting board by slightly dampening its surface - this is where you'll prepare your salad rolls."
    },
    {
      "@type": "HowToStep",
      "text": "Pour very hot water into a wide shallow dish (I use a skillet) and let cool slightly. Then dip one spring roll wrapper in the water and let it soften for 10-12 seconds, until just pliable. If you let it set too long, the paper will get too sticky to work with."
    },
    {
      "@type": "HowToStep",
      "text": "Use your hands to gently spread the wrapper onto your dampened work surface, making sure there aren't many creases. Then top with fillings in this order: radish, bell pepper, carrot, tofu, basil, kale. Fold the bottom of the wrapper over the fillings, firmly tucking them into each other, then fold the sides over the center, and continue rolling until the salad roll is seam side down."
    },
    {
      "@type": "HowToStep",
      "text": "Place seam side down on a serving platter and set aside. Continue until all fillings are used up."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with cashew dipping sauce. Best when fresh, though leftovers will keep stored separately for 2-3 days."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/thai-spring-rolls-cashew-dipping-sauce"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T07:04:50.772Z"
}
