{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Vicky and Ruth"
  },
  "cookingMethod": "baking",
  "cookTime": "PT35M",
  "createdAt": "2022-12-03T21:59:15.047Z",
  "datePublished": "2022-07-03",
  "description": "Impress your family and guests with this fabulous fresh fruit tart with tahini cream. It's easier to make than you think. You just need a little skill and patience. A Vegan and Gluten-Free Dessert.",
  "image": [
    "https://mayihavethatrecipe.com/wp-content/uploads/2015/06/Fruit-Tart-6-225x225.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2015/06/Fruit-Tart-6-260x195.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2015/06/Fruit-Tart-6-320x180.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2015/06/Fruit-Tart-6.jpg"
  ],
  "keywords": "gluten-free, kosher, dairy free",
  "name": "Fruit Tart",
  "nutrition": {
    "@type": "nutritionInformation",
    "calories": "339 calories",
    "carbohydrateContent": "37.3",
    "cholesterolContent": "0",
    "fatContent": "17.5",
    "fiberContent": "2.6",
    "proteinContent": "5.1",
    "saturatedFatContent": "8.4",
    "servingSize": "1 slice",
    "sodiumContent": "334",
    "sugarContent": "13.4",
    "transFatContent": "0",
    "unsaturatedFatContent": "5"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "For the crust:",
    "1 cup 1 to 1 gluten-free flour, you may use all-purpose unbleached flour if you prefer",
    "1/2 cup almond flour",
    "3 tbsp coconut oil",
    "2 tbsp tahini",
    "1 tbsp maple syrup",
    "Pinch of salt",
    "3 tbsp unsweetened vanilla cashew milk or any other plant-based milk",
    "For the cream:",
    "1 1/2 cups unsweetened cashew milk",
    "2 tbsp granulated sugar",
    "3 tbsp corn starch",
    "1 tsp natural vanilla extract",
    "3 tbsp tahini",
    "Optional:",
    "1/2 cup vegan chocolate chips",
    "1 tsp coconut oil",
    "Fresh fruit (here we used green and golden kiwi, raspberries, blackberries, blueberries and strawberries)",
    "2 tbsp apricot preserves",
    "A little warm water ( see instructions below)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350F"
    },
    {
      "@type": "HowToStep",
      "text": "Combine the flour, almond flour, coconut oil, tahini, maple syrup and salt in a food processor. Pulse a few times until well combined"
    },
    {
      "@type": "HowToStep",
      "text": "Add the cashew milk, 1 tablespoon at a time, and keep pulsing until it forms a dough. (Note: if the crumbs don't come together in the food processor, but they do when you pinch them with your fingers, place them on a floured surface and knead with your hands until it forms a soft dough)"
    },
    {
      "@type": "HowToStep",
      "text": "Press the dough evenly on a non-stick 11\"x1.5\" with removable bottom tart pan, so the dough comes up the sides of the pan. Refrigerate for 15 minutes"
    },
    {
      "@type": "HowToStep",
      "text": "Carefully prick the bottom and sides with a fork several times to avoid air bubbles while baking (you can also use pie weights if you have them)"
    },
    {
      "@type": "HowToStep",
      "text": "Bake at 350F for 25 minutes until golden brown. Set aside to cool"
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare the cream. In a small saucepan, heat 1 cup of cashew milk and sugar just until small bubbles start to appear on the sides"
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, whisk together remaining 1/2 cup cashew milk, corn starch and vanilla extract until well incorporated"
    },
    {
      "@type": "HowToStep",
      "text": "Off the heat, add corn starch mixture to warm milk. Bring saucepan back to the stove and cook the cream over medium-low heat, whisking constantly, until it thickens (this will happen quickly, in 30 to 45 seconds). Turn off heat and add the tahini, mixing well until it's completely incorporated. Set aside to cool, but do not refrigerate. Cover the surface with plastic wrap (so it touches the cream)"
    },
    {
      "@type": "HowToStep",
      "text": "Melt chocolate chips and coconut oil (you can do this in the microwave, in 20 second increments stirring well each time). Pour melted chocolate over the cooled tart shell and refrigerate for a few minutes until the chocolate hardens (SEE NOTE)"
    },
    {
      "@type": "HowToStep",
      "text": "To assemble the tart, spread cooled cashew cream over the chocolate-covered tart bottom. Arrange fruit on top and refrigerate for at least 2 hours, until the cream has set."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the apricot preserves with enough warm water to be able to brush the mixture on the fruit."
    },
    {
      "@type": "HowToStep",
      "text": "Using a pastry brush, carefully brush the thin apricot mixture to achieve shine on the fruit."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://mayihavethatrecipe.com/gluten-free-fruit-cashew-cream-tart"
  ],
  "suitableForDiet": "VeganDiet",
  "totalTime": "PT1H20M",
  "updatedAt": "2022-12-03T21:59:15.045Z",
  "url": "https://mayihavethatrecipe.com/fruit-tart/"
}
