{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Hello Veggie"
  },
  "createdAt": "2022-12-02T01:10:36.139Z",
  "datePublished": "2019-06-27T08:00:00+00:00",
  "description": "These hearty vegan bowls are perfect for meal prep - and super high in protein too!",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2019/06/Tofu-Scramble-Bowls-1.jpg"
  ],
  "name": "Garden Tofu Scramble Bowls with Smoky Red Potato Hash",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "477 kcal",
    "carbohydrateContent": "267.7 g",
    "fatContent": "16.7 g",
    "fiberContent": "30.8 g",
    "proteinContent": "43.2 g",
    "saturatedFatContent": "1.9 g",
    "servingSize": "1 /4 of recipe",
    "sugarContent": "18.9 g"
  },
  "recipeCategory": "Breakfast",
  "recipeIngredient": [
    "2 tablespoons avocado oil",
    "1 pound red potatoes (diced (uniform pieces, about 1/2-inch in size)",
    "1 small onion (diced)",
    "1/2 teaspoon smoked paprika",
    "1/2 teaspoon garlic powder",
    "Salt and pepper (to taste)",
    "1 14-ounce package firm tofu, pressed for at least 30 minutes and drained",
    "1 tablespoon nutritional yeast",
    "1 teaspoon ground turmeric",
    "1 tablespoon avocado oil",
    "2 cloves garlic (minced)",
    "1 small zucchini (cut into thick half moons)",
    "1/2 red bell pepper (diced)",
    "1 cup loosely packed baby arugula or spinach",
    "1 cup sun-dried tomatoes",
    "4 slices whole grain toast (halved on the diagonal)",
    "Thinly sliced green onions (to garnish (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Crumble the tofu into a large bowl. Add the nutritional yeast and turmeric; toss to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Heat 2 tablespoons of oil in a skillet over medium heat. Add the potatoes and diced onion and cook for 10 minutes, stirring occasionally. Stir in the paprika and garlic powder; cook for 5 minutes more, or until the potatoes are lightly browned and tender. Season to taste with salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the potatoes into 4 large bowls. Return the skillet to medium heat and add 1 tablespoon of oil. Add the garlic, zucchini, and bell pepper to the skillet and cook for about 5 minutes, or until the vegetables are tender without being too soft. Stir in the crumbled tofu. Continue to cook until the tofu has heated through, 3-5 minutes more. Stir in the arugula or spinach and season to taste with salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the the tofu scramble mixture into the bowls with the potatoes, then add the sun-dried tomatoes and pieces of toast. Garnish with green onions, if desired, and serve immediately."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://helloveggie.co/tofu-scramble-bowls"
  ],
  "updatedAt": "2022-12-02T01:10:36.138Z"
}
