{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "67",
    "ratingValue": "4.69"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-05T12:01:06.036Z",
  "datePublished": "2015-06-20T05:00:56+00:00",
  "description": "Creamy, simple Vegan Mac &#039;N&#039; Cheese infused with raw and roasted garlic for extra flavor! Just 10 ingredients required for this delicious, flavorful plant-based entrée or side.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/06/Vegan-Garlic-Mac-n-Cheese-SQUARE.jpg"
  ],
  "keywords": "mac n cheese",
  "name": "Garlic Mac 'n' Cheese",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "627 kcal",
    "carbohydrateContent": "86 g",
    "fatContent": "23 g",
    "fiberContent": "8 g",
    "proteinContent": "22.2 g",
    "saturatedFatContent": "3.6 g",
    "servingSize": "1 serving",
    "sodiumContent": "590 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 head roasted garlic (see instructions for method)",
    "10 ounces macaroni noodles* (use gluten-free pasta for GF // 10 ounces equals ~2 1/4 cups dry)",
    "4 Tbsp olive or avocado oil",
    "5 cloves garlic (minced)",
    "4-5 Tbsp unbleached all-purpose flour (or sub arrowroot powder for GF)",
    "2 - 2 1/4 cups Blue Diamond Almondmilk Original Unsweetened",
    "~1/2 tsp each salt and pepper (to taste)",
    "1/2 cup vegan parmesan cheese",
    "4-6 Tbsp nutritional yeast (plus more for topping)",
    "1/4 cup panko bread crumbs (optional // gluten-free for GF)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To roast garlic, preheat oven to 400 degrees F (204 C) and cut off the very top of a head of garlic. Drizzle the top with a bit of oil, a sprinkle of salt and loosely wrap in foil."
    },
    {
      "@type": "HowToStep",
      "text": "Place directly on oven rack and roast for 45 minutes - 1 hour, depending on size of garlic. You'll know it's done when the garlic is very fragrant and the bulb appears soft and golden brown. Remove from oven and let cool."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare pasta, add macaroni to a large pot of boiling, well-salted water. Stir to prevent noodles from sticking, and boil according to package instructions (about 8-10 minutes). Drain and cover with a towel to keep moist - set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare sauce, heat a large skillet over medium heat. Once hot add oil and minced garlic. Stir and cook for 1-2 minutes, or until light golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Immediately add lesser amount of flour (or use arrowroot powder // 4 Tbsp as original recipe is written) and whisk - cook for 1 minute. (Later on, if the sauce is not thick enough, add an extra 1 Tbsp (amount as original recipe is written // adjust if altering batch size) later on during the blending process. I found 4 Tbsp to be the perfect amount)."
    },
    {
      "@type": "HowToStep",
      "text": "Add almond milk 1/2 cup at a time, whisking to prevent clumps, until 2 cups have been added (amount as original recipe is written // use lesser end of range if altering batch size). Cook for 2 minutes, stirring frequently. (Add the additional 1/4 cup (amount as original recipe is written // adjust if altering batch size) almond milk later on if the sauce appears too thick.)"
    },
    {
      "@type": "HowToStep",
      "text": "Transfer sauce to a blender and add roasted garlic (squeeze from base to push out cloves), salt and pepper, vegan parmesan cheese, nutritional yeast, and blend on high until creamy and smooth. Taste and adjust seasonings as needed - you want it pretty well salted + cheesy, so don't be shy."
    },
    {
      "@type": "HowToStep",
      "text": "Return sauce back to skillet and cook over low heat until warmed and slightly thickened - about 2-3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add cooked, drained pasta and toss to coat. Then top with 1 more Tbsp nutritional yeast and 1/4 cup panko bread crumbs (amounts as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Broil on high on the top rack of your oven for 1-2 minutes, or until golden brown (see photo). Watch closely as it can burn quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately. I love topping mine with an extra pinch of vegan parmesan cheese and a little red pepper flake."
    },
    {
      "@type": "HowToStep",
      "text": "Leftovers keep covered in the refrigerator for up to 3 days, though best when fresh. Reheat in the microwave or on the stovetop - add extra almond milk if it's dry."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/garlic-mac-n-cheese"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-05T12:01:06.035Z"
}
