{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "13",
    "ratingValue": "4.85"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-04T15:08:00.871Z",
  "datePublished": "2020-03-13T03:00:00+00:00",
  "description": "A gingery take on sauerkraut with apple, radish, and cabbage. The perfect addition to sandwiches, salads, bowls, and more! Just 6 ingredients and simple methods required.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Apple-Cabbage-Kraut-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Apple-Cabbage-Kraut-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Apple-Cabbage-Kraut-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/01/Apple-Cabbage-Kraut-SQUARE-480x270.jpg"
  ],
  "keywords": "sauerkraut",
  "name": "Gingery Apple Cabbage Sauerkraut",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "20 kcal",
    "carbohydrateContent": "5 g",
    "fatContent": "0.1 g",
    "fiberContent": "1.2 g",
    "proteinContent": "0.6 g",
    "servingSize": "1 quarter-cup-servings",
    "sodiumContent": "304 mg",
    "sugarContent": "2.7 g",
    "unsaturatedFatContent": "0.04 g"
  },
  "prepTime": "PT1472M",
  "recipeCategory": "Side",
  "recipeCuisine": "Chinese-Inspired",
  "recipeIngredient": [
    "8 cups red or green cabbage, finely grated or chopped (reserve whole outer leaves for later use)",
    "2 1/2 tsp sea salt",
    "1 cup thinly sliced radish (daikon or red)",
    "1 large apple, cored and thinly sliced + chopped into strips (we like Honeycrisp)",
    "2 Tbsp fresh ginger (grated)",
    "4 cloves garlic (finely minced or grated)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Sterilize any equipment you will be using for fermentation, especially the jars (we prefer using mason jars or these Weck Jars that hold about 850 ml). It is extremely important that everything is sterilized to allow for proper fermentation. Do so easily by pouring boiling water over clean jars and lids and drying completely. Let jars come back to room temperature before adding ingredients."
    },
    {
      "@type": "HowToStep",
      "text": "Add finely grated cabbage (we used our mandolin) to a large mixing bowl and top with sea salt. Wash hands thoroughly and massage cabbage for 10 minutes. The cabbage should start softening, shrinking in volume, and releasing water. Continue massaging until this happens."
    },
    {
      "@type": "HowToStep",
      "text": "Add radish, apple, ginger, and garlic and massage once more with clean hands for 4-5 minutes until thoroughly combined. Then taste test and adjust flavor, adding more salt for saltiness, grated ginger for more zing, or garlic for more intense garlic flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Use your clean hands to put the sauerkraut mixture into your sterilized jars and press down firmly to pack. There should be enough liquid from the massaging to rise up and cover the vegetables. If this doesn't happen, top with filtered water until covered (it is unlikely that you will need to add water)."
    },
    {
      "@type": "HowToStep",
      "text": "Also, make sure there is plenty of room (about 1 1/2 inches) between the contents and the lid so it has room to expand. Seal with a lid and set on the counter where there's not much direct sun exposure — or in a cabinet. The ideal temperature for fermentation is above 65 degrees F (18 C), so try to keep your environment on the warmer side to encourage proper fermentation."
    },
    {
      "@type": "HowToStep",
      "text": "Fermentation can happen in as quickly as 24 hours if your space is hot, or it can take as long as 2 weeks (again, depending on the environment). We found our sweet spot to be about 7-10 days."
    },
    {
      "@type": "HowToStep",
      "text": "During the fermentation process, open your jars once per day to release air (you should feel pressure release and see air bubbles when you open the jars). Press down with a sterilized object such as a spoon or the bottom of a drinking glass to ensure that the vegetables are still completely covered by the liquid. Doing so helps encourage proper fermentation."
    },
    {
      "@type": "HowToStep",
      "text": "The longer it sits and ferments, the tangier it will become, so sample occasionally with a clean utensil to test and see if it is at the right stage for you. Once it has reached your desired tanginess, cover securely and transfer to the fridge, where it should keep at least 3 months and up to 6 months. When serving, resist double-dipping to avoid contamination."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://minimalistbaker.com/gingery-apple-cabbage-sauerkraut"
  ],
  "totalTime": "PT1472M",
  "updatedAt": "2022-12-04T15:08:00.870Z"
}
