{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "23",
    "ratingValue": "4.92"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT2M",
  "createdAt": "2022-12-01T09:21:22.162Z",
  "datePublished": "2016-03-28T05:00:24+00:00",
  "description": "A 30-minute kale salad with tons of veggies, roasted cashews, and a gingery cashew dressing! A hearty and flavorful plant-based entrée or side dish.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/03/GIngery-Thai-kale-Salad-SQUARE.jpg"
  ],
  "keywords": "kale salad",
  "name": "Gingery Kale Salad with Cashew Dressing",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "596 kcal",
    "carbohydrateContent": "63.7 g",
    "fatContent": "33.7 g",
    "fiberContent": "11.5 g",
    "proteinContent": "17 g",
    "saturatedFatContent": "5.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "1000 mg",
    "sugarContent": "16 g"
  },
  "prepTime": "PT28M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup green beans (stems removed, steamed and chopped)",
    "1 tsp tamari (or soy sauce if not gluten free)",
    "1/2 tsp sesame oil",
    "1 tsp maple syrup",
    "1 tsp sesame seeds (optional)",
    "2 tsp sesame oil (or grape seed oil)",
    "2 medium shallots, thinly sliced",
    "2 bundles lacinato (non curly) kale (torn into bite-size pieces, large stalks removed)",
    "3 medium whole carrots (chopped or ribboned*)",
    "1/2 medium red bell pepper (quartered and thinly sliced)",
    "1/4 cup fresh chopped cilantro or basil (optional)",
    "1/3 cup roasted salted cashews (or sub peanuts)",
    "1/3 cup salted cashew butter (or sub peanut butter)",
    "1 Tbsp tamari (or soy sauce if not gluten free)",
    "2 tsp fresh grated (or very finely minced) ginger",
    "1/4 cup fresh lime juice",
    "1 Tbsp maple syrup",
    "1 Tbsp sesame oil",
    "1 tsp chili garlic sauce (optional // or 1/4 tsp red pepper flake- amount as original recipe is written)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Steam green beans slightly so they still have a bite, either in a steamer basket on the stovetop, or in the microwave. Then transfer to a small mixing bowl and top with tamari, sesame oil, maple syrup, and sesame seeds (optional). Toss to combine, then transfer to refrigerator to chill."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a small skillet over medium-low heat. Once hot, add sesame oil and shallot. Sauté for 2-3 minutes, stirring frequently, until softened and slightly golden brown. Remove from heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add kale to a large mixing bowl and drizzle with a bit of lime juice and sesame oil and use your hands to massage the kale to soften and remove some of the bitterness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare dressing in a small mixing bowl by whisking together all ingredients and thinning with a little hot water until pourable."
    },
    {
      "@type": "HowToStep",
      "text": "Add green beans, sautéed shallot, and remaining salad ingredients to kale and toss with dressing. Enjoy immediately."
    },
    {
      "@type": "HowToStep",
      "text": "If keeping for later, store dressing separately. Will keep in the refrigerator up to 2 days, though best when fresh."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://minimalistbaker.com/gingery-thai-kale-salad-cashew-dressing"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T09:21:22.161Z"
}
