{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-11-27T12:33:04.000Z",
  "datePublished": "2022-11-01",
  "description": "Try our easy to follow Gingerbread Castle recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1912-gingerbread-castle:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Cake,Pescatarian,Orange,Seafood free,Gingerbread,Video,Dec 2019,Stone fruit,Christmas,Soy free,Vegetarian,Peanut free",
  "name": "Gingerbread Castle Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "European",
  "recipeId": "9930",
  "recipeIngredient": [
    "200g dried apricots",
    "2.5 cup plain flour",
    "2 cup self-raising flour",
    "1 tsp mixed spice",
    "0.25 cup firmly packed dark brown sugar",
    "500g cream cheese",
    "1 cup milk",
    "1.5 cup pure icing sugar",
    "250g unsalted butter",
    "125g unsalted butter",
    "2 tsp vanilla bean extract",
    "1 tsp vanilla extract",
    "2.25 cup icing sugar mixture",
    "1 tbs ground ginger",
    "1 tsp bicarbonate of soda",
    "0.5 tsp lemon juice",
    "0.33 cup golden syrup",
    "3 free range eggs",
    "1 free range egg",
    "1 free range egg white",
    "1 cup caster sugar",
    "1 cup almond meal",
    "1 cup sultanas",
    "1 cup orange juice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 160°C. Grease and line 2 x 20cm (5cm deep) round cake pans with baking paper. Combine apricot, sultanas and orange juice in a bowl and set aside to soften."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Using an electric mixer, beat butter, sugar and vanilla until pale and creamy. Add eggs, one at a time, beating well after each addition until combined. Using a large spoon, stir in flour, almond meal and milk, in alternate batches, until well combined. Add apricot mixture. Divide mixture evenly between pans and smooth tops. Bake for 45 minutes or until a skewer inserted into centres of cakes comes out clean. Cool in pans for 10 minutes before turning onto wire racks to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the gingerbread biscuits, preheat oven to 180°C. Line 2 baking trays with baking paper. Beat butter, sugar and golden syrup in a bowl with electric beaters until creamy. Add egg and beat until combined. Sift flour, ginger, mixed spice and bicarbonate of soda together. Gradually beat into butter mixture until combined. Divide dough in half. Roll 1 portion out between 2 sheets of baking paper until 5mm thick. Cut house shapes from dough using picture as a guide. Place onto trays and bake for 12 minutes or until firm. Cool completely before decorating with royal icing."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make the royal icing, lightly whisk egg white and lemon juice together in a bowl. Gradually add icing sugar, whisking until smooth. Transfer to a small snap lock bag and snip off corner. Pipe designs onto biscuits and leave to set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the cream cheese frosting, place cream cheese, butter and vanilla in a bowl. Using an electric mixer, beat until pale. Reserve 1/4 cup icing sugar mixture and gradually beat remainder into frosting mixture until smooth."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To assemble cake, trim tops of cakes to level, if necessary. Cut cakes through the centre to make 4 layers. Place one layer onto a sheet of baking paper and spread with 1/2 cup frosting. Repeat with remaining cake layers and frosting. Use a palette knife to spread frosting on top and side of cake. Firmly press gingerbread houses around side of cake. Transfer to a cake stand, dust with reserved icing sugar and serve."
    }
  ],
  "recipeNameId": "gingerbread-castle",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/gingerbread-castle"
  ],
  "totalTime": "PT115M",
  "updatedAt": "2022-11-27T07:36:56.554Z",
  "url": "https://www.woolworths.com.au/shop/recipes/gingerbread-castle"
}
