{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-02T02:39:11.581Z",
  "datePublished": "2020-10-23T16:23:37+00:00",
  "description": "Soft and fluffy pumpkin spice cookies with glaze have the perfect blend of warm spices and pumpkin.",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2015/11/Vegan-Pumpkin-Spice-Cookies-5.jpg"
  ],
  "keywords": "pumpkin spice, vegan pumpkin cookies",
  "name": "Glazed Vegan Pumpkin Spice Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "344 kcal",
    "carbohydrateContent": "62 g",
    "fatContent": "10 g",
    "fiberContent": "2 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "2 g",
    "servingSize": "18 g",
    "sodiumContent": "253 mg",
    "sugarContent": "38 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 3/4 cups all-purpose flour",
    "1 teaspoon baking powder",
    "1 teaspoon baking soda",
    "1/4 teaspoon finely ground sea salt",
    "1 teaspoon ground cinnamon",
    "1 teaspoon ground nutmeg",
    "1/4 teaspoon ground allspice",
    "1/8 teaspoon ground black pepper",
    "12 tablespoon vegan butter (room temperature)",
    "1 cup brown sugar",
    "1/2 cup granulated sugar",
    "1/2 cup applesauce plus 1 tsp baking powder (whisked together)",
    "2 teaspoon pure vanilla extract",
    "1 cup pumpkin puree",
    "2 tablespoon unsweetened plant-based milk (not coconut, more if needed)",
    "For the glaze:",
    "1 cup confectioner’s sugar",
    "1 teaspoon vanilla",
    "1/2 teaspoon cinnamon",
    "Unsweetened plant-milk (not coconut milk (add by the tsp until you get the consistency that you like)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°F (176°C) and line a cookie sheet with parchment paper"
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl whisk the 2 3/4 cups of flour, 1 tsp baking powder, 1 tsp baking soda, 1/4 tsp sea salt, 1 tsp ground cinnamon, 1 tsp ground nutmeg, 1/4 tsp allspice, and 1/8 tsp ground black pepper together until well combined and the flour looks fluffy."
    },
    {
      "@type": "HowToStep",
      "text": "In a large mixing bowl beat the 12 tbsp vegan butter, 1 cup brown sugar, and 1/2 cup granulated sugar together until light and creamy. Add the 1/2 cup applesauce and 1 tsp of baking powder mixture and beat until well combined. Add the 2 tsps of vanilla extract, and 1 cup of pumpkin puree and beat until well combined. Add half of the flour and 1 tablespoon of the milk and mix until almost combined. Add the second half of the flour and 1 more tablespoon of milk (if the batter is still too dry, the consistency should be thick enough to spoon onto a cookie sheet.) and mix until almost combined. Add one or more tablespoons of milk if needed."
    },
    {
      "@type": "HowToStep",
      "text": "NOTE: The consistency of the pumpkin puree will determine how much milk you’ll need to add. If it’s a thick and solid puree you might need to add more milk, if it’s a thin, soupy mixture you probably won’t need to add more than two tablespoons."
    },
    {
      "@type": "HowToStep",
      "text": "Finish blending the flour into the mixture with a spoon. Drop by tablespoons on the cookie sheet and bake for 12 minutes, or until they are a light golden brown and firm to the touch. Cool for 5 minutes on the cookie sheet and use a spatula to tranfer to cool on a wire rack."
    },
    {
      "@type": "HowToStep",
      "text": "For the glaze:"
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl mix the 1 cup confectioner’s sugar, 1 tsp vanilla, 1/2 tsp cinnamon, and 1 tsp milk together. Add more milk by the teaspoon until you get the consistency that you desire. Some people like a thick and gooey glaze and others like a thin glaze. If the glaze becomes too thin, stir in more confectioner’s sugar."
    },
    {
      "@type": "HowToStep",
      "text": "When the cookies are completely cooled, frost the cookies with the glaze and put the cookies in the refrigerator until the glaze hardens, approximately 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Store in an airtight container in the refrigerator for up to 4 days. Store in a freezer bag for up to 3 months."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://veganosity.com/vegan-pumpkin-spice-cookies-egg-and-dairy-free"
  ],
  "totalTime": "PT27M",
  "updatedAt": "2022-12-02T02:39:11.581Z"
}
