{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "4.34"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-02T17:15:11.005Z",
  "datePublished": "2019-06-02T00:40:26+00:00",
  "description": "No gluten? No problem! This spring infused Gluten-Free Lemon Cake is made with fresh lemons, beautiful bluebs and oat flour.  It’s fresh and zingy , soft and tender and there are bursts of juicy blueberry in every bite!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Gluten-Free-Lemon-Cake-with-Blueberries-A-Virtual-Vegan-12.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Gluten-Free-Lemon-Cake-with-Blueberries-A-Virtual-Vegan-12-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Gluten-Free-Lemon-Cake-with-Blueberries-A-Virtual-Vegan-12-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/05/Gluten-Free-Lemon-Cake-with-Blueberries-A-Virtual-Vegan-12-480x270.jpg"
  ],
  "keywords": "gluten-free cake, gluten-free lemon cake, lemon blueberry loaf, lemon cake, vegan cake, vegan lemon cake",
  "name": "Gluten-Free Lemon Cake with Blueberries",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "342 kcal",
    "carbohydrateContent": "54.7 g",
    "fatContent": "12.8 g",
    "fiberContent": "3.4 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "9 g",
    "servingSize": "1 of 10 slices",
    "sodiumContent": "322 mg",
    "sugarContent": "26.4 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Brunch",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "2 very packed cups / 250 g oat flour (certified gluten-free if necessary)",
    "1/2 cup / 75 g cornmeal (, medium or course grind (unsweetened shredded coconut can be used as an alternative). )",
    "1/2 cup / 60 g tapioca flour/starch (, Please don't try to sub this. It gives by far the best results. )",
    "3/4 teaspoon baking soda (, (bicarbonate of soda in the UK)",
    "2 teaspoons baking powder",
    "1/2 teaspoon fine salt",
    "1/2 / 120 mls coconut oil (measured while liquid)",
    "3/4 cup / 150 g cane sugar or white granulated sugar",
    "1/2 cup / 120 mls unsweetened milk of choice",
    "1/4 cup / 60 mls freshly squeezed lemon juice",
    "2 lemons worth of zest",
    "1 cup / 130 g fresh or frozen blueberries (, plus another small handful for decorating the top)",
    "3/4 cup / 95 g powdered sugar",
    "2 - 4 tablespoons freshly squeezed lemon juice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375°F (190 *C), then grease a 1lb loaf pan (approx 9x5 inches) with some coconut oil, or any other neutral oil you have. Place a long strip of baking parchment along the bottom and up either end to act as handles which will allow you to lift the loaf out easily once it's baked."
    },
    {
      "@type": "HowToStep",
      "text": "To a large bowl, add the flour, cornmeal, tapioca flour, baking soda, baking powder and salt. Whisk them together to combine."
    },
    {
      "@type": "HowToStep",
      "text": "In another bowl or jug, add the melted coconut oil, sugar, milk, lemon juice and lemon zest. Whisk or stir them all together really well until thick and gloopy."
    },
    {
      "@type": "HowToStep",
      "text": "Make sure everything is ready to go, oven at temperature, loaf pan ready and at your side, before you continue. Then, pour the wet mixture into the dry mixture. With a spatula or wooden spoon, fold them together. Be gentle, but work quite quickly. As soon as you can no longer see any dry flour, pour in the blueberries and fold those in too."
    },
    {
      "@type": "HowToStep",
      "text": "Immediately spoon the batter into the loaf pan, smooth out the top, and sprinkle over a few extra blueberries (not essential, it's just for looks!). If you don't intend on glazing the finished loaf, a handful of granulated sugar sprinkled all over the top is nice as it will bake up to give a lovely crunchy top."
    },
    {
      "@type": "HowToStep",
      "text": "Get it into the oven without hanging around (we want to really take advantage of the reaction of the baking soda with the lemon juice for maximum fluffy texture). Bake for about 50 minutes. If you use frozen blueberries it might take a couple of minutes longer. Check it's done by poking it in the centre with a toothpick. If it comes out clean, except for perhaps a little blueberry juice, then it's done."
    },
    {
      "@type": "HowToStep",
      "text": "Leave the loaf in the pan to cool. This is important as it can crack and break a bit if you try to remove it while still warm. When it is cool, use the parchment paper handles to lift it out, then peel the paper off the bottom and place on a cooling rack or board ready for glazing."
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, add the powdered sugar. Gradually add the lemon juice 1 tablespoon at a time, stirring really well between each addition. It will feel like there is not enough liquid, then all of a sudden it will come together into a thick, smooth glaze. You shouldn't need more than 4 tablespoons of lemon juice. The amount needed will vary depending on humidity though. Once the glaze is completely smooth, thick and drizzle-able, use a spoon to drizzle it all over the top of your loaf. Leave it for at least 10 minutes to set up a bit before cutting."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://avirtualvegan.com/gluten-free-lemon-cake-blueberries"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-02T17:15:10.996Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/p3hJ3crH.mp4",
    "description": "No gluten? No problem! This spring infused Gluten-Free Lemon Cake is made with fresh lemons, beautiful bluebs and oat flour.  It’s fresh and zingy , soft and tender and there are bursts of juicy blueberry in every bite!",
    "name": "Gluten-Free Lemon Cake with Blueberries",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/p3hJ3crH-720.jpg",
    "uploadDate": "2019-05-29T00:00:00.000Z"
  }
}
