{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-03T11:42:05.619Z",
  "datePublished": "2020-12-01T04:40:43+00:00",
  "description": "Vegan, grain-free and gluten-free gingerbread men that are perfectly spiced, soft and chewy. Make them with your kiddos and have them help with icing them!",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2020/11/Vegan-Gingerbread-Men-0027.jpg",
    "https://www.veganricha.com/wp-content/uploads/2020/11/Vegan-Gingerbread-Men-0027-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2020/11/Vegan-Gingerbread-Men-0027-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2020/11/Vegan-Gingerbread-Men-0027-480x270.jpg"
  ],
  "keywords": "gingerbread men recipe, glutenfree gingerbread mean, vegan gingerbread men",
  "name": "Gluten-Free Grain-Free Vegan Gingerbread Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "79 kcal",
    "carbohydrateContent": "9 g",
    "fatContent": "4 g",
    "fiberContent": "1 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "32 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 cup almond flour (blanched superfine preferred) )",
    "3 tbsp tapioca starch",
    "1.5 tbsp coconut flour",
    "1 tsp ground ginger",
    "1/2 tsp ground cinnamon",
    "1/8 tsp allspice",
    "generous pinch of clove and nutmeg",
    "1/4 tsp vanilla extract (optional)",
    "1/4 tsp salt",
    "1 tbsp melted coconut oil",
    "1 tbsp molasses (use more for darker cookies) )",
    "3 tbsp maple syrup",
    "1/2 cup powdered sugar",
    "A few teaspoons coconut cream as needed."
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a bowl, mix the almond flour, tapioca starch, coconut flour, spices, and salt. Mix well until the mixture is well combined."
    },
    {
      "@type": "HowToStep",
      "text": "Add the melted coconut oil, molasses, maple syrup, and mix well. Press and mix until the mixture forms somewhat of a dough. The mixture will be somewhat sticky, but it will stiffen once you refrigerate it. Refrigerate for at least 20-30 minutes, then bring it together and press and knead for 15 seconds."
    },
    {
      "@type": "HowToStep",
      "text": "Place the dough between two pieces of parchment paper, and roll it out into an evenly thin oval, or circle, or rectangle."
    },
    {
      "@type": "HowToStep",
      "text": "Use your cookie cutter to cut out shapes and place them on a parchment-lined baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Accumulate the leftover pieces, roll back into a dough ball, roll out again, and repeat to make more shapes."
    },
    {
      "@type": "HowToStep",
      "text": "Distribute the shapes on baking sheets based on their size. You want to keep similarly sized shapes on one baking sheet, and the larger ones on another baking sheet. If they're all similar sizes, they can be on the same baking sheet. Otherwise the smaller cookies will get too crisp or brown or the larger ones will stay too soft."
    },
    {
      "@type": "HowToStep",
      "text": "Bake at 315 degrees F (160 C) for 11-12 minutes. Check at 11 minutes to see if the edges are starting to get crisp, if not, bake for another 1 or 2 minutes. Depending on how thin you rolled the dough out, and your baking sheet and oven, you may need 2-3 more minutes for larger pieces, or if they're rolled out thicker, you'd need to add another minute or two. For crispy cookies you want them to be crispy on the edges, and they eventually crisp out in the middle once cooled. Almond flour and coconut flour tends to browne really quickly so you want to keep an eye out for the cookies."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the tray from the oven when done, and transfer the cookies after 2 mins, gently to a cooling rack. Let them cool completely until before icing."
    },
    {
      "@type": "HowToStep",
      "text": "For the icing, mix icing sugar with 2-4 tsp coconut cream or until the icing is a thick mix, then use a chopstick to make whatever design you want, or pour into a plastic bag, cut a small hole into the edge, and use however you'd like.Store on the counter for up to 2 days. Refrigerate for longer"
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://veganricha.com/vegan-gingerbread-cookies-gluten-free-grain-free"
  ],
  "totalTime": "PT62M",
  "updatedAt": "2022-12-03T11:42:05.618Z"
}
