{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "She Likes Food"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-04T03:31:09.031Z",
  "datePublished": "2017-12-11",
  "description": "These Orange Cranberry Cinnamon Rolls are so flavorful and perfect for breakfast!",
  "image": [
    "https://www.shelikesfood.com/wp-content/uploads/2017/12/Gluten-Free-Orange-Cranberry-Cinnamon-Rolls-Vegan-1401-225x225.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2017/12/Gluten-Free-Orange-Cranberry-Cinnamon-Rolls-Vegan-1401-260x195.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2017/12/Gluten-Free-Orange-Cranberry-Cinnamon-Rolls-Vegan-1401-320x180.jpg",
    "https://www.shelikesfood.com/wp-content/uploads/2017/12/Gluten-Free-Orange-Cranberry-Cinnamon-Rolls-Vegan-1401.jpg"
  ],
  "name": "Gluten Free Orange Cranberry Cinnamon Rolls {Vegan}",
  "prepTime": "PT-463924H13M46S",
  "recipeCategory": "Breakfast",
  "recipeIngredient": [
    "2 cups unsweetened almond milk, or other favorite kind of milk",
    "6 tablespoons unsalted non-dairy butter, or regular butter",
    "1 (1/4 ounce) package rapid-rise instant yeast",
    "2 tablespoons granulated sugar",
    "1/4 teaspoon salt",
    "1 teaspoon vanilla extract",
    "4 cups Bob’s Red Mill Gluten Free 1:1 Baking Flour",
    "1/4 cup unsalted non-dairy butter, or regular butter",
    "1/2 cup light brown sugar",
    "1 tablespoon + 1 teaspoon ground cinnamon",
    "2 cups fresh cranberries",
    "1/2 cup powdered sugar",
    "1 tablespoon orange juice",
    "1/2 teaspoon orange zest"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add the almond milk and butter to a medium sized pot and heat until butter is melted. Transfer to a large bowl and let cool to the temperature of bath water (about 110 degrees F). Once cooled, add the yeast, stir, and let sit for 10 minutes. Then, add the sugar, salt and vanilla extract and let sit for another minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour to the milk mixture 1/2 cup at a time and stir well in between each addition. Add flour until dough forms a ball that isn’t sticky. You may need to add a few more tablespoons of flour or you may not need the entire 4 cups. Form dough into a ball, cover with plastic wrap and let sit in a warm place for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "The dough is much easier to roll out if it’s chilled for at least an hour."
    },
    {
      "@type": "HowToStep",
      "text": "Pre-heat oven to 350 degrees Fahrenheit. Add the cranberries to a food processor and process until crumb like. Squeeze as much liquid out of the blended cranberries as you can with your hands or with a paper towel."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the brown sugar and cinnamon together in a small bowl. Cover a large cutting board or counter top with plastic wrap and then lightly flour it (You will probably need to overlap two pieces of plastic wrap). Roll dough out until it’s about 1/4 inch thick and 20×15 inches wide. Cut the edges off so that they are straight."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the dough with the softened butter and then evenly sprinkle it with the cinnamon sugar mixture and then with the cranberries. Use the plastic wrap to roll dough (long side) into a cinnamon roll. Cut roll into pieces that are 1 inch thick and place into a medium sized cast iron skillet or oven safe dish. Bake cinnamon rolls for about 25-30 minutes, until cooked through."
    },
    {
      "@type": "HowToStep",
      "text": "While cinnamon rollls are baking, add the glaze ingredients to a small bowl and mix until smooth. Top cooked cinnamon rolls with desired amount of glaze. Cinnamon rolls are best when eaten immediately. They can be re-heated and eaten later as well, but best when served warm."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://shelikesfood.com/orange-cranberry-cinnamon-rolls-gluten-free-vegan/print/10986"
  ],
  "totalTime": "PT43M",
  "updatedAt": "2022-12-04T03:46:27.771Z",
  "url": "https://www.shelikesfood.com/orange-cranberry-cinnamon-rolls-gluten-free-vegan/"
}
