{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "createdAt": "2022-12-04T15:31:42.974Z",
  "datePublished": "2016-09-01T08:49:40+00:00",
  "description": "This delicious French Lentil Stew is creamy and flavorful thanks to hearty lentils, creamy cashews, fresh veggies, and plenty of warming spice. This makes a wonderful dinner on a chilly Fall evening.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2016/09/golden_lentil_stew_recipe.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/09/golden_lentil_stew_recipe-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/09/golden_lentil_stew_recipe-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/09/golden_lentil_stew_recipe-480x270.jpg"
  ],
  "keywords": "Golden French Lentil Stew, lentil stew",
  "name": "Golden French Lentil Stew",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "349 kcal",
    "carbohydrateContent": "42 g",
    "fatContent": "15 g",
    "fiberContent": "15 g",
    "proteinContent": "15 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "972 mg",
    "sugarContent": "9 g",
    "unsaturatedFatContent": "11 g"
  },
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1/2 cup 125 mL raw cashews, or 1/4 cup plus 2 tablespoons (90 mL) raw sunflower seeds",
    "2 cups 500 mL water",
    "2 tablespoons 30 mL extra-virgin olive oil",
    "1 large yellow or sweet onion (diced, or 2 leeks, cleaned and thinly sliced (about 2 cups/500 mL)",
    "4 large cloves garlic (minced (2 tablespoons/ 30 mL minced)",
    "1 to 1 1/2 teaspoons 5 to 7 mL fine sea salt, to taste, plus a couple pinches",
    "2 medium carrots (diced (1 heaping cup/275 mL)",
    "2 stalks celery (diced (3/4 cup/175 mL)",
    "2 teaspoons 10 mL ground cumin",
    "1 1/2 teaspoons 7 mL dried thyme",
    "1 teaspoon 5 mL ground turmeric",
    "1 14-ounce/398 mL can of diced tomatoes, with juices",
    "3/4 cup 175 mL uncooked French green lentils, picked over and rinsed",
    "4 cups 1 L low-sodium vegetable broth",
    "3 cups 750 mL stemmed and chopped Swiss chard or kale leaves",
    "Black Pepper",
    "1 to 2 teaspoons 5 to 10 mL white wine vinegar, to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put the cashews in a bowl and cover with a couple of inches of water. Soak for 1 to 2 hours or overnight. (For a quick-soak method, cover with boiling water and soak for 30 to 60 minutes.) Drain and rinse. Transfer the cashews to a high-speed blender along with 1/2 cup (125 mL) of the water. Blend on high until super smooth and creamy in texture. Set the cashew cream aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a large Dutch oven or stockpot, heat the oil over medium heat. Stir in the onion, garlic, and a couple pinches of salt, and sauté until the onion is softened, 4 to 6 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the carrots and celery, and cook for another few minutes or so. Stir in the cumin, thyme, and turmeric until combined."
    },
    {
      "@type": "HowToStep",
      "text": "Add the diced tomatoes with their juices, lentils, broth, and remaining water. Increase the heat to high and bring to a low boil. Reduce the heat to medium and simmer, uncovered, for 30 to 35 minutes, until the lentils are tender."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the cashew cream and chard. Add salt, pepper, and vinegar to taste. (The vinegar’s role is to add a little bit of brightness to the soup; add a bit at a time and keep tasting, as it can quickly overwhelm.) Cook for a couple of minutes over low-medium heat, until the chard is wilted, and then serve. This stew will keep in an airtight container in the fridge for up to 5 days, or you can freeze it for 1 to 2 months (always let it cool completely before storing). The stew will thicken after sitting in the fridge; you can thin it out with a bit of broth when you reheat it, if desired, or simply serve it thick with some crusty bread."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://ohmyveggies.com/golden-french-lentil-stew-from-oh-she-glows-every-day"
  ],
  "suitableForDiet": [
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-04T15:31:42.974Z"
}
