{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "createdAt": "2022-12-03T07:21:07.058Z",
  "datePublished": "2014-04-03T02:29:24+00:00",
  "description": "This salad isn’t the kind of thing you should make in advance, but since it really does come together in just a handful of minutes, it definitely belongs in the ‘quick and easy’ department. If you want to, you could segment the grapefruit and dice the chili ahead of time so that when it’s time to eat it’s simply a matter of slicing up the avocado and putting everything on a plate.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2014/04/img_3167-1.jpg"
  ],
  "name": "grapefruit and avocado salad",
  "prepTime": "PT10M",
  "recipeIngredient": [
    "1 ruby red grapefruit",
    "1 ripe avocado",
    "1/2 a red chili (or to taste, deseeded and finely diced)",
    "olive oil (use the best you have)",
    "salt and pepper",
    "a few sprigs of fresh cilantro"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by peeling and segmenting the grapefruit. Work over a bowl as you’re cutting the segments so that you capture all of the grapefruit juices. You can just drop the segments into the bowl while you’re working and fish them out later."
    },
    {
      "@type": "HowToStep",
      "text": "When you’ve separated all of the segments from the membrane, give the membrane a good squeeze to get all the rest of the juice out."
    },
    {
      "@type": "HowToStep",
      "text": "De-seed and finely dice the chili. Pluck a few sprigs out of a bunch of cilantro."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the avocado in half, twist to separate the two halves, and whack the pit with the sharp side of a knife. you can twist the knife to loosen the pit and pull it out. Now nick the skin at the pointy tip with a sharp knife. Use your fingers to peel the skin off as if you were peeling like a banana. This technique is important because the greatest carotenoid concentrations are shown to be in the darker green flesh right next to the skin. We don’t want to lose this layer by cutting the skin off with a knife."
    },
    {
      "@type": "HowToStep",
      "text": "Slice the avocado lengthwise into thin strips."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange the avocado slices and grapefruit segments onto one or two plates. Sprinkle with the diced chili, and a little salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon some of the reserved grapefruit juice overtop, followed by a healthy glug of good olive oil. Lastly, garnish with the cilantro sprigs. Serve immediately."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://heynutritionlady.com/grapefruit-and-avocado-salad"
  ],
  "totalTime": "PT10M",
  "updatedAt": "2022-12-03T07:21:07.057Z"
}
