{
  "@type": "Recipe",
  "cookTime": "PT240M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Greek Roast Lamb recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1005_greekstyleroastlamb:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Roast lamb,Lamb",
  "name": "Greek Roast Lamb Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Mains",
  "recipeCuisine": "Greek",
  "recipeId": "1152",
  "recipeIngredient": [
    "3 cloves garlic",
    "0.5 cup kalamata olives",
    "1 tsp dried oregano",
    "1 lemon, rind grated",
    "1 tbs olive oil",
    "0.5 bunch fresh oregano",
    "2.25kg lamb shoulder",
    "0.75 cup white wine"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To bone a lamb shoulder, place lamb shoulder on a chopping board. Using a sharp knife, cut through the joint to remove the leg. Look for a thin bone on one side of the large portion. Using the point of the knife, cut around the bone, scraping close to the bone and pulling the meat back as you go. This is a large flat triangular bone. Scrape away the meat and follow it to the joint bone where the leg was attached. Cut around this and remove both bones. This will give you a flattened or butterflied lamb shoulder."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place garlic cloves, fresh oregano, dried oregano, grated lemon rind, a pinch of salt and ground black pepper in a small food processor and process until finely chopped. Add lemon juice and olive oil. Process to combine."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 240°C."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place lamb into a baking dish and pierce the skin surface all over to allow the marinade to penetrate. Spread the herb mix over both sides of the lamb and rub well into the meat. Pour white wine into base of dish. Tightly cover with foil and leave in fridge to marinate for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place lamb into oven and reduce temperature to 180°C. Cook for 4 hours, adding olives for the last 30 minutes of cooking time. The lamb will be very tender and pulls apart easily. Serve."
    }
  ],
  "recipeNameId": "greek-roast-lamb",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/greek-roast-lamb"
  ],
  "totalTime": "PT280M",
  "updatedAt": "2022-11-24T14:05:44.696Z",
  "url": "https://www.woolworths.com.au/shop/recipes/greek-roast-lamb"
}
