{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-04T07:09:27.387Z",
  "datePublished": "2014-05-08T08:03:10+00:00",
  "description": "Roasted garlic and rosemary make these grilled artichokes shine. Bonus: No butter in sight! These artichokes and their dipping oil are double vegan all the way.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2014/04/grilled-artichokes-with-roasted-garlic-olive-oil-dip-4.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2014/04/grilled-artichokes-with-roasted-garlic-olive-oil-dip-4-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2014/04/grilled-artichokes-with-roasted-garlic-olive-oil-dip-4-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2014/04/grilled-artichokes-with-roasted-garlic-olive-oil-dip-4-480x270.jpg"
  ],
  "keywords": "Grilled Artichokes recipe, Grilled Artichokes with Roasted Garlic Olive Oil Dip",
  "name": "Grilled Artichokes with Roasted Garlic Olive Oil Dip",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "765 kcal",
    "carbohydrateContent": "9 g",
    "fatContent": "82 g",
    "fiberContent": "4 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "11 g",
    "servingSize": "1 artichoke half",
    "sodiumContent": "215 mg",
    "sugarContent": "1 g",
    "unsaturatedFatContent": "69 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 large artichokes",
    "1 bay leaf",
    "1 slice lemon",
    "1 cup olive oil",
    "4-5 sprigs fresh rosemary",
    "6-8 garlic cloves (about 1/4 cup)",
    "1 teaspoon olive oil (for roasting the garlic)",
    "1/2 cup rosemary olive oil",
    "2 teaspoons freshly squeezed lemon juice",
    "1/2 teaspoon Dijon mustard",
    "1/4 teaspoon kosher salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare and steam the artichokes. Use kitchen scissors to snip off the tips of the leaves, and then cut off the stem and about 1/2 inch of the top with a sharp knife. Rinse well under cold water. Place the artichokes in a large pot filled with two inches water. Add the lemon slice and bay leaf. Bring to a boil over high heat, then reduce to a simmer and cover, continuing to boil until tender, 30-40 minutes. Remove from water and set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "While the artichokes are steaming, make the rosemary olive oil and roast the garlic. To make the rosemary olive oil, pour the oil into a small saucepan set over medium heat. Add the rosemary sprigs. Bring just to a boil, then remove from heat. Let sit for 5 minutes. Remove the rosemary and discard it."
    },
    {
      "@type": "HowToStep",
      "text": "To roasted the garlic cloves, preheat the oven to 375o F. Place the unpeeled cloves in a shallow baking pan or pie dish and drizzle with 1 teaspoon of olive oil. Toss to coat and cover pan with foil. Bake for 20-25 minutes, until garlic is soft. Remove from oven and let cool enough to handle."
    },
    {
      "@type": "HowToStep",
      "text": "Make the dipping sauce. Squeeze the roasted garlic into the bowl of a food processor and discard the garlic skins. Add 1/2 cup rosemary olive oil, lemon juice, Dijon mustard, and salt. Blend until pureed, about 30 seconds. Pour into a small serving bowl and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To grill the artichokes, preheat grill to approximately 500oF. Using a sharp knife, cut the artichokes in half. With a spoon, scrape out just the fuzzy, hairy center of the artichoke, leaving the leaves and heart. Brush well with some of the remaining rosemary olive oil. Place cut-side down on the grill and cook until the artichokes darken with grill lines, about 3 minutes. Use tongs to rotate a quarter turn; cook for another minute or two. Remove from heat and allow to cool for 2-3 minutes. Serve with dipping oil."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://ohmyveggies.com/grilled-artichokes"
  ],
  "suitableForDiet": [
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-04T07:09:27.386Z"
}
