{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-24T12:25:40.000Z",
  "datePublished": "2021-03-10",
  "description": "Try our easy to follow Halloween Cake recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1210_halloweencake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Celebration cake,Halloween,Baking,Chocolate",
  "name": "Halloween Cake Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "870",
  "recipeIngredient": [
    "1 pkt red, yellow and green food colours",
    "600ml thickened cream",
    "1 cake decoration piping bags",
    "jelly beans (to decorate)",
    "lolly snakes (to decorate)",
    "mini waffle cones (to decorate)",
    "180g m&m's milk chocolate",
    "10 marshmallows",
    "halloween creepy crawlies spider (to decorate)",
    "1 pkt vanilla cake mix",
    "225g white chocolate melts",
    "225g dark chocolate melts"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 140°C. Grease with butter and line 2 deep 20cm (base) cake pans."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Prepare each cake mix separately. Add red and yellow food colour to one mixture until it's bright orange. Add green colour to the second mixture until it's bright green. Pour cakes into prepared pans and bake following packet instructions. Transfer cakes to wire racks to cool completely."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make the ganache, place dark chocolate melts and white chocolate melts into separate bowls. Heat thickened cream in a saucepan on medium-low until hot. Divide cream between chocolates. Stir both until melted and smooth. Cover and chill until thick."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Halve each cake through the middle. Reserve 1/4 of a cup of each ganache. Spread remaining dark ganache over the top of three cakes. Chop 1 cup of marshmallows in half and scatter over ganache. Stack the cakes, alternating colours. Finish with plain cake on top. Transfer to a cake stand."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Colour the white chocolate ganache with red and yellow food colours until it becomes bright orange. Spread orange ganache over top and sides of the cake, reserving some for the witches hat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spoon reserved milk chocolate ganache into a piping bag and decorate top and side of cake with a spiderweb. Measure and mark the centre of the cake with a toothpick. Pipe straight lines of dark ganache from centre out to the edge and down the side. Pipe looping lines around the cake to connect the straight lines and form a web. Add multicoloured chocolate M&M's to the joins on the top of the web."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For bloodshot eyes, trim tops from 10 marshmallows and press a jelly bean into the centre to hold. Place eyes around the base."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spoon extra melted chocolate onto baking paper. Dip cone into chocolate to coat. Stand onto discs and leave to set. Colour reserved white ganache with green. Pipe green band around hat brim. Add reserved orange ganache to make a buckle. Place the witch hat on the top and press spider onto the side. SCARY DECORATIONS: Use snake and spider lollies to add more creepy decoration to the cake."
    }
  ],
  "recipeNameId": "halloween-cake",
  "recipeYield": "20",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/halloween-cake"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-24T12:23:02.723Z",
  "url": "https://www.woolworths.com.au/shop/recipes/halloween-cake"
}
