{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-24T12:25:19.268Z",
  "datePublished": "2022-11-02",
  "description": "Try our easy to follow Halloween Layer Cake recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1910-halloween-cake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Layer cake,Seafood free,Chocolate,Halloween,Sesame free,Baking",
  "name": "Halloween Layer Cake Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "9817",
  "recipeIngredient": [
    "400g self-raising flour",
    "2 Philadelphia All Natural Cream Cheese blocks (softened)",
    "300g unsalted butter (softened)",
    "1 tbs vanilla extract",
    "3 cup icing sugar mixture",
    "1 cup Cadbury Bournville Cocoa",
    "2 Cadbury Dairy Milk Freddo",
    "274g Oreo",
    "4 free range eggs",
    "600g caster sugar",
    "1 tbs vegetable oil",
    "200g Cadbury Baking Chips Real Milk Chocolate (melted)",
    "50g Cadbury Baking Chips White chocolate (melted)",
    "1 handful The Natural Confectionery Co. Sour Squirms"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 160°C. Lightly grease 3 x 20cm (5cm deep) round cake pans with vegetable oil and line bases with baking paper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chocolate cake, use a stand mixer to whisk all the ingredients with 300ml water for 5 minutes, scraping down sides of bowl, or until mixture is light and fully combined. Divide mixture evenly among pans and bake for 40 minutes or until cake springs back when pressed and skewer inserted into centres comes out clean. Set aside in pans for 5 minutes, then transfer to wire racks to cool completely."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chocolate cream cheese icing, whip cream cheese in the bowl of a stand mixer fitted with a whisk attachment for 5 minutes or until smooth and no lumps remain. Add icing sugar in three batches, mixing in between each addition until fully combined. Slowly drizzle in chocolate with mixer running on low speed, then beat until fully combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the decorations, line 2 baking trays with baking paper. Transfer milk chocolate to a piping bag or ziplock bag with corner snipped, then pipe trees onto the baking paper, ensuring the tree bases are at least 1cm thick to keep them stable. Refrigerate for 5 minutes or until set. Lay Freddo frogs in a single layer on the remaining tray. Transfer white chocolate to a piping bag, then pipe fangs on Freddo. Refrigerate for 5 minutes or until set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To assemble cake, place 1 cake layer on a serving plate and spread with one-third chocolate cream cheese icing. Repeat with remaining cakes and icing. Process Oreo biscuits in a food processor until mixture resembles fine breadcrumbs. Scatter over Oreo crumbs to resemble soil. Insert trees gently into top of cake, then arrange Freddo in front of trees. Scatter sour squirm lollies among trees and Freddo."
    }
  ],
  "recipeNameId": "halloween-layer-cake",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/halloween-layer-cake"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-24T12:25:19.267Z",
  "url": "https://www.woolworths.com.au/shop/recipes/halloween-layer-cake"
}
