{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-06-15",
  "description": "An irresistable twist on hasselback potatoes, the pumpkin in this recipe adds a gorgeous sweetness and pairs beautifully with the floral sage and hazelnut stuffing.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2012-hasselback-pumpkin-with-stuffing-balls:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Hasselback,Microwave,Seafood free,Christmas,Stuffing,Dec 2020,Pumpkin,Sesame free",
  "name": "Hasselback Pumpkin With Stuffing Balls Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Side dishes",
  "recipeCuisine": "Scandinavian",
  "recipeId": "10837",
  "recipeIngredient": [
    "1kg whole butternut pumpkin, halved lengthways, deseeded, peeled",
    "2 bunches sage, leaves picked",
    "0.33 cup extra virgin olive oil",
    "2 brown onions, diced",
    "4 cloves garlic, crushed",
    "450g day-old sourdough bread, crust removed, cut into cubes",
    "1 cup blanched hazelnuts, toasted",
    "1.5 cup cheddar, finely grated",
    "3 free range eggs",
    "2 tbs maple syrup",
    "60g baby rocket leaves (to serve)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place pumpkin, cut-side down, on a microwave-safe plate and cover. Microwave on high for 8 minutes or until partially cooked. Set aside for 5 minutes to cool. Leaving a 1.5cm border around edge of pumpkin halves, scoop out some of the flesh using a metal spoon. Roughly chop flesh, then set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Finely chop half of the sage. Heat 2 tbs oil in a frying pan over medium- low heat. Cook onion, stirring, for 7 minutes or until softened. Add garlic and chopped sage, and cook for 2 minutes or until fragrant. Set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place bread and 3/4 cup hazelnuts in a food processor and process until fine breadcrumbs form. Add cheddar, pumpkin flesh and eggs. Season, then pulse until mixture is finely chopped."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 200°C/180°C fan-forced. Line a large baking tray with baking paper. Stuff pumpkin cavities with bread mixture, reserving remaining mixture. Place 1 pumpkin half, cut-side down, on a chopping board. Place a bamboo skewer, lengthways, on either side of pumpkin, then carefully slice through to the skewers at 5mm intervals. Repeat with remaining pumpkin half."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place pumpkin, cut-side down, on tray. Roll 1 tablespoonfuls of reserved bread mixture into balls and place around pumpkin. Brush pumpkin and balls with 1 tbs oil and season. Bake for 30 minutes or until balls are golden. Transfer balls to a bowl and cover to keep warm. Bake pumpkin for a further 20 minutes or until tender."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Brush pumpkin with syrup. Toss remaining sage leaves in remaining oil to coat and insert into the pumpkin cuts. Bake for a further 20 minutes or until pumpkin is golden and sage is crispy. Transfer pumpkin to a platter, scatter over remaining hazelnuts and serve with stuffing balls and rocket."
    }
  ],
  "recipeNameId": "hasselback-pumpkin-with-stuffing-balls",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/hasselback-pumpkin-with-stuffing-balls"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-11-27T13:16:04.763Z",
  "url": "https://www.woolworths.com.au/shop/recipes/hasselback-pumpkin-with-stuffing-balls"
}
