{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-03T09:59:23.833Z",
  "datePublished": "2006-04-30T09:38:00+00:00",
  "description": "This \"special occasion\" recipe has added oil, so I do not recommend it for those following a low-fat diet. If you want to try it without oil, try substituting the liquid from cooked chickpeas, called \"aquafaba.\"",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2006/04/pasta-1.jpg"
  ],
  "name": "Hasty Tasty Pasta with Broccoli, Olives, and Vegan Chicken",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "271 kcal",
    "carbohydrateContent": "25 g",
    "fatContent": "2.42 g",
    "fiberContent": "4.9 g",
    "proteinContent": "11 g",
    "servingSize": "1 serving",
    "sodiumContent": "41 mg"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 pound pasta (I recommend rotini;I used spaghetti because that's all I had)",
    "1 large bunch broccoli (cut into florets, stems peeled and sliced)",
    "1 package fake chicken strips (may substitute 4 ounces of Butler Soy Curls, rehydrated in vegetable broth and drained well)",
    "1-2 teaspoon good olive oil (may substitute aquafaba)",
    "4-6 cloves garlic (minced)",
    "1/8 cup pine nuts",
    "1 1/2 teaspoon dried basil",
    "1/8 teaspoon red pepper flakes",
    "black pepper to taste",
    "salt to taste",
    "small black olives (to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of water to a boil and add the pasta and salt (if desired). Cook until the pasta is almost done (with about 2 minutes of cooking time left). Add the broccoli to the pasta and cover. Cook for 2 minutes, until broccoli and pasta are just barely tender (al dente) and broccoli is bright green. Remove 1 cup of the cooking water and reserve it; drain the pasta and put it into a large serving bowl. Toss with a teaspoon of olive oil, if desired."
    },
    {
      "@type": "HowToStep",
      "text": "While the pasta is cooking, sauté the chick'n strips in a non-stick skillet sprayed with olive oil until brown. Remove them to the serving bowl. Add as much olive oil to the skillet as you want to use, heat it and add the garlic and pine nuts. Stir and cook until the pine nuts just start to brown. Remove from the heat and add the reserved cup of pasta cooking water--carefully to avoid spattering. Return to the heat, add the basil, red pepper, black pepper, and salt, and stir and cook until slightly thickened. Pour it over the pasta and chick'n strips, add the black olives, toss well, and serve."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2006/04/hasty-tasty-pasta-with-broccoli-olives.html"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-03T09:59:23.830Z"
}
