{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-01T01:42:59.665Z",
  "datePublished": "2016-08-11T12:43:12+00:00",
  "description": "Hatch Chile Sweet Potato Cornbread boasts the subtle sweetness of sweet potatoes paired with the smoky flavor of roasted Hatch chiles.&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2016/08/Hatch-Chile-Sweet-Potato-Cornbread-butter-melt-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/08/Hatch-Chile-Sweet-Potato-Cornbread-butter-melt-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/08/Hatch-Chile-Sweet-Potato-Cornbread-butter-melt-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/08/Hatch-Chile-Sweet-Potato-Cornbread-butter-melt-1-480x270.jpg"
  ],
  "name": "Hatch Chile Sweet Potato Cornbread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "321.21 kcal",
    "carbohydrateContent": "49.45 g",
    "fatContent": "10.75 g",
    "fiberContent": "2.69 g",
    "proteinContent": "7.28 g",
    "servingSize": "1 Serving",
    "sodiumContent": "472.61 mg"
  },
  "prepTime": "PT30M",
  "recipeIngredient": [
    "1/2 lb. fresh Hatch chiles (about 3 peppers) ($0.34)",
    "1 sweet potato (3/4 to 1 lb.) ($0.97)",
    "1.5 cups yellow cornmeal ($0.36)",
    "1 cup all-purpose flour ($0.13)",
    "1/4 cup sugar ($0.20)",
    "1 Tbsp baking powder ($0.12)",
    "1 tsp salt ( $0.05)",
    "2 large eggs ($0.54)",
    "1/2 cup sour cream ($0.58)",
    "3/4 cup milk ($0.23)",
    "3 Tbsp cooking oil, divided* ($0.06)",
    "2-3 green onions, sliced ($0.17)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Line a baking sheet with foil. Pour 1 Tbsp cooking oil into a small dish, dip your fingers into the oil, then rub the outside of the Hatch chiles with oil until they're evenly coated. Save the rest of the 1 Tbsp of oil to coat the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Place the peppers on the baking sheet. Adjust your oven rack so that the top of the peppers will be about 6 inches from the broiler, turn the broiler on to high, and place the peppers in the oven. Broil the peppers, turning them occasionally, until they are blackened on all sides (10-15 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the peppers have charred on the outside, remove them from the oven and place an upside down bowl over the peppers to trap the steam. Let them cool under the bowl for about 10 minutes. Once cool enough to touch, peel back the skin of the peppers, cut off the stem, open the peppers lengthwise, and scrape out the seeds. Chop the remaining roasted pepper flesh and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While the peppers are roasting, peel the sweet potato and cut it into 1/2 inch cubes. Place the cubes in a small pot, cover with water, place a lid on top, and bring the water to a boil over high heat. Let the sweet potatoes boil until very tender (about 7 minutes). Drain the potatoes then mash until mostly smooth. Set the mashed sweet potatoes aside."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the inside of a 10-inch cast iron skillet with the leftover oil from coating the peppers. Place the skillet in the oven and preheat to 425oF."
    },
    {
      "@type": "HowToStep",
      "text": "While the oven and skillet are preheating, stir together the cornmeal, flour, sugar, baking powder, and salt in a large bowl. In a separate bowl, whisk together 1.5 cups of the mashed sweet potato, eggs, sour cream, milk, and 2 Tbsp of cooking oil until smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the bowl of wet ingredients into the bowl of dry ingredients, then stir just until combined and no dry flour remains on the bottom of the bowl. Add the chopped green chiles and sliced green onions, then gently fold until they're incorporated into the batter."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully take the preheated skillet out of the oven and pour in the cornbread batter. Smooth the top of the batter, then return the skillet to the oven. Bake the cornbread for 22-26 minutes, or until the top is golden brown and cracked around the edges. Slice the cornbread into eight pieces and serve."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/hatch-chile-sweet-potato-cornbread"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-01T01:42:59.664Z"
}
