{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "20",
    "ratingValue": "4.66"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-30T22:31:37.058Z",
  "datePublished": "2018-08-02T13:23:56+00:00",
  "description": "These rich and juicy Hawaiian Burgers are flavored with sweet pineapple, tangy teriyaki sauce, savory green onions, and creamy Monterey jack cheese.&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2018/08/Hawaiian-Burgers-H.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/08/Hawaiian-Burgers-H-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/08/Hawaiian-Burgers-H-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/08/Hawaiian-Burgers-H-480x270.jpg"
  ],
  "keywords": "Dinner, easy, Fast",
  "name": "Hawaiian Burgers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "823.75 kcal",
    "carbohydrateContent": "67.15 g",
    "fatContent": "47 g",
    "fiberContent": "3.68 g",
    "proteinContent": "32.8 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1778.8 mg"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "20 oz. can pineapple slices in juice ($1.19)",
    "2 green onions, sliced ($0.17)",
    "2 oz. Monterey jack cheese, shredded ($0.55)",
    "1 lb. ground pork ($2.50)",
    "6 Tbsp teriyaki sauce, divided ($0.29)",
    "1/2 red onion ($0.41)",
    "1 Tbsp cooking oil, divided ($0.04)",
    "4 Onion Rolls ($2.99)",
    "4 Tbsp mayonnaise ($0.41)",
    "1 Tbsp sriracha ($0.09)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Take one of the pineapple slices from the can, and chop it into very small pieces. Slice the green onions and shred the Monterey Jack cheese. Place the ground pork, chopped pineapple, sliced green onions, shredded cheese, and 2 Tbsp teriyaki sauce in a large bowl. Mix the ingredients together by hand until they are evenly incorporated."
    },
    {
      "@type": "HowToStep",
      "text": "Shape the pork mixture into four burger patties. Make the patties flatter and thinner than you'd like the finished burgers to be, as they do contract and shrink inward as they cook. Set the patties aside."
    },
    {
      "@type": "HowToStep",
      "text": "Thinly slice the red onion. Add 1/2 Tbsp cooking oil to a large skillet and heat over medium-high. When the skillet and oil are very hot, add the red onion slices and allow them to cook until browned and caramelized on the bottom. Stir the onions and then let them brown again. Avoid stirring too often, as this will prevent the browning and caramelization on the edges. When the onions are mostly browned, transfer them to a bowl and set them aside."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the heat under the skillet down to medium, add another 1/2 Tbsp oil to the skillet, swirl to coat the surface, then add the burger patties. Cook the patties until browned on one side, then carefully flip and cook until browned on the second side and cooked through (about 5 minutes per side - cooking time may vary due to cookware and size and shape of burgers)."
    },
    {
      "@type": "HowToStep",
      "text": "While the burgers are cooking, combine the mayonnaise and sriracha in a small bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the cooked burgers to a clean plate or cutting board. Pat four more pineapple rings dry with a paper towel, then add them to the skillet. Continue to cook the pineapple slices over medium until they're hot and some of the browned bits from the skillet have dissolved off the skillet and onto the pineapple (about 2-3 minutes each side)."
    },
    {
      "@type": "HowToStep",
      "text": "To build the burgers, smear a tablespoon or so of the sriracha mayo onto a bun, add a cooked burger, and drizzle another tablespoon of teriyaki sauce over the burger. Top with one of the cooked pineapple slices and a few of the caramelized red onion."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/pineapple-pork-hawaiian-burgers"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-11-30T22:31:37.057Z"
}
