{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "78",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T16:25:06.276Z",
  "datePublished": "2014-06-10T05:00:19+00:00",
  "description": "7-ingredient granola bars that taste just like a raw brownie! No baking required besides toasting the nuts and oats — an optional step. Simple, all naturally sweetened, and so delicious.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/05/Brownie-Granola-Bars-SQUARE.jpg"
  ],
  "keywords": "brownie bars",
  "name": "Healthy Brownie Granola Bars",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "352 kcal",
    "carbohydrateContent": "41 g",
    "fatContent": "20 g",
    "fiberContent": "7.4 g",
    "proteinContent": "8.2 g",
    "saturatedFatContent": "2.2 g",
    "servingSize": "1 bars",
    "sodiumContent": "3 mg",
    "sugarContent": "25 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cups rolled oats (GF for gluten-free eaters)",
    "1 cup raw nuts (roughly chopped // I used half almonds, half pecans)",
    "1 cup raw walnuts",
    "2 cups pitted dates (soaked for 10 minutes in warm water then drained)",
    "3/4 cup cocoa or cacao powder",
    "1/4 cup natural salted almond butter (or peanut butter)",
    "1/4 cup agave nectar or maple syrup (or honey if not vegan)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Optional step: Toast your oats and pecans in a 350-degree F (176 C) oven for 15 minutes or until slightly golden brown. Otherwise, leave them raw – I prefer the toasted flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Process walnuts in a food processor until a loose meal is reached. Remove from bowl and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add dates and process until small bits remain (about 1 minute). It should form a “dough” like consistency. (Mine rolled into a ball)."
    },
    {
      "@type": "HowToStep",
      "text": "Add walnut meal and cocoa or cacao powder back in with the dates and process to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a large mixing bowl and add the (toasted) oats and nuts and stir to combine. You may have to use your hands to really incorporate the mixture well."
    },
    {
      "@type": "HowToStep",
      "text": "Next, warm honey and almond butter in a small skillet over medium heat for 2-3 minutes until combined and pourable. Pour over brownie mixture and then thoroughly stir using a wooden spoon. (I opted to put plastic bags on my hands and mix that way to better incorporate the mixture.)"
    },
    {
      "@type": "HowToStep",
      "text": "Once thoroughly mixed, transfer to a 9×13 dish (or similar size pan // adjust if altering batch size) lined with plastic wrap or parchment paper so they lift out easily."
    },
    {
      "@type": "HowToStep",
      "text": "If using a 9x13, ONLY USE 3/4 of the pan so they have the proper thickness. Otherwise they’ll be too thin. Cover with parchment or plastic wrap and press down firmly to even out the top. Freeze for 15-20 minutes to harden."
    },
    {
      "@type": "HowToStep",
      "text": "Lift bars from pan and chop into 12 even bars (or more if you prefer). Store in an airtight container in the freezer or fridge to keep them extra fresh. They will get a little sticky when left out at room temp."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/healthy-brownie-granola-bars"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-04T16:25:06.275Z"
}
