{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "5",
    "reviewCount": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vicky & Ruth"
  },
  "cookingMethod": "Stove top",
  "cookTime": "PT25M",
  "createdAt": "2022-12-02T18:38:05.169Z",
  "datePublished": "2019-07-28",
  "description": "Two of our favorite Italian classics come together in this mouthwatering, nutrient-filled eggplant lasagna. Made with seasonal ingredients and Explore Cuisine Green Lentil Lasagne Noodles. No oven required!",
  "image": [
    "https://mayihavethatrecipe.com/wp-content/uploads/2019/07/HIGH-PROTEIN-EGGPLANT-LASAGNA-8-225x225.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2019/07/HIGH-PROTEIN-EGGPLANT-LASAGNA-8-260x195.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2019/07/HIGH-PROTEIN-EGGPLANT-LASAGNA-8-320x180.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2019/07/HIGH-PROTEIN-EGGPLANT-LASAGNA-8.jpg"
  ],
  "keywords": "lasagna, protein, high protein, explore cuisine, vegetarian, skillet, eggplant, tofu",
  "name": "High Protein Skillet Eggplant Lasagna",
  "nutrition": {
    "@type": "nutritionInformation",
    "calories": "605 calories",
    "carbohydrateContent": "45.4",
    "cholesterolContent": "0",
    "fatContent": "29",
    "fiberContent": "10.1",
    "proteinContent": "21",
    "saturatedFatContent": "8.7",
    "servingSize": "1 stack",
    "sodiumContent": "880",
    "sugarContent": "13.5",
    "transFatContent": "0",
    "unsaturatedFatContent": "12.3"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Italian",
  "recipeIngredient": [
    "2 small eggplants, peeled and cut into 1/2 inch thick slices",
    "1 cup plain, unsweetened non-dairy milk",
    "1 cup seasoned bread crumbs (you can use gluten-free)",
    "4 tbsp extra virgin olive oil, divided",
    "1 large bunch fresh basil, thoroughly washed",
    "14oz extra firm tofu, drained and patted dry, crumbled (See note 1 for a dairy alternative)",
    "1/2 -1 tsp salt (to taste)",
    "56oz prepared pasta sauce",
    "1- 8oz box Explore Cuisine Green Lentil Lasagne sheets, cut in half",
    "12oz shredded mozzarella cheese (vegan or dairy)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the eggplant slices in a large bowl, and pour the milk over, so they're covered. Place the bread crumbs in a large plate"
    },
    {
      "@type": "HowToStep",
      "text": "Coat each slice of eggplant with bread crumbs, pressing lightly so they're well coated. Set them aside"
    },
    {
      "@type": "HowToStep",
      "text": "Heat 2 tablespoons of the olive oil in a nonstick, deep 4-quart skillet with a lid. Arrange as many breaded eggplant slices as you can fit at the bottom, and cook them over medium heat, 3-4 minutes per side. Remove them from the pan, add one more tablespoon of olive oil, and repeat the process with the remaining slices. Set them aside"
    },
    {
      "@type": "HowToStep",
      "text": "While the eggplant cooks, place the basil in the food processor and pulse until chopped small (save a few leaves for garnish). Add the tofu and pulse until it has the consistency of ricotta cheese (see note 2). Set aside"
    },
    {
      "@type": "HowToStep",
      "text": "Wipe the skillet clean using a paper towel. Spread about a cup and a half of sauce at the bottom. Arrange 6 pieces of pasta on top. Add a dollop of the tofu mixture on each one, and spread it lightly. Place a slice of eggplant on top, sprinkle with some cheese and top with a few spoonfuls of sauce. Repeat the process, creating 2 more stacked layers (a piece of pasta, an eggplant slice and cheese, sauce). You'll end up with a few extra pieces of pasta. Arrange them over the top, and pour the remaining sauce, so everything is well covered. Cover the skillet and cook over medium-low heat for 17-20 minutes (depending on how al dente you like the pasta)"
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the remaining shredded cheese on top, cover, turn off the heat and let it sit until the cheese has melted. Garnish with some basil leaves, whole or cut into ribbons"
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://mayihavethatrecipe.com/high-protein-skillet-eggplant-lasagna"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T18:38:05.169Z",
  "url": "https://mayihavethatrecipe.com/high-protein-skillet-eggplant-lasagna/"
}
