{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "168",
    "ratingValue": "4.43"
  },
  "author": {
    "@type": "Person",
    "name": "Mark Bittman"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-11-25T13:16:17.000Z",
  "datePublished": "2012-03-20T14:35:00+00:00",
  "description": "Skip take out and make these easy and addictive Chicken Yakisoba noodles that are full of chicken and vegetables, and drenched in a sweet and tangy sauce! ",
  "image": {
    "@type": "ImageObject",
    "height": 480,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2012/03/Chicken-Yakisoba-fork-bowl.jpg",
    "width": 640
  },
  "keywords": "easy, Stir Fry Noodles, Stir Fry Recipes, Yakisoba Recipe",
  "name": "Homemade Chicken Yakisoba",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "354.62 kcal",
    "carbohydrateContent": "33.9 g",
    "fatContent": "14.25 g",
    "fiberContent": "7.27 g",
    "proteinContent": "27.13 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1314.62 mg"
  },
  "prepTime": "PT15M",
  "recipeIngredient": [
    "1/2 head green cabbage ($0.41)",
    "1 yellow onion ($0.55)",
    "2 carrots ($0.25)",
    "1 crown broccoli ($0.70)",
    "1 inch fresh ginger ($0.52)",
    "1 large chicken breast ($1.66)",
    "2 Tbsp vegetable oil ($0.08)",
    "2 3oz. packages ramen noodles, seasoning packets discarded ($0.50)",
    "1 tsp sesame oil, optional ($0.19)",
    "1/4 cup soy sauce ($0.24)",
    "1/4 cup worcestershire sauce ($0.20)",
    "2 Tbsp ketchup ($0.05)",
    "1 Tbsp sriracha ($0.26)",
    "1 Tbsp sugar ($0.02)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Before you begin, prepare the meat and vegetables for stir frying. Peel the ginger with either a vegetable peeler or the side of a spoon and then grate it with a cheese grater. Peel and grate the carrots with a large holed cheese grater. Remove the core from the cabbage and cut into thin strips. Slice the onion into thin strips. Cut the broccoli into bite-sized pieces. Slice the chicken into thin strips."
    },
    {
      "@type": "HowToStep",
      "text": "Begin boiling a medium pot full of water for the noodles. Heat the vegetable oil in a large skillet over medium-high heat. When the oil is hot, add the grated ginger, saute for about 30 seconds to one minute (its okay if it sticks to the pan but don’t let it burn). Add the chicken strips and cook until they are no longer pink (about five minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the chicken is cooked through, add all of the vegetables. Stir and cook until wilted (about 5-10 minutes). Meanwhile, once the water boils, add the noodles and cook just until tender (2-3 minutes). Drain, return to the pot (with the heat turned off) and toss with the sesame oil to keep from sticking."
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, combine the soy sauce, worcestershire sauce, ketchup, sriracha, and sugar. Use only 1/2 tsp of sriracha if you don’t want it spicy, use up to 1 Tbsp if you like it hot. Stir until the ketchup and sugar are dissolved. Pour the sauce into the skillet with the chicken and vegetables with the heat still on medium high. Add the noodles, stir to coat everything in the sauce, and heat through (just a few minutes)."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://budgetbytes.com/chicken-yakisoba"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-25T11:12:52.124Z"
}
