{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "47",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-01T10:07:37.306Z",
  "datePublished": "2017-08-31T14:51:03+00:00",
  "description": "Homemade English Muffins. Nothing can beat them straight off the griddle or gently toasted.  They are soft, slightly chewy &amp; perfect for breakfast or snacks. No oven is required &amp; they are so much nicer than store bought!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2017/08/vegan-english-muffins-2.jpg"
  ],
  "keywords": "bread, breakfast muffins, english muffin, yeast",
  "name": "Homemade English Muffins",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "196 kcal",
    "carbohydrateContent": "34 g",
    "fatContent": "3.9 g",
    "fiberContent": "1.6 g",
    "proteinContent": "5 g",
    "servingSize": "1 muffin",
    "sodiumContent": "370 mg",
    "sugarContent": "1.2 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "375g / 3 cup all purpose white flour (strong white flour in the UK)",
    "1/2 teaspoon salt",
    "2 teaspoons sugar",
    "2 teaspoons instant yeast (, sometimes called quick or fast action yeast)",
    "1 teaspoon baking soda",
    "30mls / 2 tablespoons refined coconut oil",
    "Approx 200 mls / 3/4 cup plus 2 tablespoons tepid water (, you might need a little more)",
    "some extra flour for kneading and rolling",
    "Optional cornmeal for dusting"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you have a stand mixer with a dough hook, add all ingredients (except the cornmeal) to the bowl and mix for around 7 - 10 minutes until the dough is smooth and elastic. My Kitchen Aid Pro suggests using setting 2 for dough. Once it starts coming together after a minute or two in the mixer, give it a little poke and add a drop or two more water if it feels dry, giving it a chance to mix in between additions, until it is a very slightly tacky to touch dough."
    },
    {
      "@type": "HowToStep",
      "text": "If you do not have a stand mixer, add all of the dry ingredients to a large bowl. (See recipe notes for bread machine advice)."
    },
    {
      "@type": "HowToStep",
      "text": "Pour in the water and liquid (but room temperature) oil then stir briefly to combine and absorb the dry flour. Add a little more water as required to make a very slightly tacky dough."
    },
    {
      "@type": "HowToStep",
      "text": "Turn out onto a lightly floured surface and knead for at least 10 minutes until the dough is completely smooth and elastic. If after a few minutes of kneading it feels sticky, add a tablespoon of flour at a time, kneading in between additions. It should be slightly tacky but not sticky."
    },
    {
      "@type": "HowToStep",
      "text": "When kneaded properly, if you put your hands either side of the ball of dough and squeeze inwards, it should bounce back slowly when you let go."
    },
    {
      "@type": "HowToStep",
      "text": "Once the dough is kneaded adequately and is smooth and elastic, place in a lightly oiled bowl and cover. Use a bowl cover, damp clean dish towel or cling wrap. Leave in a draft free area until it has doubled in size (around 1 hour although this will vary depending on how warm the environment is). You will get the best flavour by not rushing it so I advise just leaving it on the kitchen counter and not moving it somewhere really warm to speed it up."
    },
    {
      "@type": "HowToStep",
      "text": "Line a large baking sheet with parchment paper and sprinkle it with cornmeal or flour if you don't have cornmeal."
    },
    {
      "@type": "HowToStep",
      "text": "Once the dough has doubled in size, turn it out onto a lightly floured surface and roll it out with a rolling pin until it is about 1 inch thick. Make sure it is even all over."
    },
    {
      "@type": "HowToStep",
      "text": "Use a cookie cutter (about 3 inches in diameter is good) to cut rounds and place them on the prepared baking sheet. If you don't have a cookie cutter use the top of a glass or a mason jar lid. Be sure to cut carefully and get as many as you can out of the first batch of rolled dough because the muffins from the first batch are always slightly better than those made with the remaining dough."
    },
    {
      "@type": "HowToStep",
      "text": "When you have cut as many as you can, ball up the remaining dough as gently as you can and re-roll it then cut out the remaining muffins."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the tops of the muffins with more cornmeal (or flour) then cover and leave again until almost doubled in size. It won't take as long this time. Usually about 30 - 40 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "If you have a griddle, heat it to a medium low heat. I have an electric Cuisinart Griddler and set mine to 350°F. If you don’t have a griddle you can use a heavy frying pan or skillet instead."
    },
    {
      "@type": "HowToStep",
      "text": "When the griddle is to temperature, or when your skillet is preheated, place as many muffins as will fit comfortably (with sufficient room to turn them easily), VERY gently on the griddle. It’s important to be as gentle as possible because you don’t want to knock any of the air out of them."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for 5 -7 minutes until beautifully golden on the bottom, then VERY gently turn them over and cook for another 5- 7 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove and place on a cooling rack."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/homemade-english-muffins"
  ],
  "totalTime": "PT130M",
  "updatedAt": "2022-12-01T10:07:37.304Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/SjIurWtT.mp4",
    "description": "Homemade English Muffins. Nothing can beat them straight off the griddle or gently toasted.  They are soft, slightly chewy &amp; perfect for breakfast or snacks. No oven is required &amp; they are so much nicer than store bought!",
    "name": "Homemade English Muffins",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/SjIurWtT-720.jpg",
    "uploadDate": "2017-08-31T00:00:00.000Z"
  }
}
