{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-11-25T13:16:17.000Z",
  "datePublished": "2019-03-01T10:32:02+00:00",
  "description": "Everything you ever wanted to know about tempeh but were afraid to ask! Today we're covering the basics: what is tempeh, how to cook it, where to buy it, and even how to make it.",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2022/09/tempeh-2022-sq.jpg",
    "width": 1200
  },
  "keywords": "ferementation, soy",
  "name": "Homemade Tempeh",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "173 kcal",
    "carbohydrateContent": "12.1 g",
    "fatContent": "6 g",
    "fiberContent": "9 g",
    "proteinContent": "16.6 g",
    "saturatedFatContent": "0.8 g",
    "servingSize": "3 ounces",
    "sodiumContent": "7 mg"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Indonesian",
  "recipeIngredient": [
    "2 cups dried soybeans",
    "2 tablespoons rice vinegar",
    "1 packet tempeh starter (or 1 teaspoon if using tempeh starter harvested from a previous batch)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the beans into a large saucepan or bowl and cover them with several inches of water. Let the beans soak for about 12 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Split the beans in half and remove the hulls. To do this you can either massage the beans vigorously by hand, hit them with a potato masher, or arrange them on a towel-lined flat surface and roll them with a rolling pin."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the beans to a fine mesh colander and rinse them under high pressure water. The hulls should begin to settle to the bottom or be forced to the sides. Pick out as many of the hulls as you can."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the beans to a large saucepan and cover them with several inches of water."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pot over high heat and bring the water to a boil."
    },
    {
      "@type": "HowToStep",
      "text": "Lower the heat and allow the beans to boil for 1 hour. Skim any loose hulls from the surface of the water as they float there."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the beans into the mesh colander."
    },
    {
      "@type": "HowToStep",
      "text": "With the beans still in the colander, dry them gently with a hair-dryer on low power. Allow the beans to cool if they've heated up too much."
    },
    {
      "@type": "HowToStep",
      "text": "Once the beans are cool and dry to the touch, transfer them to a large mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Add the vinegar and mix well."
    },
    {
      "@type": "HowToStep",
      "text": "Add the starter and mix well. Stir for a few minutes to ensure even distribution of the starter."
    },
    {
      "@type": "HowToStep",
      "text": "Gather a gallon sized plastic zip bag and use a pin to poke holes, separated by about 1/2-inch, in both sides of the bag."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the beans to the bag. Set the bag on a plate and distribute the beans in a 1-inch thick layer. Fold the bag over the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Use a meat thermometer to poke a hole through the bag, into the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Place the beans in a warm (not hot) location, such as at the back of your oven with the light turned on."
    },
    {
      "@type": "HowToStep",
      "text": "Check the beans after 1-hour. The temperature needs to be between 85°F and 90°F. Move or make any adjustments if needed to raise or lower the temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Check the beans every few hours. After about 24 hours, the temperature may begin to climb and you may be able to remove the beans from the oven."
    },
    {
      "@type": "HowToStep",
      "text": "White mycelium will begin to grow on the beans. Continue checking the beans until they are completely embedded in a block of mold (1-4 days)."
    },
    {
      "@type": "HowToStep",
      "text": "Your tempeh is finished. Cook it right away, or seal and refrigerate for up to 7 days, or freeze for up to 3 months."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/tempeh"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-11-25T10:14:08.155Z"
}
