{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "31",
    "ratingValue": "4.68"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T01:35:03.635Z",
  "datePublished": "2014-07-07T12:16:33+00:00",
  "description": "It's easier than you can imagine to make your own vegan hot dogs! And they're so much healthier when you control the ingredients.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2014/07/homemade-veggie-dogs2.jpg"
  ],
  "keywords": "vegan hot dogs, veggie dogs",
  "name": "Homemade Veggie Dogs",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "115 kcal",
    "carbohydrateContent": "11.6 g",
    "fatContent": "1.4 g",
    "fiberContent": "2.5 g",
    "proteinContent": "15 g",
    "servingSize": "1 veggie dog",
    "sodiumContent": "116 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1/2 medium onion (coarsely chopped)",
    "3 cloves garlic",
    "3/4 cup cooked pinto beans (well-drained)",
    "1/2 cup plus 2 tablespoons water",
    "2 tablespoons coconut aminos or soy sauce",
    "1 tablespoon tomato paste",
    "2 teaspoons smoked paprika",
    "1 teaspoon ground coriander",
    "1 teaspoon ground mustard",
    "1/2 teaspoon white or black pepper",
    "1/4 teaspoon celery seed",
    "1/4 teaspoon mace",
    "1/8 teaspoon hickory smoked salt (optional but good)",
    "1 cup vital wheat gluten",
    "1/3 cup oatmeal (rolled or quick oats, uncooked)",
    "2 tablespoons nutritional yeast",
    "1 tablespoon ground flax seeds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put the onion and garlic into a food processor and pulse to chop finely. Heat a small non-stick skillet. Add onion and garlic and cook until onion is softened, about 3 minutes. Transfer onion mixture back to food processor."
    },
    {
      "@type": "HowToStep",
      "text": "Add the pinto beans, water, coconut aminos or soy sauce, tomato paste, and all seasonings to the food processor. Blend until it’s a thin paste."
    },
    {
      "@type": "HowToStep",
      "text": "Combine remaining ingredients (gluten, oatmeal, yeast, and flax) in a large mixing bowl. Add the contents of the food processor and stir until combined. If it seems that there’s not enough moisture, add another tablespoon or two of water. Knead in the bowl for about two minutes until a heavy gluten “dough” is formed."
    },
    {
      "@type": "HowToStep",
      "text": "Cut off 8 pieces of aluminum foil or parchment paper, each about 6 inches long. Divide the gluten into 8 equal pieces. Place a piece of foil or parchment on the counter. Roll a piece of gluten between the palms of your hands until it’s about the size and shape of a hot dog. Place it on the foil/paper and roll up. Roll the tube back and forth, pressing lightly with your hands, to give it an even shape, and then twist the ends closed. Repeat with the remaining gluten to form 8 veggie hot dogs."
    },
    {
      "@type": "HowToStep",
      "text": "Set up a steamer in a pot and add enough water to come just below the bottom of the steamer. Begin heating the water. Place all the veggie dogs in the steamer, cover, and steam for 45 minutes. Remove from heat and allow to cool slightly before unwrapping. Store the veggie dogs in a covered container in the refrigerator. Warm gently in a frying pan or microwave or on a grill before serving."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2014/07/homemade-veggie-dogs.html"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-02T01:35:03.634Z"
}
