{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "13",
    "ratingValue": "4.16"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-25T13:59:36.000Z",
  "datePublished": "2010-12-09T21:31:00+00:00",
  "description": "Make your own homemade pita bread with this fun, simple recipe. This bread can be used for sandwiches, wraps, salads, or even baked into chips!",
  "image": {
    "@type": "ImageObject",
    "height": 480,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2010/12/Pita20whole.jpg",
    "width": 640
  },
  "keywords": "flatbread, Homemade Bread, pita bread",
  "name": "Homemade Pita Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "187.89 kcal",
    "carbohydrateContent": "36.28 g",
    "fatContent": "2.33 g",
    "fiberContent": "2.06 g",
    "proteinContent": "5.34 g",
    "servingSize": "1 Serving",
    "sodiumContent": "296.38 mg"
  },
  "prepTime": "PT75M",
  "recipeCategory": "Side Dish",
  "recipeCuisine": "Middle-Eastern",
  "recipeIngredient": [
    "1 1/8 cup warm water ($0.00)",
    "1 1/2 tsp yeast ($0.15)",
    "1 1/2 tsp sugar ($0.03)",
    "1 Tbsp olive oil ($0.10)",
    "1/2 cup whole wheat flour ($0.08)",
    "2 1/2 cups all-purpose flour ($0.37)",
    "1 tsp salt ($0.05)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a small bowl combine the warm water, sugar and yeast. Stir to dissolve and let sit for 5 minutes or until a foam develops on top. Once a foam develops on top, add 1 Tbsp of olive oil."
    },
    {
      "@type": "HowToStep",
      "text": "In a large bowl, combine 1 cup of flour (half whole wheat in my case) and the salt. Stir them so they are evenly combined. Add the small bowl of liquid to the bowl with the flour. Stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Continue mixing in flour until it forms a loose ball that you can no longer stir with a spoon. Turn the ball of dough out onto a floured surface and continue to knead in more flour until a soft and pliable (but not sticky) ball forms. You should have used around 3 cups of flour total and kneaded the dough for at least 3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Place the ball of dough in an oiled bowl, cover loosely and let sit to rise for one hour or until doubled in size."
    },
    {
      "@type": "HowToStep",
      "text": "Punch down the risen dough and turn it out onto a floured surface. Stretch the dough into a log and cut it into 8 (or 6) equal sized pieces. Shape each piece of dough into a smooth ball and then roll it out into a flat, 6 inch diameter circle."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 500 degrees and let the dough circles rest as the oven comes up to temp. Place a damp cloth over the dough circles so they do not dry out. When the oven is hot enough, place the dough circles on a wire rack (a couple at a time) and place the rack in the oven. Watch the circles puff up as they bake. When the circle has completely inflated but not yet turned brown you can remove it from the oven and put in the next batch. If you let the pitas cook until golden brown they will be crispier and may retain the inflated shape as they cool."
    },
    {
      "@type": "HowToStep",
      "text": "As you remove the pitas from the oven, stack them on a plate and cover with a damp cloth. The trapped steam will soften them as they cool. Once completely cooled, store the pitas in an air tight container in the refrigerator."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/pita-bread"
  ],
  "totalTime": "PT95M",
  "updatedAt": "2022-11-25T13:33:15.826Z"
}
