{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "16",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-02T01:33:50.472Z",
  "datePublished": "2013-06-25T15:04:38+00:00",
  "description": "This honey sunflower bread is hearty, nutty, and just slightly sweet.",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Honey-Sunflower-Bread-front-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Honey-Sunflower-Bread-front-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Honey-Sunflower-Bread-front-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Honey-Sunflower-Bread-front-1-480x270.jpg"
  ],
  "name": "Honey Sunflower Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "200.58 kcal",
    "carbohydrateContent": "31.32 g",
    "fatContent": "6.28 g",
    "fiberContent": "3.03 g",
    "proteinContent": "6.09 g",
    "servingSize": "2 Slices",
    "sodiumContent": "301.83 mg"
  },
  "prepTime": "PT180M",
  "recipeIngredient": [
    "1 1/4 cups warm water ($0.00)",
    "2 Tbsp honey ($0.24)",
    "2 tsp instant or active dry yeast ($0.19)",
    "2 Tbsp olive oil ($0.32)",
    "1/2 cup raw sunflower seeds ($0.60)",
    "1 1/2 cups whole wheat flour ($0.38)",
    "1/2 Tbsp salt ($0.05)",
    "1 1/2 to 2 cups all-purpose flour ($0.14)",
    "1 large egg, optional ($0.17)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Dissolve the yeast and honey into the warm water and let it rest for five minutes to allow the yeast to activate."
    },
    {
      "@type": "HowToStep",
      "text": "While the yeast is activating, roughly chop the sunflower seeds with either a knife or a mini-food processor. Add the chopped sunflower seeds to a large bowl with one cup of the whole wheat flour and the salt. Stir until evenly combined."
    },
    {
      "@type": "HowToStep",
      "text": "By this point the yeast should be foamy and frothy in the water. Add the olive oil to the yeast water and then pour it all into the bowl with the flour and sunflower seeds. Stir until the mixture is fairly smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Add the last half cup of whole wheat flour and stir until it is incorporated. Add a half cup of all-purpose flour and stir until it forms a loose, shaggy ball of dough."
    },
    {
      "@type": "HowToStep",
      "text": "Take the dough out of the bowl and place it onto a floured work surface. Knead the dough for five minutes, slowly adding more all-purpose flour as you go. After five minutes of kneading, the dough should be soft, supple, not sticky, and will spring back when poked gently with your finger. You should use between 1 1/2 to 2 cups of all-purpose flour total (including what was added when it was in the bowl)."
    },
    {
      "@type": "HowToStep",
      "text": "Place the dough back into the mixing bowl, cover loosely with plastic wrap or a damp towel, and let it rise for 1 to 1.5 hours, or until double in size."
    },
    {
      "@type": "HowToStep",
      "text": "Once it is double in size, deflate it, divide it in half, and form it into two balls. Place the balls on a large baking sheet covered with parchment paper, cover with a damp towel, and allow them to rise until double again (1 to 1.5 hrs)."
    },
    {
      "@type": "HowToStep",
      "text": "Begin preheating the oven to 400 degrees. Separate the egg white and yolk. Whisk a tablespoon of water into the egg white and then brush it over the tops of each loaf. The egg wash is optional, but it will create a nice deep brown, glossy crust."
    },
    {
      "@type": "HowToStep",
      "text": "Take a sharp knife (a micro-serrated bread knife or a very sharp chef's knife) and carefully slice an \"X\" in the top of each loaf. Be sure to use no downward pressure while doing this, just carefully drag the knife horizontally or you'll deflate the loaf. Bake the loaves in the preheated 400 degree oven for 25 minutes, or until golden brown on top. Allow the loaves to cool before slicing."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://budgetbytes.com/honey-sunflower-bread"
  ],
  "totalTime": "PT205M",
  "updatedAt": "2022-12-02T01:33:50.471Z"
}
