{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "22",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-25T13:16:17.000Z",
  "datePublished": "2022-11-09T08:29:48+00:00",
  "description": "This homemade Honey Wheat Bread is soft, fluffy, flavorful, and perfect for breakfast toast and all of your favorite sandwiches.",
  "image": {
    "@type": "ImageObject",
    "height": 900,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2022/10/Honey-Wheat-Bread-butter.jpg",
    "width": 1200
  },
  "keywords": "Homemade Bread, Honey Wheat, Wheat Bread",
  "name": "Honey Wheat Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "156 kcal",
    "carbohydrateContent": "26 g",
    "fatContent": "4 g",
    "fiberContent": "3 g",
    "proteinContent": "4 g",
    "servingSize": "1 slice",
    "sodiumContent": "294 mg"
  },
  "prepTime": "PT150M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1.25 cup warm water ($0)",
    "2 tsp active dry yeast or instant yeast ($0.34)",
    "2 Tbsp honey ($0.50)",
    "3 Tbsp olive oil ($0.36)",
    "1.5 cups whole wheat flour* ($0.57)",
    "1.5 cups all-purpose flour* ($0.38)",
    "1/2 Tbsp salt ($0.05)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Stir the yeast and 1 Tbsp of the honey into the warm water until dissolved, then set it aside for about five minutes to allow the yeast to activate. A thick layer of foam should develop on the surface of the water."
    },
    {
      "@type": "HowToStep",
      "text": "While waiting for the yeast to bloom, stir together 1 cup of the whole wheat flour with the salt."
    },
    {
      "@type": "HowToStep",
      "text": "Once the yeast is foamy, add the rest of the honey (1 Tbsp) and the olive oil and stir to combine. Pour the yeast water into the bowl with the flour and salt, then stir until combined. Add 1/2 cup more of whole wheat flour and stir until combined again."
    },
    {
      "@type": "HowToStep",
      "text": "Now start adding all-purpose flour, 1/2 cup at a time, until you can no longer stir the dough with a spoon. At that point, turn the dough out onto a floured surface and begin to knead all-purpose flour into the dough, a little at a time."
    },
    {
      "@type": "HowToStep",
      "text": "Knead the dough for about five minutes, slowly adding flour as you knead, or until the dough no longer sticks to your hands, but is still fairly pliable. I used 1.5 cups all-purpose flour total, but the total flour amount will vary with the type of flour used and relative humidity in the room."
    },
    {
      "@type": "HowToStep",
      "text": "Place the kneaded dough back into the mixing bowl and cover with a cloth. Let the dough rise at room temperature for about an hour, or until it has doubled in size."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly coat a bread pan with oil. Punch the dough down to deflate, then take the dough out of the bowl. Shape the dough into a log about the same length of your bread pan."
    },
    {
      "@type": "HowToStep",
      "text": "Place the shaped dough in the bread pan and let it rise for anohter hour, or until it has risen about 2-inches above the edges of the bread pan."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375oF. Once fully preheated, add the risen bread and bake for 30 minutes, or until the bread is deeply golden brown and it sounds hollow when tapped."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the bread from the oven and let it cool just a few minutes (to make it easier to handle), then carefully remove the bread from the pan to fully cool."
    },
    {
      "@type": "HowToStep",
      "text": "Once cool, slice and serve your delicious homemade bread!"
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://budgetbytes.com/honey-wheat-sandwich-bread"
  ],
  "totalTime": "PT180M",
  "updatedAt": "2022-11-25T11:13:46.379Z"
}
