{
  "@type": "Recipe",
  "cookTime": "PT5M",
  "createdAt": "2022-11-24T14:32:14.225Z",
  "datePublished": "2022-06-15",
  "description": "Put a fun twist on classic tiramisu using leftover hot cross buns with this creative use of excess Easter treats.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2104-hot-cross-bun-misu:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Tiramisu,Strawberry,Chocolate,Autumn,Easter leftovers,Apr 2021,Easter,Hot cross buns",
  "name": "Hot Cross Bun-Misu Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "11184",
  "recipeIngredient": [
    "0.33 cup marsala",
    "1.5 cups espresso coffee, cooled",
    "1 tsp gelatine powder",
    "300 thickened cream",
    "0.75 cup caster sugar",
    "250g mascarpone",
    "6 leftover Indulgent Mocha Hot Cross Buns with CADBURY® OLD GOLD® dark chocolate, cut horizontally",
    "2 tsp cocoa powder",
    "0.25 cup chocolate sauce",
    "strawberries, chopped (to serve)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Grease a 22cm round springform pan. Line base and side with baking paper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Combine marsala and 1 cup coffee in a medium bowl. Place 1 tbs boiling water in a small bowl and sprinkle over gelatine, stirring until dissolved. Set aside for 3 minutes to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Using an electric mixer, beat cream and 1/4 cup sugar in a large bowl until firm peaks form. Reduce speed to low and beat in gelatine mixture. Fold in mascarpone until just combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place bun bases in pan, trimming to fit (don’t worry if there are a few gaps). Brush generously with coffee mixture to moisten (see Tip). Top with half of the cream mixture. Working with centre bun slices, dip in coffee mixture for 2 seconds before layering in pan, trimming to fit. Top with remaining cream mixture. Dust with cocoa. Brush cut-sides of bun tops with coffee mixture and place cut-sides down in pan, trimming to fit, pressing slightly into cocoa. Refrigerate, covered, for 3 hours or until set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, stir remaining coffee and sugar in a small saucepan over medium heat for 2 minutes or until sugar has dissolved. Increase heat to high and bring to the boil. Boil for 2 minutes or until syrup has thickened slightly. Remove pan from heat and allow to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove bun-misu from pan and transfer to a plate. Top with strawberries and serve drizzled with coffee syrup. Tip: Depending on how stale your hot cross buns are, you may need to use slightly more or less coffee mixture."
    }
  ],
  "recipeNameId": "hot-cross-bun-misu",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/hot-cross-bun-misu"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-11-24T14:32:14.224Z",
  "url": "https://www.woolworths.com.au/shop/recipes/hot-cross-bun-misu"
}
