{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Sponsored"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-11-22T00:14:41.478Z",
  "datePublished": "2022-09-26",
  "description": "Put a twist on the classic chocolate mud cake with this hot chocolate cake topped with gooey chocolate fudge sauce and toasted marshmallows.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2107-hot-chocolate-cake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Chocolate cake,Microwave,Chocolate",
  "name": "Hot Chocolate Cake Recipe | Woolworths",
  "prepTime": "PT90M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "11796",
  "recipeIngredient": [
    "250g White wWngs selfraising flour, sifted",
    "250g CSR caster sugar",
    "200g dark chocolate",
    "250g unsalted butter",
    "4 eggs, whisked",
    "1 tsp vanilla paste",
    "50g cocoa powder, sifted",
    "1 pinch sea salt",
    "250ml butter milk",
    "300g CSR caster sugar",
    "5 150 g egg white",
    "350g unsalted butter, diced",
    "50g cocoa powder, sifted (plus extra to dust)",
    "50g CSR brown Sugar",
    "50g dark Chocolate",
    "125ml cream, thick",
    "25g unsalted butter",
    "storebought white marshmallows"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 160°C FanForced. Line a 20cm (8 inch) round cake tin with a baking paper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the Mud Cake, place the chocolate and butter in a mediumsized heatproof bowl. Place in the microwave and melt, stirring frequently, until smooth. Set aside until completely cool, then whisk in the eggs and vanilla paste until completely combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "In a separate large bowl, combine the selfraising flour, cocoa powder, caster sugar and sea salt. Pour in the chocolate mixture, mix to combine, then mix in the buttermilk. Pour mixture into the lined tin, then place in the oven and bake for 60 minutes or until the skewer inserted in the centre comes out a little moist, not completely dry. Allow to cool completely in the tin."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, for the buttercream, halffill a medium saucepan with water. Place over a medium heat and bring to a simmer. Place the egg whites and sugar in a medium-sized stainless steel bowl and whisk until combined. Place the bowl over the saucepan of simmering water and whisk constantly until the sugar has dissolved and the mixture reaches 75°C, scraping down the sides of the bowl regularly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Once at temperature, remove from the heat. Working carefully, transfer the hot egg white mixture to the bowl of a stand mixer fitted with a whisk attachment. Whisk on medium speed 510minutes until cooled to body temperature."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "With the mixer running on medium, gradually add in the butter, a cube at a time, ensuring that the butter is combined before each addition, then add the cocoa powder and vanilla. Continue whisking for 510 minutes until smooth and glossy. Place in the fridge for 20minutes to allow to firm up"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the chocolate fudge sauce, place all ingredients into a small saucepan over medium heat and stir until melted and smooth. Allow to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the toasted marshmallows, toast with a kitchen blowtorch, or place under the grill for a few minutes until charred (make sure you watch the marshmallows closely!)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To assemble, remove the cooled cake from the tin and trim the top to make it even, then flip the cake so the base becomes the top. Place on a serving plate and swirl with cocoa buttercream, dust with extra cocoa powder, drizzle over chocolate fudge sauce and top with toasted marshmallows."
    }
  ],
  "recipeNameId": "hot-chocolate-cake",
  "recipeYield": "10",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/hot-chocolate-cake"
  ],
  "totalTime": "PT160M",
  "updatedAt": "2022-11-22T00:14:41.476Z",
  "url": "https://www.woolworths.com.au/shop/recipes/hot-chocolate-cake"
}
