{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT120M",
  "createdAt": "2022-12-03T16:43:51.766Z",
  "datePublished": "2020-04-27T15:21:10+00:00",
  "description": "Learn how to soak and cook dried garbanzo beans and black beans in three easy steps.",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2017/08/How-to-Cook-Raw-Chickpeas-Black-Beans.jpg"
  ],
  "keywords": "black beans, dried beans, garbanzo beans",
  "name": "How to Cook Dried Garbanzo Beans & Black Beans",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "458 kcal",
    "carbohydrateContent": "81 g",
    "fatContent": "4 g",
    "fiberContent": "21 g",
    "proteinContent": "28 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 cup",
    "sodiumContent": "1435 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 lb dried chickpeas/garbanzo beans",
    "1 lb dried black beans",
    "12 cups water",
    "1 tablespoon sea salt (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "FOR THE CHICKPEAS"
    },
    {
      "@type": "HowToStep",
      "text": "Long Soak Chickpeas"
    },
    {
      "@type": "HowToStep",
      "text": "Rinse the chickpeas in a colander, put in a stock pot and cover with 3 to 4 inches (7 to 10 cm) of water, let sit for 8 hours. The beans will expand and become softer."
    },
    {
      "@type": "HowToStep",
      "text": "Short Soak Chickpeas"
    },
    {
      "@type": "HowToStep",
      "text": "Rinse the chickpeas in a colander, put in a stock pot and cover with 3 to 4 inches (7 to 10 cm) of water and bring to a boil. Boil for 10 minutes and remove the pot from the heat, let the chickpeas soak for 2 hours. The beans will expand and become softer."
    },
    {
      "@type": "HowToStep",
      "text": "After They Soak"
    },
    {
      "@type": "HowToStep",
      "text": "In a colander, drain the water and rinse the beans. Place in a stock pot and cover with 12 cups of fresh water and bring to a boil. When the water begins to boil, reduce the heat to simmer, or a low boil, and cook for 90 minutes, or until the chickpeas are cooked to your desired texture. For a firm and chewy bean cook uncovered and for a creamier softer bean, cover, leaving a bit of a gap to allow steam to escape. Add more boiling water to the pot as needed. If you want your beans to have a salty flavor, add the salt during the last 15 minutes of cooking. If you add it earlier you could end up with tough beans."
    },
    {
      "@type": "HowToStep",
      "text": "When the beans are finished cooking drain and rinse them in a colander and let the excess water drip off of them."
    },
    {
      "@type": "HowToStep",
      "text": "FOR THE BLACK BEANS"
    },
    {
      "@type": "HowToStep",
      "text": "For a Long Soak"
    },
    {
      "@type": "HowToStep",
      "text": "Rinse the beans in a colander and place in a stock pot. Cover with 3 to 4 inches (7 to 10 cm) of water and let soak for 6 hours. Don’t let them soak for too long or the beans will split. The beans will expand and become soft."
    },
    {
      "@type": "HowToStep",
      "text": "For a Short Soak"
    },
    {
      "@type": "HowToStep",
      "text": "Rinse the beans in a colander and place in a stock pot. Cover with 3 to 4 inches (7 to 10 cm) of water and bring to a boil. Boil for 5 minutes and remove from the heat and let sit for 2 hours. The beans will expand and become soft."
    },
    {
      "@type": "HowToStep",
      "text": "After They Soak"
    },
    {
      "@type": "HowToStep",
      "text": "Drain and rinse the beans in a colander, rinse the stock pot, and put the beans back in the pot. Cover the beans with 12 cups of water and bring to a boil. When the water is boiling reduce the heat and cook at a low boil for approximately 90 minutes to two hours, or until the beans are fully cooked. Stir the beans every 15 minutes and add more boiling water if necessary. The beans should be covered with water throughout the cooking time. SEE NOTE"
    },
    {
      "@type": "HowToStep",
      "text": "When the beans are finished cooking, drain and rinse them and let the excess water drip off."
    },
    {
      "@type": "HowToStep",
      "text": "Store both types of beans in an air tight container in the refrigerator for 3 to 5 days or in the freezer for up to 6 months."
    }
  ],
  "recipeYield": "5",
  "sameAs": [
    "https://veganosity.com/make-raw-garbanzo-black-beans-in-3-easy-steps"
  ],
  "totalTime": "PT605M",
  "updatedAt": "2022-12-03T16:43:51.765Z"
}
