{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 2,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-03T02:09:50.417Z",
  "creator": {
    "@type": "Person",
    "name": "Christine Gallary"
  },
  "dateCreated": "2014-11-12T10:30:00-05:00",
  "dateModified": "2019-11-14T20:27:39-05:00",
  "datePublished": "2014-11-12T10:30:00-05:00",
  "headline": "How To Grill a Spatchcocked Turkey",
  "HowtoTip": {
    "text": "Remember to start with a clean grill — after preheating the grill, scrub the hot grill grates with a grill brush or wadded piece of aluminum foil.As tempting it is to keep peeking at the turkey while it&#x27;s cooking, it&#x27;s best to keep the lid on as much as possible so the heat stays steady. You don&#x27;t want any heat escaping or risk extending the cooking time and running out of fuel before the turkey is cooked.Since grilled turkey isn&#x27;t cooked in a roasting pan, you won&#x27;t have any turkey drippings, so we recommend making gravy separately. Try our delicious Make-Ahead Gravy recipe."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F833f51796e4eec2e09c3016f9f92c9af50c6cf0f"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F833f51796e4eec2e09c3016f9f92c9af50c6cf0f"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F833f51796e4eec2e09c3016f9f92c9af50c6cf0f"
    }
  ],
  "keywords": [
    "anheuser busch thanksgiving",
    "butter",
    "Cooking Lessons from The Kitchn",
    "grilling",
    "How To",
    "Main Dish",
    "meat",
    "Meat Tutorials",
    "poultry",
    "recipe",
    "thanksgiving",
    "purpose:search",
    "platform:search",
    "course:main dish",
    "dishtype:meat dish",
    "dishtype:poultry dish",
    "mainingredients:poultry",
    "method:grilled",
    "diet:low-calorie",
    "diet:under 400 calories",
    "diet:under 500 calories",
    "updated:2019-11-14"
  ],
  "name": "How To Grill a Spatchcocked Turkey",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "386 cal",
    "carbohydrateContent": "0.3 g",
    "cholesterolContent": "0 mg",
    "fatContent": "18.2 g",
    "fiberContent": "0 g",
    "proteinContent": "52.3 g",
    "saturatedFatContent": "6.4 g",
    "servingSize": "Serves 20",
    "sodiumContent": "271.1 mg",
    "sugarContent": "0.2 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 (14-to-16 pound) thawed turkey",
    "8 tablespoons unsalted butter"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Spatchcock the turkey: Follow our instructions for How To Spatchcock a Turkey. Then wet brine, dry-brine, or season the spatchcocked turkey. (If wet- or dry-brining, you can do this up to 3 days ahead of cooking.)"
    },
    {
      "@type": "HowToStep",
      "text": "Let the turkey warm to room temperature: Let the spatchcocked turkey sit at room temperature on the counter while you prepare the grill to take the chill off from refrigerating."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the grill: If you have 3 burners on your gas grill, light the side burners to medium and keep the middle burner off. (If your grill only has two burners, light them both to medium low.) For a charcoal grill, divide the lit coals in half and place a pile on each side of the grill, leaving the middle empty. Preheat to between 300°F and 325°F degrees, and maintain this temperature throughout cooking."
    },
    {
      "@type": "HowToStep",
      "text": "Place butter under the skin of the turkey: Cut 4 tablespoons of the butter into small cubes and tuck the butter pieces under the skin of the turkey over the breast and legs."
    },
    {
      "@type": "HowToStep",
      "text": "Grill the turkey breast first: When the grill has preheated, place the breast skin-side up over the back half of the unlit burner on the gas grill. (If your grill only has two burners, just place the breast on one half of the grill.) For a charcoal grill, place the breast over the middle of the grill where there are no coals, making sure to leave enough space in the middle for the legs. Cover the grill and cook for 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "After 20 minutes, begin grilling the turkey legs: After the breast has been cooking for 20 minutes, place the legs in front of the breast over the unlit burner on the gas grill. (If your grill only has two burners, place the legs on the other half of the grill.) For a charcoal grill, place the legs in the middle of the grill where there are no coals. Cover the grill and continue cooking."
    },
    {
      "@type": "HowToStep",
      "text": "Baste the skin as the turkey cooks: After about 40 minutes of total grilling time, the skin should be starting to turn brown. Melt the remaining 4 tablespoons of unsalted butter and brush the skin with it. Continue to grill, covered, basting every 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Check the temperature: Check the temperature of both the breast and the legs occasionally throughout cooking to gauge how quickly the turkey is cooking. After 1 hour and 20 minutes of total cooking time from when the breast was placed on the grill, the turkey should be close to finishing. It is done when it registers 165°F in the thickest part of the leg (not touching bone) and in the thickest part of the breast (not touching bone). Continue grilling and basting as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the grill: As each piece is ready, use 2 pairs of tongs (or 1 pair tongs and a flat spatula) to transfer it to a clean serving platter, roasting pan, or rimmed baking sheet. Cover loosely with a piece of foil."
    },
    {
      "@type": "HowToStep",
      "text": "Rest the turkey: Let the turkey rest in a warm place for at least 30 minutes before carving and serving."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-grill-a-spatchcocked-turkey-cooking-lessons-from-the-kitchn-212710"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F833f51796e4eec2e09c3016f9f92c9af50c6cf0f",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-03T02:09:50.415Z",
  "url": "https://www.thekitchn.com/how-to-grill-a-spatchcocked-turkey-cooking-lessons-from-the-kitchn-212710"
}
