{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "28",
    "ratingValue": "4.58"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-02T07:35:43.378Z",
  "datePublished": "2017-03-16T13:57:54+00:00",
  "description": "A step-by-step guide to aquafaba! What is it? How do you whip it? How do you use it? What recipes can I use it in? All of your questions are answered here!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/03/How-to-Make-Aquafaba-Minimalist-Baker-Recipes.png"
  ],
  "keywords": "aquafaba",
  "name": "How to Make Aquafaba",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "15 kcal",
    "carbohydrateContent": "3 g",
    "fatContent": "0.2 g",
    "proteinContent": "0.8 g",
    "servingSize": "1 serving",
    "sodiumContent": "2.7 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT6M",
  "recipeCategory": "Egg Replacer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 15-ounce can chickpeas (drained LIQUID RESERVED- that's the aquafaba // beans set aside for another use)",
    "1/8 tsp cream of tartar (optional // the trick to a better whip!)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Drain your chickpeas and reserve the liquid - then you have aquafaba! Place in a large mixing bowl to whip!"
    },
    {
      "@type": "HowToStep",
      "text": "The trick to whipping aquafaba is using a hand or stand mixer! Whisking it by hand takes quite a long time and does not produce as good of results. Another trick is to throw in 1/8-1/4 tsp cream of tartar, which causes the aquafaba to whip up much easier, faster, and makes the peaks firmer."
    },
    {
      "@type": "HowToStep",
      "text": "Whip your aquafaba to desired thickness. It generally requires 3-6 minutes to get to semi-firm peaks, depending on your equipment and how thick your aquafaba was to begin with. So take your time and don't be discouraged if it takes some time to reach stiff peaks."
    },
    {
      "@type": "HowToStep",
      "text": "Aquafaba can be used in a number of ways: 1) It can be added to recipes UNWHIPPED as an egg binder, such as in these Vegan Gluten Free Sugar Cookies. 2) It can be whipped into semi-soft peaks and added to recipes as a whipped egg white substitute, such as these Vegan Gluten Free Waffles! 3) It can be whipped into stiff peaks and made into things like Easy Vegan Macaroons and meringues (recipe to come!). It can also be used to make Vegan Mayo!"
    },
    {
      "@type": "HowToStep",
      "text": "Because aquafaba is such a recent discovery - only in the last few years - there are tons of uses that are yet to be explored yet! So be creative, use these methods and recipes as a starter guide, and go from there! If you discover new creations, share them down below in the comments!"
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://minimalistbaker.com/a-guide-to-aquafaba"
  ],
  "totalTime": "PT6M",
  "updatedAt": "2022-12-02T07:35:43.378Z"
}
