{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T23:10:17.854Z",
  "datePublished": "2018-08-21T11:44:25+00:00",
  "description": "A step-by-step visual tutorial on how to roast vegetables of all kinds (with and without oil), plus 6 delicious ways to put them to use!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/08/How-to-Roast-Vegetables-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/08/How-to-Roast-Vegetables-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/08/How-to-Roast-Vegetables-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/08/How-to-Roast-Vegetables-SQUARE-480x270.jpg"
  ],
  "keywords": "roasted vegetables",
  "name": "How to Roast Vegetables!",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "87 kcal",
    "carbohydrateContent": "15.3 g",
    "fatContent": "2.2 g",
    "fiberContent": "4.2 g",
    "proteinContent": "3.8 g",
    "saturatedFatContent": "0.3 g",
    "servingSize": "1 servings",
    "sodiumContent": "66 mg",
    "sugarContent": "4.6 g",
    "unsaturatedFatContent": "1.54 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Side Dish",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 medium sweet potato (well rinsed, skin on, sliced into 1/4-inch rounds)",
    "1 large beet (well rinsed, skin on, sliced into 1/4-inch rounds)",
    "2 large carrots (well rinsed, peeling optional, thinly sliced on a slant)",
    "1 bulb garlic (cloves removed and separated, peeling optional)",
    "1 small red or white onion (skin removed, sliced into thin wedges from top to bottom)",
    "1 small head cauliflower (cut into large bite-sizes pieces)",
    "1 small head broccoli (cut into large bite-sizes pieces)",
    "Any other seasonal vegetables you have on hand (well rinsed, peeling optional, sliced in bite-size pieces)",
    "1-2 Tbsp neutral oil",
    "Sea salt to taste",
    "Other seasonings as desired*",
    "Kale Salad (similar to video)",
    "Pasta Salad (similar to video)",
    "Beet Hummus (similar to video)",
    "Grain Bowl (similar to video)",
    "Carrot Smoothie (similar to video)",
    "Soup (similar to video)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and prepare 1-2 large baking sheets (depending on how many vegetables you're roasting) with parchment paper or a non-stick sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Follow the tips above to prepare vegetables for roasting by rinsing as needed, peeling as desired, and slicing/piecing into bite-size pieces. Peeling the garlic is optional - it can be roasted peeled OR with the skin on."
    },
    {
      "@type": "HowToStep",
      "text": "Add vegetables to the same baking pans according to their required cook time. Root vegetables (beets, carrots, potatoes, etc.) generally tend to take longer (up to 40 minutes), so I like to group them together so they finish baking at the same time.Cruciferous vegetables (like cauliflower, broccoli, and cabbage), as well as garlic and onion don't tend to require as much time to cook (~25 minutes) so we recommend grouping them together on a separate pan so they finish baking at the same time."
    },
    {
      "@type": "HowToStep",
      "text": "Once on the pan, drizzle with a little oil to coat (see this method for oil-free!), a pinch of salt, and desired seasonings of choice. We prefer a heavy coating of curry powder. NOTE: However, depending on how you intend to use the vegetables, you may choose not to season. For instance, if you plan to freeze your roasted carrots or sweet potatoes and then add them to smoothies, maybe just add a little salt and omit any further seasoning."
    },
    {
      "@type": "HowToStep",
      "text": "Rub the oil and seasonings of choice into the vegetables and arrange into even layers so there isn't much or any overlap. Then bake until golden brown and tender (anywhere from 20-30 minutes for cruciferous vegetables, onions, and garlic, and anywhere from 25-40 minutes for root vegetables)."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from oven and enjoy immediately on things like salads, bowls, in pasta salads and more! See the video below for inspiration. I like to freeze my roasted (or even steamed) carrots and sweet potatoes to add to smoothies throughout the week. My favorite way to use beets is blended into hummus. And roasted broccoli and cauliflower are perfect for grain bowls, pasta salads, and more."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy when fresh, or store leftovers covered in the refrigerator up to 4-5 days. Reheat in a cast-iron skillet over medium heat, or in a 375 degree F (190 C) oven until hot.You can also freeze up to 1 month, but it's usually best to add these frozen roasted vegetables to things like smoothies, stews, and vegetable broth where their texture will be masked."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/how-to-roast-vegetables"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-03T19:22:47.905Z"
}
