{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 5,
    "ratingValue": 4.8
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-02T12:49:32.571Z",
  "creator": {
    "@type": "Person",
    "name": "Faith Durand"
  },
  "dateCreated": "2014-02-12T10:00:00-05:00",
  "dateModified": "2022-04-18T11:15:58-04:00",
  "datePublished": "2014-02-12T10:00:00-05:00",
  "headline": "How To Make Panna Cotta",
  "HowtoTip": {
    "text": "Why I prefer half and half: I usually prefer to use half and half as a base for panna cotta, instead of milk and cream, because the milk and cream in half and half has been homogenized. This means that the panna cotta won&#x27;t separate into layers of lighter and heavier fat levels, as often happens when using milk and cream. I don&#x27;t call for it in this tutorial because half and half seems to be a predominantly American product, and we cater to readers from all over the world. But I wanted to note my preference for it.Milk, cream, and alternative dairies: However, you can use any combination of milk, cream, coconut milk, soy milk, almond milk — really any creamy liquid — to make panna cotta. But the less fat in the panna cotta, the softer it will be. A panna cotta made with all soy milk, for instance, will set very softly. I wouldn&#x27;t suggest trying to unmold it unless the proportion of gelatin was increased.Fun with flavors: If you want to play with the flavors, try scraping a vanilla bean into the warmed milk, instead of using extract. Or add lemon or almond extracts, or stir in a handful of chopped chocolate at the very end for a straciatella effect. You can substitute espresso or pureed fruit for some of the milk. Just a few ideas — the possibilities are endless!Troubleshooting Panna CottaThe panna cotta is still liquid! Perhaps the gelatin didn&#x27;t melt all the way, or you accidentally boiled the mixture. (Boiling destroys gelatin&#x27;s thickening power.) It may also have not set long enough.My panna cotta has two layers! See my note above about milk and cream. If you are using non-homogenized milk, as I did in this tutorial, this is especially likely to happen. I don&#x27;t find that it really affects the eating experience, but to reliably avoid this, use half and half instead of milk and cream."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F7ed63c9c6146cde6ea5a4d801cd702d79792670d"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F7ed63c9c6146cde6ea5a4d801cd702d79792670d"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F7ed63c9c6146cde6ea5a4d801cd702d79792670d"
    }
  ],
  "keywords": [
    "Cooking Lessons from The Kitchn",
    "dairy",
    "dessert",
    "easter",
    "easy",
    "Gluten-Free",
    "How To",
    "Keeps Well",
    "Make Ahead",
    "Party Food",
    "recipe",
    "stovetop",
    "sweets",
    "Valentine's Day",
    "video",
    "team:food",
    "purpose:search",
    "platform:search",
    "course:dessert",
    "dishtype:sweets",
    "method:stovetop",
    "diet:under 500 calories",
    "diet:low-calorie",
    "diet:under 400 calories",
    "diet:gluten-free",
    "diet:under 300 calories",
    "updated:2022-04-18"
  ],
  "name": "How To Make Panna Cotta",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "229 cal",
    "carbohydrateContent": "12.1 g",
    "cholesterolContent": "0 mg",
    "fatContent": "19.1 g",
    "fiberContent": "0 g",
    "proteinContent": "3.1 g",
    "saturatedFatContent": "11.2 g",
    "servingSize": "Serves 8",
    "sodiumContent": "75.6 mg",
    "sugarContent": "11.9 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dessert",
  "recipeCuisine": [],
  "recipeIngredient": [
    "Cooking spray",
    "1 1/2 cups whole milk (see Ingredient Notes)",
    "3 teaspoons powdered gelatin",
    "1/3 cup sugar",
    "1 1/2 cups light or heavy cream",
    "1 teaspoon pure vanilla extract",
    "Pinch salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Lightly grease the ramekins: Spray the ramekins with cooking spray, then use a paper towel to wipe out most of the oil, leaving only a light residue."
    },
    {
      "@type": "HowToStep",
      "text": "Bloom the gelatin: Pour the milk into the saucepan and sprinkle the powdered gelatin evenly over top. Let soften for 5 minutes or until the surface of the milk is wrinkled and the gelatin grains look wet and slightly dissolved."
    },
    {
      "@type": "HowToStep",
      "text": "Dissolve the gelatin over low heat: Set the saucepan over low heat and warm the milk gently, stirring or whisking frequently. The milk should never boil or simmer; if you see steam, remove the pot from the stove and let it cool down. The milk should get hot, but not so hot that you can't leave your finger in the pot for a few seconds. The gelatin will dissolve quickly as the milk warms; it melts at body temperature so this step should go quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Check to make sure the gelatin is dissolved: After about 2 minutes of warming, rub a bit of the milk between your fingers to make sure it's smooth. Or dip a spoon in the milk and check the back for distinct grains of gelatin."
    },
    {
      "@type": "HowToStep",
      "text": "Dissolve the sugar: Stir the sugar into the milk and continue warming until it dissolves as well. It shouldn't take more than 5 minutes total to dissolve both the gelatin and sugar. Again, never let the mixture boil."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk in the cream and flavorings: Remove the saucepan from the heat. Whisk in the cream, vanilla, and a pinch of salt."
    },
    {
      "@type": "HowToStep",
      "text": "Pour into the ramekins and chill: Divide the mixture evenly between the prepared ramekins and put in the refrigerator to chill. If serving straight from the cups, without unmolding, chill for 1 to 2 hours. If you want to unmold the panna cotta, chill for at least 4 hours or overnight."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare to unmold: Fill a large bowl partway with warm to hot water. Wipe a dessert plate with a damp paper towel (a damp plate lets you reposition the panna cotta more easily if it doesn't fall in the right spot)."
    },
    {
      "@type": "HowToStep",
      "text": "Release the panna cotta edge from the cup: Run a thin knife carefully around the sides of a ramekin. Don't slide the knife all the way into the cup; just release the top edge of the pudding from the edge of the cup. Dip the ramekin in the warm water up to its rim, and hold it there for about 3 seconds."
    },
    {
      "@type": "HowToStep",
      "text": "Unmold on a plate: Invert the ramekin over the plate and shake gently to help the panna cotta fall out, or press gently on one side to help nudge it out. It should fall out on the plate easily. (If it does not, return to the warm water bath in increments of 2 seconds.) Reposition on the plate if desired. Serve immediately, or refrigerate, lightly covered, for up to 5 days. The gelatin gets stronger as it sits, so this will be a bit rubbery by days 4 or 5, but you can mitigate this by letting the panna cotta sit at room temperature for about half an hour before serving."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-make-panna-cotta-cooking-lessons-from-the-kitchn-200070"
  ],
  "suitableforDiet": "https://schema.org/GlutenFreeDiet,https://schema.org/LowCalorieDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F7ed63c9c6146cde6ea5a4d801cd702d79792670d",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-02T12:49:32.569Z",
  "url": "https://www.thekitchn.com/how-to-make-panna-cotta-cooking-lessons-from-the-kitchn-200070"
}
