{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "createdAt": "2022-12-02T00:10:03.381Z",
  "datePublished": "2014-06-12T12:59:07+00:00",
  "description": "Homemade almond milk has a shorter shelf life than the store bought stuff. I've read that it will last anywhere from 3-7 days, but in my experience 7 is pushing it, so I'd err on the side of caution and use it up within 3-5 days. Blanched almonds are totally not necessary, I just happened to have some on hand. There is a lot of valuable nutrition in almond skins, so I would have preferred them with their skins on.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2014/06/img_3377.jpg"
  ],
  "name": "how to make your own almond milk",
  "recipeIngredient": [
    "1 cup whole almonds",
    "3-4 cups cold water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the almonds in a jar or glass bowl and cover with water. Place in the fridge to soak overnight, or for at least 8 hours."
    },
    {
      "@type": "HowToStep",
      "text": "When you're ready to milk your almonds, drain and rinse well."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare your straining setup by setting a mesh strainer into a large jug or bowl, and then lining with a double layer of cheese cloth, or with a nut milk bag if you're fancy like that."
    },
    {
      "@type": "HowToStep",
      "text": "Place soaked almonds into the jar of a blender with 3-4 cups of cold water. How much water you use depends on how creamy you want your almond milk, and the capacity of your blender (you can always add more water to the milk after straining if your blender is small). I prefer 4 cups of water."
    },
    {
      "@type": "HowToStep",
      "text": "Blend on high speed for 2 minutes, then carefully pour the mixture into the prepared strainer."
    },
    {
      "@type": "HowToStep",
      "text": "Wait a minute for the liquid to pass through, then get down to business squeezing as much liquid as you can from the almond meal."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the liquid into a clean glass jar and store in the fridge. Reserve the almond pulp for later. Now you've made your own almond milk. Yay!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://heynutritionlady.com/how-to-make-your-own-almond-milk"
  ],
  "updatedAt": "2022-12-02T00:10:03.381Z"
}
