{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 4,
    "ratingValue": 4
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-06T09:26:57.135Z",
  "creator": {
    "@type": "Person",
    "name": "Faith Durand"
  },
  "dateCreated": "2012-06-21T14:00:00-04:00",
  "dateModified": "2020-06-14T17:00:00-04:00",
  "datePublished": "2012-06-21T14:00:00-04:00",
  "description": "Here are some thoughts, tips, and directions to help you turn your side salad into the most delicious part of the meal. ",
  "headline": "How To Make the Perfect Simple Salad",
  "HowtoTip": {
    "text": "More good mix-ins for a quick salad: Dried fruit, nuts, shaved zucchini or squash, cooked eggplant cubes, all sorts of cheese."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2Ffd5959ba4783a282a66470375dfeb4db29fb3d50"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Ffd5959ba4783a282a66470375dfeb4db29fb3d50"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Ffd5959ba4783a282a66470375dfeb4db29fb3d50"
    }
  ],
  "keywords": [
    "butter",
    "Cooking Lessons from The Kitchn",
    "How To",
    "recipe",
    "salad",
    "Side Dish",
    "vegetarian",
    "Gluten-Free",
    "vegan",
    "greens",
    "pantry",
    "vegetables",
    "dinner",
    "team:food",
    "purpose:search",
    "platform:search",
    "course:side dish",
    "dishtype:green salad",
    "dishtype:salad",
    "mainingredients:vegetable",
    "mainingredients:greens",
    "mainingredients:pantry",
    "diet:low-fat",
    "diet:under 200 calories",
    "diet:vegetarian",
    "diet:low-calorie",
    "diet:gluten-free",
    "diet:vegan",
    "diet:under 500 calories",
    "diet:under 400 calories",
    "diet:under 300 calories",
    "meal:dinner",
    "updated:2020-06-14"
  ],
  "name": "How To Make the Perfect Simple Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "69 cal",
    "carbohydrateContent": "2.3 g",
    "cholesterolContent": "0 mg",
    "fatContent": "6.9 g",
    "fiberContent": "0.8 g",
    "proteinContent": "0.5 g",
    "saturatedFatContent": "1.0 g",
    "servingSize": "Serves 4",
    "sodiumContent": "92.1 mg",
    "sugarContent": "0.8 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Green salad",
  "recipeCuisine": [],
  "recipeIngredient": [
    "About 4 ounces lettuce or mixed greens, washed, dried, and torn",
    "Finely shredded carrots or julienned cucumbers (optional)",
    "Small handful finely shredded fresh basil, mint or other aromatic herb (optional)",
    "2 tablespoons olive oil",
    "2 teaspoons vinegar or lemon juice",
    "1/2 teaspoon honey or maple syrup",
    "Flaky salt and freshly ground black pepper",
    "Grated Parmesan or Asiago cheese, for garnish (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "The greens should be completely dry. No matter what kind of greens you use, they should be as dry as possible. If greens aren't dry, they feel weighed down and even a little slimy when the dressing is added. I like to buy bags of mixed salad greens (sure, I could make my own mix, but I don't always have the time or inclination to buy frisee, radicchio, romaine, arugula, and butter lettuce and wash and chop them myself!), but these should be washed too.Wash the greens and spin dry if you like, then lay them out on a towel to air-dry for a little while."
    },
    {
      "@type": "HowToStep",
      "text": "The greens should be bite-sized. Really. Make sure the greens are torn into bite-sized bits. I really hate those oversized wedges of lettuce left in restaurant salads; you have to cut them up to get them in your mouth! No good.Tear up your greens if you think they will be too big to spear and eat gracefully."
    },
    {
      "@type": "HowToStep",
      "text": "Put the greens in a really big bowl. This gives you space to dress the salad without splashing or compressing all the air out of what should be a light, fluffy mix of greens.No matter how you serve your salad, it's best to toss it in a really big bowl — much bigger than the volume of the green themselves."
    },
    {
      "@type": "HowToStep",
      "text": "Add any other vegetables you like (make sure they are dry too). Herbs are extra-good. For a really simple salad, this is where you toss in any little extras. I don't like to over-complicate my side salads or weigh them down with lots of heavy vegetables. But sometimes I add a little carrot or cucumber, finely shredded and blotted dry. Finely shredded herbs are wonderful in salad too; I'm partial to mint.Here I added about 1/3 cup grated carrot (I didn't peel the carrot, and I grated it straight into the salad) and a small handful chiffonaded basil."
    },
    {
      "@type": "HowToStep",
      "text": "Always dress your salad. Bottles at the table — no. All right. Here's my salad manifesto. I don't believe that salads should ever ever be dressed at the table by the diners. A good salad is not a pile of vegetables with gloppy dressing on top. A good salad has dressing mixed all throughout, and a dressing calibrated to the salad itself. I know some might disagree with this, but I'm positively militant about it! Salad should never come to the party naked.For this salad dressing, whisk 2 tablespoons good olive oil with 2 teaspoons balsamic vinegar until thick and emulsified."
    },
    {
      "@type": "HowToStep",
      "text": "Most dressings need a touch of sweetness. In salad dressing, sweetness should always be a deliberate part of the equation. Sometimes you deliberately leave it out, balancing the dressing with something funky and strong, like Amanda Hesser's anchovies in her French dressing. But I find that just oil and vinegar lack a little something, unless you are working with really terrific oil and aged balsamic. A half teaspoon of honey or maple syrup won't sweeten the dressing noticeably; it will just make it taste more rounded and full.Whisk in 1/2 teaspoon honey and blend."
    },
    {
      "@type": "HowToStep",
      "text": "Taste the dressing first. Always taste the dressing before you pour it on the salad. Adjust if you want a little more acidity or sweetness.Taste the dressing and adjust as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Use far less dressing than you think you need. Here I used all the dressing, but I wish I would have actually used less (and there's only 2 tablespoons of oil here!). You want to lightly dress the salad, not drench it.Drizzle the salad very lightly with dressing, just enough to moisten the lettuce, and work it in with your hands or two forks, stopping to toss it before you add all the dressing you've made. You want to coat the greens very, very lightly."
    },
    {
      "@type": "HowToStep",
      "text": "Salt and pepper! Now for perhaps the most important part of a well-dressed salad: Salt and pepper. This is what that flaky salt in your cupboard is for.As you toss the salad with your hands or forks, sprinkle on salt and pepper. Taste and adjust as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add any other mix-ins, such as nuts, cheese, or other dressy things.I like to serve salad in individual bowls and sprinkle any last-minute grace notes like a shaving of Parmesan or some slivered nuts directly on top. This makes them look finished and pretty, and it also is a good way to make sure that these heavy ingredients don't fall immediately to the bottom of the salad. If you don't use any other garnishes, I like to add just a touch more pepper on top.Serve the salad in individual bowls, or on plates. Garnish with some pepper, a shaving of cheese, or some fruit or nuts."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/how-to-make-the-perfect-simple-salad-cooking-lessons-from-the-kitchn-173111"
  ],
  "suitableforDiet": "https://schema.org/GlutenFreeDiet,https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet,https://schema.org/VeganDiet,https://schema.org/VegetarianDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2Ffd5959ba4783a282a66470375dfeb4db29fb3d50",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-06T09:26:57.133Z",
  "url": "https://www.thekitchn.com/how-to-make-the-perfect-simple-salad-cooking-lessons-from-the-kitchn-173111"
}
