{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 2,
    "ratingValue": 3
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-03T20:58:41.230Z",
  "creator": {
    "@type": "Person",
    "name": "Emma Christensen"
  },
  "dateCreated": "2016-01-22T13:30:00-05:00",
  "dateModified": "2022-08-11T20:20:00-04:00",
  "datePublished": "2016-01-22T13:30:00-05:00",
  "headline": "How To Stir-Fry Noodles",
  "HowtoTip": {
    "text": "Stir-fried noodles in a skillet: A wok is preferred over a skillet for this recipe because the amount of ingredients can make stir-frying in a skillet tricky. If you use a skillet, stir-fry the meat and vegetables on their own, transfer them to a plate, then stir-fry the noodles and the sauce. Mix everything together at the end, working in batches if necessary.Stir fry sauce: Grace Young&#x27;s favorite simple sauce for these noodles is a mix of 1 tablespoon of soy sauce and 1 tablespoon rice wine or dry sherry. You could also add a tablespoon of oyster sauce or chili garlic sauce."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2Fcf5bee0e51808e011710c49e913ff003b757e747"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Fcf5bee0e51808e011710c49e913ff003b757e747"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Fcf5bee0e51808e011710c49e913ff003b757e747"
    }
  ],
  "keywords": [
    "asian",
    "blitz",
    "chinese",
    "Cooking Lessons from The Kitchn",
    "dinner",
    "easy",
    "Gluten-Free",
    "Healthy Living",
    "How To",
    "Main Dish",
    "pasta",
    "quick",
    "recipe",
    "stir-fry",
    "stovetop",
    "vegan",
    "vegetarian",
    "Dairy-Free",
    "purpose:search",
    "platform:search",
    "course:main dish",
    "dishtype:stir-fry",
    "dishtype:noodles",
    "dishtype:pasta dish",
    "cuisine:chinese",
    "cuisine:asia",
    "method:stovetop",
    "diet:vegetarian",
    "diet:dairy-free",
    "diet:gluten-free",
    "diet:vegan",
    "diet:egg-free",
    "meal:dinner",
    "updated:2022-08-11"
  ],
  "name": "How To Stir-Fry Noodles",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "599 cal",
    "carbohydrateContent": "65.4 g",
    "cholesterolContent": "0 mg",
    "fatContent": "24.0 g",
    "fiberContent": "5.4 g",
    "proteinContent": "35.3 g",
    "saturatedFatContent": "4.9 g",
    "servingSize": "Serves 4",
    "sodiumContent": "342.6 mg",
    "sugarContent": "3.3 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": "Chinese",
  "recipeIngredient": [
    "12 ounces fresh or dry noodles, such as Chinese egg noodles or rice noodles",
    "4 to 5 cups other mixed stir-fry ingredients, like chicken, pork, beef, tofu, red and green peppers, mushrooms, napa cabbage, bok choy, and so on",
    "2 to 3 tablespoons vegetable or peanut oil",
    "1 to 3 garlic cloves, thinly sliced, optional",
    "1/2 teaspoon salt",
    "Soy sauce, rice wine, chicken broth, or oyster sauce, to taste (see Recipe Note)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare the noodles as needed: Prepare the noodles according to package directions. If using dried rice or cellophane noodles, soak in water until softened. Be careful not too overcook the noodles — it's better to slightly undercook than over cook."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the noodles: Rinse the noodles with cold water. Drain the noodles and shake the strainer a few times to get the noodles as dry as possible."
    },
    {
      "@type": "HowToStep",
      "text": "Toss the noodles with a little vegetable or peanut oil: Return the noodles to the pan you used to cook them and toss them with a little oil. This prevents them from sticking and forming a big mass in the wok."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the noodles: Using a pair of kitchen shears, cut the noodles a few times directly in the saucepan. Aim for roughly 6- to 8-inch pieces. This makes the noodles easier to mix in with the other stir-fry ingredients. Set the saucepan near the stove."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare any other stir-fry ingredients: Make sure any other stir-fry ingredients, like chicken or bok choy, are cut into bite-sized pieces so they cook at the same rate and are ready for the wok. Keep them in separate bowls within reach near the stove. If you're making a sauce or using any other flavoring ingredients, make sure they're ready near the stove."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the wok: Set your wok over high heat until a drop of water evaporates within a second or two of contact."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 tablespoon of oil: Pour 1 tablespoon of oil down the side of the pan. Swirl to coat the bottom and lower sides of the wok evenly."
    },
    {
      "@type": "HowToStep",
      "text": "Stir-fry the aromatics: If you're using garlic or other aromatics, add it now. Stir-fry just until fragrant, 10 to 20 seconds. When done, push the aromatics up the side of the pan to make room for the next step."
    },
    {
      "@type": "HowToStep",
      "text": "Stir-fry any meat or vegetable ingredients: Start with stir-frying the meat. Sear for 1 minute without stirring, then stir-fry another minute to work in the aromatics. Add the vegetables. Stir-fry another minute or so until everything nearly cooked, another 1 to 2 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the noodles: Swirl another tablespoon of oil around the hot wok. Add the noodles and use two spatulas to gently toss the noodles with the other stir-fry ingredients, like tossing a salad. Do this a few times until the ingredients are mixed. Note: Your wok may move or wobble as you do this; it's helpful to have a kitchen helper to hold the wok steady for you."
    },
    {
      "@type": "HowToStep",
      "text": "Add the stir-fry sauce: Season the stir-fry with the salt, and swirl in any liquid sauce ingredients, like soy sauce or chicken broth. Stir and toss the noodles and other stir-fry ingredients to coat evenly."
    },
    {
      "@type": "HowToStep",
      "text": "Stir-fry one more minute: Once the sauce has been added, stir and toss the stir-fry just another minute or so, until the noodles are warmed and any meat you're stir-frying is cooked all the way through."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately: Transfer the noodle stir-fry to a serving dish or to plates. Serve immediately while still hot with extra seasoning ingredients on the side."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/how-to-stir-fry-noodles-226766"
  ],
  "suitableforDiet": "https://schema.org/GlutenFreeDiet,https://schema.org/LowLactoseDiet,https://schema.org/VeganDiet,https://schema.org/VegetarianDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2Fcf5bee0e51808e011710c49e913ff003b757e747",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-03T20:58:41.229Z",
  "url": "https://www.thekitchn.com/how-to-stir-fry-noodles-226766"
}
