{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 2,
    "ratingValue": 3.5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-06T08:56:17.552Z",
  "creator": {
    "@type": "Person",
    "name": "Faith Durand"
  },
  "dateCreated": "2014-07-22T15:00:00-04:00",
  "dateModified": "2022-09-06T06:37:00-04:00",
  "datePublished": "2014-07-22T15:00:00-04:00",
  "description": "This method is not hard, once you get the hang of it, and thanks to the extra-high heat of the grill, it makes some of the best pizza you'll ever eat!",
  "headline": "How To Make the Best Grilled Pizza",
  "HowtoTip": {
    "text": "Every grill is different! You know your grill and it cooks differently than mine. Your pizza may take longer or shorter depending on how hot the grill gets and where your areas of direct and indirect heat are. Consider your first pizza a sacrifice to learning just how to control your grill temperature.Cooking times will vary! On that same note, of course, you need to keep an eye on the heat. This method works perfectly every time on my own grill, but the timing depends on how thin you stretch your dough, and how hot your grill gets. Flipping the dough gives you an extra measure of control and certainty, though, that the crust will be cooked through by the time your toppings have melted and warmed."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F22045936668cd54e6e8f9d407a1f464ddc10e593"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F22045936668cd54e6e8f9d407a1f464ddc10e593"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F22045936668cd54e6e8f9d407a1f464ddc10e593"
    }
  ],
  "keywords": [
    "autumn",
    "blitz",
    "Cooking Lessons from The Kitchn",
    "dinner",
    "Dinner for a Crowd",
    "easy",
    "grilling",
    "How To",
    "Main Dish",
    "Party Food",
    "pizza",
    "quick",
    "recipe",
    "summer",
    "vegetarian",
    "Cooking with Kids",
    "children",
    "team:food",
    "purpose:search",
    "platform:search",
    "course:main dish",
    "lifestyle:kid-friendly",
    "dishtype:pizza",
    "occasion:summer",
    "method:grilled",
    "meal:dinner",
    "updated:2022-09-06"
  ],
  "name": "How To Make the Best Grilled Pizza",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "227 cal",
    "carbohydrateContent": "40.1 g",
    "cholesterolContent": "0 mg",
    "fatContent": "4.3 g",
    "fiberContent": "2.9 g",
    "proteinContent": "7.1 g",
    "saturatedFatContent": "0.9 g",
    "servingSize": "Serves 6",
    "sodiumContent": "609.2 mg",
    "sugarContent": "1.7 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 ball pizza dough (about 1 pound), store-bought or homemade",
    "1/2 to 1 cup tomato sauce, store-bought or homemade",
    "Cheese such as torn mozzarella, grated Asiago or Swiss, and grated Parmesan",
    "Toppings such as herbs, thinly sliced vegetables, pepperoni and salami, prosciutto, chopped greens such as kale, or diced tomatoes",
    "Olive oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat the grill: You should heat it quite hot; my grill was about 600°F with the lid on while baking this particular pizza. Aim for at least 550°F. If you have a choice on your grill between direct and indirect heat, set it up so the pizza is over direct heat."
    },
    {
      "@type": "HowToStep",
      "text": "Gather your ingredients and toppings: Set up a table or bench near the grill so you have easy access to everything. Good grilled pizza is as much about the organization and logistics as it is about actual cooking!"
    },
    {
      "@type": "HowToStep",
      "text": "Also have your tools close to hand: You will want a pair of long metal tongs. A spatula may be helpful, although not absolutely necessary. You may want a hot pad or oven mitt if your grill lid gets hot."
    },
    {
      "@type": "HowToStep",
      "text": "Prep your dough: It should be stretched or rolled out into a thin circle. (Circle-ish — as you can see, my pizzas usually resemble continents more than they do the moon!)"
    },
    {
      "@type": "HowToStep",
      "text": "Brush the dough with olive oil: Brush one side of the dough with oil; this is the side you'll lay down on the grill."
    },
    {
      "@type": "HowToStep",
      "text": "Grill one side of the pizza: Take the lid off the grill. Lay the dough round on the grill with the olive-oil side down. Brush the top of the dough with a thin layer of olive oil, too. Let the dough cook for about 3 minutes, with the lid off, or 1 to 2 minutes with the lid on. Use the tongs to lift up the dough from time to time, checking on how it is doing. You want grill marks on it, but you don't want the dough to get crispy; it should be just set."
    },
    {
      "@type": "HowToStep",
      "text": "Top the pizza: Flip the dough over with the tongs or spatula. The dough should come up easily and flip without tearing. Now is where your organization comes in! You need to top the pizza quickly. Spread on a thin layer of sauce, some cheese, and toppings. It shouldn't be too heavily loaded, or the pizza won't cook well."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the pizza: Put the lid on and cook for 3 to 5 minutes. Use your sense of smell; if the pizza smells like it's scorching, take the lid off and move the pizza to a cooler part of the grill or turn the heat down."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the finished pizza: Remove the lid and check the pizza. The edges should be crisp and well-done, and the cheese should all be melted. Drag the pizza off with the spatula or tongs. Let cool for 3 minutes, then cut into pieces and eat!"
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-grill-pizza-cooking-lessons-from-thekitchn-120920"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F22045936668cd54e6e8f9d407a1f464ddc10e593",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-06T08:56:17.552Z",
  "url": "https://www.thekitchn.com/how-to-grill-pizza-cooking-lessons-from-thekitchn-120920"
}
