{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 5,
    "ratingValue": 1
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-07T00:34:53.917Z",
  "creator": {
    "@type": "Person",
    "name": "Meghan Splawn"
  },
  "dateCreated": "2016-10-19T15:30:00-04:00",
  "dateModified": "2020-12-31T17:49:40-05:00",
  "datePublished": "2016-10-19T15:30:00-04:00",
  "headline": "How To Make a French Baguette at Home",
  "HowtoTip": {
    "text": "Storage: Leftover baguettes should be cooled, then tightly wrapped in plastic wrap and stored at room temperature for up to 3 days. Freeze tightly wrapped baguettes for up to 1 month. "
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2Fb68e19a3ea79447e7f15839cafea4f4deef11433"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Fb68e19a3ea79447e7f15839cafea4f4deef11433"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Fb68e19a3ea79447e7f15839cafea4f4deef11433"
    }
  ],
  "keywords": [
    "baking",
    "bread",
    "flour",
    "french",
    "salt",
    "vegan",
    "vegetarian",
    "Wellness",
    "european",
    "Dairy-Free",
    "baked goods",
    "dishtype:baked good",
    "dishtype:bread",
    "cuisine:europe",
    "cuisine:french",
    "method:baked",
    "diet:low-fat",
    "diet:vegetarian",
    "diet:low-calorie",
    "diet:vegan",
    "diet:egg-free",
    "diet:under 500 calories",
    "diet:under 400 calories",
    "diet:dairy-free",
    "updated:2020-12-31"
  ],
  "name": "How To Make a French Baguette at Home",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "324 cal",
    "carbohydrateContent": "67.9 g",
    "cholesterolContent": "0 mg",
    "fatContent": "0.9 g",
    "fiberContent": "2.6 g",
    "proteinContent": "9.5 g",
    "saturatedFatContent": "0.1 g",
    "servingSize": "Serves 8",
    "sodiumContent": "240.7 mg",
    "sugarContent": "0.2 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Baked good",
  "recipeCuisine": "Europe",
  "recipeIngredient": [
    "1/2 teaspoon active dry yeast",
    "4 ounces (1/2 cup) room temperature water",
    "5 ounces (1 cup) all-purpose flour",
    "8 ounves (1 cup) lukewarm water, about 95°F",
    "1 teaspoon active dry yeast",
    "20 ounces (4 cups) all-purpose flour, plus more for shaping",
    "1 teaspoon fine salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the starter: Dissolve the yeast and water for the starter in a medium bowl. Add the flour and stir to form a thick, gloppy paste. Give it a good 50 or so brisk stirs to build up the gluten. Cover with a kitchen towel and leave at room temperature 8 hours or overnight."
    },
    {
      "@type": "HowToStep",
      "text": "Proof the yeast: Place the yeast and water for the baguettes in the bowl of a stand mixer. Scrape the starter into the bowl and break it up with a spatula or squeeze it between your hands. You don't need to completely dissolve the starter; just loosen it up and break it into stringy lumps."
    },
    {
      "@type": "HowToStep",
      "text": "Start the dough: Add the flour and salt, then stir to form a thick, shaggy dough. Let this rest for 10 to 20 minutes to give the flour time to absorb the water."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the dough: Fit the stand mixer with the dough hook. Knead the dough on low speed until the dough gathers into a ball, 2 to 3 minutes. Increase the speed to medium and knead for 12 to 15 minutes. Keep a close eye on your mixer as it has a tendency to \"walk\" and bounce on the counter at this speed. Around the 7-minute mark, the dough will start to pull away from the sides of the bowl, collect around the dough hook, and regularly slap the sides of the bowl. If it doesn't, nudge your mixer speed up a notch. Also, if the dough starts climbing the dough hook, stop the mixer and scrape it down again. By the end of kneading, the dough will look smooth and creamy, with a soft, matte finish."
    },
    {
      "@type": "HowToStep",
      "text": "First rise (2 to 3 hours): Remove the dough from the bowl, form into a ball, and place in a lightly greased bowl. Cover with a kitchen towel. Let the dough rise at 70°F to 75°F until tripled in bulk, 2 to 3 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Rest the dough (15 minutes) : When ready to shape the loaves, sprinkle your work surface generously with flour. Turn the dough out onto the floured surface and use a bench scraper or kitchen shears to divide the dough into 3 equal portions, each about 11 3/4 ounces. Cover with a kitchen towel and let the dough rest for about 15 minutes to relax the gluten."
    },
    {
      "@type": "HowToStep",
      "text": "Make a couche (optional): If you do not have a baguette pan or couche, tear a piece of parchment paper that is 3 times the width of a rimmed baking sheet. Crinkle the paper, then flatten and fold into thirds lengthwise. Line the baking sheet with the parchment, ensuring that the folds peak up, creating 3 valleys for the shaped baguettes to rest in. (If you have a baguette pan or couche, skip this step.)"
    },
    {
      "@type": "HowToStep",
      "text": "Shape the baguettes: Take 1 piece of dough and gently but firmly pat the dough into a rough 10 by 8-inch rectangle. Make sure the dough isn't sticking to the work surface and try not to deflate too many of those lovely air bubbles. With the 10-inch side facing you, fold down the top third of the dough and use the heel of your hand to seal the edge. Fold the bottom third of the dough up and use the heel of your hand to seal the edge, just like folding a business letter. Use the edge of your hand to pat a crease in the middle of the dough and fold the dough in half again. This makes the surface of the dough smooth and taut. Use the heel of your hand to again seal the edge. Use the palms of your hand to gently press and roll the loaf into a long, tapered baguette form. Start with your hands in the middle of the loaf and gradually move them to the outer edge of the baguette as you roll. Roll until the baguette is as long as your baking sheet or couche (usually 12 to 15 inches). Repeat with the shaping the remaining 2 portions of dough."
    },
    {
      "@type": "HowToStep",
      "text": "Second rise (1 hour): Transfer the shaped baguettes to the prepared parchment-lined pan, baguette pan, or couche. Cover with a kitchen towel and set aside for 1 hour to rise. The loaves are ready to bake when they look puffy and ballooned."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the oven: Arrange a rack in the middle of the oven and heat to 450°F. If you have a baking stone, set it on the lowest rack of your oven. Otherwise, place a small oven-safe pan in the bottom of the oven while it heats."
    },
    {
      "@type": "HowToStep",
      "text": "Score the top of each loaf: Use a sharp knife or razor blade to quickly score the surface of the loaves. Slash each baguette at a 45-degree angle 4 to 5 times along the loaf's axis."
    },
    {
      "@type": "HowToStep",
      "text": "Steam and bake: Add 1/2 cup of water or a few ice cubes to the pan in the oven.The steam will create a moist environment during the initial few minutes of baking and help get a crackling, crisp crust. Place the baguettes in the oven and bake until the crusts are deep golden brown, 20 to 30 minutes. To check, insert a thermometer into the space created by the slash in the center of the loaf: when the temperature is 200°F, the loaf is done."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-make-a-french-baguette-at-home-236641"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet,https://schema.org/LowLactoseDiet,https://schema.org/VeganDiet,https://schema.org/VegetarianDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2Fb68e19a3ea79447e7f15839cafea4f4deef11433",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-07T00:34:53.916Z",
  "url": "https://www.thekitchn.com/how-to-make-a-french-baguette-at-home-236641"
}
