{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 82,
    "ratingValue": 3.4
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-06T00:40:00.273Z",
  "creator": {
    "@type": "Person",
    "name": "Emma Christensen"
  },
  "dateCreated": "2014-02-24T10:00:00-05:00",
  "dateModified": "2022-09-22T14:30:00-04:00",
  "datePublished": "2014-02-24T10:00:00-05:00",
  "description": "Making a fresh batch of starter is as easy as stirring together some flour and water and letting it sit. ",
  "headline": "How To Make Sourdough Starter from Scratch",
  "HowtoTip": {
    "text": ""
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F63dbb86741abd47759a8f10349db143c59c06789"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F63dbb86741abd47759a8f10349db143c59c06789"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F63dbb86741abd47759a8f10349db143c59c06789"
    }
  ],
  "keywords": [
    "baking",
    "blitz",
    "bread",
    "flour",
    "How To",
    "recipe",
    "sourdough",
    "baked goods",
    "purpose:search",
    "platform:search",
    "dishtype:sourdough bread",
    "dishtype:baked good",
    "dishtype:bread",
    "updated:2022-09-22"
  ],
  "name": "How To Make Sourdough Starter from Scratch",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "0 cal",
    "carbohydrateContent": "0 g",
    "cholesterolContent": "0 mg",
    "fatContent": "0 g",
    "fiberContent": "0 g",
    "proteinContent": "0 g",
    "saturatedFatContent": "0 g",
    "servingSize": "Serves 0",
    "sodiumContent": "0 mg",
    "sugarContent": "0 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Sourdough bread",
  "recipeCuisine": [],
  "recipeIngredient": [
    "All-purpose flour (or a mix of all-purpose and whole grain flour)",
    "Water, preferably filtered"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Making sourdough starter takes about 5 days. Each day you \"feed\" the starter with equal amounts of fresh flour and water. As the wild yeast grows stronger, the starter will become more frothy and sour-smelling. On average, this process takes about 5 days, but it can take longer depending on the conditions in your kitchen. As long as you see bubbles and signs of yeast activity, continue feeding it regularly. If you see zero signs of bubbles after three days, take a look at the Troubleshooting section below."
    },
    {
      "@type": "HowToStep",
      "text": "Day 1: Make the Initial Starter4 ounces all-purpose flour (3/4 cup plus 2 tablespoons) 4 ounces water (1/2 cup)"
    },
    {
      "@type": "HowToStep",
      "text": "Weigh the flour and water, and combine them in a 2-quart glass or plastic container (not metal). Stir vigorously until combined into a smooth batter. It will look like a sticky, thick dough. Scrape down the sides and loosely cover the container with plastic wrap or a clean kitchen towel secured with a rubber band."
    },
    {
      "@type": "HowToStep",
      "text": "Place the container somewhere with a consistent room temperature of 70°F to 75°F (like the top of the refrigerator) and let sit for 24 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Day 2: Feed the Starter4 ounces all-purpose flour (3/4 cup + 2 tablespoons)4 ounces water (1/2 cup)"
    },
    {
      "@type": "HowToStep",
      "text": "Take a look at the starter. You may see a few small bubbles here and there. This is good! The bubbles mean that wild yeast have started making themselves at home in your starter. They will eat the sugars in the the flour and release carbon dioxide (the bubbles) and alcohol. They will also increase the acidity of the mixture, which helps fend off any bad bacterias. At this point, the starter should smell fresh, mildly sweet, and yeasty."
    },
    {
      "@type": "HowToStep",
      "text": "If you don't see any bubbles yet, don't panic — depending on the conditions in your kitchen, the average room temperature, and other factors, your starter might just be slow to get going."
    },
    {
      "@type": "HowToStep",
      "text": "Weigh the flour and water for today, and add them to the starter. Stir vigorously until combined into a smooth batter. It will look like a sticky, thick dough. Scrape down the sides and loosely cover the container with the plastic wrap or kitchen towel secured again. Place the container somewhere with a consistent room temperature of 70°F to 75°F (like the top of the refrigerator) and let sit for 24 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Day 3: Feed the Starter4 ounces all-purpose flour (3/4 cup + 2 tablespoons)4 ounces water (1/2 cup)"
    },
    {
      "@type": "HowToStep",
      "text": "Check your starter. By now, the surface of your starter should look dotted with bubbles and your starter should look visibly larger in volume. If you stir the starter, it will still feel thick and batter-like, but you'll hear bubbles popping. It should also start smelling a little sour and musty. Again, if your starter doesn't look quite like mine in the photo, don't worry. Give it a few more days. My starter happened to be particularly vigorous!"
    },
    {
      "@type": "HowToStep",
      "text": "Weigh the flour and water for today, and add them to the starter. Stir vigorously until combined into a smooth batter. It will look like a sticky, thick dough. Scrape down the sides and loosely cover the container with the plastic wrap or kitchen towel secured again. Place the container somewhere with a consistent room temperature of 70°F to 75°F (like the top of the refrigerator) and let sit for 24 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Day 4: Feed the Starter4 ounces all-purpose flour (3/4 cup + 2 tablespoons)4 ounces water (1/2 cup)"
    },
    {
      "@type": "HowToStep",
      "text": "Check your starter. By now, the starter should be looking very bubbly with large and small bubbles, and it will have doubled in volume. If you stir the starter, it will feel looser than yesterday and honeycombed with bubbles. It should also be smelling quite sour and pungent. You can taste a little too! It should taste sour and somewhat vinegary."
    },
    {
      "@type": "HowToStep",
      "text": "When I made my starter here, I didn't notice much visual change from Day 3 to Day 4, but could tell things had progress by the looseness of the starter and the sourness of the aroma."
    },
    {
      "@type": "HowToStep",
      "text": "Weigh the flour and water for today, and add them to the starter. Stir vigorously until combined into a smooth batter. It will look like a sticky, thick dough. Scrape down the sides and loosely cover the container with the plastic wrap or kitchen towel secured again. Place the container somewhere with a consistent room temperature of 70°F to 75°F (like the top of the refrigerator) and let sit for 24 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Day 5: Starter is Ready to UseCheck your starter. It should have doubled in bulk since yesterday. By now, the starter should also be looking very bubbly — even frothy. If you stir the starter, it will feel looser than yesterday and be completely webbed with bubbles. It should also be smelling quite sour and pungent. You can taste a little too! It should taste even more sour and vinegary."
    },
    {
      "@type": "HowToStep",
      "text": "If everything is looking, smelling, and tasting good, you can consider your starter ripe and ready to use! If your starter is lagging behind a bit, continue on with the Day 5 and Beyond instructions."
    },
    {
      "@type": "HowToStep",
      "text": "Day 5 and Beyond: Maintaining Your Starter4 ounces all-purpose flour (3/4 cup + 2 tablespoons)4 ounces water (1/2 cup)"
    },
    {
      "@type": "HowToStep",
      "text": "Once your starter is ripe (or even if it's not quite ripe yet), you no longer need to bulk it up. To maintain the starter, discard (or use) about half of the starter and then \"feed\" it with new flour and water: weigh the flour and water, and combine them in the container with the starter. Stir vigorously until combined into a smooth batter."
    },
    {
      "@type": "HowToStep",
      "text": "If you're using the starter within the next few days, leave it out on the counter and continue discarding half and \"feeding\" it daily. If it will be longer before you use your starter, cover it tightly and place it in the fridge. Remember to take it out and feed it at least once a week — I also usually let the starter sit out overnight to give the yeast time to recuperate before putting it back in the fridge."
    },
    {
      "@type": "HowToStep",
      "text": "How to Reduce the Amount of StarterMaybe you don't need all the starter we've made here on an ongoing basis. That's fine! Discard half the starter as usual, but feed it with half the amount of flour and water. Continue until you have whatever amount of starter works for your baking habits."
    },
    {
      "@type": "HowToStep",
      "text": "How to Take a Long Break from Your StarterIf you're taking a break from baking, but want to keep your starter, you can do two things:1) Make a Thick Starter: Feed your starter double the amount of flour to make a thicker dough-like starter. This thicker batter will maintain the yeast better over long periods of inactivity in the fridge.2) Dry the Starter: Smear your starter on a Silpat and let it dry. Once completely dry, break it into flakes and store it in an airtight container. Dried sourdough can be stored for months. To re-start it, dissolve 1/4 cup of the flakes in 4 ounces of water, and stir in 4 ounces of flour. Continue feeding the starter until it is active again."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-make-your-own-sourdough-starter-cooking-lessons-from-the-kitchn-47337"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F63dbb86741abd47759a8f10349db143c59c06789",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-06T00:40:00.272Z",
  "url": "https://www.thekitchn.com/how-to-make-your-own-sourdough-starter-cooking-lessons-from-the-kitchn-47337",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://cdn.jwplayer.com/previews/Bl3l6JmQ",
    "description": "Not all of us are so lucky to have a sourdough starter passed down to us from our bread-baking friends. Thankfully, making a fresh batch of starter is as easy as stirring together some flour and water and letting it sit. That’s right!\n\nNo expensive heirloom starters, mashed-up grapes, or mysterious rituals required — just flour, water, and a little bit of patience. Here is how to make your own sourdough starter from scratch. Easy-peasy.\n\nCheck out the full recipe post [HERE](https://www.thekitchn.com/how-to-make-your-own-sourdough-starter-cooking-lessons-from-the-kitchn-47337)",
    "name": "How to Make Sourdough Starter",
    "thumbnailUrl": [
      "https://cdn.jwplayer.com/v2/media/Bl3l6JmQ/poster.jpg?width=720"
    ],
    "uploadDate": "2022-12-02T14:00:12"
  }
}
