{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 8,
    "ratingValue": 4.5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-03T04:09:50.466Z",
  "creator": {
    "@type": "Person",
    "name": "Faith Durand"
  },
  "dateCreated": "2010-11-19T12:30:00-05:00",
  "dateModified": "2022-10-07T12:34:23-04:00",
  "datePublished": "2010-11-19T12:30:00-05:00",
  "headline": "How To Make Turkey Gravy Ahead of Thanksgiving",
  "HowtoTip": {
    "text": "I call for 5 cups of stock for 1 quart gravy, because there is inevitably some evaporation. I have often started making gravy with a quart of stock, but ended up with only 3 cups of gravy! This gives you a little room.This produces a relatively thin gravy. I like gravy to taste of the turkey, not of the flour or the roux. It won&#x27;t spread out all over your plate, but it&#x27;s certainly not thick like pancake batter.Adapted from The New York Times."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2Fad1379b1e0608639beac0880fb1e5aaa32c49180"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Fad1379b1e0608639beac0880fb1e5aaa32c49180"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Fad1379b1e0608639beac0880fb1e5aaa32c49180"
    }
  ],
  "keywords": [
    "anheuser busch thanksgiving",
    "blitz",
    "butter",
    "christmas",
    "Cooking Lessons from The Kitchn",
    "flour",
    "Freezer Friendly",
    "How To",
    "Make Ahead",
    "Meat Tutorials",
    "pepper",
    "poultry",
    "recipe",
    "Root Vegetables",
    "sauce",
    "stovetop",
    "thanksgiving",
    "autumn",
    "dinner",
    "team:food",
    "purpose:search",
    "platform:search",
    "dishtype:sauce",
    "dishtype:poultry dish",
    "cuisine:united states",
    "timing:make-ahead",
    "timing:freezer-friendly",
    "occasion:autumn",
    "occasion:friendsgiving",
    "occasion:thanksgiving",
    "occasion:christmas",
    "mainingredients:poultry",
    "method:stovetop",
    "diet:under 200 calories",
    "diet:low-calorie",
    "diet:under 500 calories",
    "diet:low-fat",
    "diet:under 400 calories",
    "diet:under 300 calories",
    "meal:dinner",
    "updated:2022-10-07"
  ],
  "name": "How To Make Turkey Gravy Ahead of Thanksgiving",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "161 cal",
    "carbohydrateContent": "17.0 g",
    "cholesterolContent": "0 mg",
    "fatContent": "5.8 g",
    "fiberContent": "3.4 g",
    "proteinContent": "5.8 g",
    "saturatedFatContent": "2.3 g",
    "servingSize": "Serves 4",
    "sodiumContent": "419.1 mg",
    "sugarContent": "4.2 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dinner",
  "recipeCuisine": "United states",
  "recipeIngredient": [
    "2 to 4 pounds bone-in turkey pieces, a mix of breast, thighs and/or legs",
    "Salt and freshly ground black pepper",
    "1/2 cup dry white wine or dry sherry",
    "1 large yellow onion",
    "2 large carrots",
    "4 celery stalks",
    "1 tablespoon whole black peppercorns",
    "1 bay leaf",
    "Fresh thyme and parsley springs (optional)",
    "Unsalted butter, as needed",
    "1/4 cup all-purpose flour"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Roast the turkey pieces. Arrange a rack in the middle of the oven and heat the oven to 400°F. Pat the turkey pieces dry with paper towels and place them in a roasting pan. Generously season with salt and pepper. Roast until the turkey is cooked through and browned, about 1 1/2 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Remove some meat from the turkey pieces. Remove from the oven and let the turkey cool slightly. Shred some of the meat from the bones. How much you shred is up to you: If you don't leave anything on the bones it will be to the poverty of your stock. But it is not necessary to leave all the meat on the bones; certainly remove a good deal of it for eating. (I removed a little over half.)"
    },
    {
      "@type": "HowToStep",
      "text": "Deglaze the roasting pan. Now that the turkey is removed from the pan, you can deglaze all the fat and juices it left behind in the roasting pan. Place the pan over medium-high heat until the fat begins to sizzle. Add the wine or sherry a few tablespoons at a time, stirring constantly and breaking up any bits clinging to the bottom of the pan. When the pan is clean and only liquid remains, turn off the heat and pour the liquid off into a clean jar or heatproof bowl. Refrigerate."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the turkey bones with water. Place the turkey bones and remaining meat in a 4-quart or larger pot. Peel and roughly chop the onion and add to the pot. Don't peel the carrots. Chop them and the celery and add them to the pot. Add the peppercorns, bay leaf, and herbs if using. Add enough water to just cover."
    },
    {
      "@type": "HowToStep",
      "text": "Make turkey stock. Bring the pot to a full, rolling boil over medium-high heat. Reduce the heat until the pot is simmering. Cover, partially, with a lid, and simmer for as long as you can let it go. (This is one of many steps in the process that are really up to you. If you can only cook it for an hour, it won't be as rich, but it will still be wonderful.) It's ideal to let it simmer for several hours at least. Check it frequently, however, and make sure that the liquid level isn't slipping down too far."
    },
    {
      "@type": "HowToStep",
      "text": "Strain the turkey stock. When you're done simmering the turkey stock and are ready to make gravy, turn off the heat and strain the broth through a fine-mesh strainer into a bowl. Press down on the turkey meat and bones to release all the liquid. You should have at least 6 cups of stock (you'll need 5 cups for the gravy) — hopefully more. (This might sound like heresy to some, but honestly, there is nothing wrong with setting your first, richer stock aside and refilling the pot and going for a second round. The resulting stock will be thinner and not as rich, of course, but it's still extremely delicious for soups and other cooking projects.)"
    },
    {
      "@type": "HowToStep",
      "text": "So now you have your turkey meat, and a big pot of turkey stock. Time to make the actual gravy! If you have refrigerated your turkey stock, scrape any fat off the top and set aside. Measure out 5 cups of turkey stock and set it aside."
    },
    {
      "@type": "HowToStep",
      "text": "Make a roux with fat. Add about 1/4 cup of the fat to a 2-quart saucepan or sauté pan. What kind of fat is up to you. Scrape what you can off the pan drippings you set aside earlier, and augment with fat off the stock, if you have it. Make up any difference with butter. This doesn't need to be exact; it can be approximate. After the fat foams up in the pan, add the flour. Cook the flour over medium-low heat, stirring constantly. When it turns a pale brown, it's time to add the stock."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the stock into the roux. Add about 1/2 cup of the stock and whisk vigorously to smooth out lumps. Add the remaining 4 1/2 cups and any remaining pan drippings and whisk again. Bring to a boil, whisking frequently. (A flat whisk here is very helpful.) When it boils, whisk vigorously until the gravy thickens. Turn off the heat. Taste and season, if necessary, with salt and pepper. Depending on how well you strained your stock, there may be bits of turkey in your gravy at this point. If you want to, you can strain the gravy again into a bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Cool and store your gravy. Let the gravy cool slightly, then pour into a freezer-safe container or bag, and freeze."
    },
    {
      "@type": "HowToStep",
      "text": "Thaw and reheat for Thanksgiving. Thaw in the fridge overnight, then reheat over low heat, whisking to smooth out any separation."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-make-turkey-gravy-ahead-of-thanksgiving-cooking-lessons-from-the-kitchn-132850"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2Fad1379b1e0608639beac0880fb1e5aaa32c49180",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-03T04:09:50.464Z",
  "url": "https://www.thekitchn.com/how-to-make-turkey-gravy-ahead-of-thanksgiving-cooking-lessons-from-the-kitchn-132850"
}
