{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 4,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-02T15:19:48.490Z",
  "creator": {
    "@type": "Person",
    "name": "Emily Han"
  },
  "dateCreated": "2014-04-21T10:00:00-04:00",
  "dateModified": "2022-09-07T13:43:00-04:00",
  "datePublished": "2014-04-21T10:00:00-04:00",
  "headline": "How To Make Tempeh",
  "HowtoTip": {
    "text": "Soybeans: If you have access to pre-hulled and split soybeans, you can skip steps 1 and 2.Other beans: To make tempeh with other beans, process them like soybeans. Boiling time may vary.Grains: To substitute grains for some or all of the beans, soak them overnight and cook them separately from the beans. Cool and dry the grains and then mix them with the beans before adding the vinegar and tempeh starter.Seeds: To substitute seeds for some of the beans, you can soak them or not. If soaking, be sure to dry them well. Mix the seeds with the beans before adding the vinegar and tempeh starter."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F034a902152c4729edade1172bcb9e58d5b73e412"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F034a902152c4729edade1172bcb9e58d5b73e412"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F034a902152c4729edade1172bcb9e58d5b73e412"
    }
  ],
  "keywords": [
    "Alternative Meats",
    "beans",
    "blitz",
    "Cooking Lessons from The Kitchn",
    "How To",
    "Jams & Preserved Foods",
    "lentils",
    "recipe",
    "tempeh",
    "vegan",
    "vegetarian",
    "Dairy-Free",
    "condiments",
    "purpose:search",
    "platform:search",
    "dishtype:jam",
    "dishtype:condiment",
    "mainingredients:plant protein",
    "mainingredients:beans",
    "mainingredients:tempeh",
    "diet:low-fat",
    "diet:under 200 calories",
    "diet:vegetarian",
    "diet:low-calorie",
    "diet:vegan",
    "diet:egg-free",
    "diet:under 500 calories",
    "diet:under 400 calories",
    "diet:under 300 calories",
    "diet:dairy-free",
    "updated:2022-09-07"
  ],
  "name": "How To Make Tempeh",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "127 cal",
    "carbohydrateContent": "9.8 g",
    "cholesterolContent": "0 mg",
    "fatContent": "5.5 g",
    "fiberContent": "5.4 g",
    "proteinContent": "11.8 g",
    "saturatedFatContent": "0.0 g",
    "servingSize": "Serves 4",
    "sodiumContent": "7.0 mg",
    "sugarContent": "2.8 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Jam",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 pound (about 2 1/2 cups) dried whole soybeans (see Recipe Note)",
    "2 tablespoons white vinegar",
    "1 teaspoon tempeh starter"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak the beans: Place the beans in a large bowl and cover by 3 inches with water. Let stand overnight or at least 12 hours."
    },
    {
      "@type": "HowToStep",
      "text": "De-hull and split the beans: The hulls or skins need to be removed in order for the spores to inoculate the beans. Using your hands or a potato masher, knead and squeeze the beans so that the hulls fall off and the beans split in half. This is the most labor-intensive part of the tempeh-making process and may take 10 to 20 minutes. Don't worry about de-hulling and splitting every last bean, but do try to get a majority of them. Periodically stir the water so the hulls to float to the surface; skim them off and discard them."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the beans: Drain the beans, transfer them to a large pot, and cover by 2 inches with fresh water. Bring to a boil. Skim off and discard any foam or hulls that rise to the surface. Reduce the heat and simmer, partially covered, until the beans are tender but not mushy, about 45 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the zip-top bags: While the beans are cooking, prepare the bags. Using the skewer or a large needle, prick holes in the bags at 1-inch intervals."
    },
    {
      "@type": "HowToStep",
      "text": "Dry the beans: Drain the beans. Spread them out on two towel-lined baking sheets and pat them dry."
    },
    {
      "@type": "HowToStep",
      "text": "Cool the beans: Let the beans cool to below body temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Add the vinegar: Transfer the beans to a clean, dry bowl. Sprinkle the vinegar over the beans and mix well. Adding vinegar lowers the pH and prevents the growth of unwanted bacteria."
    },
    {
      "@type": "HowToStep",
      "text": "Add the tempeh starter: Sprinkle the tempeh starter over the beans and mix for about a minute to distribute evenly."
    },
    {
      "@type": "HowToStep",
      "text": "Fill the bags: Divide the beans between the two bags."
    },
    {
      "@type": "HowToStep",
      "text": "Flatten the bags: Seal the bags and flatten the beans out evenly."
    },
    {
      "@type": "HowToStep",
      "text": "Incubate the tempeh: Place the bags in the incubator. The temperature must be between 85°F and 90°F for the next 24 to 48 hours, so periodically check to make sure the temperature is consistent."
    },
    {
      "@type": "HowToStep",
      "text": "Check at 12 hours: Between 12 and 24 hours you should start to see some white mycelium growing on the beans. You may want to lower the heat source because the beans will start generating their own heat as the mold grows; an instant-read thermometer is handy for checking the internal temperature of the fermenting tempeh."
    },
    {
      "@type": "HowToStep",
      "text": "Continue to incubate up to 48 hours: Depending on your conditions, the tempeh may take up to 48 hours total. The mycelium will continue to thicken, forming a white layer around the beans and binding them into a dense, firm cake. The tempeh is done when the entire surface is covered with dense, white mycelium (some black or gray spots are okay), as well as the spaces between the beans. The beans should be bound together firmly as a cake. You may want to slice a small piece off the edge to make sure the cake is firm all the way through. The tempeh should smell pleasantly nutty and mushroomy. It may also have a light ammonia smell."
    },
    {
      "@type": "HowToStep",
      "text": "Stop the fermentation: Remove the bags from the incubator and let the tempeh cool to room temperature. Transfer the tempeh cakes to airtight bags or containers and store in the refrigerator up to 1 week."
    },
    {
      "@type": "HowToStep",
      "text": "Using tempeh: Use freshly-made tempeh in your recipes! Tempeh can be eaten raw or cooked. Cooking brings out the nutty flavor, and some people prefer cooked because it can be slightly bitter raw."
    },
    {
      "@type": "HowToStep",
      "text": "Freezing tempeh: To freeze the tempeh, steam it for 20 minutes and then freeze in an airtight container up to 3 months."
    },
    {
      "@type": "HowToStep",
      "text": "Troubleshooting: You may see some black or gray spots on the tempeh, especially near the air holes — this is completely normal and safe. If you see any other colors or if the tempeh is mushy, slimy, or smells bad, you should discard it."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-make-tempeh-cooking-lessons-from-the-kitchn-202369"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet,https://schema.org/LowLactoseDiet,https://schema.org/VeganDiet,https://schema.org/VegetarianDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F034a902152c4729edade1172bcb9e58d5b73e412",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-02T15:19:48.488Z",
  "url": "https://www.thekitchn.com/how-to-make-tempeh-cooking-lessons-from-the-kitchn-202369"
}
