{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 3,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT6300S",
  "createdAt": "2022-12-04T10:28:12.816Z",
  "creator": {
    "@type": "Person",
    "name": "Lesley Téllez"
  },
  "dateCreated": "2019-12-04T11:00:00-05:00",
  "dateModified": "2022-05-06T11:19:19-04:00",
  "datePublished": "2019-12-04T11:00:00-05:00",
  "description": "A step-by-step guide to making pork and green chile tamales at home, plus instructions for freezing and re-heating. ",
  "headline": "How To Make the Best Tamales: A Step-by-Step Guide",
  "HowtoTip": {
    "text": "Make ahead: The filling can be made 1 or 2 days in advance and refrigerated. Fresh masa should be used within one or two days of purchase, or else it will turn sour.Storage: Any leftover pork and green chile filling can be frozen (it’s also great repurposed over nachos, rice, or in tacos). The tamales can also be filled and frozen raw and steamed directly from the freezer and may need an extra 5 minutes steaming time. Instant Pot variation: To cook the pork in an Instant Pot (Step 2), cook on HIGH pressure for 30 minutes, then naturally release the pressure for 10 minutes before quick releasing any remaining pressure. Cook the sauce and meat (Step 6) together with the Sauté function. To steam the tamales (Step 11), add 1 cup water to the Instant Pot insert. Place the steamer basket in the insert and place the tamales vertically, open-side up in the steamer. Lock on the lid and cook on the STEAM setting for 30 minutes."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FRecipes%2F2019-11-How-To-Tamales%2F2019-10-28_Kitchn89369_HT_Tamales"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FRecipes%2F2019-11-How-To-Tamales%2F2019-10-28_Kitchn89369_HT_Tamales"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipes%2F2019-11-How-To-Tamales%2F2019-10-28_Kitchn89369_HT_Tamales"
    }
  ],
  "keywords": [
    "corn",
    "garlic",
    "How To",
    "mexican",
    "onions",
    "pork",
    "recipe",
    "salsa",
    "Latin American",
    "Gluten-Free",
    "vegetables",
    "meat",
    "Main Dish",
    "Freezer Friendly",
    "Make Ahead",
    "dinner",
    "lunch",
    "team:food",
    "purpose:applenews",
    "purpose:email lead",
    "purpose:newsbreak",
    "purpose:pinterest",
    "purpose:search",
    "purpose:smartnews",
    "platform:email",
    "platform:newsfeeds",
    "platform:search",
    "platform:social",
    "course:main dish",
    "dishtype:salsa",
    "dishtype:dip",
    "cuisine:mexican",
    "cuisine:latin america",
    "timing:make-ahead",
    "timing:extended",
    "timing:freezer-friendly",
    "mainingredients:vegetable",
    "mainingredients:corn",
    "mainingredients:meat",
    "mainingredients:pork",
    "diet:gluten-free",
    "meal:lunch",
    "meal:dinner",
    "updated:2022-05-06"
  ],
  "name": "How To Make the Best Tamales: A Step-by-Step Guide",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "312 cal",
    "carbohydrateContent": "21.8 g",
    "cholesterolContent": "0 mg",
    "fatContent": "22.2 g",
    "fiberContent": "2.5 g",
    "proteinContent": "7.7 g",
    "saturatedFatContent": "3.0 g",
    "servingSize": "Serves 18",
    "sodiumContent": "282.2 mg",
    "sugarContent": "1.8 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT5100S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": "Mexican",
  "recipeIngredient": [
    "1 pound boneless pork shoulder",
    "1/2 large white onion",
    "2 cloves garlic, divided",
    "1 bay leaf",
    "1 pound tomatillos",
    "4 serrano peppers",
    "1 tablespoon canola oil",
    "1 tablespoon kosher salt, plus more for seasoning",
    "1 teaspoon ground cumin",
    "1 teaspoon Mexican oregano",
    "1/2 teaspoon freshly ground black pepper, plus more for seasoning",
    "1 large package dried corn husks (about 1 pound)",
    "2 pounds fresh masa for tamales (purchased from a tortillería; not masa preparada), or 3 cups masa harina for tamales",
    "1/2 to 3 cups salted chicken broth (not low-sodium)",
    "1 1/4 cups canola oil",
    "2 teaspoons kosher salt",
    "1 1/2 teaspoons baking powder"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak the corn husks. Place 1 package corn husks in a large pot or bowl and add enough hot tap water to cover. Make sure the husks are submerged by weighing them down with a few coffee mugs."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the pork. Cut 1 pound pork shoulder into 2-inch chunks. Season with kosher salt and black pepper. Place in a large saucepan. Cut 1/2 large white onion into 2 pieces, and add 1 piece to the pan. Add 1 of the garlic cloves, 1 bay leaf, and 2 1/2 cups water. Bring to a simmer over high heat, about 7 minutes. Reduce the heat to low, cover, and cook until the pork is fork tender and falling apart, stirring every 20 minutes to prevent the bottom of the pot from burning, 1 to 1 1/2 hours total. Meanwhile, start the chile sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the chile sauce ingredients. Husk and rinse 1 pound tomatillos. Place in a medium saucepan. Add the remaining onion piece, remaining garlic clove, and 4 serrano peppers, and cover with 1 inch of cold water. Bring to a boil, then lower the heat to medium. Simmer, stirring occasionally, until the items have softened, about 8 minutes for the tomatillos and peppers, and 12 minutes for the onion and garlic. Use a slotted spoon to transfer the items to a bowl as they are ready. Let cool slightly, then coarsely chop the peppers (discarding any tough stems), onion, and garlic."
    },
    {
      "@type": "HowToStep",
      "text": "Cool the meat. When the pork is ready, use a slotted spoon and transfer it to a bowl. Remove 1/4 cup of the broth for the sauce. Let the pork cool slightly, then shred with your fingers or two forks."
    },
    {
      "@type": "HowToStep",
      "text": "Blend the sauce. Place the tomatillos, chopped chiles, onion, garlic, and 1/4 cup broth in a blender and blend until smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Combine the sauce and meat. Heat 1 tablespoon canola oil in a medium saucepan over high heat until shimmering. Add the sauce in one quick pour. Stir in the shredded pork. Add 1 tablespoon kosher salt, 1 teaspoon ground cumin, 1 teaspoon Mexican oregano, and 1/2 teaspoon black pepper. Bring to a boil and cook for 3 to 4 minutes to let the flavors meld. The filling should taste salty—it needs to be saltier than you’d think, to stand out inside the tamales. Remove from the heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Knead the dough. If using masa harina for your dough, place 3 cups masa harina in a deep mixing bowl and pour in 2 1/4 cups chicken broth. Mix with your hands until the dough is moist and soft. If using fresh masa, knead 1/2 cup chicken broth into 2 pounds masa with your hands until a firm dough forms."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the dough. Pour 1 1/4 cups canola oil into a stand mixer fitted with the paddle attachment. (Alternatively, use an electric hand mixer and large bowl.) With the mixer on low speed — and don’t wear your best clothing, because it will splatter — add the masa in golf-ball-sized pieces one at a time. The dough may look rather lumpy and unattractive here, but it will eventually transform. Stop the mixer and sprinkle in 2 teaspoons kosher salt and 1 1/2 teaspoons baking powder. If using masa harina, stir in an extra 1/2 cup chicken broth. Mix on high speed until the dough is very light and fluffy, about 10 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the dough inside the husks. Remove 1 corn husk from the water and wipe off any extra water with a towel. Use a rubber spatula to spread about 1/4 to 1/2 cup of dough (the amount depends on the size of the corn husk) in a large rectangle. Leave a few inches of space at the top so the dough doesn’t burst out once it’s cooking, and leave about 3 inches of space at the narrower end of the leaf so you have room to fold it."
    },
    {
      "@type": "HowToStep",
      "text": "Add the homemade filling. Add a small amount of the pork filling (about 2 tablespoons) in a line down the center of the tamal. Don’t add too much, or else it will spill out of the husk when you’re folding it."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the tamales closed. To close the tamale, bring one side of the tamal toward the other, like an empanada or a taco, and press lightly to seal. Then tuck the leaves of the husk over each other into a tube-shape. Press down on the narrower end to seal, then fold up toward the wider end. Set aside folded side down and repeat with the remaining tamales."
    },
    {
      "@type": "HowToStep",
      "text": "Steam the tamales for 35 minutes. Add water to a steamer pot and line the insert with a layer of corn husks. (This helps keep the steam trapped inside and adds a bit of flavor.) Bring the water to a light boil. Place the tamales vertically, open-side up in the steamer, but don’t pack them too tightly or they won’t have room to expand. Cover with some extra corn husks. Cover and steam until the corn husk easily pulls away from the tamal, about 35 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Let the tamales cool 10 to 15 minutes. Don’t eat the tamales immediately after you remove them from the pot, as they’ll be too soft still. Let the tamales cool for 10 to 15 minutes — they’ll firm up quite a bit and be ready to eat."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-make-tamales-recipe-22943666"
  ],
  "suitableforDiet": "https://schema.org/GlutenFreeDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipes%2F2019-11-How-To-Tamales%2F2019-10-28_Kitchn89369_HT_Tamales",
  "totalTime": "PT11400S",
  "updatedAt": "2022-12-04T10:28:12.814Z",
  "url": "https://www.thekitchn.com/how-to-make-tamales-recipe-22943666"
}
