{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 3,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT2400S",
  "createdAt": "2022-12-04T09:41:10.844Z",
  "creator": {
    "@type": "Person",
    "name": "Casey Barber"
  },
  "dateCreated": "2019-08-14T11:00:53-04:00",
  "dateModified": "2020-01-21T21:59:45-05:00",
  "datePublished": "2019-08-14T11:00:53-04:00",
  "description": "A step-by-step guide to making easy, classic potato and cheese pierogies. ",
  "headline": "How To Make Better-than-Grandma&#8217;s Potato and Cheese Pierogies",
  "HowtoTip": {
    "text": "Make ahead: The filling can be made up to 1 day in advance. Refrigerate in an airtight container until ready to fill the pierogies.Storage: The pierogies can be frozen up to 3 months in advance of cooking. Freeze in a single layer on the waxed paper-lined baking sheet, then transfer to a sealable bag or vacuum seal once frozen solid. Pierogies can be stored in the refrigerator for up to 3 hours before boiling. Cover loosely with plastic wrap and store on the waxed paper-lined baking sheet.Ingredient/Equipment Variation: If you don’t have a 3-inch round cookie cutter, you can use the ring from a wide-mouth Mason jar or go grandma-style with a juice glass."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FRecipes%2F2019-08-how-to-better-than-grandmas-potato-and-cheese-pierogies%2F2019-07-15_Kitchn77183_How-To-Make-Better-than-Grandmas-Potato-and-Cheese-Pierogies"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FRecipes%2F2019-08-how-to-better-than-grandmas-potato-and-cheese-pierogies%2F2019-07-15_Kitchn77183_How-To-Make-Better-than-Grandmas-Potato-and-Cheese-Pierogies"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipes%2F2019-08-how-to-better-than-grandmas-potato-and-cheese-pierogies%2F2019-07-15_Kitchn77183_How-To-Make-Better-than-Grandmas-Potato-and-Cheese-Pierogies"
    }
  ],
  "keywords": [
    "children",
    "Cooking Lessons from The Kitchn",
    "dairy",
    "dinner",
    "Freezer Friendly",
    "How To",
    "lunch",
    "Make Ahead",
    "polish",
    "recipe",
    "Root Vegetables",
    "vegetarian",
    "video",
    "european",
    "team:food",
    "purpose:facebook",
    "purpose:flipboard",
    "purpose:instagram",
    "purpose:pinterest",
    "purpose:search",
    "platform:search",
    "platform:social",
    "cuisine:europe",
    "cuisine:polish",
    "cuisine:eastern european",
    "diet:vegetarian",
    "meal:lunch",
    "meal:dinner"
  ],
  "name": "How To Make Better-than-Grandma’s Potato and Cheese Pierogies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "564 cal",
    "carbohydrateContent": "59.2 g",
    "cholesterolContent": "0 mg",
    "fatContent": "29.6 g",
    "fiberContent": "2.9 g",
    "proteinContent": "15.4 g",
    "saturatedFatContent": "17.5 g",
    "servingSize": "Serves 4",
    "sodiumContent": "515.0 mg",
    "sugarContent": "2.1 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT2700S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Lunch",
  "recipeCuisine": "Europe",
  "recipeIngredient": [
    "8 ounces Yukon Gold potatoes (1 medium or 2 small), cut into 2-inch pieces",
    "1 tablespoon plus 1/4 teaspoon kosher salt, divided",
    "1/4 cup finely shredded cheddar cheese (1 ounce)",
    "1 to 2 tablespoons heavy cream",
    "1 large egg",
    "1/2 cup plain Greek yogurt (any fat percentage)",
    "3 tablespoons unsalted butter, melted and slightly cooled",
    "1 teaspoon kosher salt",
    "2 cups unbleached all-purpose flour",
    "1 tablespoon water",
    "4 tablespoons unsalted butter, divided",
    "Caramelized onions, for serving"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cook the potatoes. Place the potatoes in a medium saucepan and add water to cover by 2 inches. Stir in 1 tablespoon of the salt. Cover and bring to a boil over medium heat. Uncover and cook until the potatoes are tender, about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the potatoes. Drain the potatoes and return to the pan. Place over low heat and stir for about 30 seconds to remove excess moisture."
    },
    {
      "@type": "HowToStep",
      "text": "Rice the potatoes. Run the potatoes through a ricer or food mill into a bowl. Discard the skins. (Alternatively, peel the potatoes and mash until very smooth.)"
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the cheese, cream, and salt. Stir in the remaining 1/4 teaspoon salt, cheese, and 1 tablespoon of the cream—the consistency should be firm enough to roll into a ball. If the filling is too dry, stir in the remaining 1 tablespoon cream."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the egg, yogurt, and butter together. Whisk the egg, yogurt, butter, and salt together in a medium bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Stir the wet ingredients into the flour. Pour the flour into a large bowl. Pour in the egg mixture and gently stir into the flour. The dough will initially be very dry and shaggy, seeming as if it will never come together, but have no fear: Keep stirring, and it will pull itself into shape."
    },
    {
      "@type": "HowToStep",
      "text": "Smash the dough against the sides of bowl. Once the dough starts to come together, press and smash it against the sides of the bowl with your palms, picking up dough bits and essentially kneading it within the bowl until it forms a ball."
    },
    {
      "@type": "HowToStep",
      "text": "Knead the dough. Tip the dough and any remaining shaggy flakes out onto a clean work surface or silicone baking mat. Knead until smooth, about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the dough with bowl. Cover the dough with the bowl and let rest 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Make the egg wash and prepare a baking sheet. Whisk the egg and water together in a small bowl. Line a rimmed baking sheet with waxed paper or parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the dough into 4 pieces. Divide the dough into 4 pieces. Set aside 3 dough pieces and cover again with the bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Roll out the dough. Roll the remaining dough as thinly as possible into a rough 8 x 12-inch rectangle."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the dough into 6 rounds. Using a 3-inch round cookie cutter, cut out 6 rounds of dough. If the dough isn’t quartered evenly, you may get 5 rounds from one piece and 7 from another. Resist the temptation to re-roll dough scraps for additional rounds. It seems wasteful, but the dough won’t be as tender the second time around."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon filling into the rounds. Spoon 1 teaspoon filling into the center of each dough round."
    },
    {
      "@type": "HowToStep",
      "text": "Add the egg wash. Using your finger, swipe a very scant amount of egg wash—just a light touch—around the dough edge."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the pierogi. Fold into a half-moon shape: Either fold the dough over the filling on the work surface—I call this “the blanket”—or gently cup the pierogi in your hand in a U shape—I call this “the taco.”"
    },
    {
      "@type": "HowToStep",
      "text": "Seal the pierogi. Gently but firmly seal the pierogi by pinching and squeezing the edges together with your thumb and pointer finger. Start with one pinch at the top, then move to one “corner” of the pierogi and pinch along the edge back to the top. Repeat on the opposite side to finish sealing the pierogi."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to the baking sheet. Transfer to the baking sheet and repeat with the remaining dough and filling. Freeze on the baking sheet, cover loosely with plastic wrap and refrigerate up to 3 hours, or cook immediately."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the pierogies. Bring a 4-quart pot of water to a rolling boil over medium-high heat. Add the pierogies and cook until floating, 2 to 3 minutes for fresh and 4 to 5 minutes for frozen."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to the baking sheet. Using a spider or slotted spoon, scoop the pierogies out of the water and transfer to a rimmed baking sheet in a single layer."
    },
    {
      "@type": "HowToStep",
      "text": "Pan-fry the pierogies in butter. Melt 1 tablespoon of the butter in a large skillet over medium heat. Add as many pierogies as will fit in a single layer without crowding. Cook, flipping once, until the pierogies are brown and crispy, about 2 minutes per side. Repeat with the remaining pierogies, adding more butter for each batch. Serve with caramelized onions."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/pierogi-22931922"
  ],
  "suitableforDiet": "https://schema.org/VegetarianDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipes%2F2019-08-how-to-better-than-grandmas-potato-and-cheese-pierogies%2F2019-07-15_Kitchn77183_How-To-Make-Better-than-Grandmas-Potato-and-Cheese-Pierogies",
  "totalTime": "PT5100S",
  "updatedAt": "2022-12-04T09:41:10.842Z",
  "url": "https://www.thekitchn.com/pierogi-22931922"
}
