{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 3,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-06T20:00:26.178Z",
  "creator": {
    "@type": "Person",
    "name": "Emma Christensen"
  },
  "dateCreated": "2007-10-25T13:00:55-04:00",
  "dateModified": "2019-05-03T05:09:40-04:00",
  "datePublished": "2007-10-25T13:00:55-04:00",
  "headline": "How To Make a Zuni Café Roasted Chicken at Home",
  "HowtoTip": {
    "text": "This post has been updated — first published October 2007.Adapted from The Zuni Cafe Cookbook."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F388e39a6ca67e257cb7bef6bde6a98aef1bcd434"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F388e39a6ca67e257cb7bef6bde6a98aef1bcd434"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F388e39a6ca67e257cb7bef6bde6a98aef1bcd434"
    }
  ],
  "keywords": [
    "allergies",
    "Cooking Lessons from The Kitchn",
    "dinner",
    "Gluten-Free",
    "How To",
    "Kitchn 100",
    "low-carb",
    "lunch",
    "Main Dish",
    "Meat Tutorials",
    "paleo",
    "Party Food",
    "poultry",
    "recipe",
    "roasting",
    "purpose:search",
    "platform:search",
    "course:main dish",
    "dishtype:poultry dish",
    "mainingredients:poultry",
    "diet:paleo",
    "diet:low-carb",
    "diet:gluten-free",
    "meal:lunch",
    "meal:dinner",
    "updated:2019-05-03"
  ],
  "name": "How To Make a Zuni Café Roasted Chicken at Home",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "584 cal",
    "carbohydrateContent": "1.0 g",
    "cholesterolContent": "0 mg",
    "fatContent": "40.7 g",
    "fiberContent": "0.4 g",
    "proteinContent": "50.4 g",
    "saturatedFatContent": "11.7 g",
    "servingSize": "Serves 4",
    "sodiumContent": "935.0 mg",
    "sugarContent": "0.0 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 3- to 4-pound chicken, the smallest you can find (Judy Rodgers also specifies an organic and free-range chicken)",
    "Salt",
    "Pepper",
    "Fresh herbs, like thyme, sage, rosemary, or a mix"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Clean the chicken: Remove the giblets and save for another purpose or discard. Pat the chicken very dry, inside and out, with paper towels."
    },
    {
      "@type": "HowToStep",
      "text": "Loosen the skin over the breasts: Slip your fingers between the skin and breast meat near the cavity of the chicken. Slide your fingers as far beneath the skin as you can manage without tearing the skin, creating a pocket."
    },
    {
      "@type": "HowToStep",
      "text": "Tuck herbs under the skin: Holding the pocket of skin open with one hand, use the other to tuck a stem or two of herbs under the skin."
    },
    {
      "@type": "HowToStep",
      "text": "Season the chicken: In a small dish, measure out 3/4 teaspoon of salt for every pound of chicken. Mix in some fresh pepper. Rub the outside of the chicken with the salt mixture, making sure to get under the wings and drumsticks and sprinkling heavily over the thicker parts of the breasts and thighs."
    },
    {
      "@type": "HowToStep",
      "text": "Cover loosely and chill for 1 to 3 days: Transfer the chicken, breast-side up, to a dinner plate or other shallow dish. Place the chicken, on the plate, inside a clean plastic grocery bag and loosely tie the opening closed. The chicken should be covered, but still with some air circulation around the bird. Chill for up to 3 days; the larger your chicken, the more it will benefit from a long chill."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the oven and the baking dish: About an hour before baking, place the skillet or dish you're using to roast the chicken into the oven on a middle rack. Heat the oven to 475°F."
    },
    {
      "@type": "HowToStep",
      "text": "Dry the chicken: Uncover the chicken. Tilt it to drain any juices that have accumulated in the cavity. Pat the chicken dry with paper towels."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the chicken to the baking dish: Remove the pre-heated pan from the oven and set it on the stovetop. Place the chicken in the hot pan, breast-side up. It should begin to sizzle immediately — if not, don't worry, but increase the oven temperature by 25 degrees next time."
    },
    {
      "@type": "HowToStep",
      "text": "Roast the chicken for 20 to 30 minutes: Roast the chicken until you see the skin on the breasts start to blister and brown."
    },
    {
      "@type": "HowToStep",
      "text": "Flip the chicken breast-side down: Remove the pan from the oven and close the oven door. Carefully flip the chicken over using tongs and a spatula, covering your hands with oven mitts to protect from splashes."
    },
    {
      "@type": "HowToStep",
      "text": "Roast another 10 to 20 minutes: Roast breast-side down until the bottom also looks well-browned."
    },
    {
      "@type": "HowToStep",
      "text": "Flip and roast a final 5 to 10 minutes: Flip the chicken back over so that it's breast-side up. Check the temperature and roast another 5 to 10 minutes, until the skin over the breasts is well-browned and the chicken registers at least 165°F in the thickest part of the thigh meat. Total roasting time is 45 minutes to 1 hour; the larger your chicken, the more time it will need."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the juices from the chicken: Slash the skin connecting the thighs and the body of the chicken. Tilt the chicken in the pan so that any juices inside the chicken run out into the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Rest the chicken: Transfer the chicken to a serving platter or cutting board. Let the chicken rest, uncovered, for about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Simmer the pan drippings: While the chicken is resting, prepare the pan drippings. Tilt the pan to collect all the juices to one side and skim off any fat with a spoon. Place the pan over high heat and bring to a simmer. Simmer for a minute or two, scraping up any roasted bits from the bottom of the pan. Remove from heat. You can also make a pan sauce or a gravy from the drippings, if you prefer."
    },
    {
      "@type": "HowToStep",
      "text": "Carve the chicken and serve: Use a sharp knife to cut away the wings and the thighs from the chicken where they join the body. Separate the drumsticks and the thighs at the joint. Keeping your knife close to the bone and parallel to the ribs, cut away the chicken breasts. Serve immediately with the pan sauce, gravy, or pan drippings while the skin is crispy."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/how-to-make-a-zuni-cafe-roasted-chicken-at-home-34903"
  ],
  "suitableforDiet": "https://schema.org/GlutenFreeDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F388e39a6ca67e257cb7bef6bde6a98aef1bcd434",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-06T20:00:26.177Z",
  "url": "https://www.thekitchn.com/how-to-make-a-zuni-cafe-roasted-chicken-at-home-34903"
}
