{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-06T21:05:41.093Z",
  "creator": {
    "@type": "Person",
    "name": "Emma Christensen"
  },
  "dateCreated": "2013-11-20T12:00:00-05:00",
  "dateModified": "2020-01-21T20:52:44-05:00",
  "datePublished": "2013-11-20T12:00:00-05:00",
  "headline": "How To Freeze &#038; Reheat Dinner Rolls",
  "HowtoTip": {
    "text": ""
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F873f1f68972ac09647269ec96fa10fc40cf8a33f"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F873f1f68972ac09647269ec96fa10fc40cf8a33f"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F873f1f68972ac09647269ec96fa10fc40cf8a33f"
    }
  ],
  "keywords": [
    "baking",
    "bread",
    "Cooking Lessons from The Kitchn",
    "dinner roll",
    "How To",
    "Party Food",
    "recipe",
    "baked goods",
    "purpose:search",
    "platform:search",
    "dishtype:dinner roll",
    "dishtype:baked good",
    "dishtype:bread",
    "method:baked",
    "diet:under 200 calories",
    "diet:low-calorie",
    "diet:under 500 calories",
    "diet:low-fat",
    "diet:under 400 calories",
    "diet:under 300 calories",
    "updated:2020-01-21"
  ],
  "name": "How To Freeze & Reheat Dinner Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "154 cal",
    "carbohydrateContent": "28.5 g",
    "cholesterolContent": "0 mg",
    "fatContent": "2.0 g",
    "fiberContent": "1.5 g",
    "proteinContent": "5.0 g",
    "saturatedFatContent": "0.5 g",
    "servingSize": "Serves 4",
    "sodiumContent": "349.4 mg",
    "sugarContent": "0.5 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dinner roll",
  "recipeCuisine": [],
  "recipeIngredient": [
    "1 batch dinner roll dough, any recipe or use our favorite:→ How to Make Soft & Tender Dinner Rolls"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you're just a day or two away from your dinner, there might not even be a need to go to the freezer! Mixed dough actually keeps very well for a few days in the refrigerator."
    },
    {
      "@type": "HowToStep",
      "text": "You actually have two options here: You can refrigerate the dough just after it has risen and before shaping the rolls — just transfer it to a storage container big enough to have a few inches of space at the top, cover, and put it an a corner of your fridge where it won't be in the way. You can also refrigerate the dough just after shaping the rolls — transfer the shaped rolls into their baking dish, cover, and put it in the fridge."
    },
    {
      "@type": "HowToStep",
      "text": "→If you refrigerate the dough in bulk, no need to let it come to room temperature before shaping. Just shape the dough, let the rolls rise, and bake — add on an extra 20 minutes or so of rising time, but other than that, it's business as usual."
    },
    {
      "@type": "HowToStep",
      "text": "→If you refrigerate the shaped rolls, take them out of the fridge about an hour and a half before you want to bake them and let them rise until puffy. It's ok if they're still a little cool to the touch; as long as they've puffed up, they're ready to bake. Bake as usual."
    },
    {
      "@type": "HowToStep",
      "text": "Follow your recipe as usual right up until you shape the rolls. Go ahead and shape the rolls, but place them a little apart on a parchment-lined baking sheet. Let them rise about partway — until just starting to puff, but not ready to bake. At this point, freeze the rolls on their baking sheet for a few hours. Once they're frozen solid, you can transfer the unbaked rolls to a freezer bag or container. Unbaked rolls can be kept frozen for about a month, after which the yeast starts to have trouble rising the dough after thawing."
    },
    {
      "@type": "HowToStep",
      "text": "The day before you want to bake the rolls, remove the shaped rolls from the freezer and arrange them in your baking pan. Cover and let them thaw overnight in the refrigerator."
    },
    {
      "@type": "HowToStep",
      "text": "When ready to bake, remove the pan of rolls from the refrigerator and let them finish proofing at room temperature. This will take a little longer than usual, about an hour. The rolls may still be cool to the touch, but when they have obviously poofed, they're ok to bake. Bake as usual."
    },
    {
      "@type": "HowToStep",
      "text": "Bake your rolls as usual — as if you were going to serve them right away. Let them cool completely, then wrap them tightly in aluminum foil. Place the foil-wrapped package in a freezer bag or storage container and freeze for up to a month, after which even well-wrapped bread starts to develop frost and freezer burn."
    },
    {
      "@type": "HowToStep",
      "text": "You can bake these frozen rolls either thawed or straight from the freezer:→ To thaw the dinner rolls, remove the rolls from the freezer the night before you want to serve them. Take the foil-wrapped rolls out of the freezer bag and loosen the foil. Let thaw at room temperature overnight. Rolls can be served as soon as they've thawed but are even better if re-warmed (in their loose foil packing) for about 10 minutes in a 300°F oven."
    },
    {
      "@type": "HowToStep",
      "text": "→ To make rolls straight from the freezer, remove the rolls from the freezer the night before you want to serve them. Take the foil-wrapped rolls out of the freezer bag and loosen the foil. Heat the oven to 300°F. Place the loosely-wrapped package of rolls directly on an oven rack and bake for 20 to 25 minutes, until the rolls are piping hot to the touch and warm all the way through."
    },
    {
      "@type": "HowToStep",
      "text": "Serve these rolls immediately and while still warm as they tend to become dry once cooled."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/how-to-freeze-dinner-rolls-cooking-lessons-from-the-kitchn-197254"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F873f1f68972ac09647269ec96fa10fc40cf8a33f",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-06T21:05:41.091Z",
  "url": "https://www.thekitchn.com/how-to-freeze-dinner-rolls-cooking-lessons-from-the-kitchn-197254"
}
