{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Vicky & Ruth"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T13:10:57.580Z",
  "datePublished": "2018-01-02",
  "description": "This Vegan Ramen Bowl is exactly what you need to get you through this nasty, frigid winter! Loaded with immune boosting ingredients, you'll want to make it every week! Check out our other vegan dinner recipes under 300 calories",
  "image": [
    "https://mayihavethatrecipe.com/wp-content/uploads/2018/01/Immune-Booster-Vegan-Ramen-Bowl-Square-225x225.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2018/01/Immune-Booster-Vegan-Ramen-Bowl-Square-260x195.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2018/01/Immune-Booster-Vegan-Ramen-Bowl-Square-320x180.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2018/01/Immune-Booster-Vegan-Ramen-Bowl-Square.jpg"
  ],
  "name": "Immune Booster Vegan Ramen Bowl",
  "nutrition": {
    "@type": "nutritionInformation",
    "calories": "266 calories",
    "carbohydrateContent": "24.6",
    "cholesterolContent": "0",
    "fatContent": "10.7",
    "fiberContent": "3.1",
    "proteinContent": "19.3",
    "saturatedFatContent": "1.5",
    "servingSize": "2 cups",
    "sodiumContent": "1480",
    "transFatContent": "0",
    "unsaturatedFatContent": "3"
  },
  "prepTime": "PT15M",
  "recipeIngredient": [
    "1 tbsp toasted sesame oil 3 green onions, sliced 3oz shiitake mushrooms, thinly sliced 5 cups shredded Napa cabbage 6 cups water 4 cups ramen broth (here we used this one), or vegetable broth 1 4-inch piece fresh turmeric root, peeled and grated 1 1.5-inch piece of ginger, peeled and grated 7oz enoki mushrooms, stems removed 1/3 cup soy sauce 3oz ramen noodles (here we used these, but you can use your favorite) Salt to taste (optional) For the toppings: 2 tsp toasted sesame oil, divided 6 baby bok choy, sliced in half 1/4 tsp salt or to taste 1 lb high protein super firm tofu, diced small 2 tsp soy sauce Chili garlic sauce to taste (optional) (here we used this one)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat 1 tablespoon of sesame oil in a large soup pot. Add the sliced green onions and shiitake mushrooms and cook over medium high heat for about 3 minutes, stirring occasionally. Add the cabbage and continue cooking for 4 minutes, stirring occasionally"
    },
    {
      "@type": "HowToStep",
      "text": "Add the water, broth, grated ginger and turmeric, enoki mushrooms and soy sauce. Bring to boil. Add the noodles, reduce the heat to low, cover and simmer for 20 minutes"
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare the toppings. Heat one teaspoon of sesame oil in a large non stick skillet. Arrange the baby bok choy halves flat side down, add 1/4 teaspoon of salt and cook over medium high heat for 3 to 5 minutes, until the surface starts to brown. Turn them over and cook for another 2 minutes. Set aside until ready to use"
    },
    {
      "@type": "HowToStep",
      "text": "Heat another teaspoon of sesame oil in the same skillet. Add the diced tofu and cook, tossing often, for 3-4 minutes or until it starts to brown. Add 2 teaspoons of soy sauce and cook for another minute"
    },
    {
      "@type": "HowToStep",
      "text": "Serve the ramen hot in a large bowl, topped with the sauteed baby bok choy, tofu and a spoonful of chili garlic sauce"
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://mayihavethatrecipe.com/immune-booster-vegan-ramen-bowl"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-02T13:10:57.578Z",
  "url": "https://mayihavethatrecipe.com/immune-booster-vegan-ramen-bowl/"
}
