{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-05T14:38:15.652Z",
  "datePublished": "2022-09-26",
  "description": "Try making these bite-sized pork pies for a special picnic treat.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/stebak380indpor_034:Square-1300x1300"
  ],
  "keywords": "Snacks",
  "name": "Individual Pork Pies Recipe | Woolworths",
  "prepTime": "PT60M",
  "recipeCategory": "Snacks",
  "recipeCuisine": "European",
  "recipeId": "RGR11882",
  "recipeIngredient": [
    "200g pork belly, trimmed of fat and skin, and cubed",
    "200g pork shoulder, trimmed and cubed",
    "50g unsmoked back, or streaky bacon, trimmed and diced",
    "10 sage leaves, finely chopped",
    "0.25 tsp nutmeg",
    "0.25 tsp allspice",
    "410g plain flour (save 10g for dusting)",
    "0.5 tsp fine salt",
    "150g lard or beef dripping, cubed",
    "1 egg, beaten (for glazing)",
    "2 sheets leaf gelatine, cut into pieces (optional)",
    "1.0 cup chicken stock (optional)",
    "1 pinch sea salt",
    "1 pinch freshly ground black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 200°C. Put the pork belly, pork shoulder, bacon, herbs, seasoning, and spices into a food processor and whiz until the meat is chopped, but not mushy. If you do not have a processor, cut the meat by hand into 5mm dice, then mix in the other ingredients."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the hot water crust, place the flour and salt in a bowl and make a well. Boil a kettle, then measure out 150ml boiling water into a jug. Add the lard or dripping to the water, and stir until the fat has melted. This will also reduce the temperature of the water and make it easier to work with."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Pour the liquid into the centre of the flour and mix together with a wooden spoon. At the end, you will need to use your hands to bring it all together into a soft dough. Be careful, as it will be hot. Cut off one-quarter of the pastry, wrap it in a clean tea towel and put it somewhere warm for later."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "You will need to work quickly as the pastry will begin to harden as it cools. Turn the dough out onto a well-floured work surface and roll it out to 5mm thick. Cut circles big enough to line the muffin tray, allowing the pastry to overlap the edges slightly. Make 12 pastry cases. Pack the pork filling into each of the lined muffin cases, and brush a little beaten egg around the edges of each."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Roll out the set-aside pastry. Cut out 12 lids to fit the muffin cases. Top the filling with the lids, and press down the sides to seal. Brush the tops with egg. Use a chopstick or other implement to make a hole in each pie if you wish to fill it with jelly later, or cut 2 slits to allow the steam to escape if you don't."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bake the pies in the centre of the oven for 30 minutes, then reduce the heat to 160°C and cook for a further 30 minutes until golden brown. Remove from the oven and leave to cool in the tray for 10 minutes before turning out. At this stage they can be eaten hot, allowed to cool, or cooled and filled with jelly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the jelly (if using), soak the gelatine in a little cold water for 5 minutes until softened. Heat the chicken stock and add the softened gelatine, stirring constantly until it dissolves. Cool. Once the liquid starts to thicken, but not solidify, use a small funnel to pour it into each cooled pie, a little at a time. You may need to reopen the holes in the tops of the pies if they have closed up a little when cooking. Each pie will need only 2-3 tablespoons of liquid. Refrigerate to set the jelly overnight before eating."
    }
  ],
  "recipeNameId": "individual-pork-pies",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/individual-pork-pies"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-12-05T14:38:15.652Z",
  "url": "https://www.woolworths.com.au/shop/recipes/individual-pork-pies"
}
