{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-04T22:23:00.522Z",
  "datePublished": "2017-09-24T08:00:00+00:00",
  "description": "The super-thin, spongy and deliciously tangy flatbread is a staple of Ethiopian cuisine and its quite easy to make at home.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2017/09/injera-with-cilantro-mango-chutney1.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2017/09/injera-with-cilantro-mango-chutney1-500x500.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2017/09/injera-with-cilantro-mango-chutney1-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2017/09/injera-with-cilantro-mango-chutney1-480x270.jpg"
  ],
  "keywords": "flatbread recipe, how to make flatbread, how to make Injera, Injera",
  "name": "Injera with Cilantro Mango Chutney",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "98 kcal",
    "carbohydrateContent": "12 g",
    "fatContent": "5 g",
    "fiberContent": "2 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "1 g",
    "servingSize": "4 g",
    "sodiumContent": "76 mg",
    "sugarContent": "1 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "4 g"
  },
  "prepTime": "PT2880M",
  "recipeCategory": "Bread",
  "recipeCuisine": "Ethiopian",
  "recipeIngredient": [
    "2 cups teff flour",
    "1/8 teaspoon active dry yeast",
    "1 cup all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1/2 teaspoon salt",
    "4 teaspoons freshly grated ginger",
    "4 small shallots (roughly chopped)",
    "4 cups packed cilantro leaves with tender stems",
    "2 jalapeño peppers (ribs and seeds removed, roughly chopped)",
    "1 teaspoon ground cumin",
    "1 teaspoon ground coriander",
    "1/2 to 3/4 cup canola oil (depending on how thick you want the chutney)",
    "Salt to taste",
    "Flesh of 1 ripe mango (diced)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Whisk teff flour and yeast together in a large glass bowl. Add two cups of lukewarm water and whisk the mixture until it is completely smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the bowl with plastic wrap and let it sit at room temperature for 42 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Take a look at the batter and see whether it looks shiny on top (it may actually have a bit of water sitting on top). If it doesn’t look shiny yet, let it sit up to 6 hours longer."
    },
    {
      "@type": "HowToStep",
      "text": "Once the surface of the batter looks shiny, gently shake the bowl. You should see a few bubbles rising to the top. If you see bubbles, the batter is ready for the next step."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate bowl, whisk together the all-purpose flour, the baking powder and the salt."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour mix to the batter."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk up to 1 cup of water into the batter, a little bit at a time, until the dough is completely smooth. (I added the whole cup). Your goal is to get a thin and pourable consistency that will easily spread when swirled around in a pan."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the batter again with plastic wrap and let sit at room temperature for another hour."
    },
    {
      "@type": "HowToStep",
      "text": "Take a look at the batter again see how thick it is. If it doesn't run easily off a spoon, whisk in more water. It’s very important that the batter is really thin because you want the bread to be very thin as well (so thin that you can easily see through it). The bread will not taste good at all when it is too thick!"
    },
    {
      "@type": "HowToStep",
      "text": "Set a large wire rack next to you, then heat a large nonstick skillet to which you have a lid over medium heat for 3 minutes. Pour 1/4 cup of batter into the skillet and immediately spread it around by swirling the pan."
    },
    {
      "@type": "HowToStep",
      "text": "You will start to see the bread cook from the outer rim to the center and the edges of the bread will start to peel away from the pan. When the bread is cooked about half-way to the center, put the lid on the pan and keep it there for about 1 minute. This will steam the top of the bread."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the lid, take the injera out of the pan with a rubber spatula and cool on the wire rack."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat the cooking process with the remaining batter."
    }
  ],
  "recipeYield": "25",
  "sameAs": [
    "https://ohmyveggies.com/injera"
  ],
  "suitableForDiet": [
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT2915M",
  "updatedAt": "2022-12-04T22:23:00.521Z"
}
