{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "28",
    "ratingValue": "4.97"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-29T22:46:26.000Z",
  "datePublished": "2018-06-24T17:57:06+00:00",
  "description": "With just a few ingredients, this Jerk Chicken with Pineapple Black Bean Salsa is big on fresh summery flavor and will become your new go-to easy summer meal!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2018/06/Jerk-Chicken-with-Pineapple-Black-Bean-Salsa-H.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/06/Jerk-Chicken-with-Pineapple-Black-Bean-Salsa-H-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/06/Jerk-Chicken-with-Pineapple-Black-Bean-Salsa-H-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2018/06/Jerk-Chicken-with-Pineapple-Black-Bean-Salsa-H-480x270.jpg"
  ],
  "keywords": "Chicken Meal Prep, Ground Chicken Recipes, meal prep",
  "name": "Jerk Chicken with Pineapple Black Bean Salsa",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "389 kcal",
    "carbohydrateContent": "67 g",
    "fatContent": "6 g",
    "fiberContent": "4 g",
    "proteinContent": "17 g",
    "servingSize": "1 Serving",
    "sodiumContent": "249 mg"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "4 cups cooked rice ($0.70)",
    "2 cups pineapple tidbits* ($0.50)",
    "1 15oz. can black beans, well rinsed ($0.89)",
    "1/3 cup finely diced red onion ($0.16)",
    "1/2 cup coarsely chopped cilantro ($0.17)",
    "1 lime ($0.75)",
    "1 pinch crushed red pepper (optional) ($0.02)",
    "1/4 tsp salt, or to taste ($0.02)",
    "2 boneless, skinless chicken breasts (about 2/3 lb. each) ($6.42)",
    "1 Tbsp jerk seasoning ($0.030)",
    "1 Tbsp cooking oil ($0.04)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin cooking your rice first. If you plan on packing this for meal prep, transfer the cooked rice to your meal prep containers and refrigerate them as you finish the rest of the recipe, so they can begin to cool down."
    },
    {
      "@type": "HowToStep",
      "text": "While the rice is cooking, prepare the pineapple black bean salsa. Coarsely chop the pineapple tidbits into smaller pieces, similar in size to the black beans. Place the chopped pineapple, rinsed black beans, diced red onion, and chopped cilantro in a large bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Squeeze the juice of half the lime (about 1 Tbsp) over the ingredients in the bowl. Also add 1/4 tsp salt and a pinch of red pepper flakes (optional). Stir the ingredients together, give it a taste, and add more salt or lime juice if needed. Any unused lime will be cut into wedges for squeezing over the chicken before serving."
    },
    {
      "@type": "HowToStep",
      "text": "Next, prepare the jerk chicken. Pat the chicken breasts dry with a paper towel. Place a piece of plastic wrap over the chicken to eliminate splatter, then gently pound the chicken breasts into an even thickness using either a rolling pin or a mallet. Sprinkle the jerk seasoning over both sides of the chicken and use your hands to rub it into the surface, making sure they're completely coated."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cooking oil to a large skillet, or preheat your grill. Once hot, add the chicken and cook until well browned on both sides, and the chicken is completely cooked through (about 7 minutes each side). It should no longer be pink in the center and the juices should run clear. For extra safety, use an instant read meat thermometer and cook until the internal temperature reaches 165oF."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the cooked chicken to a clean cutting board and let it rest for five minutes. After five minutes, slice the chicken into 1/2-wide strips."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, place about a cup of cooked rice on a plate, or in your meal prep container, top with about a cup of the pineapple black bean salsa, and a few strips of the jerk chicken. Slice the remaining lime into wedges and squeeze fresh juice over the chicken just before eating."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/jerk-chicken-with-pineapple-black-bean-salsa"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-29T14:20:09.772Z"
}
