{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "41",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T15:28:54.579Z",
  "datePublished": "2019-06-11T03:00:18+00:00",
  "description": "Made with kale and chickpeas, these falafel are a healthier take on one of our favorite Middle Eastern dishes. Delicious, satisfying, and only 30 minutes to prepare. Serve on greens or wrapped in chard or pita.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2019/04/Kale-Falafel-Hummus-Wraps-SQUARE.jpeg",
    "https://minimalistbaker.com/wp-content/uploads/2019/04/Kale-Falafel-Hummus-Wraps-SQUARE-500x500.jpeg",
    "https://minimalistbaker.com/wp-content/uploads/2019/04/Kale-Falafel-Hummus-Wraps-SQUARE-500x375.jpeg",
    "https://minimalistbaker.com/wp-content/uploads/2019/04/Kale-Falafel-Hummus-Wraps-SQUARE-480x270.jpeg"
  ],
  "keywords": "falafel wraps",
  "name": "Kale Falafel Hummus Wraps",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "421 kcal",
    "carbohydrateContent": "60.7 g",
    "fatContent": "15.7 g",
    "fiberContent": "11.6 g",
    "proteinContent": "15.1 g",
    "saturatedFatContent": "1.9 g",
    "servingSize": "1 wraps",
    "sodiumContent": "881 mg",
    "sugarContent": "6.1 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "4 cups loosely packed kale, stems removed and torn",
    "4 large cloves garlic, skins removed (4 large cloves yield ~2 Tbsp or 12 g)",
    "1 15-ounce can chickpeas, rinsed and drained (~1 1/2 cups as recipe is written)",
    "1 1/2 Tbsp tahini",
    "3 Tbsp fresh lemon juice",
    "1/2 tsp ground cumin",
    "1/2 tsp sea salt",
    "1/4-1/2 cup oat flour (ground from rolled oats // or all purpose if not gluten free)",
    "2-4 Tbsp avocado or olive oil (for cooking)",
    "Hummus (or store-bought // for topping)",
    "4 medium pitas (white or wheat // sub rainbow chard for gluten-free option)*)",
    "Greens of choice (such as fresh parsley or lettuce)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add kale and garlic to a food processor and pulse to chop into small bits. Then add chickpeas, tahini, lemon juice, cumin, and salt and pulse to combine. Mixture shouldn’t be puréed, just combined."
    },
    {
      "@type": "HowToStep",
      "text": "Once incorporated, transfer mixture to a medium mixing bowl (or stir directly in food processor) and introduce 1/4 cup oat flour (amount as original recipe is written // adjust if altering batch size). Add oat flour another 1 Tbsp (5.6 g) at a time until the mixture is thick enough to handle — adding roughly 2-4 Tbsp."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as desired. I added a touch more salt, cumin, and lemon juice. Scoop out heaping 2-Tbsp portions of falafel dough and use your hands to form them into approximately 1/2-inch thick patties. As written, recipe makes ~9 falafel."
    },
    {
      "@type": "HowToStep",
      "text": "NOTE: If not cooking all of the falafel right away, FREEZE uncooked falafel between layers of parchment paper and store in a container in the freezer up to 1 month. Then just thaw and cook as instructed!"
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium to medium-high heat. Once hot, add 2 Tbsp oil (or lesser end of range if adjusting batch size). Swirl to coat pan. Add 4 falafel (or however many will fit comfortably) to the pan at a time."
    },
    {
      "@type": "HowToStep",
      "text": "Cook until browned on the bottom, checking at the 2-minute mark to ensure they’re not over-browning. If they are, slightly reduce heat. Flip once they're deep golden brown — about 3-4 minutes. Cook until the other side is golden brown as well."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble, lay pita (or chard) flat, top with 2-3 falafel, a healthy spread of hummus, and greens or herbs, and roll up. Secure with a toothpick or wrap with parchment or foil for easy handling. Store leftover falafel covered in the refrigerator for up to 4-5 days and reheat in a 350 degree F (176 C) oven. See freezing instructions in step 4."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/kale-falafel-hummus-wraps"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T15:28:54.578Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=-TTCGB5Dnac",
    "description": "Made with kale and chickpeas, these falafel are a healthier take on one of my favorite Mediterranean dishes. Delicious, satisfying, and only 30 minutes to prepare. Serve on greens or wrapped in chard or pita.\n\nFull Recipe: https://minimalistbaker.com/kale-falafel-hummus-wraps\n\nThe origin of falafel is an ongoing and heated debate. Some would say it’s a quintessential Israeli food, while Palestinians claim its Arab roots, and still others claim it originated in Egypt, Lebanon, or Yemen. While we claim no expertise on the origins of falafel, we do know we absolutely love its crispy texture and rich flavor. \n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT59S",
    "embedUrl": "https://www.youtube.com/embed/-TTCGB5Dnac?feature=oembed",
    "name": "Kale Falafel Hummus Wraps | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/-TTCGB5Dnac/hqdefault.jpg",
    "uploadDate": "2019-06-11T08:00:00+00:00"
  }
}
