{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "4"
  },
  "author": {
    "@type": "Person",
    "name": "Shannon @ Yup, it's Vegan"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T23:09:55.897Z",
  "datePublished": "2015-11-22T17:00:26+00:00",
  "description": "Author's note: Traditional Greek spanakopita consists of a flaky filo crust filled with spinach and feta cheese, flavored with garlic, onion, and herbs. But anything spinach can do, kale can do better. Its hearty texture and mildly sweet flavor take spanakopita to another level. (Recipe excerpted from Crossroads by Tal Ronnen with Scot Jones. (Artisan Books). Copyright © 2015. Photographs by Lisa Romerein.)",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2015/11/vegan-kale-spanakopita-harissa-sauce-crossroads-cookbook-4.jpg"
  ],
  "keywords": "Kale Spanakopita",
  "name": "Kale Spanakopita with Harissa Sauce and Mint Oil (from the Crossroads cookbook)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "77 kcal",
    "carbohydrateContent": "8 g",
    "fatContent": "4 g",
    "fiberContent": "1 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 roll",
    "sodiumContent": "81 mg",
    "sugarContent": "1 g",
    "unsaturatedFatContent": "2 g"
  },
  "prepTime": "PT35M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "3 tbsp grapeseed oil",
    "1 large onion (chopped)",
    "4 garlic cloves (minced)",
    "2 lb kale (washed, dried, tough center ribs removed, and leaves finely chopped)",
    "1/2 tsp red pepper flakes",
    "Kosher salt and freshly ground black pepper",
    "2 cups Kite Hill almond ricotta (crumbled (about 14 ounces)",
    "1/2 cup finely chopped fresh dill",
    "1/2 cup finely chopped fresh mint",
    "8 tbsp Earth Balance butter stick (melted (1 stick)",
    "1/2 lb premade filo dough (such as Athens) (eighteen 9-by-14 inch sheets), thawed but kept refrigerated)",
    "harissa sauce (recipe follows)",
    "1/4 cup mint oil (recipe follows)",
    "2 tbsp Earth Balance butter stick",
    "2 pints cherry tomatoes (stemmed)",
    "1 shallot (chopped)",
    "2 garlic cloves (chopped)",
    "3/4 cup dry white wine",
    "2 1/2 tbsp nutritional yeast (see note)",
    "2 tbsp harissa spice mix (see note)",
    "1 cup fresh mint leaves with tender stems",
    "1/2 cup extra-virgin olive oil",
    "1/8 tsp kosher salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put a large sauté pan over medium-high heat and add the grapeseed oil. When the oil is hot, add the onion and garlic and sauté until very soft, about 4 minutes. Add the kale in handfuls, folding the leaves over with a spoon until each batch is wilted before adding more. Once all the kale is in the pan, season with the red pepper flakes, salt, and black pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the kale mixture to a colander set over a bowl or in the sink. Using the back of a spoon, gently press out all of the excess liquid. Spread the kale out on a baking sheet and set aside to cool; the kale needs to be completely cool to prevent the dough from becoming soggy. (The kale can be prepared a couple of hours in advance, covered, and refrigerated.)"
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the cooled kale to a cutting board and coarsely chop. Then transfer to a mixing bowl and stir in the almond ricotta, dill, and mint until well combined. Season with salt and black pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375°F. Brush two baking sheets with some of the melted butter substitute."
    },
    {
      "@type": "HowToStep",
      "text": "Unroll the filo dough and lay one sheet on a work surface. (Keep the remaining filo covered with a damp—not wet—towel as you work to prevent it from drying out and becoming brittle.) Brush the sheet with melted butter substitute. Stack a second sheet of filo on top and brush with melted butter substitute, then repeat the process with another sheet of filo, so you have three buttered layers."
    },
    {
      "@type": "HowToStep",
      "text": "With a sharp knife or pizza cutter, cut the sheets lengthwise into 3-inch-wide strips. Cut the pieces crosswise in half, so you end up with 6 pieces. Place a heaping tablespoon of the kale-ricotta filling near the bottom of one filo strip. Fold the sides over, then fold the bottom up to encase the filling. Tightly roll up the filo away from you, to form a cigar-shaped spanakopita. Place on one of the prepared baking sheets, seam side down, and cover with plastic wrap while you fill and roll the remaining strips. Repeat the process until all of the filo sheets are layered, cut, filled, and rolled."
    },
    {
      "@type": "HowToStep",
      "text": "Brush the tops of the spanakopita cigars with the remaining melted butter substitute. Bake for 20 to 30 minutes, until crisp and golden. Serve hot or warm, with the harissa sauce, dotted with the mint oil, on the side for dipping."
    }
  ],
  "recipeYield": "36",
  "sameAs": [
    "https://yupitsvegan.com/2015/11/22/vegan-kale-spanakopita-crossroads-cookbook-review"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-02T23:09:55.895Z"
}
