{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-24T12:25:40.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Lamb & Pea Pie recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp207lampea_025:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Meat pie & tart",
  "name": "Lamb & Pea Pie Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "English",
  "recipeId": "RGR35126",
  "recipeIngredient": [
    "1-2 tbs olive oil",
    "1 onion, finely chopped",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "2 cloves garlic, grated or finely chopped",
    "350g lamb leg steaks, cut into bite-sized pieces",
    "1 tsp ground turmeric",
    "0.5 tsp ground allspice",
    "2 tbs plain flour",
    "3.6 cup hot vegetable stock",
    "2 waxy potatoes, peeled and cut into small cubes",
    "125g frozen peas, thawed",
    "300g ready-made shortcrust pastry",
    "1 egg, lightly beaten, for egg wash"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat 1 tablespoon of the oil in a large pan over a low heat. Add the onion and a pinch of salt, and sweat gently for about 5 minutes until soft and translucent. Add the garlic then increase the heat to medium, and add a little extra oil if needed. Tip in the lamb, and sprinkle over the turmeric and allspice. Cook, stirring now and then, for 6-8 minutes until the lamb is browned all over."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove from the heat, and stir in the flour and a tablespoon of the stock. Return to the heat, and pour in the remaining stock. Bring to the boil, reduce the heat to low, and add the potatoes. Simmer gently, stirring occasionally so that the mixture doesn’t stick, for about 20 minutes until the potatoes have cooked and the sauce has thickened. Add the peas, and season well with salt and black pepper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, preheat the oven to 200°C (Gas 6). Spoon the meat filling into the pie dish. On a floured work surface, roll out the pastry so that it is about 5cm larger than the top of the pie dish. Cut out a strip of pastry about 2.5cm in from the edge to make a collar. Wet the edge of the pie dish with a little water; fit the pastry strip all the way around, and press down firmly. Brush the pastry collar with a little of the egg wash, then top with the pastry lid. Trim away the excess. Using your finger and thumb, pinch together the edges to seal, and decorate the top with any leftover pastry, if you wish."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Brush the top of the pie all over with the remaining egg wash. Using a sharp knife, make 2 slits in the top to allow steam to escape. Bake in the oven for 30-40 minutes until cooked and golden all over. Serve hot."
    }
  ],
  "recipeNameId": "lamb-and-pea-pie",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/lamb-and-pea-pie"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-11-24T14:51:45.909Z",
  "url": "https://www.woolworths.com.au/shop/recipes/lamb-and-pea-pie"
}
