{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT7M",
  "createdAt": "2022-11-23T06:51:28.462Z",
  "datePublished": "2016-05-14T12:00:07+00:00",
  "description": "Lemon Butter Green Beans are the perfect go-to all-purpose side dish with a fresh and vibrant flavor. Only five ingredients needed. ",
  "image": {
    "@type": "ImageObject",
    "height": 480,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2016/05/Lemon-Butter-Green-Beans-front-1.jpg",
    "width": 640
  },
  "name": "Lemon Butter Green Beans",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "150.2 kcal",
    "carbohydrateContent": "22.1 g",
    "fatContent": "5.98 g",
    "fiberContent": "6.73 g",
    "proteinContent": "4.43 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1270.45 mg"
  },
  "prepTime": "PT10M",
  "recipeIngredient": [
    "1 lb. green beans ($0.98)",
    "1 Tbsp butter ( $0.09)",
    "1 lemon ($0.59)",
    "Salt and Freshly Cracked Pepper to taste ($0.05)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Use a microplane, zester, or small-holed cheese grater to remove the thin layer of yellow zest from the lemon. Set the zest aside. Remove the stems from the green beans and, if you prefer shorter pieces, snap them in half. Place the green beans in a colander and rinse well with cool water."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the rinsed green beans to a deep skillet. Add about one inch of fresh water (the water will not cover the beans). Place a lid on the skillet and turn the flame on to medium-high. Allow the water to come up to a boil. Let the beans simmer and steam for 3-5 minutes, or just until the beans are bright green and just slightly tender. Test the texture with a fork."
    },
    {
      "@type": "HowToStep",
      "text": "Once the green beans are bright green and slightly tender, turn off the heat and drain them in a colander. Return the drained green beans to the still-warm skillet with the heat turned off."
    },
    {
      "@type": "HowToStep",
      "text": "Add the butter, about 1/2 tsp of lemon zest, a quick squeeze of the lemon juice (about 1 tsp), a pinch of salt, and some freshly cracked pepper. Toss the green beans to distribute the seasonings and allow the residual heat to melt the butter."
    },
    {
      "@type": "HowToStep",
      "text": "When the butter has melted fully, taste the green beans and add more salt, pepper, lemon juice, or lemon zest to your liking. Serve immediately."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/random"
  ],
  "totalTime": "PT17M",
  "updatedAt": "2022-11-23T06:51:28.434Z"
}
