{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "4.94"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-29T17:17:20.603Z",
  "datePublished": "2017-07-03T16:24:36+00:00",
  "description": "This rustic Lemon Blueberry Cream Cheese Galette is a simple dessert that can be made with frozen or fresh berries. Easier than pie!&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2017/07/Lemon-Blueberry-Cream-Cheese-Galette-close.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/07/Lemon-Blueberry-Cream-Cheese-Galette-close-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/07/Lemon-Blueberry-Cream-Cheese-Galette-close-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/07/Lemon-Blueberry-Cream-Cheese-Galette-close-480x270.jpg"
  ],
  "keywords": "Dessert",
  "name": "Lemon Blueberry Cream Cheese Galette",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "355.32 kcal",
    "carbohydrateContent": "34.42 g",
    "fatContent": "21.8 g",
    "fiberContent": "2.3 g",
    "proteinContent": "5.63 g",
    "servingSize": "1 Serving",
    "sodiumContent": "260.3 mg"
  },
  "prepTime": "PT75M",
  "recipeIngredient": [
    "1.5 cups flour (plus some for dusting) ($0.09)",
    "1 tsp sugar ($0.02)",
    "Pinch salt ($0.01)",
    "8 Tbsp cold butter ($1.07)",
    "3 Tbsp ice water ($0.00)",
    "1/2 lb. blueberries (frozen or fresh) ($1.80)",
    "1 Tbsp sugar ($0.02)",
    "1 tsp cornstarch ($0.02)",
    "1 fresh lemon ($0.75)",
    "4 oz cream cheese, room temperature ($0.75)",
    "2 tsp sugar ($0.04)",
    "1 large egg, separated ($0.26)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To prepare the galette crust, combine the flour, sugar, and salt in a large bowl. Cut the cold butter into chunks and add it to the flour and salt. Use a pastry cutter or your hands to work the butter into the flour until the flour looks like damp sand with some pea-sized pieces of butter."
    },
    {
      "@type": "HowToStep",
      "text": "Begin adding ice water, one tablespoon at a time, until a dough forms and no dry flour remains on the bottom of the bowl. Shape the dough into a flattened disc, wrap it in plastic, and refrigerate for one hour or until solid."
    },
    {
      "@type": "HowToStep",
      "text": "While the dough is refrigerating, combine the blueberries, sugar, cornstarch, 1/2 tsp of zest and 1 Tbsp of juice from the lemon. Stir them together well and set the mixture aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate bowl, combine the room temperature cream cheese, sugar, egg yolk, and 1 tsp juice from the lemon until it forms a smooth mixture. Save the egg white to brush over the crust just before baking."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400oF. Lightly flour a clean work surface. Take the dough out of the refrigerator and roll it into a 14-16 inch circle. The dough may seem a little stiff at first, but it will become more pliable as it warms. Make sure to keep your work surface dusted with flour as you roll to keep the dough from sticking."
    },
    {
      "@type": "HowToStep",
      "text": "Line a large baking sheet with parchment. Transfer the rolled dough onto the parchment (you can either roll or fold the dough to transfer without ripping). Spread the cream cheese mixture over the center of the circle, leaving about 2-inches of bare dough around the outside edge. I like to leave a higher \"lip\" on the outer edge of the cream cheese to help hold in the berries and their juice."
    },
    {
      "@type": "HowToStep",
      "text": "Stir the blueberries one last time and pour them over the cream cheese, including all of the juice from the bowl. Begin folding up the sides of the dough over the cream cheese and berries, leaving the center open."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the reserved egg white with a fork, using a drop or two of water to make it more fluid, if needed. Brush the egg white over the surface of the galette dough."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the galette for 30 minutes, or until the crust is golden brown. Let the galette sit for 10 minutes before slicing into six pieces and serving."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://budgetbytes.com/blueberry-lemon-cream-cheese-galette"
  ],
  "totalTime": "PT105M",
  "updatedAt": "2022-11-29T17:17:20.601Z"
}
