{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Kiersten"
  },
  "createdAt": "2022-12-02T09:28:42.308Z",
  "datePublished": "2019-05-06T08:00:00+00:00",
  "description": "Shared with publisher permission from Bazaar: Vibrant Vegetarian Recipes by Sabrina Ghayour. Photo credit: Kris Kirkham.",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2019/05/p145-Lemon-black-pepper-Pecorino-Cabbage-Rice.jpg"
  ],
  "name": "Lemon, Black Pepper, Pecorino & Cabbage Rice",
  "recipeCategory": "Side Dishes",
  "recipeIngredient": [
    "olive oil",
    "1 white onion (very finely chopped)",
    "1 1/2 cups basmati rice",
    "1/2 cup butter (divided)",
    "1 1/4 –1 1/2 quarts boiling water",
    "1 teaspoon freshly ground black pepper (mill it coarsely)",
    "3 1/2 ounces pecorino cheese (finely grated, plus extra (optional) to serve)",
    "1/2 large Savoy cabbage (shredded into ribbons)",
    "finely grated zest of 1 unwaxed lemon"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat a large saucepan over a medium-low heat and add enough olive oil to coat the base of the pan. Add the onion and cook for about 8–10 minutes, or until soft and translucent, without browning."
    },
    {
      "@type": "HowToStep",
      "text": "Add the rice and half the butter to the saucepan and stir gently for a minute or so. Then begin adding the boiling water a ladleful at a time, stirring constantly, ensuring that each ladleful of water is absorbed before adding the next. Don’t be tempted to increase the heat to speed up the process – you don’t want the liquid to evaporate too quickly, as the rice won’t cook properly. Once you have used one-third of the water, check the rice to see if it has cooked through (the grains should not be hard in the center). Continue stirring and adding water this way until the rice is cooked to your liking."
    },
    {
      "@type": "HowToStep",
      "text": "Add the pepper and pecorino and stir rapidly to ensure the mixture becomes creamy and smooth. Now stir in the cabbage, followed by the remaining butter. Lastly, mix in the lemon zest. Take the pan off the heat and ladle the risotto into serving bowls. Drizzle a little olive oil over each serving, then scatter over some pecorino, if desired. Serve immediately."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://helloveggie.co/cabbage-rice"
  ],
  "updatedAt": "2022-12-02T09:28:42.307Z"
}
