{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "35",
    "ratingValue": "4.98"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-03T09:49:52.035Z",
  "datePublished": "2015-02-18T13:09:54+00:00",
  "description": "Urad Dal Lentils made into a batter and baked to make a soft flavorful nutritious bread. Allergen Information: Free of dairy, egg, soy, gluten, nut. Can be made corn-free. Can be made grain-free by omitting the rice flour. Add 1 tsp xanthan gum for lighter bread. Makes 1 medium bread pan (8.5 by 4.5 inch loaf pan)",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2015/02/lentil-bread-6116-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/02/lentil-bread-6116-1-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/02/lentil-bread-6116-1-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/02/lentil-bread-6116-1-480x270.jpg"
  ],
  "name": "Lentil Bread - Gluten-free Vegan Sandwich Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "227 kcal",
    "carbohydrateContent": "36 g",
    "fatContent": "3 g",
    "fiberContent": "15 g",
    "proteinContent": "12.2 g",
    "servingSize": "1 serving",
    "sodiumContent": "392 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT480M",
  "recipeCategory": "Bread",
  "recipeCuisine": "fusion",
  "recipeIngredient": [
    "1.5 cups urad dal (split and skinned black gram- Urad Dal Matpe)",
    "3 tbsp rice flour",
    "3 Tbsp corn starch (or tapioca starch)",
    "1.5 tsp baking powder",
    "2 tsp flaxmeal (or psyllium husk)",
    "1/4 tsp cumin seeds",
    "1 tsp salt",
    "1/4 tsp black pepper",
    "1 tsp lemon juice",
    "1 Tbsp oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak the urad dal overnight. Drain and add to a food processor. Process the dal until it is just slightly gritty. Process for 30 to 45 seconds then move the dal with a spatula. It will take 3 to 4 minutes to break the lentils down into a batter type consistency. Add just a little water (3 to 6 Tablespoons) to help with the processing. Add the rest of the ingredients and process for a minute to combine. Check the batter for aeration. (drop a half tsp of batter in a cup of water. The batter should float on the top). If not aerated well, transfer the thick batter to a bowl and whip with a large spoon a few times, then check again. the batter should be thick and pasty but also slightly bubbly."
    },
    {
      "@type": "HowToStep",
      "text": "Drop batter into parchment lined bread pan. Spray oil on top and even it out using a light hand so the air in the batter is not pressed out."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 395 degrees F / 200oc. Bake for 45 minutes. Cover the bread with another parchment after first 15 to 20 minutes by placing the parchment on the loaf pan. Reduce temperature to 375 degrees F / 190oc after 45 minutes, remove parchment and bake for another 10 to 15 minutes or until it sounds hollow when tapped."
    },
    {
      "@type": "HowToStep",
      "text": "Cool completely before slicing. (about an hour). The bread slices more easily the next day. Refrigerate the bread for upto 5 days in an airtight container. The bread crust is crusty the first day and gets softer as it sits because of moisture. Moisture in the storage container after a day is normal. I like to use to bread with chutney toppings or simple sandwiches."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/2015/02/lentil-bread-gluten-free-vegan-sandwich-bread-recipe.html"
  ],
  "totalTime": "PT540M",
  "updatedAt": "2022-12-03T09:49:52.034Z"
}
