{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "11",
    "ratingValue": "4.64"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-04T19:41:54.366Z",
  "datePublished": "2018-04-17T11:10:03+00:00",
  "description": "Lentil Fritters in Eggplant, Sweet Potato Coconut Stew - Bengali Inspired Chapor Ghonto. Indian Veggie Stew with Moong Dal patties. Vegan Gluten-free Indian Recipe.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2018/04/Vegan-bengali-chapor-ghonto-lentil-fritter-veggie-stew-veganricha-4909.jpg",
    "https://www.veganricha.com/wp-content/uploads/2018/04/Vegan-bengali-chapor-ghonto-lentil-fritter-veggie-stew-veganricha-4909-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2018/04/Vegan-bengali-chapor-ghonto-lentil-fritter-veggie-stew-veganricha-4909-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2018/04/Vegan-bengali-chapor-ghonto-lentil-fritter-veggie-stew-veganricha-4909-480x270.jpg"
  ],
  "name": "Lentil Fritters in Eggplant, Sweet Potato Coconut Stew - Inspired Bengali Chapor Ghonto",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "163 kcal",
    "carbohydrateContent": "28 g",
    "fatContent": "3 g",
    "fiberContent": "9 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "605 mg",
    "sugarContent": "7 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "1 cup moong dal (petite (oval yellow lentils) or red lentils (masoor dal)",
    "1/2 tsp salt",
    "1/4 tsp turmeric",
    "1/2 green chile optional",
    "1/2 inch ginger",
    "1/4 cup corn",
    "1/2 tsp oil",
    "1 tsp or more paach phoron (or use 1/4 tsp each of fennel seeds, cumin seeds, mustard seeds, nigella seeds and 1/8 tsp fenugreek seeds)",
    "1 bay leaf",
    "1 dried red chile or use pepper flakes to taste",
    "1 medium eggplant (cubed small (or use other veggies like cauliflower, zucchini, broccoli)",
    "1 small sweet potato (cubed small or 1 cup (I used frozen sweet potato medly with purple, orange and yellow)",
    "1 large carrot (chopped or other veggies)",
    "1/2 tsp turmeric",
    "3/4 cup water",
    "2 tbsp shredded coconut",
    "cayenne or black pepper to taste (lemon juice to taste)",
    "coconut for garnish (minced ginger and sliced green chile for garnish)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Fritters: Soak the dal in hot water for 15 minutes (soak for longer (30 to 45 mins) for better results). Drain and blend with the rest of the ingredients except corn to make smooth thick batter. Add a few tbsp or so water if needed. Transfer the batter to a bowl. Fold in sweet corn or other small chopped veggies into the batter. (add paprika or cayenne to taste for heat and color). See below for how to use the batter that is stuck to the blender."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a skillet over medium heat. Spray oil. When hot, add dollops of the batter and cook 3 minutes per side to make fat pancakes. Keep aside"
    },
    {
      "@type": "HowToStep",
      "text": "Stew: Heat oil in a saucepan over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "Add the paanch phoron spices and cook until the spices star to pop. Add bay leaf and red chile and mix for a few seconds"
    },
    {
      "@type": "HowToStep",
      "text": "Add the veggies and turmeric and cook for a few minutes. (You can also add a tsp minced garlic at this point and mix in.)"
    },
    {
      "@type": "HowToStep",
      "text": "Add salt and water and partially cover and cook for 8 minutes. Taste and adjust salt and flavor. I usually rinse the blender that I used to make the lentil batter, with a 1/4 cup of water and add to the stew. This cleans up the blender and thickens the stew. You can also reserve 1 tbsp of batter from above and add that instead. Or use 1/4 cup cooked red lentils or Moong dal. * Many thickening options :)"
    },
    {
      "@type": "HowToStep",
      "text": "Continue to cook until veggies are tender to preference. Add more water if needed. Fold in the coconut. Add a tsp of minced ginger and minced green chile (optional but they add amazing flavor). Taste and adjust salt, flavor, heat. (This dish is different flavor profile. To make it more familiar, you can add a bit of garam masala). Add the fritters and let them soak for a minute before serving (or serve on the side). Garnish with coconut, lemon juice and cilantro."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/lentil-fritters-in-eggplant-sweet-potato-coconut-stew-bengali-chapor-ghonto"
  ],
  "totalTime": "PT55M",
  "updatedAt": "2022-12-04T19:41:54.365Z"
}
