{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-01T01:12:09.781Z",
  "datePublished": "2017-01-16T09:46:39+00:00",
  "description": "Sauté­ed mushrooms, onions, and peppers are piled on top of a cashew cheese covered cornmeal crust and smothered in garlicky tomato sauce to create this vegan deep dish pizza.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2017/01/vegan-deep-dish-pizza-2.jpg"
  ],
  "keywords": "cashew cheese, pizza",
  "name": "Loaded Vegan Deep Dish Pizza",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "508 kcal",
    "carbohydrateContent": "56 g",
    "fatContent": "26.8 g",
    "fiberContent": "6.9 g",
    "proteinContent": "14.8 g",
    "saturatedFatContent": "4.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "794 mg",
    "sugarContent": "7.7 g"
  },
  "prepTime": "PT90M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 cup all-purpose flour",
    "3/4 cup whole wheat pastry flour, (or more all-purpose flour)",
    "1/4 cup cornmeal",
    "1 1/2 teaspoons granulated sugar",
    "1/2 teaspoon salt",
    "1 package active dry yeast (2 1/4 teaspoons)",
    "1/2 cup + 1 tablespoon warm water",
    "1/4 cup olive oil",
    "1 cup raw cashews, (soaked in water 4 to 8 hours)",
    "1 cup unflavored soy or almond milk",
    "3 tablespoons tapioca starch",
    "2 tablespoons nutritional yeast flakes",
    "2 tablespoons white miso paste",
    "1 tablespoon lemon juice",
    "1 14 ounce can crushed tomatoes",
    "3 garlic cloves, (minced)",
    "1 1/2 teaspoons dried oregano",
    "1/2 teaspoon red pepper flakes",
    "1/4 teaspoon salt",
    "2 tablespoons olive oil",
    "6 ounces white button mushrooms, (cleaned and sliced)",
    "1/2 medium green bell pepper, (sliced into strips)",
    "1 small onion, (sliced into strips)",
    "salt and pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin making the crust by stirring flours, cornmeal, sugar, salt, and yeast together in a large mixing bowl. Stir in the water and olive oil until a dough forms. Turn the dough onto a lightly floured surface and knead until smooth and elastic, about 7 minutes. Lightly oil a medium bowl, then transfer the dough the the bowl, cover and place in a warm spot to rise until the dough has doubled in size, about 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly oil a 9 inch cake pan or springform pan. Transfer the dough to the pan and press until it stretches to cover the bottom of the pan, then press some of the dough up the sides of the pan to form a rim about 3 inches high. Cover the dough again and allow it to rest while you prepare the fillings."
    },
    {
      "@type": "HowToStep",
      "text": "While the dough rests, prepare the cheese. Place all ingredients into a blended and blend until smooth. Transfer to a small saucepan and place over medium heat. Bring to a simmer, and lower heat. Allow to simmer, whisking almost constantly. The mixture will get a bit lumpy at first, and then it will become thick and stretchy. Eventually it will start to pull away from the sides of the pan, after about 7 minutes. When this happens, remove it from the heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the sauce by stirring all ingredients together in a small bowl."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare the toppings, coat the bottom of a large skillet with olive oil and place over medium heat. Add mushrooms in an even layer. Allow to cook for 5 minutes, until browned on bottoms, then flip and cook 5 minutes more. Raise heat to medium high and add peppers and onions, along with a sprinkle of salt and pepper. Cook until veggies begin to brown, about 5 minutes. Remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Once the dough has sat for 15 minutes, turn the oven on to preheat it to 425°. Once preheated, place the crust into the oven and bake for 10 minutes. Remove the crust from the oven, and spread the cheese in an even layer over the center. Distribute the veggies over the cheese, and then spread the sauce over the veggies. Cover with foil and bake for 15 to 20 minutes, until the sauce just begins to bubble."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and allow to sit for at least 10 minutes before cutting - the longer it sits the less messy it will be."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/loaded-vegan-deep-dish-pizza"
  ],
  "totalTime": "PT135M",
  "updatedAt": "2022-12-01T01:12:09.780Z"
}
