{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T18:42:57.403Z",
  "datePublished": "2015-03-05T12:16:19+00:00",
  "description": "Maida Papdi are crisp Indian Crackers spiced with toasted cumin seeds. bake or fry and serve with chutneys or choice. Vegan Indian Holi Recipe, Palm oil free",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2015/03/crackers-6963-300x449-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/03/crackers-6963-300x449-1-300x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/03/crackers-6963-300x449-1-300x270.jpg"
  ],
  "name": "Maida Papdi - Cumin Spiced Crackers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "215 kcal",
    "carbohydrateContent": "31 g",
    "fatContent": "7 g",
    "fiberContent": "1 g",
    "proteinContent": "4 g",
    "servingSize": "1 serving",
    "sodiumContent": "248 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Snack",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "1/3 to 1/2 tsp cumin seeds",
    "2 cups unbleached white flour",
    "1/4 tsp carom seeds (ajwain)",
    "1/4 tsp freshly ground black pepper",
    "1/2 to 3/4 tsp salt",
    "1/4 tsp baking soda",
    "3 tablespoons of neutral oil (or melted vegan butter)",
    "1/2 to 3/4 cup water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Toast the cumin seeds in a dry skillet over medium heat for 2 minutes or until they change color and get fragrant. this is especially helpful to release the cumin flavor for baked crackers. Add to a large bowl. Add flour, carom seeds, salt, pepper and baking soda and whisk well. Add oil and mix with hands or a spoon to make breadcrumbs. 2 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add water a few tablespoons at a time and knead into a smooth dough. Not too stiff and not too sticky soft. Cover and let sit for half an hour."
    },
    {
      "@type": "HowToStep",
      "text": "Knead the dough again for half a minute then divide into golf-ball size balls. Roll out each ball into a 4 inch circle. Fold to a half circle. then fold again to make an uneven triangle(see picture). Roll it out a bit to flatten a bit. Place on parchment lined sheet. Repeat for all the balls."
    },
    {
      "@type": "HowToStep",
      "text": "Alternatively, roll out a larger ball of dough into a thin 8 inch circle. spray oil on the circle. Fold into half and roll it out until 2 mm thick. Using a pizza cutter or cookie cutter, cut into desired shape. Use an inch or 1.5 inch cookie cutter to make circle papri for papri chaat. Sprinkle some fine sea salt if desired and press in."
    },
    {
      "@type": "HowToStep",
      "text": "Bake in pre-heated 350 degree F / 180oc for 12 minutes. Move the crackers around, inside out and bake for another 4 minutes. Flip the crackers and move and bake for another 2 minutes or so. The triangle crackers will need a few minutes more to crisp up, while smaller crackers will be done sooner. Bake only until the crackers are just lightly golden on the edges. Cool completely and store in an airtight container for up to 2 weeks."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/2015/03/maida-papdi-cumin-spiced-crackers.html"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-04T11:05:54.607Z"
}
