{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-23T02:35:54.000Z",
  "datePublished": "2022-08-03",
  "description": "The poached chicken in this recipe has an incredibly silky texture and is very tender. You can add extras to the soup at the end, such as Asian greens, noodles, shrimps, or crunchy beansprouts.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/slocoo092malchi_027:Square-1300x1300"
  ],
  "keywords": "Chicken soup,Tree nut free,Egg free,Sesame free,Dairy free",
  "name": "Malaysian Chicken Soup Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Entrees",
  "recipeCuisine": "Asian",
  "recipeId": "RGR9985",
  "recipeIngredient": [
    "1.4kg free-range chicken",
    "1 onion, quartered",
    "1 piece fresh root ginger, 5cm, peeled and sliced",
    "6 garlic cloves, crushed",
    "1 pinch salt",
    "1 tablespoon soy sauce",
    "1 tablespoon fish sauce",
    "1 cup hot vegetable stock (optional)",
    "1 bunch green spring onions, finely sliced, to serve",
    "1 pinch freshly ground black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the slow cooker, if required. Put the chicken, upside down, into the slow cooker, add the onion, ginger, and garlic, and season with salt and pepper. Pour over enough water to cover the chicken. Cover with the lid and cook on auto/low for 6–8 hours or on high for 3–4 hours. Remove the chicken from the broth and set aside until it is cool enough to handle."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the skin from the chicken and discard, then remove all the meat from the bones. Strain the broth from the slow cooker into a clean heavy-based pan, add the chicken meat, and stir in the soy sauce and fish sauce. Top up with some stock, if necessary, then simmer gently to warm through, taste, and season as required. Ladle into warmed Asian soup bowls and garnish with spring onions."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the chicken, onion, ginger, and garlic in a large pan and cover with water. Season with salt and pepper and bring to the boil. Reduce to a simmer, cover with the lid, and cook on a low heat for 30–40 minutes or until the chicken is cooked and the juices flow clear when pierced with a sharp knife. Remove the chicken from the broth and set aside until it is cool enough to handle."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the skin from the chicken and discard, then remove all the meat from the bones. Strain the broth from the pan into a clean heavy-based pan, add the chicken meat, and stir in the soy sauce and fish sauce. Top up with some stock, if necessary, then simmer gently to warm through, taste, and season as required. Ladle into warmed Asian soup bowls and garnish with spring onions."
    }
  ],
  "recipeNameId": "malaysian-chicken-soup",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/malaysian-chicken-soup"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-12-05T17:51:39.250Z",
  "url": "https://www.woolworths.com.au/shop/recipes/malaysian-chicken-soup"
}
