{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "61",
    "ratingValue": "4.81"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-23T11:03:12.995Z",
  "datePublished": "2016-04-30T13:27:57+00:00",
  "description": "Mango Coconut Tofu Bowls with savory coconut rice, honey-lime glaze, avocado, sweet mango, and spicy red pepper.",
  "image": {
    "@type": "ImageObject",
    "height": 480,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2016/04/Mango-Coconut-Tofu-Bowls-close-1.jpg",
    "width": 640
  },
  "keywords": "Vegetarian Dinner",
  "name": "Mango Coconut Tofu Bowls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "655.73 kcal",
    "carbohydrateContent": "101.45 g",
    "fatContent": "21.85 g",
    "fiberContent": "8.15 g",
    "proteinContent": "17.25 g",
    "servingSize": "1 Serving",
    "sodiumContent": "704.25 mg"
  },
  "prepTime": "PT30M",
  "recipeIngredient": [
    "1.5 cups uncooked jasmine or basmati rice ($0.66)",
    "1 clove garlic, minced ($0.08)",
    "3/4 tsp salt ($0.03)",
    "1 13.5oz. can coconut milk ($1.50)",
    "1 cup water ($0.00)",
    "1 lime ($0.25)",
    "1/4 cup honey ($0.48)",
    "1/2 Tbsp soy sauce ($0.03)",
    "1 tsp corn starch ($0.04)",
    "1 14oz. package firm or extra firm tofu ($1.99)",
    "1 pinch salt ($0.02)",
    "2 Tbsp corn starch ($0.08)",
    "2 Tbsp neutral oil for frying ($0.04)",
    "1 mango ($1.69)",
    "1 avocado, sliced ($1.00)",
    "2-3 green onions, sliced ($0.20)",
    "1 pinch crushed red pepper ($0.02)",
    "1 handful fresh cilantro ($0.10)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin by pressing the tofu. Remove the tofu from the package, draining away all moisture. Wrap the tofu in a clean, lint-free dish towel or a few layers of paper towel. Place the wrapped tofu between two plates and place something heavy on top (cast iron pan or pot full of water). Let the tofu press for at least 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "To make the Savory Coconut Rice, combine the uncooked rice, minced garlic, salt, coconut milk, and water in a medium pot. Place a lid on the pot and bring to a boil over high heat. Once it reaches a boil, turn the heat down to low and let simmer for 20 minutes. Turn the heat off and let the pot sit, undisturbed, for 10 more minutes. Fluff the rice with a fork and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While the rice is cooking, prepare the honey lime glaze. Use a zester, microplane, or small-holed cheese grater to remove the thin layer of green zest from the lime. Squeeze the juice from the lime into a separate bowl (you'll need about 1/4 cup juice). Combine the juice with 1/2 tsp of the zest, honey, soy sauce, and corn starch in a bowl. Stir until the corn starch and honey are dissolved."
    },
    {
      "@type": "HowToStep",
      "text": "After the tofu has been pressed, cut it into 1/2 inch cubes. Blot with a paper towel if needed to make sure the surface is dry. Season the tofu with a pinch of salt. Sprinkle the corn starch over top and gently toss until all the pieces are well coated."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the oil in a large skillet over medium heat until the oil is shimmering. Add the tofu and fry on until golden brown on each side (about 3 minutes each side). Remove the fried tofu from the pan and turn the heat down to low. While the tofu fries, cut the mango into cubes."
    },
    {
      "@type": "HowToStep",
      "text": "Give the prepared glaze a quick stir, then add it to the skillet. Allow the glaze to begin to simmer, at which point it will thicken. Once thickened, turn the heat off and add the fried tofu and cubed mango. Toss to coat in the glaze."
    },
    {
      "@type": "HowToStep",
      "text": "To build the bowls, place about one cup of the savory coconut rice in the bottom of each bowl, then top with a scoop of the mango and tofu. Add sliced green onions, sliced avocado, a pinch of red pepper flakes, and a few sprigs of cilantro on top of each bowl."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/random"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-23T11:03:12.988Z"
}
