{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT2100S",
  "createdAt": "2022-12-06T11:18:41.179Z",
  "creator": {
    "@type": "Person",
    "name": "Patty Catalano"
  },
  "dateCreated": "2021-10-12T08:00:00-04:00",
  "dateModified": "2021-10-15T17:14:04-04:00",
  "datePublished": "2021-10-12T08:00:00-04:00",
  "description": "These maple-frosted doughnuts are the perfect doughnut recipe for beginners. The supple dough is simple to make by hand or in a mixer, and the doughnuts taste even better when you make it in advance.",
  "headline": "Maple Bars",
  "HowtoTip": {
    "text": "Make ahead: The dough can be made and refrigerated up to 1 day in advance. Storage: Maple bars are best eaten the day they are made. Store leftovers loosely covered at room temperature. "
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FRecipes%2F2021-09-maple-bars%2F2021-09-21_ATK10879"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FRecipes%2F2021-09-maple-bars%2F2021-09-21_ATK10879"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipes%2F2021-09-maple-bars%2F2021-09-21_ATK10879"
    }
  ],
  "keywords": [
    "breakfast",
    "brunch",
    "doughnuts",
    "kid-friendly",
    "recipe",
    "pantry",
    "autumn",
    "dessert",
    "baked goods",
    "frying",
    "stovetop",
    "Cooking with Kids",
    "children",
    "snacks",
    "team:food",
    "platform:search",
    "course:dessert",
    "lifestyle:kid-friendly",
    "dishtype:breakfast sweet",
    "dishtype:baked good",
    "cuisine:united states",
    "cuisine:new england",
    "cuisine:midwest",
    "timing:extended",
    "occasion:autumn",
    "occasion:timing",
    "occasion:weekend",
    "mainingredients:flour",
    "mainingredients:pantry",
    "mainingredients:sugar",
    "method:fried",
    "method:stovetop",
    "meal:breakfast",
    "meal:snack",
    "meal:brunch",
    "meal:elevenses",
    "updated:2021-10-15"
  ],
  "name": "Maple Bars",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "299 cal",
    "carbohydrateContent": "47.8 g",
    "cholesterolContent": "0 mg",
    "fatContent": "9.9 g",
    "fiberContent": "1.0 g",
    "proteinContent": "5.0 g",
    "saturatedFatContent": "5.9 g",
    "servingSize": "Serves 16",
    "sodiumContent": "109.4 mg",
    "sugarContent": "22.5 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT2700S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Snack",
  "recipeCuisine": "United states",
  "recipeIngredient": [
    "1 stick (8 tablespoons) unsalted butter",
    "1 cup whole or 2% milk",
    "1/4 cup granulated sugar",
    "1 (1/4-ounce) packet active dry yeast (2 1/4 teaspoons)",
    "2 large eggs",
    "1 teaspoon vanilla extract",
    "4 to 4 1/4 cups all-purpose flour, plus more for dusting",
    "3/4 teaspoon kosher salt",
    "2 quarts peanut or canola oil, for deep-frying",
    "1/2 cup packed light or dark brown sugar",
    "4 tablespoons (1/2 stick) unsalted butter",
    "1/4 cup maple syrup",
    "2 tablespoons whole or 2% milk",
    "1 1/2 cups powdered sugar",
    "1/4 teaspoon maple extract (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cut 1 stick unsalted butter into large pieces. If using a stand mixer, melt the butter in a small microwave-safe bowl. If making by hand, melt the butter in a large microwave-safe bowl. Microwave on high for 40 to 50 seconds until mostly melted (a few lumps are fine) and set aside to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Microwave 1 cup whole or 2% milk in a microwave-safe measuring cup or bowl until warm but not hot (about 100oF), 40 to 50 seconds. Add 1/4 cup granulated sugar and whisk until dissolved. Sprinkle 1 packet (2 1/4 teaspoons) active dry yeast over the milk and set aside until the yeast appears bubbly and foamy, about 5 minutes. (If it doesn't, get new yeast and start over with new yeast.)"
    },
    {
      "@type": "HowToStep",
      "text": "If using a stand mixer, pour the butter and milk-yeast mixture into the stand mixer bowl. Add 2 large eggs and 1 teaspoon vanilla extract. Beat with the paddle attachment on medium speed until combined, about 1 minute. (If making by hand, add the yeast mixture to the butter and whisk to combine.)"
    },
    {
      "@type": "HowToStep",
      "text": "Place 4 cups of the all-purpose flour and 3/4 teaspoon kosher salt in a large bowl and whisk to combine. With the mixer on low speed, add the flour in 2 (1 1/2-cup) increments, waiting until the flour is fully incorporated before adding the next. Stop the mixer and switch out the paddle attachment for the dough hook."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining 1 cup all-purpose flour and mix on low speed until combined. Increase the speed to medium-high and beat until the dough is smooth and tacky, about 3 minutes. If the dough is too sticky, add up to 1/4 cup more all-purpose flour, 1 tablespoon at a time, until smooth and firm enough to pick up. (If kneading by hand, stir the flour and salt into the milk mixture until a sticky dough forms. Transfer to a floured work surface and knead until the dough is smooth and tacky, 3 to 5 minutes.)"
    },
    {
      "@type": "HowToStep",
      "text": "Remove the dough from the bowl and shape it into a tight, smooth ball. Sprinkle the dough with a little more all-purpose flour (about 1 tablespoon) and return to the bowl. Cover with a kitchen towel or plastic wrap. Refrigerate until doubled in bulk, 8 to 12 hours. (Alternatively, let the dough rise at room temperature for 1 to 2 hours before frying — the finished doughnuts will be denser but still delicious.)"
    },
    {
      "@type": "HowToStep",
      "text": "Line 2 baking sheets with parchment paper. Dust a work surface with flour, then transfer the dough onto it. Roll the dough into a 12x8-inch rectangle about 1/2-inch thick with a long side closer to you. Cut the dough into 12 (4-inch-long, 2-inch-wide) bars (make 1 vertical cut and 5 horizontal cuts)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the doughnuts to the baking sheets. Cover loosely with kitchen towels or plastic wrap and let rise until puffy, at least 30 minutes if proofed at room temperature or about 1 hour if proofed in the refrigerator. Meanwhile, make the glaze."
    },
    {
      "@type": "HowToStep",
      "text": "Place 1/2 cup packed light brown sugar, 4 tablespoons unsalted butter, 1/4 cup maple syrup, and 2 tablespoons milk in a small saucepan over medium-low heat. Cook until the butter melts and the sugar dissolves, but do not boil, 5 to 6 minutes. Reduce the heat to low and whisk in 1 1/2 cups powdered sugar and 1/4 teaspoon maple flavoring, if desired, until smooth, about 1 minute. Cover to keep warm."
    },
    {
      "@type": "HowToStep",
      "text": "Set up a cooling station: Line a baking sheet with paper towels and place a wire rack over the paper towels."
    },
    {
      "@type": "HowToStep",
      "text": "Heat 2 quarts peanut or canola oil in a large heavy-bottomed pot or Dutch oven over medium-high heat to 355oF to 365oF. Reduce the heat slightly to maintain this heat."
    },
    {
      "@type": "HowToStep",
      "text": "Fry the doughnuts in batches of 3: Place in the hot oil and fry until puffed and golden-brown on the bottom, about 1 1/2 minutes. Flip and until the second side is golden-brown, about 1 1/2 minutes more. Remove the doughnuts from the hot oil with tongs, a spider, or a metal spatula, and hold them over the pot briefly to drain off excess oil. Place on the rack."
    },
    {
      "@type": "HowToStep",
      "text": "When the doughnuts are cool enough to handle but still warm, dunk the tops in the icing and return to the rack glazed-side up. If the icing has cooled and thickened, place back over low heat and whisk until loose again. Let the glaze set for 3 minutes before serving."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/maple-bars-23228584"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipes%2F2021-09-maple-bars%2F2021-09-21_ATK10879",
  "totalTime": "PT4800S",
  "updatedAt": "2022-12-06T11:18:41.178Z",
  "url": "https://www.thekitchn.com/maple-bars-23228584"
}
