{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "10",
    "ratingValue": "4.41"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T21:28:45.313Z",
  "datePublished": "2016-04-05T05:30:41+00:00",
  "description": "Tender, moist nutty sponge sandwiched together with creamy maple infused frosting. Completely dairy, egg &amp; oil free yet perfectly sweet &amp; decadent, this maple walnut cake is total perfection!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2016/04/Maple-Walnut-Cake-9-copy-1.jpg"
  ],
  "keywords": "maple cake, oil-free cake, sweet potato, sweet potato cake, vegan cake, walnut cake",
  "name": "Maple Walnut Vegan Sweet Potato Cake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "505 kcal",
    "carbohydrateContent": "71 g",
    "fatContent": "22 g",
    "fiberContent": "9.5 g",
    "proteinContent": "8.2 g",
    "servingSize": "1 serving",
    "sodiumContent": "191 mg",
    "sugarContent": "31 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "130g / 1 packed cup course ground raw walnuts (you can use walnut pieces or halves and grind them up in a food processor or blender)",
    "390g / 3 1/3 cups spelt flour",
    "235g / 1 cup and 3 tablespoons coconut sugar (you can sub this for any granulated brown sugar)",
    "1/2 teaspoon salt",
    "2 tablespoons baking powder",
    "1/2 teaspoon baking soda",
    "375mls / 1.5 cups and 1 tablespoon non dairy milk (I used my homemade cashew milk but any unsweetened, unflavoured variety is fine )",
    "4 teaspoons vanilla extract",
    "1 tablespoon apple cider vinegar",
    "300g / 1.5 cups cooked sweet potato",
    "1 x 398 - 400ml can full fat coconut milk",
    "166g / 1 1/3 cup powdered sugar",
    "4 tablespoons pure maple syrup",
    "30g / 1/4 cup chopped walnuts"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin by making sure that you have a well refrigerated can of full fat coconut milk waiting in the fridge."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350° and lightly grease two 8 inch round cake pan then line the bottoms with parchment paper circles. (for cooking in different tins see recipe notes)."
    },
    {
      "@type": "HowToStep",
      "text": "Add all of the dry ingredients to a large bowl."
    },
    {
      "@type": "HowToStep",
      "text": "In a blender (or with a stick blender) blend the milk, sweet potato, vanilla and vinegar well until very smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the liquid into the dry ingredients and stir to combine. Do not over stir. Just enough to combine everything so that you can't see any dry flour. A few little lumps are ok."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon evenly into the prepared cake pans and place on the middle shelf of your pre-heated oven."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 35 to 40 minutes until a skewer or toothpick inserted into the middle comes out clean. (It might seem like a long cooking time but it needs it due to the moistness of the sweet potato)."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and leave in the tins for 5 - 10 minutes then turn out onto a cooling rack."
    },
    {
      "@type": "HowToStep",
      "text": "Leave to cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "Once the cake is cool, scrape out the cream only from the coconut milk into a chilled bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Beat with a hand mixer or in a stand mixer until thick and very creamy."
    },
    {
      "@type": "HowToStep",
      "text": "Add the powdered sugar and maple syrup and beat again until well combined."
    },
    {
      "@type": "HowToStep",
      "text": "If you aren't going to decorate the cake right away refrigerate the cream."
    },
    {
      "@type": "HowToStep",
      "text": "Place the bottom layer of the cake on a cake stand or plate, flat side up."
    },
    {
      "@type": "HowToStep",
      "text": "Use just under half of the frosting and spread it all over. Use a palette knife or a knife and if you have trouble spreading it without breaking the cake up, dip the knife in a glass of water before spreading then try again."
    },
    {
      "@type": "HowToStep",
      "text": "Put on the top layer of the cake, this time flat side down, rounded side up."
    },
    {
      "@type": "HowToStep",
      "text": "Use the remaining frosting to cover the top and sides of the cake."
    },
    {
      "@type": "HowToStep",
      "text": "Scatter a few chopped walnuts on top for decoration."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://avirtualvegan.com/maple-walnut-cake"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-02T21:28:45.311Z"
}
