{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "161",
    "ratingValue": "4.73"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT22M",
  "createdAt": "2022-12-01T05:39:28.110Z",
  "datePublished": "2017-01-13T05:00:05+00:00",
  "description": "Saucy, baked tempeh marinated in a spicy-sweet peanut sauce! Super flavorful, hearty, and perfect for topping noodles, salads, and more! Vegan + gluten-free.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/12/Peanut-Tempeh-SQUARE.jpg"
  ],
  "keywords": "baked tempeh",
  "name": "Marinated Peanut Tempeh (7 Ingredients!)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "250 kcal",
    "carbohydrateContent": "19.3 g",
    "fatContent": "15.2 g",
    "fiberContent": "1 g",
    "proteinContent": "13.4 g",
    "saturatedFatContent": "2.8 g",
    "servingSize": "1 heaping one-third-cup servings",
    "sodiumContent": "463 mg",
    "sugarContent": "10.2 g"
  },
  "prepTime": "PT1460M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "8 ounces tempeh (if GF, ensure gluten-free friendly)",
    "1 whole fresh or dried bird's eye chili (minced/crushed // or sub 1/4 tsp red pepper flake)",
    "1 1/2 Tbsp sesame oil (if avoiding oil, leave this out and add a bit more lime, soy sauce, and maple syrup)",
    "2 Tbsp salted creamy peanut (or almond, cashew, or sunbutter)",
    "2 Tbsp gluten-free tamari (or soy sauce if not GF)",
    "2 Tbsp lime juice",
    "3 Tbsp maple syrup"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To remove bitterness from the tempeh, add to rimmed skillet or saucepan filled with 1 inch of water and bring to a low boil over medium heat. Steam tempeh for a total of 10-12 minutes, flipping once at the halfway point. Then rinse, pat dry, and cut into thin, bite-size pieces. I prefer slicing the tempeh in half lengthwise then cutting into small triangles. (The smaller the pieces, the better they can soak up the marinade.) Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Mix marinade by adding chili, sesame oil, peanut butter, tamari, lime juice, and maple syrup. Whisk to combine. Taste and adjust flavor as needed, adding more crushed chili for heat, maple syrup for sweetness, lime juice for acidity, or tamari for saltiness. Don't be shy - you want this extremely flavorful!"
    },
    {
      "@type": "HowToStep",
      "text": "Add the sliced tempeh to the marinade and toss to coat. Then cover and refrigerate for at least 2 hours, preferably 24 hours. I found that 24 hours infused the most flavor! While marinating, toss/stir occasionally to ensure even coating. (Pro tip: Just before baking, drizzle with a bit more maple syrup and tamari for extra flavor. Optional but recommended!)"
    },
    {
      "@type": "HowToStep",
      "text": "Once marinated, preheat oven to 375 degrees F (190 C) and line a baking sheet with parchment paper. Add tempeh and reserve any leftover marinade to brush/coat the tempeh once baked."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 22-30 minutes or until caramelized and deep golden brown. Remove from oven and brush/coat with any remaining marinade."
    },
    {
      "@type": "HowToStep",
      "text": "This tempeh is delicious for adding to Asian-inspired dishes like spring rolls, salads, and noodle dishes! Store leftovers covered in the refrigerator up to 3 days. Best when fresh."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/marinated-peanut-tempeh-7-ingredients"
  ],
  "totalTime": "PT1482M",
  "updatedAt": "2022-12-01T05:39:28.109Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=XEg1wmp4pYs",
    "description": "Saucy, baked tempeh marinated in a spicy-sweet peanut sauce! Super flavorful, hearty, and perfect for topping noodles, salads, & more! Vegan + gluten free.\n\nFull Recipe: https://minimalistbaker.com/marinated-peanut-tempeh-7-ingredients/\n\nTempeh and peanut sauce both have roots in Indonesian cuisine. Tempeh is a fermented soy product that’s made of cooked, dehulled soybeans that are inoculated with mold, packed, and incubated until the beans are bound together by the mycelium. Sounds like weird science, but this fermentation process creates prebiotics which have been known to promote gut health.\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT53S",
    "embedUrl": "https://www.youtube.com/embed/XEg1wmp4pYs?feature=oembed",
    "name": "Marinated Peanut Tempeh (7 Ingredients!) | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/XEg1wmp4pYs/hqdefault.jpg",
    "uploadDate": "2019-11-13T09:00:06+00:00"
  }
}
