{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Gena Hamshaw"
  },
  "createdAt": "2022-12-02T00:34:14.050Z",
  "datePublished": "2018-09-13T08:00:00+00:00",
  "description": "Reprinted with permission from Power Plates: 100 Nutritionally Balanced, One-Dish Vegan Meals by Gena Hamshaw.",
  "image": [
    "https://hellonest.co/wp-content/uploads/2022/02/SAF5318-scaled.jpg",
    "https://hellonest.co/wp-content/uploads/2022/02/SAF5318-500x500.jpg",
    "https://hellonest.co/wp-content/uploads/2022/02/SAF5318-500x375.jpg",
    "https://hellonest.co/wp-content/uploads/2022/02/SAF5318-480x270.jpg"
  ],
  "name": "Masala Lentil Salad with Cumin Roasted Carrots",
  "recipeCategory": "Salad",
  "recipeIngredient": [
    "1 1 ⁄2 pounds (680 g carrots, peeled and sliced into 1/2 -inch (1.3-cm) rounds)",
    "2 tablespoons neutral vegetable oil",
    "1 tablespoon maple syrup",
    "1 1 ⁄2 teaspoons ground cumin",
    "Coarse salt and freshly ground black pepper",
    "1 cup 200 g dried beluga or French green lentils, or 2 (15-oz, or 425-g) cans lentils, drained and rinsed",
    "1 ⁄2 red onion (finely chopped)",
    "2 cups 60 g firmly packed baby arugula, mizuna, or baby kale",
    "1 ⁄3 cup (13 g chopped fresh mint leaves)",
    "3 tablespoons olive oil",
    "1 clove garlic (pressed or finely grated)",
    "1 teaspoon minced or finely grated ginger",
    "1 teaspoon garam masala",
    "2 tablespoons apple cider vinegar",
    "1 ⁄2 teaspoon salt",
    "Freshly ground black pepper",
    "Pomegranate molasses; toasted pumpkin seeds (sunflower seeds, or pine nuts)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To make the salad, preheat the oven to 400°F (200°C) and line a rimmed baking sheet with parchment paper. Put the carrots in a large bowl. Drizzle with the oil and maple syrup, sprinkle with the cumin, and toss until evenly coated. Transfer to the lined baking sheet, spreading them in a single layer (you may need a second baking sheet). Season generously with coarse salt and pepper. Bake for about 40 minutes, until the carrots are fork-tender and browning."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, cook the lentils as directed on page 15. Drain, rinse under cold running water, then let drain completely. (If you’re using canned lentils, you can skip this step.)"
    },
    {
      "@type": "HowToStep",
      "text": "Put the carrots and lentils in a large bowl and let cool for 10 minutes. Add the onion, arugula, and mint."
    },
    {
      "@type": "HowToStep",
      "text": "To make the dressing, combine all the ingredients in a small bowl or measuring cup and whisk until evenly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the dressing over the salad and toss gently until evenly combined. Taste and adjust the seasonings if desired. Drizzle with about 1 tablespoon pomegranate molasses, and offer the toasted seeds on the side."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://helloveggie.co/masala-lentil-salad"
  ],
  "updatedAt": "2022-12-02T00:34:14.049Z"
}
