{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "16",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T20:42:08.390Z",
  "datePublished": "2015-01-22T05:00:34+00:00",
  "description": "A masala-spiced tofu scramble with roasted cauliflower, onion, and kale that takes just 30 minutes from start to finish. Healthy, satisfying, delicious, and perfect for any time of day!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/01/Masala-Spiced-Tofu-SQUARE.jpg"
  ],
  "keywords": "tofu scramble",
  "name": "Masala-Spiced Tofu Scramble",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "511 kcal",
    "carbohydrateContent": "32.9 g",
    "fatContent": "35.3 g",
    "fiberContent": "11.4 g",
    "proteinContent": "25.4 g",
    "saturatedFatContent": "3.8 g",
    "servingSize": "1 serving",
    "sodiumContent": "434 mg",
    "sugarContent": "7.9 g",
    "unsaturatedFatContent": "23.8 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3-4 Tbsp grape seed oil (or sub olive oil or melted coconut oil)",
    "1 medium head cauliflower (de-stemmed and roughly chopped)",
    "1/2 medium red onion (thick sliced)",
    "~1/3 cup tandoori masala spice blend (divided*)",
    "1 healthy pinch each salt + pepper",
    "3 large handfuls lacinato kale (chopped)",
    "1/4 cup kalamata olives (pitted and halved)",
    "8 ounces extra-firm tofu (pressed dry)",
    "1/4 cup fresh parsley (finely chopped // optional)",
    "Serve with: Best Damn Vegan Breakfast Potatoes"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and wrap tofu in a clean, absorbent towel and set something heavy on top (like a cast iron skillet or tea pot) to begin drying."
    },
    {
      "@type": "HowToStep",
      "text": "Add chopped onion and cauliflower to a large mixing bowl with 2 Tbsp oil, 3 Tbsp masala spice blend and a healthy pinch each salt and pepper (amounts as original recipe is written // adjust if altering batch size) and toss to combine. You want it very heavily seasoned - almost all visibly coated (see photo) - so add more spice if necessary."
    },
    {
      "@type": "HowToStep",
      "text": "Add to a lightly greased or foil lined baking sheet and bake for 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add kale to the mixing bowl you used before and toss with another dash of oil and a shake of masala spice, salt, and pepper. Massage to coat."
    },
    {
      "@type": "HowToStep",
      "text": "At the 20 minute mark, stir cauliflower and onion to cook evenly and add the kale to one end of the baking sheet. Bake for 5 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Move onto the tofu while veggies are baking: Preheat large skillet to medium, medium-high heat."
    },
    {
      "@type": "HowToStep",
      "text": "While heating, to the same mixing bowl you used before, add the tofu and use a fork to piece it apart. Add chopped olives, 1 Tbsp oil and another healthy shake (~ 1 heaping Tbsp) masala blend (amounts as original recipe is written // adjust if altering batch size), salt, and pepper. Optional: I also added a dash of hot sauce for color. If using parsley, add half at this time for color and reserve the rest for garnish/serving."
    },
    {
      "@type": "HowToStep",
      "text": "Once the pan is hot, add a bit more oil and then the tofu mixture. Continue cooking and stirring (adding more masala if desired) for about 5 minutes, or until it looks visibly browned and dry."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, place the cauliflower/kale/onion mixture on the serving plates and top with tofu scramble. Garnish with a bit more fresh parsley and serve with hot sauce and breakfast potatoes, if desired. Although, I think it’s perfect on its own."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers in the fridge, covered for up to 2 days, though best when fresh."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://minimalistbaker.com/masala-spiced-tofu-scramble"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T20:42:08.389Z"
}
