{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-24T11:07:44.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Meatballs 3 Ways recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/kids_meatballsrecipe3ways:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Meatballs,High protein,Seafood free,Tree nut free,Mince,Low sugar,Beef,Peanut free",
  "name": "Meatballs 3 Ways Recipe | Woolworths",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "748 calories",
    "carbohydrateContent": "68.2 g",
    "fatContent": "30.8 g",
    "proteinContent": "47.2 g",
    "saturatedFatContent": "11.6 g",
    "sodiumContent": "855 millig",
    "sugarContent": "12.1 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Mains",
  "recipeCuisine": "Italian",
  "recipeId": "3518",
  "recipeIngredient": [
    "0.33 cup full cream milk",
    "1 brown onion, finely chopped (for tomato sauce)",
    "2 tsp dried parsley leaves",
    "1 cup chicken stock",
    "0.50 cup parmesan cheese, finely grated (save half to serve)",
    "250g dried spaghetti",
    "680g passata",
    "500g beef mince",
    "2 slice sandwich bread, crusts removed, torn",
    "2 tbs olive oil",
    "1 free range egg",
    "2 cloves garlic, finely grated with microplane"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Combine bread and milk in a large bowl. Mash with a fork. Add the mince, parmesan, parsley and egg. Use your hands to mix until well combined. Roll tablespoonfuls of the mince mixture into balls and place on a baking paper-lined oven tray. Place in the fridge for 15 minutes to set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the sauce, heat oil in a wide-based sauté or casserole pan, add onion and garlic. Cook, stirring until onion is soft. Add passata and stock. Bring to a simmer, stirring occasionally for 10 minutes. Carefully drop the meatballs into sauce and simmer for a further 10 minutes or until meatballs are cooked through."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile cook pasta in a large saucepan of boiling salted water until tender. Drain. Add the pasta to the meatballs, toss to combine. Serve topped with extra parmesan. Variation 1: Chicken meatballs with spaghetti and pesto – Make the basic meatballs; replace beef mince with chicken mince, omit the egg and omit tomato sauce. Heat 1 tablespoon of oil in a large wide-based casserole or sauté pan over medium heat, cook chicken meatballs in 3 batches until browned and cooked through. Return meatballs to pan. Add 250g punnet halved cherry tomatoes, 190g jar basil pesto and cooked spaghetti. Toss to combine. Serve with finely grated parmesan and basil leaves (optional). Variation 2: Spiced meatballs with couscous – Make the basic meatballs and tomato sauce and replace the beef mince with Turkey mince, omit the egg and add 2 teaspoons Moroccan seasoning. Serve meatballs in tomato sauce with couscous. Scatter over handful chopped continental parsley and lemon wedges to serve (optional). Tip 1: The spiced meatballs make great finger food for a party served in a bowl with sauce to the side. Tip 2: Use wet hands to shape into balls, this stops meat sticking to hands and gives a smooth surface. Tip 3: Make a double batch of basic meatballs and freeze for another meal."
    }
  ],
  "recipeNameId": "meatballs-3-ways",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/meatballs-3-ways"
  ],
  "totalTime": "PT55M",
  "updatedAt": "2022-11-24T09:38:16.266Z",
  "url": "https://www.woolworths.com.au/shop/recipes/meatballs-3-ways"
}
