{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "29",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T02:15:01.396Z",
  "datePublished": "2014-05-20T05:00:48+00:00",
  "description": "30-minute Mexican quinoa salad cups loaded with fiber, protein, and healthy fats from quinoa, black beans, sweet potatoes, and a creamy, vegan cilantro-lime dressing!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/04/Mexican-Quinoa-Salad-SQUARE.jpg"
  ],
  "keywords": "salad cups",
  "name": "Mexican Quinoa Salad Cups with Creamy Cilantro Lime Dressing",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "282 kcal",
    "carbohydrateContent": "28 g",
    "fatContent": "18 g",
    "fiberContent": "8.6 g",
    "proteinContent": "6.8 g",
    "saturatedFatContent": "2.8 g",
    "servingSize": "1 salad cups",
    "sodiumContent": "200 mg",
    "sugarContent": "5 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 small heads artisan lettuce (any variety that will form cups/wraps nicely – or sub corn tortillas)",
    "1 15-ounce can unsalted black beans (note: If your beans are salted, omit additional sea salt)",
    "1 large sweet potato (scrubbed, rinsed and cubed)",
    "~1/2 tsp each cumin, cinnamon, and sea salt (divided)",
    "3/4 cup dry white or red quinoa (rinsed in a fine mesh strainer)",
    "Olive oil",
    "1/2 small ripe avocado",
    "1 cup chopped cilantro",
    "2-3 small limes, juiced",
    "1/3 cup extra virgin olive or avocado oil",
    "1/4 tsp each sea salt and cumin",
    "1 Tbsp sweetener of choice (such as cane sugar or honey if not vegan)",
    "Water (to thin)",
    "Hot Sauce",
    "Salsa",
    "Jalapeño slices"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and prep sweet potatoes. Toss in a drizzle of olive oil and 1/4 tsp each cumin, cinnamon and sea salt (amounts as original recipe is written // adjust if altering batch size). Bake for 20-25 minutes or until tender and slightly golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Rinse quinoa in a fine mesh strainer and place in a small saucepan over medium-high heat to toast. Stir and cook for 2-3 minutes and then add 1 1/2 cups water and stir (amount as original recipe is written // use a 1:2 ratio quinoa:water if altering batch size). Bring to a boil, then reduce heat to simmer, cover and cook for 15 minutes or until tender and the water is fully absorbed. Turn off heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate saucepan, bring black beans to a simmer over medium heat and season with 1/4 tsp each sea salt, cumin and cinnamon (amounts as original recipe is written // adjust if altering batch size). If your black beans are already salted, omit additional salt. Once bubbly and warm, turn heat to simmer/low."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare dressing by adding all ingredients (starting with 2 small or 1 large lime(s) as the original recipe is written) besides water to a blender and blending. Add water to thin and scrape down sides as needed. Taste and adjust seasonings as needed, adding more lime, salt, cumin or sweetener as desired. Transfer to serving dish. You will have leftovers, which store well in a covered container in the fridge for up to several days."
    },
    {
      "@type": "HowToStep",
      "text": "Rinse and dry lettuce (or sub corn or flour tortillas) and choose the pieces that are a good “cup” shape to fill with toppings."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange on a serving plate and top with quinoa, black beans and sweet potatoes. You might have leftover toppings depending on how many salad cups you prepare. Leftovers keep well."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with dressing and any additional desired toppings, such as cilantro, salsa, chips or sliced jalapeno."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/mexican-quinoa-salad-cups-with-creamy-cilantro-lime-dressing"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T02:15:01.395Z"
}
