{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "4.67"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-04T19:03:03.309Z",
  "datePublished": "2017-12-18T03:00:43+00:00",
  "description": "An herbed green cranberry salad with roasted, spiced pecans, nut cheese, and a vinaigrette! Just 30 minutes to prepare this plant-based side or entrée!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/11/Mint-Cranberry-Salad-SQUARE.jpg"
  ],
  "keywords": "herbed green cranberry salad",
  "name": "Minty Green Salad with Cranberry Vinaigrette",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "424 kcal",
    "carbohydrateContent": "37.7 g",
    "fatContent": "29.2 g",
    "fiberContent": "7.9 g",
    "proteinContent": "6.9 g",
    "saturatedFatContent": "3.3 g",
    "servingSize": "1 side salads",
    "sodiumContent": "112 mg",
    "sugarContent": "17.2 g"
  },
  "prepTime": "PT18M",
  "recipeCategory": "Salad",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "8 ounces fresh cranberries (or sub frozen)",
    "3 Tbsp maple syrup (plus more to taste)",
    "1/2 tsp lemon or orange zest",
    "1 pinch sea salt",
    "3-4 Tbsp lemon or orange juice (lemon for more tart // orange for more sweet)",
    "1 cup raw pecans",
    "2 tsp avocado or coconut oil",
    "2 Tbsp maple syrup",
    "2 tsp coconut sugar",
    "1/8 tsp each salt, ground cinnamon, and cayenne pepper",
    "4 Tbsp cranberry compote",
    "1 pinch each sea salt and black pepper",
    "2 Tbsp red wine vinegar",
    "1 Tbsp lemon juice",
    "2 Tbsp avocado oil (if avoiding oil, sub water)",
    "2 Tbsp water (plus more to thin)",
    "7 generous cups mixed greens (I used romaine and kale)",
    "1 cup chopped fresh herbs (I used mint and parsley)",
    "1 cup sliced cucumber (organic when possible // skin on)",
    "Crispy baked chickpeas",
    "Macadamia nut cheese"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If serving with chickpeas and/or macadamia nut cheese (links above), prepare now (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare cranberry compote by adding cranberries, maple syrup, lemon or orange zest, sea salt, and lemon or orange juice to a small saucepan and bringing to a boil over medium-high heat. Once boiling, reduce heat to a simmer and cover."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for 10 minutes or until the cranberries resemble compote. Remove from heat and transfer to a shallow bowl. Set in the refrigerator to cool."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, roast pecans. Heat a medium cast-iron or metal skillet over medium heat and add pecans. Toast for 5 minutes, stirring frequently, or until deeper in color and fragrant (be careful not to burn)."
    },
    {
      "@type": "HowToStep",
      "text": "Add coconut oil, maple syrup, coconut sugar, and spices of choice and stir to combine. Cook for another 1-2 minutes. Then turn off heat and let cool in the pan, stirring occasionally until serving."
    },
    {
      "@type": "HowToStep",
      "text": "Make dressing by adding cranberry compote to a small mixing bowl OR a small blender, such as the Magic Bullet (this will yield a creamier dressing)."
    },
    {
      "@type": "HowToStep",
      "text": "Add maple syrup, salt, pepper, red wine vinegar, lemon juice, and oil and whisk or blend on high to combine. Add enough water to make a thick but pourable dressing (~2 Tbsp or 30 ml // as recipe is written // adjust if altering batch size). Taste and adjust flavor as needed, adding more lemon or vinegar for acidity, salt or pepper for overall flavor, or maple syrup for sweetness."
    },
    {
      "@type": "HowToStep",
      "text": "Assemble salad by laying down mixed greens, herbs, cucumber, and roasted candied pecans in a serving platter or bowl. Add additional toppings, such as nut cheese and chickpeas (optional). Serve with dressing."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Store leftovers undressed in the refrigerator up to 3 days. Dressing will keep in the refrigerator up to 5 days. Store any leftover cranberry compote up to 1 week. Use to make additional dressing or add to other desserts (such as pies, crisps, or cocktails)."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/herbed-green-salad-cranberry-vinaigrette"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T19:03:03.308Z"
}
