{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-03T04:18:44.480Z",
  "datePublished": "2006-01-22T13:37:00+00:00",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2006/01/Monterey-Frittata.jpg"
  ],
  "name": "Monterey Frittata",
  "prepTime": "PT20M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 pound firm or extra-firm tofu (drained (NOT silken!)",
    "2 green onions (minced)",
    "1 can sliced or quartered artichoke hearts (drained and rinsed)",
    "1 teaspoon minced garlic",
    "1/2 green bell pepper (diced)",
    "10 button mushrooms (sliced (or mushrooms of choice)",
    "2 large roma tomatoes (sliced)",
    "vegan parmesan (optional)",
    "black olives (sliced)",
    "1/4 cup nutritional yeast",
    "1 teaspoon onion powder",
    "1/8 teaspoon red pepper",
    "1/2 teaspoon celery salt",
    "1/2 teaspoon basil",
    "1/2 teaspoon thyme",
    "1/2 teaspoon salt",
    "1/2 teaspoon turmeric",
    "2 teaspoon corn starch OR 2 tbsp. instant mashed potato flakes",
    "1 cup water",
    "2 tablespoons cornstarch",
    "1 teaspoon lemon juice",
    "1 teaspoon salt",
    "1/4 teaspoon powdered garlic",
    "1/4 teaspoon dry mustard",
    "1 tablespoon tahini"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Mash the tofu and add the seasoning mix, green onions, and artichokes. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a tablespoon or so of water in a small non-stick saucepan; add the mushrooms, green peppers, and garlic and cook until the mushrooms exude their juices. Drain the liquid off, and add half the mushroom mixture to the tofu."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large non-stick skillet to medium-high. Add the tofu, and stir and cook it for a couple of minutes. Then flatten it, pressing it evenly over the entire pan. Cover, reduce the heat to medium-low, and cook for about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While it’s cooking, make your Cheeze Sauce. Blend all ingredients together in a blender (I actually use a hand blender and do it right in the pan) and pour into a saucepan. Heat it at medium-high, stirring constantly, until it boils and thickens. Add enough water or plain soymilk (a couple of tablespoons) to make it just pour-able. Keep it warm until ready to use."
    },
    {
      "@type": "HowToStep",
      "text": "Once the tofu is heated through, place the sliced tomatoes on top, and sprinkle the remaining mushroom mixture over them. (If you’d like, you can add vegan parmesan at this point, too.) Drizzle cheeze sauce over the top, using as much or as little as you’d like. (I use about 2/3 of the recipe and reserve the rest for another use.) Sprinkle black olives over the cheeze, replace the cover, and cook until the tomatoes are done (about 5 minutes). Slice carefully, and serve. Or better yet, put your feet up and have someone serve you!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2006/01/monterey-frittata.html"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-03T04:18:44.479Z"
}
