{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "37",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-03T16:30:54.352Z",
  "datePublished": "2018-01-05T03:00:40+00:00",
  "description": "Stuffed baked eggplant with Moroccan-spiced lentils! Just 9 ingredients, big flavor, plenty of protein and fiber, and the perfect side dish or entrée.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/11/Lentil-Stuffed-Eggplant-SQUARE.jpg"
  ],
  "keywords": "stuffed eggplant",
  "name": "Moroccan Lentil-Stuffed Eggplant",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "429 kcal",
    "carbohydrateContent": "72.8 g",
    "fatContent": "9.6 g",
    "fiberContent": "33.2 g",
    "proteinContent": "19.4 g",
    "saturatedFatContent": "1.2 g",
    "servingSize": "1 stuffed eggplants",
    "sodiumContent": "403 mg",
    "sugarContent": "25 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "4 small eggplants",
    "2 Tbsp avocado or coconut oil (if avoiding oil, sub water)",
    "1 pinch sea salt",
    "1 batch Moroccan-Spiced Lentils",
    "1 3/4 cups crushed tomatoes (crushed are best for flavor and texture // can sub diced or puréed tomatoes)",
    "1/4 tsp each sea salt and black pepper (plus more to taste)",
    "1/2 tsp smoked paprika (plus more to taste)",
    "1 1/2 Tbsp vegan parmesan cheese",
    "1 1/2 Tbsp gluten-free panko bread crumbs",
    "Fresh chopped parsley or cilantro",
    "White or brown rice or cauliflower rice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and get out a 9x13-inch (or similar size) baking dish."
    },
    {
      "@type": "HowToStep",
      "text": "To a large saucepan or rimmed skillet, add Moroccan-Spiced Lentils, crushed tomatoes, salt, pepper, and paprika. Heat over medium heat until bubbling. Then reduce heat to simmer and cook for 5 minutes more. Taste and adjust flavor as needed, adding more salt and pepper for overall flavor or paprika for smokiness."
    },
    {
      "@type": "HowToStep",
      "text": "See notes if thinly slicing and rolling the eggplant. Otherwise, use a knife to cut an angled divot out of the center of your eggplants. Then use a spoon to scrape out a hollow center. Leave enough eggplant flesh so it's sturdy enough to hold the lentils (see photo). (Save leftover eggplant to make things like Eggplant Curry, Persian Eggplant Dip, or Baba Ganoush.)"
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large rimmed skillet over medium heat. Once hot, add oil and the eggplant cut-side down and cover - you may have to do this in two (or more if increasing batch size) batches depending on the size of your pan. Cook on one side for 4-5 minutes or until slightly charred. Then flip the eggplant over on the other side, cover, and cook for 4-5 minutes more. You're looking for the eggplant to be softened and browned on the outside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the eggplant is cooked, place cut-side up in your baking dish and top with lentils. There should be plenty to fill the eggplant and some overflow, which can be spooned down into the dish. Top with vegan parmesan cheese and panko bread crumbs."
    },
    {
      "@type": "HowToStep",
      "text": "Bake uncovered for 30-35 minutes or until the eggplant is soft and browned and the lentils are bubbling. The bread crumbs should be browned."
    },
    {
      "@type": "HowToStep",
      "text": "Serve as is or over rice or cauliflower rice (optional). Garnish with fresh parsley or cilantro (optional) for color and flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh, though leftovers keep covered in the refrigerator up to 4 days or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/moroccan-lentil-stuffed-eggplant"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-03T16:30:54.351Z"
}
