{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-02T05:09:34.553Z",
  "datePublished": "2010-02-03T11:18:00+00:00",
  "description": "I used red cabbage, which gave this soup a wonderful, rich color, but I think any type of cabbage will do. If you don’t have hot smoked paprika, use mild and add a pinch of chipotle or cayenne to give the soup a slight kick.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2010/02/mushroom-barley-soup-fb.jpg"
  ],
  "keywords": "cabbage soup, instant pot",
  "name": "Mushroom-Barley Soup with Cannellini Beans and Cabbage",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "170 kcal",
    "carbohydrateContent": "33.2 g",
    "fiberContent": "7.5 g",
    "proteinContent": "9.2 g",
    "servingSize": "1 serving",
    "sodiumContent": "638 mg",
    "sugarContent": "4.4 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1/4 cup pearl barley (consider using buckwheat or brown rice if you are gluten-free)",
    "4 cups vegetable broth",
    "2 medium onions (diced)",
    "6 ounces portobello or brown mushrooms (halved if large and sliced)",
    "3 cloves garlic (minced)",
    "freshly ground black pepper (to taste)",
    "salt to taste",
    "2 teaspoons minced fresh thyme (or 1 tsp. dried)",
    "2 tablespoons dry sherry",
    "12 ounces shredded cabbage",
    "1/2 teaspoon smoked paprika (mild)",
    "1/2 teaspoon smoked spicy paprika (agridulce or pimenton de la Vera)",
    "4 cups water",
    "16 ounces cannellini beans (1 can, drained)",
    "1 tablespoon lemon juice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the barley in a pressure cooker or large soup pot, add the vegetable broth, and bring to a boil. If pressure cooking, lock the lid in place and bring to high pressure; cook under pressure for 18 minutes. (In an Instant Pot, just set the pressure to high and set the timer for 18 minutes.) Bring pressure down with a quick release method."
    },
    {
      "@type": "HowToStep",
      "text": "If cooking in a regular soup pot, lower the heat and simmer, covered, for 30 to 40 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the barley is cooking, cook the onion in a non-stick skillet over medium-high heat until it softens and begins to brown; adding a pinch of baking soda will speed up the browning. Once it’s beginning to brown, add the garlic and mushrooms and a little salt and pepper, reduce the heat, cover, and cook, stirring regularly, until mushrooms soften, about 3 to 4 minutes. Add the thyme and sherry and cook until the alcohol cooks off."
    },
    {
      "@type": "HowToStep",
      "text": "Once the barley is cooked, add the mushrooms to the barley along with the sliced cabbage and paprika. If there are dried bits in the skillet, use a little of the water to deglaze it, and add that and the remainder of the 4 cups of water to the pot too. Add the cannellini beans and simmer, covered, for about 30 minutes, until the cabbage is tender, adding extra water if it gets too thick."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the lemon juice just before serving and add more salt and pepper to taste."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2010/02/mushroom-barley-soup-with-cannellini.html"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-02T05:09:34.552Z"
}
