{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T23:59:47.280Z",
  "datePublished": "2022-11-05T04:24:48+00:00",
  "description": "Try my easy recipe for Mushroom Stuffed Gluten-Free Naan made with Almond Flour for your next Indian Dinner! You can either stuff the vegan naan or mix the mushroom filling right into the batter! Gluten-free vegan grain-free soyfree, No added yeast.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/10/Gluten-Free-Mushroom-Stuffed-Naan-3697.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/Gluten-Free-Mushroom-Stuffed-Naan-3697-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/Gluten-Free-Mushroom-Stuffed-Naan-3697-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/Gluten-Free-Mushroom-Stuffed-Naan-3697-480x270.jpg"
  ],
  "keywords": "glutenfree naan, vegan stuffed naan recipe",
  "name": "Mushroom Stuffed Almond Flour Naan",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "231 kcal",
    "carbohydrateContent": "20 g",
    "fatContent": "15 g",
    "fiberContent": "4 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "320 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Side",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "1 cup blanched almond flour",
    "1/2 cup tapioca starch",
    "1 teaspoon baking powder",
    "1/4 teaspoon salt",
    "2 tablespoons non-dairy yogurt",
    "1 tablespoon oil",
    "1/2 cup + 1-2 tablespoons non-dairy milk",
    "1 teaspoon oil",
    "1/4 cup chopped green onion or regular onion",
    "8 ounces mushrooms (thinly sliced, I use cremini or white )",
    "6-8 ounces frozen spinach (thawed)",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon dried oregano",
    "1/2 teaspoon garam masala",
    "1/4 teaspoon black pepper",
    "1/2 cup shredded vegan cheese (optional, I use vegan mozzarella )"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the naan batter; Add the almond flour, tapioca starch, baking powder, and salt in a bowl and mix really well. Press and mix to break down the almond flour lumps. Then add the non-dairy yogurt, oil, and 1/2 cup of non-dairy milk and mix really well. Press and mix again until no lumps are left and the mixture is really smooth. Then add in more non-dairy milk, 1 tablespoon at a time until the batter has a pancake batter consistency but thinner. You don’t want it to be too thick but also not overly thin and runny. You should be able to spread easily on the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Make the filling; Heat a skillet over medium-high heat and add the oil. Then add mushrooms, green onion, and a good pinch of salt. Cook until the mushrooms are golden on some sides."
    },
    {
      "@type": "HowToStep",
      "text": "Add the spinach, garlic powder, dried oregano, garam masala, and black pepper and continue to cook until most of the moisture from the spinach has evaporated and the mushrooms are cooked to your preference. Set the filling aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Naan in 2 ways:.To make the stuffed naan, preheat the skillet over medium-high heat until the skillet is hot, and add a few drops of oil."
    },
    {
      "@type": "HowToStep",
      "text": "Spread 3 or more tablespoons of batter onto the hot skillet then top it with the mushroom filling and add some vegan cheese if you’d like. Spread the filling around evenly then drizzle some batter on top of the filling. Then cover the pan with the lid. Cook for 1 to 1.5 minutes. Time depends on your stove and pan. Keep checking on it; if it turns brown too quickly then flip it. Otherwise, let it cook until is golden brown on the bottom. Flip the naan, cover the pan again and continue to cook until golden brown on that side as well. Then remove the naan from the skillet. Repeat for the rest."
    },
    {
      "@type": "HowToStep",
      "text": "To make the filling mixed in batter naan; mix the mushroom filling into the batter and add vegan cheese if you like. Then spread that batter onto the heated skillet with a spatula or a spoon. Cover with the lid and cook until golden brown. Flip it, cover it with the lid and cook on the other side as well until golden, another minute or so. Remove from the skillet and repeat with the remaining batter."
    },
    {
      "@type": "HowToStep",
      "text": "Store the naans covered until ready to serve. Optionally brush some melted vegan butter or oil on them. Serve with favorites curries. Use Italian herbs instead of garam masala in the filling and use with soups and stews."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/spinach-mushroom-stuffed-almond-flour-naan"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-01T23:59:47.279Z"
}
