{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "cookTime": "PT80M",
  "createdAt": "2022-12-01T04:40:37.411Z",
  "datePublished": "2016-03-10T09:41:25+00:00",
  "description": "Juicy cremini mushrooms are simmered in a herbed red wine broth and baked up in a flaky puff pastry crust to create this hearty and flavorful vegan pot pie.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2016/03/mushroom-bourguinonne-pot-pie-4.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/03/mushroom-bourguinonne-pot-pie-4-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/03/mushroom-bourguinonne-pot-pie-4-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2016/03/mushroom-bourguinonne-pot-pie-4-480x270.jpg"
  ],
  "keywords": "Mushroom Bourguignonne Pot Pie, puff pastry recipe, vegan pot pie",
  "name": "Mushroom Bourguignonne Pot Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "636 kcal",
    "carbohydrateContent": "59 g",
    "fatContent": "39 g",
    "fiberContent": "5 g",
    "proteinContent": "11 g",
    "saturatedFatContent": "9 g",
    "servingSize": "1 serving",
    "sodiumContent": "394 mg",
    "sugarContent": "8 g",
    "unsaturatedFatContent": "28 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3 tablespoons olive oil (divided)",
    "1 1/2 pounds cremini mushrooms (cleaned, stemmed and sliced)",
    "1 onion (diced)",
    "1 cup chopped carrots (about 3-4 carrots)",
    "1 leek (white and pale green part, cleaned and chopped)",
    "3 garlic cloves (minced)",
    "1/4 cup whiskey",
    "1/2 cup fresh parsley (finely chopped )",
    "2 cups dry full bodied, red wine (divided)",
    "1/4 cup all-purpose flour",
    "1 cup vegetable broth",
    "1 1/2 cups pearl onions (fresh and peeled or frozen)",
    "1 tablespoon fresh thyme leaves",
    "1 bay leaf",
    "1/2 - 1 teaspoon liquid smoke (to taste)",
    "salt and pepper (to taste)",
    "2 sheets frozen puff pastry (about 1/2 pound each, thawed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large pot with 2 tablespoons of olive oil and place it over medium heat. When the oil is hot, add the mushrooms, placing them in as even a layer as possible. Cook until the mushrooms begin to brown, about 5 minutes. Flip and cook 5 minutes more, until browned on the other side. Remove the mushrooms from the pot and transfer to a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Recoat the bottom of the pot with the remaining tablespoon of olive oil. Once the oil is hot, add the onion, carrots and leek. Sauté until the onions are soft and translucent, about 5 minutes. Add the garlic and cook 1 minute more. Add the whiskey and parsley, stir to incorporate and simmer until most of the whiskey has evaporated, 1-2 minutes. Add 1 cup of red wine and bring to a simmer."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour, one tablespoon at a time, stirring constantly, until the flour forms a smooth paste with cooking liquid. Return mushrooms to the pot and add the remaining wine, broth, pearl onions, thyme and bay leaf. Stir a few times to incorporate."
    },
    {
      "@type": "HowToStep",
      "text": "Raise heat and bring to a slow boil, then lower heat and simmer until the liquid is thick and the carrots are fork tender, about 30 minutes. Remove from heat. Discard the bay leaf and season with liquid smoke, salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400°F. Spray an 8x8-inch baking dish with an oil mister or cooking spray."
    },
    {
      "@type": "HowToStep",
      "text": "Roll one sheet of puff pastry until it's large enough to cover the bottom and sides of dish, with about an inch overhang. Place the puff pastry into the baking dish and allow the center to fall into the dish, pressing very gently until the sheet conforms to the inside. Pour the mushroom stew into the dish, over the puff pastry sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Roll the other puff pastry sheet until it's large enough to cover the dish. Place this sheet over the top of the dish, covering the stew completely. Pinch the edges of the top and bottom puff pastry sheets together and trim any edges that hang more than an inch or so below the top edges of the dish. Cut a few slits into the top sheet of puff pastry to vent steam."
    },
    {
      "@type": "HowToStep",
      "text": "Bake until the crust is puffy and lightly browned, about 30 minutes. Remove from the oven and allow to sit for about 5 minutes before serving."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://ohmyveggies.com/mushroom-bourguignonne-pot-pie"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet",
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-12-01T04:40:37.411Z"
}
