{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Kiersten"
  },
  "createdAt": "2022-12-03T11:03:50.119Z",
  "datePublished": "2019-07-15T08:00:00+00:00",
  "description": "Credit line: Recipe from YumUniverse Pantry to Plate © Heather Crosby, 2017. Photographs copyright © Heather Crosby, 2017. Reprinted by permission of the publisher, The Experiment. Available wherever books are sold. theexperimentpublishing.com",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2019/07/Mushroom-Sage-Lasagna.jpeg"
  ],
  "name": "Mushroom & Sage Lasagna",
  "recipeCategory": "Main Dishes",
  "recipeIngredient": [
    "1/2 cup 70 g raw, unsalted almonds",
    "1/4 cup 25 g raw, unsalted pecans",
    "1 tablespoon plus 2 teaspoons unrefined coconut oil",
    "1 1/4 teaspoons sea salt (plus more to taste)",
    "Fresh-cracked black pepper",
    "Pinch of fresh-ground nutmeg",
    "3 large leaves kale (chopped into small pieces)",
    "1 9-ounce (255 g) package gluten-free lasagna noodles",
    "2 1/2 cups 340 g cashews, soaked 4 to 6 hours, drained, and rinsed",
    "1 1/2 cups 360 ml water",
    "1/2 cup 65 g pine nuts, toasted",
    "3 teaspoons fresh lemon juice",
    "5 to 6 sage leaves",
    "1 1/2 pounds 680 g cremini mushrooms, sliced",
    "2 large shallots (sliced or diced (about 1 cup/80 g)",
    "1 tablespoon Sucanat or coconut palm sugar",
    "2 to 3 tablespoons dry white wine (optional)",
    "2 24-ounce (680 g) jars pasta sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375°F (190°C). In a food processor, pulse together the almonds, pecans, 1 teaspoon of the oil, 1/4 teaspoon of the salt, a few grinds of pepper, and the nutmeg until dusty. Add the kale and pulse 3 times."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the noodles according to the box instructions—layer them in rows on sheets of parchment to keep the noodles from sticking to each other."
    },
    {
      "@type": "HowToStep",
      "text": "Make a cashew cream sauce by blending the cashews, water, pine nuts, lemon juice, 2 teaspoons of the oil, 1 teaspoon of the salt, and the sage until smooth; set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Place the remaining 2 teaspoons oil, the mushrooms, shallots, Sucanat, and a pinch of salt in a skillet heated to medium. Stir occasionally for 7 to 10 minutes, until they caramelize and brown. Add the wine (if using), stir for 2 more minutes or until it cooks off, and remove from the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Add 3 spoonfuls of tomato sauce into a lasagna pan; spread it around and top with noodles side by side. Spread a few spoonfuls of tomato sauce and cashew cream sauce over the noodles. Sprinkle with the mushrooms, season the layer with a pinch of salt and fresh pepper, then top with another layer of noodles. Repeat these steps, seasoning each layer with a pinch of salt and pepper, until all the noodles, sauces, and mushrooms are used. Sprinkle with the almond-pecan-kale topping, cover with parchment, and bake for 20 minutes. Remove the parchment and bake 20 more minutes until bubbling."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://helloveggie.co/mushroom-sage-lasagna"
  ],
  "updatedAt": "2022-12-03T11:03:50.117Z"
}
