{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T12:49:09.174Z",
  "datePublished": "2013-11-15T17:59:48+00:00",
  "description": "A food processor makes fast work of chopping the onions, celery, and peppers.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2013/11/mushroom-tempeh-gumbo-small.jpg"
  ],
  "name": "Mushroom and Tempeh Gumbo",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "286 kcal",
    "carbohydrateContent": "50.3 g",
    "fatContent": "4.5 g",
    "fiberContent": "11.7 g",
    "proteinContent": "15.5 g",
    "servingSize": "1 serving",
    "sodiumContent": "541 mg",
    "sugarContent": "4.8 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Main Course",
  "recipeIngredient": [
    "1 1/2 teaspoons dried thyme",
    "1 1/2 teaspoons smoked paprika",
    "1 teaspoon dried basil",
    "1 teaspoon granulated onion or onion powder",
    "1/2 teaspoon freshly ground black pepper",
    "1/2 teaspoon granulated garlic or garlic powder",
    "1/2 teaspoon rubbed sage",
    "1/4-1/2 teaspoon cayenne pepper (use more for more heat)",
    "1/4-1/2 teaspoon freshly ground white pepper (use more for more heat)",
    "8 ounces tempeh (see note below for alternatives, any variety)",
    "2 teaspoons soy sauce or gluten-free tamari",
    "1/3 cup whole wheat flour (or gluten-free flour)",
    "6-7 cups “no-chicken” or other vegetable broth",
    "1 large onion (finely chopped)",
    "2 large ribs celery (or three medium, finely chopped)",
    "1 large green bell pepper (stemmed, seeded, and finely chopped)",
    "16 ounces portabella mushrooms (stemmed, sliced about 1/4-inch thick, and cut into inch-long pieces)",
    "4 ounces sliced mushrooms (I used a \"gourmet blend\" of cremini, oyster, maitake, and button mushrooms, any type)",
    "6 cloves garlic (minced)",
    "12 ounces sliced okra (fresh or frozen)",
    "salt to taste",
    "3 cups cooked brown rice (to serve)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the seasoning blend by mixing all the seasonings in a small bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the tempeh into 1/2-inch cubes. Place it in a mixing bowl and drizzle it with the soy sauce and mix well. Sprinkle with 1 teaspoon of the seasoning blend, mix well, and set aside to marinate."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large, dry soup pot or Dutch oven. Add the flour and toast, stirring constantly, until it turns the color of a paper bag and starts smelling nutty (see photo here). Be careful not to burn it, but if you do, wipe out your pan and start over. Remove from heat. Pour into a blender along with 2 cups of the broth and blend until combined. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Wipe out the pot and return it to the heat. Add the onion and cook until it begins to soften, adding water by the tablespoon if needed to prevent sticking. Add the celery and bell pepper and continue to cook another 2 minutes. Add the mushrooms and garlic and 2 tablespoons of water and cover tightly. Cook until mushrooms begin to soften, about 2 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Give the flour mixture another quick whirl in the blender and add it to the vegetables, along with 4 cups of broth and the okra. Add all the remaining seasoning blend, and bring to a simmer. Reduce heat to low, cover, and cook for 25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the gumbo is cooking, brown the tempeh. Heat a non-stick skillet and add the tempeh in a single layer. Cook, turning often, until it is browned on all sides."
    },
    {
      "@type": "HowToStep",
      "text": "After the gumbo has cooked for 25 minutes, add the tempeh and, if the soup seems too thick, another cup of broth. Cook for a few more minutes. Check the seasoning and add salt if you like. Serve in bowls over brown rice with Louisiana hot sauce on the table."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2013/11/mushroom-and-tempeh-gumbo.html"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-02T12:49:09.172Z"
}
