{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Courtesy of The Chalkboard Magazine"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-03T16:48:26.391Z",
  "datePublished": "2020-05-04T14:47:51+00:00",
  "description": "This lawn weed makes for a delicious, nutritious breakfast.",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2020/05/erinscott_yummysupper_nettleomelet_1.jpg",
    "https://helloveggie.co/wp-content/uploads/2020/05/erinscott_yummysupper_nettleomelet_1-500x500.jpg",
    "https://helloveggie.co/wp-content/uploads/2020/05/erinscott_yummysupper_nettleomelet_1-500x375.jpg",
    "https://helloveggie.co/wp-content/uploads/2020/05/erinscott_yummysupper_nettleomelet_1-480x270.jpg"
  ],
  "name": "Nettle Omelet with Spring Onion + Parmesan",
  "prepTime": "PT10M",
  "recipeCategory": "Breakfast",
  "recipeIngredient": [
    "3 packed cups trimmed and washed nettle leaves (see notes above about the necessary precautions for handling fresh nettles)",
    "2 Tbsp chopped spring onion or scallion",
    "2 Tbsp olive oil sea salt",
    "2 Tbsp grated organic Parmesan",
    "2-3 free-range eggs",
    "Splash of water",
    "Freshly ground black pepper",
    "Unsalted butter (organic)",
    "optional for garnish: chopped onion greens and/or flowers"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat olive oil in a medium sauté pan over medium heat. Add nettle leaves. Use tongs to toss nettles and coat them in the warm oil. Add a sprinkling of sea salt to the greens. Cover the pan, turn the flame to low and continue to cook nettles for a few minutes until the leaves are wilted and tender."
    },
    {
      "@type": "HowToStep",
      "text": "Place cooked nettles on a cutting board and coarsely chop. Set chopped nettles next to your stove so that you can easily add them to your omelet in just a few minutes. Place your grated Parm next to the stove top as well."
    },
    {
      "@type": "HowToStep",
      "text": "Set a small cast-iron (or non-stick) pan over medium heat so that it can thoroughly preheat before you cook your omelet. In the meantime, whisk eggs vigorously in a mixing bowl with a pinch of salt, a few grinds of black pepper, and a tiny splash of tap water."
    },
    {
      "@type": "HowToStep",
      "text": "Place 1/2 tablespoon butter in the hot pan. Swirl it around to coat all sides. (If the pan is too hot and the butter browns, use a paper towel to wipe out the pan, adjust the flame and start with a fresh pat of butter.) Once the melted butter has coated the sides of the pan, immediately add the whisked eggs. Grab the handle of the pan and tilt it so the eggs evenly coat the bottom, and slightly up the sides, of the pan. Once the eggs start to form large bubbles, use a spatula to pull the eggs from the edge towards the middle of the pan, letting the runny eggs fill the void. Repeat this action in 3-4 places until there’s no longer excess runny egg to fill a void."
    },
    {
      "@type": "HowToStep",
      "text": "Once your eggs have a nice rumpled surface, sprinkle the grated Parmesan onto the omelet. Next add the chopped, cooked nettles. (If the omelet still looks a little underdone to your taste, turn the flame to low and cover the pan for just a minute or so. I personally like my omelettes with a slightly gooey middle.) Slide the omelette from the pan onto a plate, letting it fold onto itself."
    },
    {
      "@type": "HowToStep",
      "text": "Serve omelette right away and garnish with onion greens (and flowers if you’ve got them). Enjoy!"
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://helloveggie.co/nettle-omelet-with-scallions-parmesan"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-03T16:48:26.390Z"
}
