{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - baobaker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-27T12:33:04.000Z",
  "datePublished": "2022-08-03",
  "description": "Here's an incredibly amazing recipe to make your own bagel! It's easy and there's no mixer required. You will never go back to store-bought bagels.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/dds5ijg1zvkylsdt3bjw:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Bagel",
  "name": "New York Style Bagels Recipe | Woolworths",
  "prepTime": "PT150M",
  "recipeCategory": "Lunch",
  "recipeCuisine": "North American",
  "recipeId": "a0K2y00000116oPEAQ",
  "recipeIngredient": [
    "500g bread flour",
    "25g white sugar",
    "10g instant dried yeast",
    "320ml warm water",
    "6g salt",
    "2 tbs garlic granules",
    "2.5 tbs onion flakes",
    "1.5 tbs white sesame seeds",
    "1 tbs black sesame seeds",
    "1 tbs poppy seeds",
    "0.5 tbs flaky sea salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bloom yeast in warm water (32°C), add sugar, and stir until dissolved, let rest for 10 minutes (especially if using older yeast) until the yeast is bubbly or frothy. give one more stir after waiting."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Into a large bowl add flour, salt, and yeast/water mixture, combine with hands until a shaggy dough is formed."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Turn dough out to work surface and knead for 10 minutes, form into a ball and place in a large oiled bowl, cover with a damp towel and let rest for 1 hour."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Punch down dough and turn out to lightly flour work surface, divide into 8 equal pieces (weigh the whole dough and divide by 8), shape each piece into a ball by rolling it between your hand and un-floured work surface. Place in a floured sheet pan, cover with a damp towel and let rest for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "While you wait combine bagel seasoning ingredients if desired. Combine white sesame seeds, black sesame seeds, poppy seeds, garlic granules, onion flakes, and flaky sea salt in a bowl or jar. You will not need all of it for this recipe, so you can store the rest and use it as you wish."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "After the dough has rested pinch with floured fingers through the middle of a dough ball, and twirl in between 2 fingers to enlarge the hole, up to about 2.5 cm. When you boil the bagel, the hole will shrink - so take this into account when forming your dough hole."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Bring a large pot of water to a boil, after it's boiling reduce the heat to a gentle boil/simmer. Drop bagels into boiling water, in a single layer, and leave room for expansion, boil for 1-2 minutes per side. After boiling place into an oiled sheet pan."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Brush each bagel with an egg wash (1 egg and 1 Tbsp of water), sprinkle with the desired seasoning."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place in a 220°C preheated oven for 20 minutes. Bagels are ready to serve!"
    }
  ],
  "recipeNameId": "new-york-style-bagels",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/new-york-style-bagels"
  ],
  "totalTime": "PT180M",
  "updatedAt": "2022-11-27T09:45:27.340Z",
  "url": "https://www.woolworths.com.au/shop/recipes/new-york-style-bagels"
}
