{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "42",
    "ratingValue": "4.74"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT1M",
  "createdAt": "2022-12-04T16:48:36.108Z",
  "datePublished": "2016-08-08T05:00:08+00:00",
  "description": "Fudgy, rich, No-Bake Almond Butter Cup Bars in just 20 minutes! Salty-sweet date-nut crust, gooey almond butter center, and ganache topping!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/07/Almond-Butter-Bars-SQUARE.jpg"
  ],
  "keywords": "almond butter cup",
  "name": "No-Bake Almond Butter Cup Bars",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "402 kcal",
    "carbohydrateContent": "34.5 g",
    "fatContent": "27.4 g",
    "fiberContent": "5.2 g",
    "proteinContent": "10 g",
    "saturatedFatContent": "7.7 g",
    "servingSize": "1 bars",
    "sodiumContent": "20 mg",
    "sugarContent": "23.1 g"
  },
  "prepTime": "PT19M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cups raw or roasted almonds or walnuts",
    "1/4 cup cocoa powder",
    "1 pinch sea salt",
    "1 cup packed dates",
    "1 cup creamy or crunchy almond butter (or sub other nut or seed butter)",
    "1 Tbsp maple syrup",
    "Pinch sea salt",
    "1 1/4 cup vegan dark chocolate (very finely chopped // 9 ounces yields ~1 1/4 cup)",
    "7 Tbsp light coconut milk",
    "1 Tbsp coconut oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare crust by adding nuts, cocoa powder, and sea salt to a food processor and blending into a meal. Remove from bowl and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add dates to the food processor and mix/pulse until small bits remain or a ball forms. Break up the dates with a spoon so they're not all in one clump. Then add the nut-cocoa mixture back in and blend to combine until a loose dough is formed."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the dough to a parchment-lined 8x8-inch baking dish (adjust number/size of pan if altering batch size) and spread with fingers to evenly distribute. Then top with parchment paper or plastic wrap and use a flat-bottomed object - such as a drinking glass or measuring cup - to press and pack the crust into a solid, even layer. Remove parchment paper and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add almond butter to a small mixing bowl along with maple syrup and sea salt. Stir to combine. (Depending on the brand, if it is extremely runny you may need to add a little almond meal to thicken until spreadable, but I didn't find this necessary.)"
    },
    {
      "@type": "HowToStep",
      "text": "Add the almond butter mixture to the crust in spoonfuls. Then top with parchment paper again and use the same object from earlier to spread and pack the mixture down into a flat, uniform layer. Remove parchment paper and set in freezer to chill."
    },
    {
      "@type": "HowToStep",
      "text": "Add finely chopped dark chocolate to a medium mixing bowl. Add coconut milk and coconut oil to a separate glass mixing bowl or glass measuring cup and microwave until hot but not boiling (alternatively, heat in a saucepan on the stovetop until very hot). Pour the coconut milk directly over the chocolate, stir to combine, and cover with something (such as plastic wrap) to encourage it to melt."
    },
    {
      "@type": "HowToStep",
      "text": "Let set for 5 minutes. Then whisk to combine. The mixture should be entirely melted and smooth. If not, heat in the microwave in 20-30 second increments until entirely smooth and no chunks remain. (Alternatively, set your glass or ceramic mixing bowl over a double boiler on the stovetop to melt)."
    },
    {
      "@type": "HowToStep",
      "text": "Remove 8x8-inch pan from the freezer and pour the ganache on top. Spread with a spoon until smooth. Then add back to the freezer to set for 5-10 minutes, or until semi-firm to the touch (enough to slice)."
    },
    {
      "@type": "HowToStep",
      "text": "Slice into desired number of bars: 9-12 (amount as original recipe is written // adjust if altering batch size) or even smaller so they're \"bites\" rather than \"bars.\" Enjoy immediately. Store leftovers covered in the refrigerator up to 1 week or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/no-bake-almond-butter-cup-bars"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-12-04T16:48:36.107Z"
}
