{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T19:22:22.853Z",
  "datePublished": "2016-02-05T09:56:35+00:00",
  "description": "These no-bake granola bars are quick, easy, and endlessly adaptable.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2016/02/no_bake_granola_bars_2.jpg"
  ],
  "name": "no-bake granola bars",
  "prepTime": "PT15M",
  "recipeCategory": "snacks",
  "recipeIngredient": [
    "3 cups rolled oats",
    "1/2 cup black or white sesame seeds",
    "1 cup whole almonds",
    "2 cups pitted dates",
    "1/2 cup cocoa nibs",
    "1 cup dried cranberries",
    "1 cup smooth nut butter (I used cashew butter*)",
    "1 cup liquid sweetener (I used a blend of honey and date syrup*)",
    "1/2 tsp coarse salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Line the bottom of an 9 x 11-inch pan with parchment paper. Preheat the oven to 180oC / 350°F."
    },
    {
      "@type": "HowToStep",
      "text": "Roughly chop the almonds (I did this by pulsing them in my food processor), then mix with the oats and sesame seeds and spread out on a baking sheet. Toast for 10 to 12 minutes, stirring once or twice while baking, until they are slightly browned. Transfer into a large bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Finely chop the dates (I also did this in the food processor, and pulsed them until they formed nearly a paste)."
    },
    {
      "@type": "HowToStep",
      "text": "Add the dates, cocoa nibs, and cranberries to the bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the nut butter, sweetener, and salt in a small saucepan, stirring until warm and fluid, but not boiling. Pour the liquid over the oat mixture in the bowl and stir until it’s completely incorporated. I found that getting in there with clean hands was the path of least resistance."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to the prepared pan and pat it down so it’s as flat as possible - clean, wet hands do the trick here."
    },
    {
      "@type": "HowToStep",
      "text": "Refrigerate the granola bars for at least 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pan from the fridge and pull up on the edges of the parchment paper to release it from the pan. Carefully slice the bars into rectangles - I cut about 24 small bars from mine."
    },
    {
      "@type": "HowToStep",
      "text": "Store the granola bars in the refrigerator, or for a longer time in the freezer (this is where mine are at)."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://heynutritionlady.com/no-bake-granola-bars"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T19:22:22.853Z"
}
