{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "62",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-02T22:00:21.289Z",
  "datePublished": "2019-04-21T03:00:19+00:00",
  "description": "Tender, naturally sweetened carrot cake bites with dates, carrots, walnuts, cinnamon, and coconut flour! So simple, delicious carrot cake flavor, and the perfect healthier snack or dessert! Just 30 minutes, 9 ingredients, and 1 food processor required.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2019/03/Carrot-Cake-Bites-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2019/03/Carrot-Cake-Bites-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2019/03/Carrot-Cake-Bites-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2019/03/Carrot-Cake-Bites-SQUARE-480x270.jpg"
  ],
  "keywords": "carrot cake bites",
  "name": "No-Bake Carrot Cake Bites",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "142 kcal",
    "carbohydrateContent": "24.1 g",
    "fatContent": "5.4 g",
    "fiberContent": "3.3 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "0.7 g",
    "servingSize": "1 bites",
    "sodiumContent": "44 mg",
    "sugarContent": "19.6 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert/Snack",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 cup peeled and finely shredded carrot (~1-2 carrots as recipe is written)",
    "1 cup packed pitted medjool dates (measured after pits are removed)",
    "1 3/4 cups raw walnuts (or sub other nut, such as pecans or cashews)",
    "2 tsp vanilla extract",
    "1/4 tsp sea salt",
    "3/4 tsp ground cinnamon",
    "1/2 tsp ground ginger",
    "1 pinch ground nutmeg",
    "4-6 Tbsp coconut flour (or sub almond flour)",
    "1/4 cup raisins (optional // or sub other unsweetened dried fruit)",
    "1/2 cup desiccated coconut flakes (you can blitz briefly in a blender for a finer flake that sticks to the bites more easily)",
    "8 tsp soft, runny coconut butter"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Using the grater attachment on your food processor (or a box grater), grate the carrot and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To the food processor, add the pitted dates and blend until small bits remain or a ball forms. Remove from food processor and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To the food processor, add walnuts, vanilla, salt, and spices. Blend until a semi-fine meal is achieved — about 15 seconds. Then add the dates and shredded carrot back in and pulse in 1-second increments until a loose dough forms and the carrots are just incorporated. Be careful not to over-blend. You're looking for a pliable dough, not a purée."
    },
    {
      "@type": "HowToStep",
      "text": "Add coconut flour 2 Tbsp (18 g) at a time and pulse to combine. If it is not mixing, you may need to remove the lid and stir occasionally to encourage things along. You’re not looking for a paste or purée here, but a tender, crumbly dough. Once well combined, add raisins (optional) and pulse/stir once more to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop out 2-Tablespoon amounts using a cookie scooper (like this one), roll into balls with hands, and place directly onto a parchment-lined baking sheet or serving platter. Repeat until all dough is used up. If the bites are too sticky to roll, add a little more coconut or almond flour to dry the mixture out."
    },
    {
      "@type": "HowToStep",
      "text": "Roll in finely shredded coconut (optional) and enjoy immediately or refrigerate to chill/firm up. Or, if topping with coconut butter (optional), place bites in the freezer to chill for 10-15 minutes, then top with fresh coconut butter (if butter is not pourable, warm in a double boiler or in the microwave until a runnier consistency is achieved). After topping with coconut butter, chill bites another 5-10 minutes to set."
    },
    {
      "@type": "HowToStep",
      "text": "Store covered in the refrigerator up to 1 week or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://minimalistbaker.com/no-bake-carrot-cake-bites"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T22:00:21.288Z"
}
