{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "createdAt": "2022-11-29T02:19:06.501Z",
  "datePublished": "2020-02-06T13:41:45+00:00",
  "description": "This No Bake Strawberry Cheesecake is the perfect small batch dessert for Valentine&#x27;s Day, Galentine&#x27;s Day, or any day the cheesecake craving hits!",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2020/02/Finished-No-bake-Strawberry-Cheesecakes.jpg",
    "width": 800
  },
  "keywords": "cheesecake recipe, dessert for two, no bake dessert, small batch dessert",
  "name": "No Bake Strawberry Cheesecake for Two",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "726.55 kcal",
    "carbohydrateContent": "63.7 g",
    "fatContent": "49.35 g",
    "fiberContent": "3.3 g",
    "proteinContent": "5.8 g",
    "servingSize": "1 jar",
    "sodiumContent": "306.2 mg"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1/2 lb. fresh strawberries ($2.00)",
    "2 Tbsp granulated sugar ($0.04)",
    "4 oz. cream cheese, room temperature ($0.40)",
    "1 Tbsp lemon juice ($0.03)",
    "1 cup heavy whipping cream ($0.78)",
    "1/2 cup powdered sugar ($0.03)",
    "1/2 tsp vanilla extract ($0.15)",
    "2 graham crackers ($0.10)",
    "1 Tbsp butter ($0.13)",
    "1/2 Tbsp brown sugar ($0.02)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash the strawberries well, remove the stems, then slice them. Place the sliced strawberries in a bowl, add the granulated sugar, and stir to combine. Let the strawberries sit while you prepare the rest of the dish, stirring them occasionally to help draw out the juices."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate bowl, begin whipping the heavy whipping cream on high speed with a hand mixer or stand mixer. When it becomes thick and fluffy, but is not yet forming peaks, add the vanilla extract and powdered sugar. Start on low speed until the powdered sugar is incorporated, then switch to high speed and continue to whip until the whipped cream forms stiff peaks."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate bowl, combine the cream cheese and lemon juice. Use a hand mixer or stand mixer to whip the cream cheese and lemon juice together until soft and creamy."
    },
    {
      "@type": "HowToStep",
      "text": "Add the whipped cream to the bowl of whipped cream cheese, then whip the two together until evenly combined."
    },
    {
      "@type": "HowToStep",
      "text": "To make the graham cracker crust, place the graham crackers in a zip top bag and use a heavy object to crush the crackers until they are in fine crumbs. Melt the butter in a small bowl, then add the graham cracker crumbs and brown sugar, and stir until combined."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble the no bake cheesecakes, divide the graham cracker crumbs between two jars, glasses, or other small containers. Next add the cheesecake filling, then top with the juiced strawberries (making sure to add a couple spoonfuls of the strawberry juice with the berries). Enjoy immediately or refrigerate until ready to eat!"
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://budgetbytes.com/no-bake-strawberry-cheesecake-for-two"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-29T02:19:06.500Z"
}
