{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT5M",
  "createdAt": "2022-12-02T00:18:20.464Z",
  "datePublished": "2022-11-08T04:21:35+00:00",
  "description": "These 5 ingredient No-Bake Peanut butter Cookies come together very quickly and satisfy the cookie, fudge and quick snack craving! Use almond butter to make it peanut-free and sunflower seed butter for nutfree.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/10/No-Bake-Peanut-Butter-Cookies-6198.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/No-Bake-Peanut-Butter-Cookies-6198-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/No-Bake-Peanut-Butter-Cookies-6198-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/No-Bake-Peanut-Butter-Cookies-6198-480x270.jpg"
  ],
  "keywords": "no bake cookies, no bake peanut butter cookies",
  "name": "No Bake Peanut Butter Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "132 kcal",
    "carbohydrateContent": "13 g",
    "fatContent": "7 g",
    "fiberContent": "1 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "105 mg",
    "sugarContent": "7 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3/4 cup smooth peanut butter",
    "1/4 cup maple syrup",
    "A pinch of salt, (a pinch more if the peanut butter is unsalted)",
    "Few drops of vanilla extract (optional)",
    "2 to 4 tablespoons of flour of choice,",
    "1/3 cup vegan semi-sweet chocolate chips or chunks",
    "1/2 teaspoon coconut oil (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the cookie dough: Let the peanut butter sit at room temperature for a while or you can microwave a little bit so that it is soft. Add to a bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the maple syrup in a microwave or in a sauce pan on stove top until it is hot. Add to the peanut butter. Add flavors such as vanilla or cinnamon etc, then mix really well. It will take a minute or so for the mixture to become nice and smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Then add the salt and flour, I usually add 2 tablespoons of flour and then add more 1 tablespoon at a time. Mix in the flour and let the mixture sit in for 5-10 minutes so that the mixture cools a little bit and the peanut butter has the time to start solidify a little and the flour gets time to get absorbed in the wet mixture."
    },
    {
      "@type": "HowToStep",
      "text": "If still very sticky, Add 1 more tablespoon of flour to mix in and see if you need more. You want it to be a soft slightly sticky cookie dough and not stiff."
    },
    {
      "@type": "HowToStep",
      "text": "Put the bowl in the refrigerator to chill for 20 to 25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, melt your chocolate. Either on a double boiler on stove or in the microwave. Add the chocolate and the coconut oil to a bowl then microwave in 30-second intervals. Check every internal and as soon as the chocolate starts to melt, whisk it until all chocolate has melted and is smooth. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Get the cookie dough bowl from the fridge. Using a scoop or a spoon, divide the dough into equal portions and roll it out into balls"
    },
    {
      "@type": "HowToStep",
      "text": "Press these balls on parchment paper or a plate using a fork and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Then dip each of these cookies into melted chocolate. You can dip half, or full or drizzle over the cookies. You can also add some crushed peanuts on top for some crunchy texture."
    },
    {
      "@type": "HowToStep",
      "text": "Then chill these cookies again for 20 minutes until the chocolate sets and serve. Store refrigerated for upto 5 days."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://veganricha.com/no-bake-peanut-butter-cookies"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T00:18:20.463Z"
}
