{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Daria Groza"
  },
  "createdAt": "2022-12-02T01:27:56.140Z",
  "datePublished": "2020-12-17T08:00:00+00:00",
  "description": "Reprinted with permission from No-Bake Vegan Desserts by Christina Leopold, Page Street Publishing Co. 2020. Photo credit: Christina Leopold",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2020/12/Banoffee-Image.png",
    "https://helloveggie.co/wp-content/uploads/2020/12/Banoffee-Image-500x500.png",
    "https://helloveggie.co/wp-content/uploads/2020/12/Banoffee-Image-500x375.png",
    "https://helloveggie.co/wp-content/uploads/2020/12/Banoffee-Image-480x270.png"
  ],
  "keywords": "banoffee pie, dessert, no-bake, vegan",
  "name": "No-Bake Vegan Banoffee Pie",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1 cup (168 g) roasted buckwheat or raw buckwheat (toasted according to instructions provided)",
    "2 cups (200 g) rolled oats (use gluten-free if required)",
    "1/2 tsp pink Himalayan salt",
    "4 tbsp (56 g) coconut oil (solid) )",
    "3 tbsp (45 ml) maple syrup",
    "1/4 tsp ground nutmeg",
    "1 1/2 cups (219 g) cashews (dry weight)",
    "2 large ripe bananas",
    "1 cup (240 ml) vanilla soy milk (or regular soy milk)",
    "1 tsp vanilla extract",
    "1 tbsp (14 g) coconut oil (solid)",
    "1/2 tsp ground cinnamon",
    "2 tbsp 30 ml maple syrup",
    "9 Medjool dates (pitted)",
    "1/2 cup (129 g) peanut butter",
    "1/2 cup maple syrup (plus 3 tbsp )",
    "1 tsp pink Himalayan salt",
    "2 large bananas",
    "Juice of 1/2 lemon or 1 lime",
    "1 can (13.5-oz/400-ml) chilled coconut milk (using only the thick cream from the top of the can)",
    "1/2 tsp vanilla extract",
    "1 tsp maple syrup",
    "2 tbsp (32 g) peanut butter",
    "4 tbsp (60 ml) maple syrup",
    "dark chocolate chunks for garnish (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Ahead of time, begin by preparing the cashews for the filling. Soak the cashews in water for a minimum of 4 hours before rinsing with clean water and draining them, or quick soak in boiled water for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "If you are using raw buckwheat groats, you will need to toast them. Using a pan over medium heat, roast them in batches for 4 to 5 minutes until they begin to brown, tossing them so they brown evenly. Allow them to cool before using."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare the crust, put the buckwheat, oats and salt in your food processor and blitz until they form a tight crumb consistency. Add in the coconut oil, maple syrup and nutmeg and blend until the mixture begins to stick together to form a dough."
    },
    {
      "@type": "HowToStep",
      "text": "Line the bottom of a 9 x 3–inch (23 x 7.5–cm) cake pan with some parchment paper before pressing the dough into the bottom and approximately 2 1/2 inches (6.5 cm) up the sides of the pan. Use the flat bottom of a glass to smooth out the dough evenly. Trim the top edges with a knife to make them smooth and even. Set aside in the freezer while you make the rest of the pie."
    },
    {
      "@type": "HowToStep",
      "text": "For the filling, put all the filling ingredients in your high-speed blender and blitz until smooth and creamy without any lumps. Pour the mixture into the pan and tap the tin on your counter to knock out any air bubbles. Place in the freezer to set for 2 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Clean your blender and next make the caramel by putting all of the ingredients in it and blitzing them until they form a smooth paste. Remove the pie from the freezer, spoon the caramel on top of the pie and smooth out using a spatula. Place the pie back in the freezer to set fully for another 2 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Once ready, remove the pie from the pan while still frozen. Slice the bananas into coins and dip them into the lemon juice. This will prevent them from discoloring. Put them on a sheet of parchment paper to remove any excess moisture. Arrange the banana coins in a circular design to cover the entire top of the tart."
    },
    {
      "@type": "HowToStep",
      "text": "For the cream, put the coconut milk, vanilla extract and maple syrup in a bowl and whisk using your electric mixer until soft peaks form. Transfer the cream to a piping bag fitted with an open star tip and pipe some peaks on top of the pie."
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, to prepare the sauce, put the peanut butter and maple syrup in a bowl and whisk until smooth. Drizzle the sauce on top of the pie, sprinkle with dark chocolate chunks, if desired, and serve."
    }
  ],
  "sameAs": [
    "https://helloveggie.co/no-bake-vegan-banoffee-pie"
  ],
  "updatedAt": "2022-12-02T01:27:56.139Z"
}
