{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "48",
    "ratingValue": "4.9"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-11-25T13:59:36.000Z",
  "datePublished": "2010-09-15T15:48:00+00:00",
  "description": "Just five minutes of measuring and mixing is all it takes to make this extraordinary no-knead bread dough. Follow these techniques for the best bread ever.",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2010/09/Finished-No-Knead-Bread.jpg",
    "width": 800
  },
  "keywords": "Homemade Bread, No Knead Bread",
  "name": "No-Knead Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "172 kcal",
    "carbohydrateContent": "36 g",
    "fatContent": "1 g",
    "fiberContent": "1 g",
    "proteinContent": "5 g",
    "servingSize": "1 serving",
    "sodiumContent": "439 mg"
  },
  "prepTime": "PT1080M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3 cups all-purpose flour ($0.29)",
    "1/4 tsp instant or bread machine yeast ($0.02)",
    "1/2 Tbsp salt ($0.02)",
    "1.5 to 1.75 cup water* ($0.00)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "The day before baking, combine the flour, yeast, and salt in a large bowl and stir until they're well combined. Stir in about 1.5 to 1.75 cups room temperature water until a shaggy, sticky ball of dough forms and there is no dry flour left on the bottom of the bowl. Cover the bowl loosely with plastic and let it sit at room temperature for 12-18 hours."
    },
    {
      "@type": "HowToStep",
      "text": "When you're ready to bake, sprinkle a little flour on top of the fermented dough, and scrape it out of the bowl (the dough should be very light, fluffy, and bubbly by this time). With well floured hands, shape the dough into a ball and place it on a piece of parchment paper. Let the dough rise for 30-60 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the dough is rising, preheat the oven to 425oF, or the highest recommended temperature listed on the packaging for your parchment paper. Place the Dutch oven inside the oven as it heats, and make sure it sits in the fully heated oven for at least 15 minutes before baking the bread."
    },
    {
      "@type": "HowToStep",
      "text": "Once the bread has risen and the Dutch oven is fully heated, carefully remove the Dutch oven from the oven (it will be EXTREMELY hot). Lift the parchment with the dough straight into the dutch oven and cover it with the lid."
    },
    {
      "@type": "HowToStep",
      "text": "Return the Dutch oven to the oven and bake for 30 minutes. Carefully remove the lid and bake for another 15-20 minutes, or until the crust is a deep golden brown. Remove the Dutch oven from the oven, lift the bread out by by using the parchment paper, and allow it to cool before cutting open and serving."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/no-knead-bread"
  ],
  "totalTime": "PT1125M",
  "updatedAt": "2022-11-25T13:34:08.042Z"
}
