{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "17",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-01T07:25:42.180Z",
  "datePublished": "2020-05-08T14:10:13+00:00",
  "description": "Simple, artisan style No Knead Sourdough Bread made with just 3 ingredients. Flour, salt and water. Full of flavour with a crispy, crusty, crackly crust and soft, chewy crumb. Great for sourdough beginners! Includes free printable sourdough baking schedules so you can see exactly how to make it work around your day!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2020/04/No-Knead-Sourdough-Bread-A-Virtual-Vegan-HERO-1.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2020/04/No-Knead-Sourdough-Bread-A-Virtual-Vegan-HERO-1-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2020/04/No-Knead-Sourdough-Bread-A-Virtual-Vegan-HERO-1-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2020/04/No-Knead-Sourdough-Bread-A-Virtual-Vegan-HERO-1-480x270.jpg"
  ],
  "keywords": "easy sourdough, no discard sourdough starter, no knead bread, sourdough bread, sourdough bread recipe",
  "name": "No Knead Sourdough Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "2004 kcal",
    "carbohydrateContent": "403 g",
    "fatContent": "9 g",
    "fiberContent": "13 g",
    "proteinContent": "66 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 loaf",
    "sodiumContent": "4101 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT65M",
  "recipeCategory": "Side",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "110 grams / 3.9 oz / 1/2 packed cup sourdough starter (100% hydration)",
    "350 g / 12.3 oz (weight oz and not fl oz) / 1 1/3 cup + 2 tablespoons / 12 fl oz water (, room temperature )",
    "500 g / 17.5 oz / 4 cups bread flour",
    "10 g / 1 3/4 teaspoon fine salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put a large bowl on a digital scale and add the sourdough starter and the water, taring the scale in between each addition. Whisk or mix them together really well until the lumps of starter are broken up and the water looks milky and frothy."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour and the salt. Mix it all together really well with a spatula, a wooden spoon or clean hands until you can no longer see any dry flour. Make sure you scrape right down into the bottom of the bowl and along the sides so every little bit is incorporated. Then cover the bowl with a lid or a damp clean dish towel (run it under the tap and wring it out) and leave on the counter for about 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Now it's time to stretch and fold the dough. Get a spray bottle of water (straight from the tap is fine) or a bowl of water big enough to fit your hands in and have it next to you on the counter. We will be doing 3 sets of stretch and folds. Don't worry this is much easier than kneading and only takes a minute or two!"
    },
    {
      "@type": "HowToStep",
      "text": "SET 1 - Place your bowl of dough in front of you on the counter. Uncover it. Spray the top of the dough with a fine mist of water, or wet your hands and rub them over it quickly, then spray or dip your dominant hand in the water so it is wet (you can use both hands if you prefer - I try to only use one when handling dough so I always have a clean one). With the dough still in the bowl (you don't need to take it out), cup your hand under and grab the dough from the side directly opposite you. Pull the dough up, stretching it gently and slightly out and upwards, then fold it over onto itself towards your body. Then turn the bowl a quarter of a turn, grab the dough on the side farthest from you, stretch it out gently and fold it over on itself. Work your way all around the dough until you have done this 10 times. You will notice that it gets a little tighter and more ball like as you go. Turn the ball of dough upside down so it's smooth side up, spritz lightly with water (or rub with a wet hand), cover and leave again for 1 hour. Watch this really short Youtube video showing the stretch and fold technique in action. A NOTE RE THE STRETCH AND FOLDS - While doing the stretch and folds you do not have to be exact about the resting time between. An hour between each is just a guide. If you have to go out it's ok to leave one for 2 hours or even 3 or for as little as 30 minutes. The important thing is that you get them all in at some point but give the dough some time to relax between each one."
    },
    {
      "@type": "HowToStep",
      "text": "SET 2 - Now that your dough has relaxed it's time to do another round of stretch and folds like you did before but this time you only need to do 6. You should feel a difference in the dough this time. It will be noticeably more elastic. When finished turn the ball of dough upside down so it's smooth side up, spritz lightly with water (or rub with a wet hand), cover and leave again for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "SET 3 - Now one more round of stretch and folds. Do 6 more. You will notice that the dough feels different. Smoother and tauter. A little tougher to stretch and fold."
    },
    {
      "@type": "HowToStep",
      "text": "When finished turn the ball of dough upside down so it's smooth side up, spritz lightly with water (or rub with a wet hand), cover and leave on the counter to bulk ferment. The time the bulk fermentation takes is very dependent on environment and is something that you will need to be flexible about and use your intuition with. It will be slightly different for everyone. As a guide though, in my kitchen which is at about 21 °C (70 °F) the bulk fermentation (after stretching and folding has been completed) takes about 3 hours. If your kitchen is the same temperature then you should be able to follow along at a similar pace. If it’s hotter then things will happen more quickly and if it’s cooler then it will take longer.The dough is ready when it has increased in volume by about 30% and looks and feels like it has life in it. Instead of being just a mass like when you left it, it should be a bit jiggly and aerated, with some few big bubbles forming around the edges and maybe under the surface on the top. The edges where the dough meets the sides of the bowl should be slightly domed. If you look at the underneath and sides through the bottom of the bowl you should see it scattered with bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Once the bulk fermentation is finished it’s time to gently pre-shape the dough. At no point should you punch your dough down like you might with regular yeasted bread! We need to preserve as much of the gas build-up as we can by treating it gently. Dust the counter with a light dusting of flour, and dust the the top of the dough in your bowl with a light dust too, then remove the dough from the bowl really gently so it falls dusty flour side down. Don’t knock all of the air out of it or tear it. A bowl scraper is really handy for doing this or just use a damp hand to get it under it and release it gently. Once the dough is out and on the floured surface, gently grab a piece of the dough furthest from you and pull it up and into the middle. Keep doing this all around until you have a rough ball shape, using a bench scraper to unstick it underneath as and when you need to. You might need to work around the dough more than once to get it into the rough ball. Once it's in a rough ball shape gently flip it over so it's seam side down, smooth side up. A bench scraper is invaluable when doing this and makes it really easy. Place your now empty mixing bowl upside down and over the dough ball and leave it to rest for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While you are waiting prepare your proofing basket and cut your parchment paper. If you don’t have a proofing basket don’t worry, I give an easy alternative. Spray the proofing basket (banneton) with a fine spray of water, then dust it very, very liberally with a coarse flour like rice flour, cornmeal, polenta or other gluten free flour, or a 50/50 mix of any of those and wholewheat or rye flour. (See my post above for how to make your own rice flour if you have some rice in your pantry - It takes 2 minutes!). Don't use regular all purpose flour or bread flour because it absorbs the moisture from the dough and will stick terribly in the proofing basket. If you don’t have a proofing basket you can easily make do with regular kitchen items. Get yourself a clean, lint free dish towel. Nothing fluffy. Cotton or linen is good. Lay it out on the counter and dust it really, really, ridiculously liberally with rice flour, cornmeal, polenta or gluten-free flour, or a 50/50 mix of any of those and wholewheat or rye flour. You can never have too much and it’s easy to brush the excess off your loaf later so don’t worry about what it will look like when you turn the bread out. Once the towel is covered in flour, lift it carefully and nestle it flour side up into a round mixing bowl or colander. 2 to 2.5 quart/litre size or a little smaller is good. Don’t use one much bigger. This will be your makeshift proofing basket."
    },
    {
      "@type": "HowToStep",
      "text": "Then cut a piece of parchment paper that will fit over your proofing basket/bowl with some excess to act as handles. This is what you will use to move your dough into the Dutch oven (or other baking vessel). I put a dinner plate (thats bigger than my proofing basket) on the paper and draw around it with a pen or pencil, then cut it out with two “handles” extending out on each side (there's a photo in my post above). I like to do this because sometimes if you use a big square of it your loaf can end up with wavy marks around the edges from the creases in the paper. It’s only aesthetic though so if that doesn’t bother you then don’t take the extra time to cut handles. Once you’ve cut the paper set it aside. You won’t need it until you are ready to bake."
    },
    {
      "@type": "HowToStep",
      "text": "Once the 30 minute rest time is up it's time to do the final shape. Dust your work surface with a light dusting of flour and keep a portion of your counter flour free. It's important not to use too much flour. There should be some stickiness to the dough because we will be using that to our advantage when we shape it, and you need the dough to be able to stick to itself when shaping. Turn the dough ball upside down. A bench scraper is ideal for getting under it to move it around like this. Gently pull the edges up and pinch them down in the middle all around, think of it like a clock and work your way all around it. This creates tension on the underneath and outside of the dough and also makes a ball shape. Once you've gone all the way around flip it over again so the bottom /smooth side is up and so that the dough is on the part of the counter with no, or barely any flour.Dust your hands with some flour to keep them from sticking but avoid using too much. If your hands do start to stick, slide them along the counter to gather a light dusting of flour before continuing.Cup your hands around the side of the dough ball farthest from you so that your little fingers are touching the counter (there's a picture of my hands doing this in the post above) and pull the dough gently towards you across the surface. As you pull, the resistance of the dough sticking slightly to the counter, and the cupping of your hands around it will encourage the dough to ball up cleanly and create surface tension. As you pull you will see the surface becoming tauter. Rotate the dough and do this in a few different directions until you have a smooth taut ball. Good surface tension is really important to stop your ball of dough spreading out like a pancake when you bake it. Here is a short YouTube video that shows this tension pull technique."
    },
    {
      "@type": "HowToStep",
      "text": "Once in a taut ball shape, put it very gently, seam side UP into the well floured proofing basket. A bench scraper slid underneath, makes it really easy to lift the dough and invert it quickly and easily. Once it's nestled in there, if you aren’t sure about how well you shaped it, you can pull the edges at the seam upwards and inwards gently to create even more tension, pinching the seam together with your fingers."
    },
    {
      "@type": "HowToStep",
      "text": "Allow the dough to proof. The aim of this is for your dough to increase in volume by about 30% to 50% and be visibly puffy and aerated, not a solid mass of dough. You will probably also see some large bubbles beginning to form around the edges and just under the surface. Don’t allow it to double in size like you might with regular yeasted bread. You have two choices for how to go about proofing:Leave it on the counter – You can cover the dough with a damp clean dish towel and leave it to proof on the counter. The time it takes is very much environment and temperature dependent but it will likely be somewhere between 2 to 4 hours. At a room temperature of about 21°C (70 °F) my dough takes about 2 1/2 to 3 hours.Retard in the fridge – Or you can put it in a sealed plastic bag (an old bread bag is good for this) and put it in the fridge overnight and continue the process the next day, either in the morning, afternoon or evening. This is again temperature dependent and the time you can get away with leaving it will depend on how cold your fridge is and how warm the dough was when it went in there, so the first time you do this I advise timing it so it goes in there just before you go to bed, and getting up early to check on it. Once you've done it once you'll have a better idea. With mine I can get away with leaving it for up to 48 hours but my fridge is pretty cold."
    },
    {
      "@type": "HowToStep",
      "text": "If you leave it on the counter, use the “poke test” to determine when it’s ready to bake. This doesn’t work well with all doughs but does with this one. Dip a finger in a bit of oil or water and stick it into the dough about half an inch. I like to do this at the side near where it touches the basket because the dough tends to be a little drier and less sticky there. When you remove your finger you are looking for the hole to fill slowly up to about half way. If it completely fills up the dough is not ready yet. Give it longer. If your finger mark stays there and doesn’t fill in at all the dough is over-proofed. If you refrigerate it, the “poke test” isn’t so reliable while the dough is cold. Depending on the temperature of your fridge, it might be ready to bake in the morning or it might need some time out at room temperature. If it is well risen and looks aerated and not solid, perhaps with some bubbles forming on the surface then it’s ready. If it hasn’t increased in volume and looks like a solid mass then leave it on the counter to warm up and become aerated and puffy looking. Once it’s at room temperature you can use the “poke test” as described above."
    },
    {
      "@type": "HowToStep",
      "text": "About an hour before you think your dough will be proofed, preheat your oven to 500°F (260 °C). It it doesn’t go that hot 450 or 475 °F will do, the hotter the better though. Have your Dutch Oven inside the oven it as it preheats. (IMPORTANT – be sure to check the manufacturers instructions about the maximum heat it’s safe to use it (and its lid at ) Some enameled Dutch ovens can only safely go to 450°F. Let it all preheat for 45 minutes to an hour so everything is scorching hot. (If you don’t have a Dutch Oven see my suggestions for alternatives in the recipe notes).Once the oven has preheated and your dough passes the poke test, place the piece of parchment paper you prepared earlier centered on the top of the banneton and lay a dinner plate or a cutting board on top. Lift it all up and quickly and smoothly flip it over so that the proofing basket ends up on top. Put it back down on the counter and carefully lift off the basket. If you used a bowl and dish towel, do the same and remove the bowl, then very carefully peel back the towel."
    },
    {
      "@type": "HowToStep",
      "text": "Score the bread with a lame, razor blade or very sharp knife (a serrated knife works best).If you have nothing suitable you can cut it by snipping with a sharp pair of kitchen scissors. I like to dip my lame into some water before I do this as I find it gives a cleaner cut. You can do just one straight cut across the middle, or a cross shape, or you can get fancy with any number of designs. When scoring you need to be quick and deliberate and cut about 1/2 an inch deep. If the blade drags don't worry as the untidy edge tends to smooth out while it bakes."
    },
    {
      "@type": "HowToStep",
      "text": "As soon as it is scored, take the lid off your scorching hot Dutch oven, lift your loaf using the paper as handles, and drop it very gently and carefully in. I always lay an oven mitt across the top of the lid after I've taken it off, as a reminder that it's hot. It's all too easy to reach out and grab it without thinking and give yourself a nasty burn. As soon as the bread is in put the lid back on and bake with the lid on for 25 minutes. After that time remove the lid, turn the oven down to 450 ° F (232 °C) and bake for another 15 to 20 minutes or until deeply golden and crusty to your liking."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the loaf carefully from the Dutch oven. Use the paper as handles to lift it out, but be careful because it can get a bit brittle and tear. Place on a wire rack to cool. It's best for the crumb (and to make cutting easier) to leave it until completely cool before cutting, but if you really can't wait that long leave it at least 30 minutes."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://avirtualvegan.com/no-knead-sourdough-bread"
  ],
  "totalTime": "PT675M",
  "updatedAt": "2022-12-01T07:25:42.174Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/NQf6rR9a.mp4",
    "description": "Simple, artisan-style No Knead Sourdough Bread made with just 3 ingredients. Flour, salt and water. Full of flavour with a crispy, crusty, crackly crust and soft, chewy crumb. Great for sourdough beginners! Includes free printable sourdough baking schedules so you can see exactly how to make it work around your day!",
    "name": "Sourdough Starter.mp4",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/NQf6rR9a-720.jpg",
    "uploadDate": "2022-11-11T00:54:41.000Z"
  }
}
