{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "29",
    "ratingValue": "4.9"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-25T13:16:17.000Z",
  "datePublished": "2020-05-28T10:20:00+00:00",
  "description": "Fresh, hearty focaccia bread is incredibly simple to make with this no-knead method. It's perfect for sandwiches or dunking into soups and stews. ",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2011/04/No-Knead-Focaccia-stack.jpg",
    "width": 800
  },
  "keywords": "Focaccia, Homemade Bread, No Knead Bread",
  "name": "No-knead Focaccia Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "177.83 kcal",
    "carbohydrateContent": "33.13 g",
    "fatContent": "2.69 g",
    "fiberContent": "1.22 g",
    "proteinContent": "4.45 g",
    "servingSize": "1 sqaure",
    "sodiumContent": "356.03 mg"
  },
  "prepTime": "PT960M",
  "recipeCategory": "Side Dish",
  "recipeCuisine": "Italian",
  "recipeIngredient": [
    "4 cups all-purpose flour ($0.61)",
    "1/4 tsp instant yeast ($0.02)",
    "1 1/2 tsp salt ($0.03)",
    "2 cups water ($0.00)",
    "2 Tbsp olive oil, divided ($0.32)",
    "2 Tbsp cornmeal ($0.03)",
    "1 Tbsp Italian seasoning ($0.30)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "The night before, combine the flour, salt and yeast in a bowl. Stir until everything is evenly combined. Add the water and stir until it forms one cohesive, sticky, shaggy ball of dough with no dry flour left on the bottom of the bowl. If there is still dry flour in bowl, add a little water (1-2 Tbsp) until the dough comes together (scroll down to the step by step photos for examples). Loosely cover the bowl and let sit at room temperature for 12-18 hours."
    },
    {
      "@type": "HowToStep",
      "text": "The next day the dough will be wet, bubbly, and very fluffy. Dust the top of the dough with some flour, then scrape the dough from the sides of the bowl. Turn the dough over on itself a few times until it forms a ball in the center of the bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Line a baking sheet with foil then drizzle with 1 Tbsp olive oil. Spread the oil to coat the surface of the foil, then sprinkle cornmeal on top of the oil."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the dough to the baking sheet. Stretch and pat the dough out into a large rectangle. You may need to dust your hands with flour throughout this process to keep the dough from sticking."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle olive oil over the surface of the dough and use a soft brush to spread it evenly over the surface. Sprinkle the Italian seasoning (or any type of herbs) over top. Let the dough rise for another hour."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 425oF. Using your fingers, press dimples into the risen dough. Bake the focaccia for 20-25 minutes in the preheated oven or until the surface is golden brown. After removing from the oven, allow the focaccia to cool before slicing and serving."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://budgetbytes.com/no-knead-focaccia"
  ],
  "totalTime": "PT980M",
  "updatedAt": "2022-11-25T10:31:25.733Z"
}
