{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "24",
    "ratingValue": "4.71"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT26M",
  "createdAt": "2022-12-03T00:08:02.021Z",
  "datePublished": "2017-12-22T15:40:58+00:00",
  "description": "No Knead Cinnamon Pull Apart Bread. All the sticky deliciousness of cinnamon rolls but with none (and I really mean none) of the effort! It needs about 10 minutes of hands on time and will totally fit around your schedule. It can be ready in a couple of hours or you can leave it to rest in the fridge&nbsp;overnight &amp; bake it up in the morning. It makes THE perfect brunch!&nbsp;",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2017/12/no-knead-cinnamon-pull-apart-bread-5.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2017/12/no-knead-cinnamon-pull-apart-bread-5-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2017/12/no-knead-cinnamon-pull-apart-bread-5-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2017/12/no-knead-cinnamon-pull-apart-bread-5-480x270.jpg"
  ],
  "keywords": "no knead bread, no knead pull apart bread, pull apart bread",
  "name": "No Knead Cinnamon Pull Apart Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "255 kcal",
    "carbohydrateContent": "46 g",
    "fatContent": "5.4 g",
    "fiberContent": "2.4 g",
    "proteinContent": "5.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "400 mg",
    "sugarContent": "12.5 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "500g / 3 3/4 cups + 4 1/2 teaspoons all purpose flour or bread flour",
    "1 tablepsoon instant yeast or quick rise yeast (, NOT regular active yeast)",
    "2 teaspoons salt",
    "240mls / 1 cup unsweetened milk of choice",
    "120mls / 1/2 cup cold water (, straight from the tap is fine)",
    "60 mls / 1/4 cup maple syrup (, real natural maple syrup and not a processed flavoured syrup as it will affect how the recipe works)",
    "70g / 1/2 packed cup dairy-free butter (, melted (measured before melting). See recipe notes for an oil-free option)",
    "100g / 1/2 cup sugar (, cane sugar or turbinado sugar is best)",
    "2 tablespoons ground cinnamon",
    "150g / 1 1/2 cup powdered sugar",
    "1/2 teaspoon vanilla extract",
    "5 - 6 teaspoons milk of choice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large bowl or in a stand mixer add the flour, yeast and salt. Mix them together so they are distributed evenly, then add the milk, water and maple syrup. Mix until all the flour is combined and you have a sticky dough, making sure you get right into the bottom of the bowl. Then cover with cling wrap.If you wish to leave the dough overnight or all day before baking, put it in the fridge and leave it there for anything between 8 - 10 hours.If you want to make the speedier version, you can put the bowl on the stove top or next to it and set the oven on low so that the residual heat kicks the yeast into action (make sure it isn't in direct contact with the heat though. There should just be gentle warmth. Anything more could kill the yeast). If you do this it will need to be left for 2 hours (although up to 3 will be fine). If you just leave it on the kitchen counter with no warmth from the oven you should leave it for anything between 3 1/2 -4 1/2 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Once the resting time has passed, line an 8 x 8 pan (or similar, it doesn't have to be exact) with parchment paper and preheat the oven to 350°F."
    },
    {
      "@type": "HowToStep",
      "text": "Melt the butter gently until liquid. Be sure it is at room temperature before you dip the dough in it or you could kill the yeast and affect how the bread turns out."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the cinnamon and sugar together in a small bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Peel back the cling wrap and dust the dough with a sprinkle of flour and dust your hands too. Pull the dough away from around the edges of the bowl, then pull off chunks of dough about the size of golf balls. Roll them in your hands to neaten them up a bit although you don't have to worry about being too tidy."
    },
    {
      "@type": "HowToStep",
      "text": "Dip each one into the butter, then roll in the cinnamon sugar before placing in the pan. Repeat until all the dough is gone. Make sure all the balls touch each other in the pan. They should be nestled in there snugly."
    },
    {
      "@type": "HowToStep",
      "text": "If you have any leftover butter, pour it over the dough in the pan, and spoon any leftover sugar mixture over too. It will be a little sludgy because of the butter getting mixed into it but that's fine."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the pan loosely with cling wrap, place it on the stove top or next to it, so that the warmth from the oven preheating can reach it and leave for 30 mins. If your dough was refrigerated, leave for 50 mins. Make sure it isn't in direct contact with the heat from the oven. There should just be gentle warmth. Anything more could kill the yeast."
    },
    {
      "@type": "HowToStep",
      "text": "Once it's rested place in the oven and bake for 26 minutes. It should be puffy and if you used butter, it should be bubbling around the edges."
    },
    {
      "@type": "HowToStep",
      "text": "Using the edges of the parchment paper, lift the bread out of the tin and onto a cooling rack. Be careful because any drips will be very hot. Leave for 10 minutes before frosting or serving."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://avirtualvegan.com/no-knead-cinnamon-pull-apart-bread"
  ],
  "totalTime": "PT46M",
  "updatedAt": "2022-12-03T00:08:02.020Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/W5rNr5D7.mp4",
    "description": "No Knead Cinnamon Pull Apart Bread. All the sticky deliciousness of cinnamon rolls but with none (and I really mean none) of the effort! It needs about 10 minutes of hands on time and will totally fit around your schedule. It can be ready in a couple of hours or you can leave it to rest in the fridge overnight &amp; bake it up in the morning. It makes THE perfect brunch!",
    "name": "No Knead Cinnamon Pull Apart Bread",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/W5rNr5D7-720.jpg",
    "uploadDate": "2017-12-22T00:00:00.000Z"
  }
}
