{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-03T00:13:53.142Z",
  "datePublished": "2014-06-17T01:00:30+00:00",
  "description": "No-noodle Pad Thai stir fry is a nice and light meal, and there is something about eating spicy food when it's hot out. It's fast enough for a weeknight meal but tasty enough for a weekend dinner party.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2014/06/img_3719-e1431270897994.jpg"
  ],
  "name": "no-noodle pad Thai stir-fry",
  "prepTime": "PT20M",
  "recipeCategory": "Asian",
  "recipeIngredient": [
    "1 medium zucchini",
    "3 large carrots",
    "250 g firm tofu (cubed)",
    "2 - 4 scallions (thinly sliced (about 1 cup sliced)",
    "2 - 3 cups bean sprouts (well rinsed)",
    "1 cup sugar snap peas (trimmed and halved)",
    "4 cloves garlic (crushed)",
    "1 Thai red chile",
    "4 Tbsp canola oil for frying",
    ".",
    "1/4 cup soy sauce or liquid aminos (I use Braggs)",
    "1/4 cup water",
    "1/4 cup tomato paste",
    "2 Tbsp rice vinegar",
    "2 Tbsp honey or other liquid sweetener",
    "1/2 tsp crushed red pepper flakes",
    "1 lime",
    "1/4 cup chopped almonds or peanuts",
    "1/4 cup chopped fresh cilantro"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by prepping all of the ingredients:"
    },
    {
      "@type": "HowToStep",
      "text": "Slice the zucchini in half lengthwise, then using a vegetable peeler, peel long ribbons down the length of the zucchini and onto a waiting plate. Stop peeling when you get to the seedy core in the middle as it will become too difficult to peel (toss it in the freezer for soups, save to add to a smoothie, or just eat it as a cook's snack!)."
    },
    {
      "@type": "HowToStep",
      "text": "Peel the carrots and then continue peeling long ribbons of carrot onto a waiting plate. Stop peeling when you get to the core or when it becomes too difficult to continue (save the core! toss it in the freezer for soups, save to add to a smoothie, or just eat it as a cook's snack!)"
    },
    {
      "@type": "HowToStep",
      "text": "Dice the tofu into 1.5cm / 0.5 inch cubes."
    },
    {
      "@type": "HowToStep",
      "text": "Thinly slice the scallions and place into a bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Rinse the bean sprouts thoroughly, drain, and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Rinse the sugar snap peas, trim the ends, cut in half, and place into a waiting bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Crush the garlic (I use a garlic crusher), and finely mince the chile. Place these in a small dish and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Now you can get the sauce ready:"
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, whisk together soy, water, tomato paste, rice vinegar, honey, and red pepper flakes. Taste and adjust seasoning if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Now you're ready to cook!"
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large frying pan over medium-high heat. Add 2 Tbsp canola oil, and then the tofu cubes. Fry until they are golden brown, stirring occasionally. While they are frying, line a plate with paper towels. When the tofu is nice and golden, slide it out of the pan and onto the waiting plate."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining 2 Tbsp of oil to the same pan. Add the garlic and chile and fry for about 1 minute, until the garlic starts to just slightly brown. Quickly add the scallions, bean sprouts, and snow peas. Fry for 2 minutes, stirring frequently. Add the zucchini and carrot ribbons and stir / toss the mixture to combine well. At this point your pan may be very full, so stir carefully!"
    },
    {
      "@type": "HowToStep",
      "text": "Fry for about 2-3 minutes until the ribbons are just beginning to soften and wilt a bit. Now add the tofu and about half of the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Stirring constantly, let the mixture cook about 2 minutes. more. At this point your vegetables should be just ever so slightly on the soft side, still with some crunch, and definitely not mushy. If your mixture is not very wet you may want to add a bit more sauce. It should be wet, but not swimming in sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon into individual bowls, garnish with cilantro, chopped almonds, and a wedge of lime."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately with with extra sauce on the side."
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://heynutritionlady.com/no-noodle-pad-thai-stir-fry"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-03T00:13:53.140Z"
}
