{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "148",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-03T00:22:19.687Z",
  "datePublished": "2017-08-02T05:00:28+00:00",
  "description": "Amazing noodle-free Pad Thai with rainbow vegetables and a spicy-sweet almond butter sauce. Just 30 minutes required and SO versatile!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/07/NOODLE-FREE-PAD-THAI-SQUARE.jpg"
  ],
  "keywords": "pad thai",
  "name": "Noodle-Free Pad Thai (30 Minutes!)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "268 kcal",
    "carbohydrateContent": "26.8 g",
    "fatContent": "15.1 g",
    "fiberContent": "5.7 g",
    "proteinContent": "9 g",
    "saturatedFatContent": "2.1 g",
    "servingSize": "1 side servings",
    "sodiumContent": "526 mg",
    "sugarContent": "16.3 g",
    "unsaturatedFatContent": "10.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup extra-firm tofu (excess liquid pressed out, crumbled with a fork)",
    "1 Tbsp coconut aminos (or tamari or soy sauce if not GF)",
    "1 tsp chili garlic sauce (or 1/8 tsp red pepper flake as original recipe is written)",
    "1/4 tsp ground turmeric (optional)",
    "2 1/2 Tbsp nut butter (almond butter, peanut butter, sunflower seed butter, etc.)",
    "3 Tbsp lime juice",
    "3 1/2 Tbsp coconut aminos (or sub tamari or soy sauce if not GF // plus more to taste)",
    "1/2 tsp red pepper flake (or sub 1 tsp chili garlic sauce- Huy Fong Foods brand)",
    "1 1/2 Tbsp maple syrup (12 g coconut sugar // plus more to taste)",
    "1 Tbsp sesame oil (sub water or omit if low/no-fat)",
    "1 medium serrano pepper (seeds + stem removed, thinly sliced // omit for less heat)",
    "1 small bundle green onions (ends removed + thinly sliced)",
    "1 1/2 cups thinly sliced red cabbage",
    "1 medium red bell pepper (cored and thinly sliced lengthwise)",
    "2 Tbsp coconut aminos (or tamari or soy sauce if not gluten free // divided)",
    "4-5 large carrots (peeled and ribboned with a vegetable peeler // ~4 cups packed)",
    "6 leaves collard greens (large stems removed, stacked + thinly sliced // ~2 cups packed)",
    "1/2 tsp freshly grated ginger (optional // or 1/4 tsp ground ginger as original recipe is written)",
    "1/2 tsp freshly grated turmeric (optional // or 1/4 tsp ground turmeric)",
    "Fresh cilantro",
    "Crushed peanuts / peanut sauce",
    "Red pepper flake"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If serving with tofu: Add tofu to a small mixing bowl and season with coconut aminos, chili garlic sauce (or pepper flake), and turmeric (optional). Stir and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add all sauce ingredients to a small mixing bowl and whisk to combine. Taste and adjust flavor as needed, adding more lime juice for acidity, coconut aminos for saltiness, red pepper flake or chili sauce for heat, or maple syrup for sweetness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium heat. Once hot, add oil (or water), pepper, onions, cabbage, bell pepper, and half of the coconut aminos for veggies (1 Tbsp as original recipe is written). Cook for 3 minutes, stirring/tossing frequently."
    },
    {
      "@type": "HowToStep",
      "text": "Add tofu to a corner of the pan and sauté until slightly browned, stirring frequently - about 3-5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add carrots and collard greens and remaining half of the coconut aminos for the veggies (1 Tbsp as original recipe is written) and stir. Sauté for 2 minutes. Then add Pad Thai sauce and freshly grated ginger and turmeric (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Sauté over medium heat until warmed through and collards are slightly wilted - about 3 minutes - stirring frequently."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor of dish as needed, adding more maple syrup for sweetness, red pepper flake or chili garlic for heat, coconut aminos for saltiness, or lime juice for acidity."
    },
    {
      "@type": "HowToStep",
      "text": "Divide between serving plates and enjoy. Serve as is or with peanut sauce, crushed peanuts, cilantro, and lime wedges. Serves 2 as an entrée or 4 as a side."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/noodle-free-pad-thai-30-minutes"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T00:22:19.685Z"
}
