{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "19",
    "ratingValue": "4.64"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T06:48:40.236Z",
  "datePublished": "2017-10-22T03:00:45+00:00",
  "description": "A guide for easy, delicious, oil-free roasted vegetables with tips on starchy and non-starchy vegetables as well as seasoning and garnish recommendations!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/09/Oil-Free-Vegetables-SQUARE.jpg"
  ],
  "keywords": "oil-free roasted vegetables",
  "name": "Oil-Free Roasted Vegetables",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "153 kcal",
    "carbohydrateContent": "34.6 g",
    "fatContent": "0.5 g",
    "fiberContent": "8.4 g",
    "proteinContent": "6.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "383 mg",
    "sugarContent": "12.5 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 medium whole carrots (halved lengthwise and chopped into large bites)",
    "4-5 small red or yellow potatoes (quartered)",
    "1 large sweet potato (sliced into 1/4-inch rounds)",
    "2 cups Brussels sprouts (halved)",
    "1 bundle broccolini (roughly chopped)",
    "1 cup red or green cabbage (thinly sliced)",
    "1 medium bell pepper (thinly sliced lengthwise)",
    "1 small beet (sliced into 1/4-inch rounds- large rounds halved)",
    "2 cups chopped cauliflower",
    "1/2 medium zucchini or yellow squash (sliced into 1/4-inch rounds)",
    "~1/2 tsp sea salt (to taste)",
    "1 Tbsp curry powder (or other seasoning of choice)",
    "Fresh lemon juice",
    "Cilantro or parsley",
    "Tahini"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and line two baking sheets with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Place a large pot or rimmed skillet on the stovetop and fill with 1/2 inch water. Bring to a boil over high heat."
    },
    {
      "@type": "HowToStep",
      "text": "Once boiling, lower heat to medium-high (you’re going for a low boil) and carefully place a steamer basket inside (I like this one - or sub a small colander or fine mesh strainer that rests over the water but not in the water)."
    },
    {
      "@type": "HowToStep",
      "text": "Add the starchy vegetables (carrots, potatoes, sweet potatoes - Brussels sprouts are optional and should only be added if you like more tender Brussels - otherwise, set aside)."
    },
    {
      "@type": "HowToStep",
      "text": "Cover pot or skillet and steam the vegetables for 4-6 minutes or until just tender. A knife should easily pierce the vegetables but not easily slide all the way through. You’re looking for them to be moist and slightly tender."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the steamed starchy vegetables to one baking sheet, and arrange the non-starchy vegetables on the other baking sheet. Season to taste with salt and curry powder, and toss to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for a total of 20-30 minutes or to desired doneness. The broccolini seems to require just 15 minutes, while the cabbage, bell pepper, and cauliflower benefit from a longer roast - up to 25-30 minutes. (Once steamed), the starchy vegetables shouldn’t need more than 20 minutes in the oven. Steamed Brussels need to be roasted for 15 minutes, while unsteamed Brussels can roast for up to 20-25 minutes. Just watch the oven closely and check for doneness."
    },
    {
      "@type": "HowToStep",
      "text": "At this point, they’re ready to serve! However, I find that the vegetables are enhanced with a bit of fresh lemon juice, some herbs, and a drizzle of tahini."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftover vegetables covered in the refrigerator up to 3-4 days. Reheat over a cast-iron skillet or on a parchment-lined baking sheet in a 400-degree F (204 C) oven until hot - about 10 minutes."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/oil-free-roasted-vegetables"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T06:48:40.235Z"
}
