{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.95"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-04T13:26:10.324Z",
  "datePublished": "2016-01-09T13:04:49+00:00",
  "description": "Oil free Dal Tadka - Restaurant style Lentil soup. Masoor Dal Tadka is one of the better known dals as it is generally available in Indian restaurants. Tadka, tarka, or chaunk are all words for the tempering, which is spices and herbs fried in oil and then mixed into the cooked lentils. This version is made oil-free.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2016/01/vegan-oil-free-dal-tadka-0762-300x449-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2016/01/vegan-oil-free-dal-tadka-0762-300x449-1-300x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2016/01/vegan-oil-free-dal-tadka-0762-300x449-1-300x270.jpg"
  ],
  "name": "Oil free Dal Tadka - Restaurant style Lentil soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "188 kcal",
    "carbohydrateContent": "33 g",
    "fiberContent": "14 g",
    "proteinContent": "12 g",
    "servingSize": "1 serving",
    "sodiumContent": "446 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Soup",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "1 cup red lentils (masoor dal, quick cooking lentils, or use other split peas or lentils of choice)",
    "2.5 cups water",
    "3/4 to 1 tsp salt",
    "1/2 cup finely chopped red or white onion",
    "5 cloves of garlic (finely chopped)",
    "1 inch ginger (chopped)",
    "broth or water as needed",
    "1/2 tsp turmeric",
    "1 tsp ground coriander",
    "1/2 to 1 tsp garam masala",
    "1/2 tsp dried fenugreek leaves kasoori methi",
    "1 tsp cumin seeds",
    "1/2 tsp mustard seeds",
    "a generous pinch of asafoetida hing (Omit to make gluten-free or use certified gluten-free asafetida)",
    "2 dried red chilies (broken into half (cayenne or california red)",
    "8 curry leaves",
    "1 bay leaf"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash and drain the red lentils. Add to a deep pan with water and salt. Bring to a boil on medium heat, then cook on medium-low heat for 12-15 minutes or until lentils are tender. Keep them on a low simmer. See Note for Instant Pot instructions."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a skillet over medium heat. Add onion, garlic, ginger and a pinch of salt. Mix and cook for 6 to 8 minutes or until golden brown. Add a splash of water or broth if the onions begin to stick or brown too quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Add turmeric, coriander, garam masala and fenugreek leaves. Mix and cook for half a minute. Add a splash of water if sticking. Pour this into the cooked simmering lentils."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a clean skillet over medium heat, when the skillet is hot, mustard seeds and cook for a few seconds. Add cumin seeds and mix. Cook until the cumin seeds slightly change color and get fragrant. The mustard seeds will change color but might not pop. Add red chilies, bay leaf and cook until the bay leaf starts to change color. Add asafetida and curry leaves and mix in (If you were using oil, asafetida + curry leaves would be added with the chilies). Add this tempering to the cooked lentils. Mix well and take off heat. Taste and adjust salt and spice. Add more water for thinner consistency. Serve hot garnished with cilantro, with Naan, flat breads or rice."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/2016/01/how-to-cook-indian-food-without-oil-oil-free-dal-tadka-recipe.html"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-04T13:26:10.323Z"
}
