{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "96",
    "ratingValue": "4.81"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-11-25T11:19:36.861Z",
  "datePublished": "2022-08-15T08:23:18+00:00",
  "description": "Lemon Pepper Chicken with Orzo is a zesty one-pot meal featuring juicy chicken thighs, orzo, feta, and lemon pepper for tons of flavor!",
  "image": {
    "@type": "ImageObject",
    "height": 900,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2022/07/One-Pot-Lemon-Pepper-Chicken-and-Orzo-H.jpg",
    "width": 1200
  },
  "keywords": "Chicken and orzo, lemon pepper chicken, One Pot Meal",
  "name": "One Pot Lemon Pepper Chicken with Orzo",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "612 kcal",
    "carbohydrateContent": "46 g",
    "fatContent": "32 g",
    "fiberContent": "3 g",
    "proteinContent": "34 g",
    "servingSize": "1 Serving",
    "sodiumContent": "715 mg"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "4 chicken thighs* ($3.74)",
    "2 Tbsp lemon pepper seasoning ($0.60)",
    "1 Tbsp cooking oil ($0.04)",
    "2 cloves garlic ($0.16)",
    "2 cups chicken broth ($0.26)",
    "1/4 cup chopped parsley ($0.20)",
    "1.5 cups orzo ($1.29)",
    "2 oz. feta, crumbled ($1.25)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Blot the chicken thighs dry with a paper towel, then season both sides liberally with lemon pepper seasoning (about 2 Tbsp lemon pepper total)."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large deep skillet over medium. Once hot, add the cooking oil. Add the seasoned chicken thighs, skin side down, and let them cook undisturbed until browned (about 6-8 minutes for bone-in skin-on thighs). Flip the chicken thighs and cook until browned on the second side. The chicken will be cooked most of the way through at this point but will finish cooking when simmered with the orzo. Remove the chicken to a clean plate."
    },
    {
      "@type": "HowToStep",
      "text": "While the chicken is browning, roughly chop about 1/4 bunch of parsley and mince two cloves of garlic. After removing the chicken from the skillet, turn the heat down to low, add the minced garlic, and sauté the garlic in the residual fat for about a minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add 2 cups of chicken broth to the skillet and stir to dissolve the crispy browned bits from the bottom of the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Add the orzo and half of the chopped parsley. Stir to combine. Finally, return the chicken to the skillet, skin side up."
    },
    {
      "@type": "HowToStep",
      "text": "Place a lid on the skillet, turn the heat up to high, and let the broth come to a full boil. Once it reaches a boil, turn the heat down to low. Let the skillet simmer on low for about 15 minutes, or until most of the broth has been absorbed. Make sure it’s simmering the whole time. If it stops simmering, increase the heat slightly until it just starts to simmer again."
    },
    {
      "@type": "HowToStep",
      "text": "After about 15 minutes the orzo should be tender and most of the broth absorbed but there will still be a little sauce in the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Fluff the orzo around the chicken a bit with a fork, then top with the remaining parsley and the crumbled feta. Serve and enjoy!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/lemon-pepper-chicken-with-orzo"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-25T11:19:36.859Z"
}
