{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "139",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Yup, it's Vegan"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T12:51:11.175Z",
  "datePublished": "2016-02-23T07:15:35+00:00",
  "description": "Vegan one pot creamy garlic pasta to meet all of your fettuccine alfredo needs with none of the extra dishes.",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2016/02/vegan-one-pot-creamy-garlic-pasta-fettucine-alfredo-3.jpg"
  ],
  "keywords": "one pot creamy pasta, vegan creamy garlic pasta, vegan fettuccine alfredo",
  "name": "One Pot Creamy Garlic Pasta",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "362 kcal",
    "carbohydrateContent": "62 g",
    "fatContent": "6 g",
    "fiberContent": "4 g",
    "proteinContent": "14 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 third recipe",
    "sodiumContent": "659 mg",
    "sugarContent": "6 g",
    "unsaturatedFatContent": "4 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Italian",
  "recipeCuisine": "nut-free",
  "recipeIngredient": [
    "1/2 tbsp olive oil",
    "4 cloves garlic (minced)",
    "1 shallot (finely chopped)",
    "2 cups low-sodium vegetable broth (see notes)",
    "1 and 1/2 cups plain, unsweetened non-dairy milk (see notes)",
    "1 tsp salt (plus more to taste (reduce if using a salty broth - mine is low-sodium)",
    "8 oz dry fettuccine",
    "black pepper, dried oregano and red pepper flakes (to taste)",
    "chopped fresh basil or parsley (for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat the olive oil in a large skillet over medium heat. If possible, choose a skillet that is wide enough to completely fit the fettuccine. Smaller pans will work, but require a bit more fuss to stir and submerge the pasta as it cooks."
    },
    {
      "@type": "HowToStep",
      "text": "Add the garlic and shallot to the pan along with a sprinkle of salt, and stir. Cook for about 2 minutes, stirring occasionally, or until the garlic is softened and the shallot is turning translucent; avoid browning."
    },
    {
      "@type": "HowToStep",
      "text": "Add the vegetable broth, nondairy milk, and salt, and stir. Add the dry pasta and gently prod it around to submerge it under the liquid. If not all of it fits now, you will need to gently push it into the pan after the submerged portion has softened later."
    },
    {
      "@type": "HowToStep",
      "text": "Bring to a boil, then reduce to a simmer. Stir occasionally, gently separating any pasta that starts to stick together. Cook for about 20 minutes, or until the sauce has thickened onto the pasta and the texture is to your liking. If too much of the liquid is cooking off, reduce the heat a little bit, and add more nondairy milk."
    },
    {
      "@type": "HowToStep",
      "text": "Adjust seasoning to taste, and serve with fresh herbs and other toppings if desired. Best served immediately, but leftovers will keep for 3-5 days in the fridge (cool completely to room temperature before boxing up and refrigerating)."
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://yupitsvegan.com/vegan-one-pot-creamy-garlic-pasta"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-01T12:51:11.174Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/SDr3wpK1.mp4",
    "description": "Creamy vegan garlic pasta that cooks together in the pan for easy cleanup. A shortcut vegan fettuccine alfredo.",
    "name": "One Pot Creamy Garlic Pasta",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/SDr3wpK1-720.jpg",
    "uploadDate": "2018-05-02T15:41:10.000Z"
  }
}
