{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "320",
    "ratingValue": "4.48"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT1M",
  "createdAt": "2022-12-01T07:05:12.640Z",
  "datePublished": "2017-01-17T14:58:01+00:00",
  "description": "If you have a mug, a microwave &amp; a spoon you can make this single serving One minute Cinnamon Roll in a Mug. It's so easy &amp; perfect for when those sweet cravings hit &amp; you NEED dessert, like now!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2017/01/one-minute-cinnamon-roll-in-a-mug06-1.jpg"
  ],
  "keywords": "cinnamon roll, microwave, mug cake",
  "name": "One Minute Cinnamon Roll in a Mug",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "413 kcal",
    "carbohydrateContent": "94 g",
    "fatContent": "1 g",
    "fiberContent": "2 g",
    "proteinContent": "7 g",
    "servingSize": "1 serving",
    "sodiumContent": "192 mg",
    "sugarContent": "40 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "9 level tablespoons all purpose flour (plain flour in the UK)",
    "3/4 teaspoon baking powder",
    "a pinch of salt",
    "Around 3-4 1/2 tablespoons water",
    "A tiny dab of oil for greasing the mug (coconut or mild olive oil/vegetable oil)",
    "3/4 teaspoon cinnamon",
    "1 1/2 tablespoons coconut sugar or brown sugar",
    "1/2 teaspoon water",
    "3 tablespoons natural powdered sugar",
    "A drop of plant-based milk or water (around 3/4 teaspoon)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Grease a normal sized drinking mug (just a standard medium sized one) with a tiny dab of oil. Be sure to reach into the bottom and the edges well."
    },
    {
      "@type": "HowToStep",
      "text": "First make the frosting. In a small bowl mix the powdered sugar with either plant-based milk or water. Add the liquid a tiny bit at a time. It doesn't take much at all and the most you will need is 3/4 teaspoon of water, perhaps a tiny drop more if you are using milk. Stir well until smooth then set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour, baking powder and salt to another small bowl and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Gradually add the water (from the 3-4 1/2 tablespoons, stirring until it starts to form a dough then use your hand to bring it together, kneading a few times until its a smooth, flexible ball of dough. If you do accidentally add a drop too much water and it's a bit sticky, add a little tiny bit more flour. If it's very dry and won't come together, add a drop more water. Only handle it as much as you need to."
    },
    {
      "@type": "HowToStep",
      "text": "Dust your work surface with a little flour, then roll your dough out into a long strip about 4 inches wide and a couple of millimetres thick"
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the coconut sugar and cinnamon evenly over the dough then fold the edges inwards to seal it in and stop it all falling out when you lift it into the mug.(see my video above)."
    },
    {
      "@type": "HowToStep",
      "text": "You will be left with a long narrow strip which you can roll up."
    },
    {
      "@type": "HowToStep",
      "text": "Roll it up and gently lift it and place it in the greased mug."
    },
    {
      "@type": "HowToStep",
      "text": "Pour over 1/2 teaspoon water then place in the microwave."
    },
    {
      "@type": "HowToStep",
      "text": "Microwave uncovered on full power for around 45 - 50 seconds. My microwave is 1200 watts. You may need to adjust the time a bit up or down. All microwaves are different so be careful not to overcook it. If you overcook it it will become tough so be sure to check how powerful your microwave is first and adjust accordingly. The very maximum time it will need is about 1 min 10 seconds and that is only if you have a really low powered microwave. Remember that it will continue to cook a little bit after you remove so a tiny bit under done is better than overdone as then it will go tough. If it needs longer cook in 5 second increments to avoid over cooking it."
    },
    {
      "@type": "HowToStep",
      "text": "It should have swollen up nicely when you check it and if you insert a toothpick or skewer into the dough it should come out clean. It is normal for the top and sides to be a little soft & damp & look a bit doughy when you first take it out because it has basically steamed in the mug."
    },
    {
      "@type": "HowToStep",
      "text": "Turn out onto a plate and spoon over the frosting. Eat immediately."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://avirtualvegan.com/one-minute-cinnamon-roll-in-a-mug"
  ],
  "totalTime": "PT5M",
  "updatedAt": "2022-12-01T07:05:12.638Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/8HhvnS0w.mp4",
    "description": "If you have a mug, a microwave & a spoon you can make this single-serving One Minute Cinnamon Roll in a Mug. It's so easy & perfect for when those sweet cravings hit & you NEED dessert, like now!",
    "name": "One Minute Cinnamon Roll in a Mug",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/8HhvnS0w-720.jpg",
    "uploadDate": "2017-01-17T00:00:00.000Z"
  }
}
