{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT5M",
  "createdAt": "2022-12-02T14:00:24.768Z",
  "datePublished": "2014-09-25T10:06:52+00:00",
  "description": "The sauce is the star of the show here. Pair it up with any steamed vegetables you like, and a healthy dose of edamame for amazing plant-based protein.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2014/09/steamed_veg_edamame_sunshine_sauce_4.jpg"
  ],
  "name": "orange carrot miso ginger sunshine sauce with steamed edamame and veg",
  "prepTime": "PT10M",
  "recipeIngredient": [
    "SAUCE:",
    "2 medium carrots (washed and coarsely chopped)",
    "2 Tbsp cold-pressed sesame or canola oil",
    "1/4 cup rice wine vinegar",
    "3 Tbsp white miso paste",
    "1 inch piece fresh ginger (peeled and roughly chopped)",
    "1/2 cup orange juice",
    "1/2 tsp sea salt",
    "1/2 tsp freshly ground black pepper",
    "VEG:",
    "1 small head cauliflower (broken down into bite-sized florets)",
    "1 head broccoli (broken down into bite-sized florets)",
    "1 medium zucchini (cut into bite-sized chunks)",
    "1 250 g package frozen shelled edamame"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by putting a large pot (one that accommodates a steamer basket) of water over high heat."
    },
    {
      "@type": "HowToStep",
      "text": "While you're waiting for the water to boil, wash and chop the veggies. Layer them into a steamer basket with sturdier veg (like cauliflower) on the bottom, and more delicate veg (like zucchini) on the top. Toss the frozen edamame in with the vegetables."
    },
    {
      "@type": "HowToStep",
      "text": "When the water has reached a rolling boil, place the steamer basket over top, cover with the lid, and steam for about 5 minutes, until vegetables are just tender."
    },
    {
      "@type": "HowToStep",
      "text": "While the vegetables are steaming, make the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Place the carrots, sesame oil, rice wine vinegar, miso paste, ginger, orange juice, salt, and pepper into the jar of a blender. Pulse a few times to combine, then run the blender for a minute or two until the sauce is smooth. This is thicker than a salad dressing, but if it's too thick you can add a few tablespoons of water, one at a time, to thin it out."
    },
    {
      "@type": "HowToStep",
      "text": "When the vegetables are done steaming, if you're going to eat immediately, divide the vegetables amongst four bowls. Top with sunshine sauce, and serve."
    },
    {
      "@type": "HowToStep",
      "text": "If you're packing this for lunches or meal prep, rinse the vegetables under cold water to stop the cooking. Drain well, and distribute amongst four containers. Pack the sauce along side in little jars, and dress the vegetables when you're ready to eat."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://heynutritionlady.com/sunshine-sauce-with-steamed-edamame-and-veg-carrot-orange-miso-ginger"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-12-02T14:00:24.767Z"
}
