{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "64",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-04T18:54:38.071Z",
  "datePublished": "2016-01-16T05:00:12+00:00",
  "description": "Amazing, simple vegan biscotti infused with orange zest and roasted almonds. Dip in vegan dark chocolate for a decadent touch. A delicious vegan breakfast, dessert, or snack with your favorite hot beverage!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/12/Orange-Amond-Biscotti-SQUARE.jpg"
  ],
  "keywords": "vegan biscotti",
  "name": "Orange Almond Biscotti (Vegan)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "188 kcal",
    "carbohydrateContent": "25.2 g",
    "fatContent": "8.9 g",
    "fiberContent": "1.3 g",
    "proteinContent": "2.7 g",
    "saturatedFatContent": "6.1 g",
    "servingSize": "1 biscotti",
    "sodiumContent": "34 mg",
    "sugarContent": "9.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Italian-Inspired",
  "recipeIngredient": [
    "1/2 cup coconut oil (melted)",
    "3/4 cup organic cane sugar (sub coconut sugar with varied results)",
    "1/2 cup pumpkin puree* (acts as binder)",
    "1 tsp vanilla extract",
    "1 3/4 cups unbleached all-purpose flour*",
    "1/2 cup fine cornmeal (or sub more all-purpose flour)",
    "1 1/2 tsp baking powder",
    "1/4 tsp sea salt",
    "1 tsp orange zest",
    "1/2 cup toasted almonds* (well chopped // somewhere between coarse and fine)",
    "3/4 cup vegan dark chocolate (optional // chopped)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Melt coconut oil in a large mixing bowl. Add organic cane sugar and whisk thoroughly to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Add pumpkin puree and vanilla and whisk until completely combined."
    },
    {
      "@type": "HowToStep",
      "text": "Next add flour, cornmeal, baking powder, salt, and orange zest. Stir until combined, but try not to over-mix."
    },
    {
      "@type": "HowToStep",
      "text": "Add almonds and stir once more to evenly disperse."
    },
    {
      "@type": "HowToStep",
      "text": "Use a knife or spatula to divide the dough into two even sections (amount as original recipe is written // adjust if altering batch size). Then using damp hands, form the two portions into long, semi-skinny logs (see photo). Try and make them as uniform in size and shape as possible so they bake evenly."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the loaves for 25-30 minutes, or until just slightly brown on the edges. Let cool slightly on the baking sheet, then use a serrated knife to gently slice into 3/4-inch pieces. Be very gentle when slicing, especially where the almonds are as they can crumble easily. I discarded (ate) the very end pieces because they were too small and already quite brown."
    },
    {
      "@type": "HowToStep",
      "text": "Gently turn the biscotti on their sides and return to the oven to bake for another 20 minutes, gently flipping once at the halfway point (10 minutes), to ensure even baking."
    },
    {
      "@type": "HowToStep",
      "text": "Let cool briefly before enjoying. If dipping in chocolate, add chopped chocolate to a mixing bowl and microwave in 30 second increments until melted, or melt over a double boiler on the stovetop."
    },
    {
      "@type": "HowToStep",
      "text": "Once the biscotti are slightly cooled, dip one half of the biscotti into the chocolate, use a spoon to spread it slightly, then scrape off the excess."
    },
    {
      "@type": "HowToStep",
      "text": "Place on a parchment-lined baking sheet to dry. To speed setting, pop in the freezer. Otherwise, let dry at room temperature until completely set."
    },
    {
      "@type": "HowToStep",
      "text": "Store covered at room temperature for 3-4 days (I found a large jar is ideal). Will keep well-sealed in the freezer for up to 1 month. Enjoy with hot tea, hot toddies, hot chocolate, ginger lattes, or chai latte!"
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://minimalistbaker.com/orange-almond-biscotti"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-04T18:54:38.070Z"
}
