{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer - claudie13"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-11-29T03:42:03.188Z",
  "datePublished": "2022-08-03",
  "description": "Try this sweet potato gnocchi from scratch. The delicious and easier than you think!",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/my1ejj5vsruhnszwd4kn:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Gnocchi,Sweet potato",
  "name": "Oven Baked Sweet Potato Gnocchi Recipe | Woolworths",
  "prepTime": "PT10M",
  "recipeCategory": "Entrees",
  "recipeCuisine": "Italian",
  "recipeId": "a0K0I00000SjUZZUA3",
  "recipeIngredient": [
    "3 medium sweet potatoes",
    "2.5 cups plain flour (plus extra for rolling the dough)",
    "2 tsp salt",
    "1 tbs nutritional yeast flakes (or grated parmesan)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/c015ektrrvvusdbx8dtu?wid=1521&hei=999&fmt=png-alpha",
      "text": "Heat the oven to 200C. Cover a medium sized baking tray with baking paper. Pierce the skin of the sweet potatoes with a fork, put them in the oven and bake for 40- 45 minutes or until tender. Remove from the oven and allow them to cool. When cool enough to handle, remove the skin, and mash (or use a hand blender) until the potato is smooth and has no lumps."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/fq6lnd039y2zr3uqaaic?wid=1798&hei=1599&fmt=png-alpha",
      "text": "Combine the salt, yeast flakes (or Parmesan) and 2 1/2 cups of the (Gluten Free if using) flour in a medium sized bowl. Dust a large pastry sheet or a clean work surface with flour and pile the flour mixture onto the surface. Make a well in the middle of the flour. Spoon the mash into the well and, using your hands, mix the sweet potato into the flour. Continue to work the mixture until both are fully combined. The dough should be quite dry not sticky. Gradually add more flour if necessary but don't let it get crumbly. Fill a large saucepan with water, bringing it to boiling point when the gnocchi is cut and ready to cook."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/ycjlcgrbu8nrqcp3ksia?wid=1800&hei=1492&fmt=png-alpha",
      "text": "Roll the dough into a ball and cut it into eight pieces. Roll each piece into a log shape, about 1/2 an inch thick. Use a pastry cutter or knife to the gnocchi into 1 inch pieces. Toss the cut pieces onto a floured tray or sheet of baking paper to keep it dry. Use a gnocchi board or a fork to press grooves into each piece of gnocchi. Add the gnocchi to the boiling water and cook for about 4-5 minutes. Gnocchi floats to the surface of the water when it's ready, it cooks very quickly. Reserve 1/2 cup of the cooking water then, using a slotted spoon, remove the gnocchi from the water, adding it to your chosen sauce. Add the reserved water and give it a toss to coat and combine with the gnocchi and sauce. Serve with some garlic bread and lashings of your favourite grated cheese."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "image": "https://foodhub.scene7.com/is/image/woolworthsltdprod/giyzlkzedgoftggl8j7b?wid=1659&hei=1104&fmt=png-alpha",
      "text": "SAUCES: Tomato or Basil pesto, Creamy cheese sauces using Parmesan, Provolone, Pecorino, Blue cheese or a really sharp tasty cheese, Pancetta or bacon with onion and garlic in a brown butter sauce, Roasted cherry tomato and basil, Roasted cherry tomato, spinach and oregano, and the family favourite mushroom and spinach in sage burnt butter, with or without a dash of cream added at the end - some add cream to theirs but I much prefer it without. PASTA: This recipe can be used for potato, pumpkin, potato and spinach, potato and silverbeet, potato and beetroot. I have experimented with these and they are delish, the only limitation on trying different flavours is your imagination. MAKE IT AHEAD: The pasta can be kept in a sealed contained in the fridge for a few days if you want to make it ahead of time. I add some semolina or flour, give it a shake to coat the pieces to prevent them sticking together (It also freezes well like this)"
    }
  ],
  "recipeNameId": "oven-baked-sweet-potato-gnocchi",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/oven-baked-sweet-potato-gnocchi"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-29T03:42:03.186Z",
  "url": "https://www.woolworths.com.au/shop/recipes/oven-baked-sweet-potato-gnocchi"
}
