{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-24T09:43:13.674Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Oysters With Chilli And Lime Mayonnaise recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp315oyschi_021:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Oysters",
  "name": "Oysters With Chilli And Lime Mayonnaise Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Appetisers",
  "recipeCuisine": "American",
  "recipeId": "RGR35237",
  "recipeIngredient": [
    "1 pinch rock salt, to serve",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "0.7 cup light olive oil",
    "24 fresh live oysters, in their shells",
    "1 tbs fresh dill, chopped",
    "2 spring onions, thinly sliced diagonally",
    "2 small fresh hot red chillies, deseeded, if you prefer",
    "1 clove garlic, grated or finely chopped",
    "1 egg, yolk only",
    "1 lime, juice only"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chilli and lime mayonnaise, using a mortar and pestle, pound the chillies, garlic, and a good pinch of salt to a paste. Spoon the paste into a large bowl, then add the egg yolk. Stir thoroughly with a wooden spoon or whisk until smooth. (Sit a folded tea towel under the bowl to stop it from moving around too much.)"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Gradually add the oil, drop by drop, whisking continuously, ensuring that it is absorbed completely before making the next addition. Once the mixture starts to thicken, add the oil in a slow, thin drizzle. When a third of the oil has been combined, start adding the lime juice a little at a time. Keep adding and whisking until everything is well incorporated. Season with black pepper, cover with cling film, and chill until needed."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To prepare the oysters, discard any that have opened or do not close tightly straight away when tapped on the work surface. Use an oyster knife, and hold the oysters over a bowl as you open them. Carefully shuck the oysters one by one, catching any liquid in the bowl and transferring the opened oysters in their shells and their liquid to the refrigerator as you go."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put a layer of rock salt on a platter - this is to keep the oysters level. Arrange the open oysters in their shells on top of the salt, and spoon over the chilled oyster liquid. Spoon a little chilli and lime mayonnaise over the top of each oyster, and serve immediately."
    }
  ],
  "recipeNameId": "oysters-with-chilli-and-lime-mayonnaise",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/oysters-with-chilli-and-lime-mayonnaise"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-11-24T09:43:13.672Z",
  "url": "https://www.woolworths.com.au/shop/recipes/oysters-with-chilli-and-lime-mayonnaise"
}
