{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-11-30T05:25:56.619Z",
  "datePublished": "2013-07-23T08:07:00+00:00",
  "description": "This savory Asian-inspired meal is made with pan fried ginger tofu over rice, with kale, crunchy bell peppers and tahini sauce.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2013/07/david-sq.jpg"
  ],
  "keywords": "kale, tofu",
  "name": "Pan Fried Ginger Tofu with Tahini Over Kale",
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "4 cups cooked rice",
    "2 bell peppers (any color, diced)",
    "1 lb. firm or extra firm tofu",
    "2 tbsp. powdered ginger (give or take a little)",
    "Black pepper to taste (I like lots in this recipe)",
    "2-3 tbsp. soy sauce",
    "1/4 cup vegetable oil",
    "1/2 cup tahini",
    "One large bunch of fresh kale (about 12-16 good sized leaves)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Drain and press tofu for about ten minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare rice according to package direction. Once rice is cooked, stir in bell peppers. I like bright, colorful ones in this dish. We used red and orange here."
    },
    {
      "@type": "HowToStep",
      "text": "Cut tofu into about 1/2 to 1 inch cubes, or strips like we did here."
    },
    {
      "@type": "HowToStep",
      "text": "Heat oil in large skillet over medium. Add tofu. Drizzle with soy sauce, and sprinkle with ginger and pepper. Allow to cook 3-4 minutes, or until it begins to crisp up just a bit on the bottom."
    },
    {
      "@type": "HowToStep",
      "text": "Gently turn your tofu pieces, and repeat this process for each side, until you've used up all of your soy sauce and spices and have some nice firm pieces of tofu."
    },
    {
      "@type": "HowToStep",
      "text": "Blanch kale leaves for about 30 seconds to one minute in almost boiling water."
    },
    {
      "@type": "HowToStep",
      "text": "Divide rice mixture among four plates. Arrange kale leaves over rice, then tofu over kale. Drizzle with tahini."
    },
    {
      "@type": "HowToStep",
      "text": "Drain and press tofu for about ten minutes. Meanwhile, prepare rice. Once rice is cooked, stir in bell peppers. I like bright, colorful ones in this dish. We used red and orange here."
    },
    {
      "@type": "HowToStep",
      "text": "Cut tofu into about 1/2 to 1 inch cubes, or strips like we did here. Heat oil in large skillet over medium. Add tofu. Drizzle with soy sauce, and sprinkle with ginger and pepper. Allow to cook 3-4 minutes, or until it begins to crisp up just a bit on the bottom. Gently turn your tofu pieces, and repeat this process for each side, until you've used up all of your soy sauce and spices and have some nice firm pieces of tofu."
    },
    {
      "@type": "HowToStep",
      "text": "Blanch kale leaves for about 30 seconds to one minute in almost boiling water."
    },
    {
      "@type": "HowToStep",
      "text": "Divide rice mixture among four plates. Arrange kale leaves over rice, then tofu over kale. Drizzle with tahini."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/pan-fried-ginger-tofu-with-tahini-over-kale"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-11-30T05:25:56.618Z"
}
