{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Pancakes With Blue Cheese & Bacon recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp194panblu_018:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Savoury pancake",
  "name": "Pancakes With Blue Cheese & Bacon Recipe | Woolworths",
  "prepTime": "PT5M",
  "recipeCategory": "Lunch,Breakfast",
  "recipeCuisine": "Australian",
  "recipeId": "RGR35112",
  "recipeIngredient": [
    "125g plain flour",
    "1 pinch salt",
    "1 egg",
    "1.2 cup milk",
    "3 rashers bacon, chopped",
    "75g Gorgonzola cheese",
    "1-2 olive oil, for frying"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the flour in a mixing bowl with a pinch of salt, stir, and make a well in the centre. Crack the egg into the well and add a tiny amount of the milk. Using a wooden spoon, stir the egg and milk, letting the flour gradually tumble in. Add the rest of the milk, little by little, stirring continuously until all the flour has been incorporated and the mixture is lump-free. Put it in the refrigerator to rest for 30 minutes, if you have time."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the bacon with a drizzle of olive oil in a hot frying pan and cook over a high heat for 5 minutes, or until golden. Remove and sit on kitchen paper to soak up any fat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "In a small flat frying pan or pancake pan, heat a drizzle of olive oil over a high heat, swirling it around the pan, then tipping it out again. Stir the batter mix, then spoon in 2 tablespoons of it, swirling it around the pan so it reaches the edges. Cook for a couple of minutes, then pull up the edges with a palette knife. Turn the pancake over and cook the other side for 1 minute."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spoon a quarter of the bacon onto one half of the pancake and top with a quarter of the cheese. Fold the pancake over and cook for a further minute or so until the cheese begins to melt, then slide onto a plate. Make and fill the other pancakes in the same way. Serve immediately."
    }
  ],
  "recipeNameId": "pancakes-with-blue-cheese-and-bacon",
  "recipeYield": "2",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/pancakes-with-blue-cheese-and-bacon"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-11-26T00:12:16.990Z",
  "url": "https://www.woolworths.com.au/shop/recipes/pancakes-with-blue-cheese-and-bacon"
}
