{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT5280S",
  "createdAt": "2022-12-06T03:28:34.319Z",
  "creator": {
    "@type": "Person",
    "name": "Kayla Hoang"
  },
  "dateCreated": "2022-02-24T08:45:00-05:00",
  "dateModified": "2022-02-24T07:12:22-05:00",
  "datePublished": "2022-02-24T08:45:00-05:00",
  "description": "Buttery and flaky, this paratha recipe is made up of tender inner layers and crisp outer ones. ",
  "headline": "Paratha",
  "HowtoTip": {
    "text": "Unsalted butter: Softened unsalted butter can be used in place of ghee.Make ahead: The paratha can be assembled, rolled out to the final shape, and stored stacked between sheets of parchment or wax paper in a resealable plastic bag or airtight container. Refrigerate for up to 3 days or freeze for up to 2 weeks. Cook refrigerated paratha per recipe instructions. Frozen paratha can be cooked straight from the freezer but will need 1 to 2 minutes more cooking time per side (make sure they are opaque).For square paratha: Roll out a piece of dough as instructed above into a round, spread with 2 teaspoons ghee, and sprinkle with 1 to 2 pinches all-purpose flour. Fold the top third down over the middle third, spread with scant 1/2 teaspoon ghee, and sprinkle with a pinch of all-purpose flour. Fold the bottom third up, spread with scant 1/2 teaspoon ghee, sprinkle with a pinch of all-purpose flour. Fold the left third of the rectangle over the middle third, spread with scant 1/2 teaspoon ghee, and sprinkle with a pinch of all-purpose flour. Fold the right side over to create a square. Let rest covered for 15 minutes, then roll out to 1/8-inch thick, maintaining the square shape, before cooking.Storage: Cooked paratha is best served immediately."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2022-02-Paratha%2Fparatha-stacked-top_view"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2022-02-Paratha%2Fparatha-stacked-top_view"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2022-02-Paratha%2Fparatha-stacked-top_view"
    }
  ],
  "keywords": [
    "recipe",
    "recipe library",
    "asian",
    "pantry",
    "Side Dish",
    "stovetop",
    "Cooking with Kids",
    "children",
    "team:food",
    "platform:search",
    "course:side dish",
    "lifestyle:kid-friendly",
    "cuisine:asia",
    "cuisine:bangladeshi",
    "timing:extended",
    "mainingredients:flour",
    "mainingredients:pantry",
    "method:stovetop"
  ],
  "name": "Paratha",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "708 cal",
    "carbohydrateContent": "71.5 g",
    "cholesterolContent": "0 mg",
    "fatContent": "42.7 g",
    "fiberContent": "2.5 g",
    "proteinContent": "9.8 g",
    "saturatedFatContent": "24.2 g",
    "servingSize": "Serves 4",
    "sodiumContent": "453.3 mg",
    "sugarContent": "0.3 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT3600S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Side dish",
  "recipeCuisine": "Asia",
  "recipeIngredient": [
    "3 cups all-purpose flour, plus more for dusting",
    "1 3/4 teaspoons kosher salt",
    "1 tablespoon neutral oil, such as canola, plus more as needed",
    "1 cup warm water",
    "3/4 cup ghee"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place 3 cups all-purpose flour and 1 3/4 teaspoons kosher salt in a large bowl and whisk to combine. Drizzle with 1 tablespoon neutral oil and use your hands to rub the oil into the flour until only tiny lumps remain."
    },
    {
      "@type": "HowToStep",
      "text": "Make a well in the center of the flour mixture. Pour 1 cup warm water into the well. Mix with your hands until it begins to form one mass of dough. Knead the dough in the bowl until all the flour is incorporated. The dough will look lumpy and will likely not be smooth. Do not overwork."
    },
    {
      "@type": "HowToStep",
      "text": "Leaving the dough in the bowl, rub a light coating of neutral oil over the surface of the dough. Press a sheet of plastic wrap directly onto the surface of the dough. Let the dough rest until hydrated, supple, and holds an indentation when poked, about 30 minutes. Meanwhile, soften 3/4 cup ghee if needed (ghee kept at room temperature should be soft enough to spread easily by hand). If your ghee is chilled or too hard, place a microwave-safe bowl and microwave in 5-second increments until softened and spreadable, but not melted."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the dough out onto a work surface and divide into 8 pieces. Dust a work surface and rolling pin very lightly with all-purpose flour. Roll and fill the dough out 1 portion at a time, keeping the remaining portions covered with plastic wrap: Place on the work surface and roll out inro a super-thin round about 14 inches wide (it does not have to be perfectly round). The dough should be so thin that you can begin to just faintly see the work surface through it."
    },
    {
      "@type": "HowToStep",
      "text": "Use your fingers to spread 1 tablespoon of the ghee evenly over the dough. Sprinkle 1 to 2 pinches all-flour over the ghee to help provide definition between the layers. Starting at the bottom, roll the dough tightly up into a log. Starting at one end, coil the log up into a round to resemble a cinnamon roll. Cover with plastic wrap while you roll and fill the remaining portions of dough. Let rest for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Working with 1 piece at a time and keeping the rest covered with plastic wrap, roll out the paratha into a round about 1/8-inch thick and 6 to 7-inches wide. Transfer to a plate and repeat rolling out the remaining paratha. If stacking the paratha, place parchment or wax paper between each to prevent sticking."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a medium nonstick frying pan over medium heat. Add 1 paratha cook until the surface is beginning to turn opaque (with no browning), 2 to 3 minutes. It’s okay if it’s not totally opaque. Flip and cook until the surface of the second side is totally opaque (but not brown), 2 to 3 minutes. Flip once more and continue to cook until opaque, about 1 minute more."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 1/2 teaspoons (1/2 tablespoon) ghee to the pan. Move the paratha around, flipping as needed, until coated in ghee. Continue to cook until golden brown, about 2 minutes per side. Transfer to a plate and repeat cooking the remaining paratha, reducing the heat as needed if the parathas are browning too quickly to ensure that the centers are cooked."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/parathas-recipe-23280232"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipe%20Ramp%20Up%2F2022-02-Paratha%2Fparatha-stacked-top_view",
  "totalTime": "PT8880S",
  "updatedAt": "2022-12-06T03:28:34.319Z",
  "url": "https://www.thekitchn.com/parathas-recipe-23280232"
}
