{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T12:37:34.623Z",
  "datePublished": "2012-03-21T11:20:12+00:00",
  "description": "Use any vegetables you like instead of the broccoli and cauliflower. You can make this a Ridiculously Easy recipe by using frozen vegetables (see notes below).",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2012/03/pasta-white-sauce-680.jpg"
  ],
  "keywords": "vegan alfredo sauce",
  "name": "Pasta and Vegetables with White Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "374 kcal",
    "carbohydrateContent": "71.5 g",
    "fatContent": "4.3 g",
    "fiberContent": "16 g",
    "proteinContent": "20 g",
    "servingSize": "1 serving",
    "sodiumContent": "115.5 mg",
    "sugarContent": "8.2 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 pound whole wheat rotini pasta (or gluten-free pasta)",
    "1 1/2 cup cooked chickpeas (or 1 can, rinsed and drained)",
    "1 head broccoli (about 1 pound, cut into small florets and stems reserved for another use)",
    "1 head cauliflower (about 1 pound, cut into florets)",
    "2 cups plain unsweetened soy milk (or other non-dairy milk)",
    "6 cloves garlic (peeled and pressed)",
    "1 tablespoon dried basil",
    "2 teaspoons dried oregano",
    "1/2 teaspoon red pepper flakes (or to taste)",
    "generous grating of black pepper",
    "5 tablespoons nutritional yeast",
    "2 teaspoons cornstarch or potato starch",
    "1 1/2 teaspoons salt or salt-free seasoning (or to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of water to a boil, and cook the pasta according to instructions on package. About a minute before it's done, add the chickpeas and cook briefly to heat them through. When the pasta is al dente, scoop out and set aside a cup of the cooking water. Then drain the pasta well and return to the pot or a large serving bowl."
    },
    {
      "@type": "HowToStep",
      "text": "While the pasta is cooking, steam the vegetables until just tender. Add them to the pasta."
    },
    {
      "@type": "HowToStep",
      "text": "While the pasta and the vegetables are cooking, make the sauce: combine in a medium saucepan the soy milk, garlic, herbs, and pepper. Bring to a simmer over medium-high heat, reduce heat to low, and cook, stirring frequently, for about 3 minutes or until pasta is done. Add 1/2 cup of the pasta cooking water and the nutritional yeast. Stir the starch into 1/4 cup of cool water and add it to the sauce, stirring well. Increase heat and cook until the sauce boils and thickens slightly. Check seasonings and add salt to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the sauce over the pasta and vegetables and stir gently to coat. If the pasta needs more moisture, add a little of the reserved pasta water. Sprinkle with extra red pepper flakes if desired and serve immediately."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2012/03/pasta-and-vegetables-with-white-sauce.html"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T12:37:34.620Z"
}
