{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "20",
    "ratingValue": "4.95"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-01T07:32:21.418Z",
  "datePublished": "2014-11-10T11:46:09+00:00",
  "description": "Using a pressure cooker cuts the time it takes to cook dried beans by about half, but I’ve also included regular cooking directions at the end of the recipe.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2014/11/pasta-fagioli-sm.jpg"
  ],
  "keywords": "pasta fagioli, pasta fazool",
  "name": "Pasta Fagioli with Cranberry Beans and Kale",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "329 kcal",
    "carbohydrateContent": "61.7 g",
    "fatContent": "1.6 g",
    "fiberContent": "15 g",
    "proteinContent": "19 g",
    "servingSize": "1 large bowl",
    "sodiumContent": "817.5 mg",
    "sugarContent": "3.7 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Italian",
  "recipeIngredient": [
    "2 cups dried cranberry beans, borlotti beans, or pinto beans (soaked for at least an hour–see step 1)",
    "1 medium onion (chopped)",
    "2 ribs celery (chopped)",
    "7 cloves garlic (minced and divided)",
    "1 teaspoon fresh rosemary, minced (or 1/2 tsp. dried)",
    "1/4 teaspoon red pepper flakes",
    "26 ounces chopped tomatoes (canned)",
    "3 teaspoons dried basil leaves (divided)",
    "2 teaspoons dried oregano (divided)",
    "1/2 teaspoon smoked paprika",
    "2 teaspoons salt (optional or to taste)",
    "2 cups small pasta (whole grain or gluten-free preferred)",
    "10 ounces kale (4-6 cups chopped, stems removed and leaves chopped)",
    "3 tablespoons nutritional yeast",
    "freshly-ground black pepper (to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "At least an hour before cooking: Check the beans for rocks and other debris and rinse them well. Then do a quick soak by placing the beans in a pot or pressure cooker, covering with 2 inches of water, and bringing to a boil. Boil for 1 minute. Remove from heat and let stand for at least 1 hour. Drain well and rinse. Set aside. (Alternately, soak overnight, drain well, and rinse.)"
    },
    {
      "@type": "HowToStep",
      "text": "Heat your pressure cooker (use the Sauté or Brown button on electric PC’s). Add the onion and a pinch of baking soda (optional) and cook until it begins to soften, adding water by the tablespoon if necessary to prevent sticking. Add the celery, half of the garlic, the rosemary, and the red pepper flakes and cook for another 2 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the tomatoes, 2 teaspoons of basil, 1 teaspoon oregano, and the smoked paprika. Heat, stirring, until hot."
    },
    {
      "@type": "HowToStep",
      "text": "Add the drained beans, 6 cups of water or vegetable broth, and salt, if you desire. Lock the lid in place, bring to high pressure, and cook at high pressure for 10 minutes. (Electric PC’s: select Manual and set the time to 10 minutes.) After 10 minutes at high pressure, remove from heat or turn off electric cooker and allow the pressure to come down naturally for 15 minutes. Release all pressure using a quick release. Carefully open the lid and check the beans. If they are not all completely softened and cooked, replace the lid and bring to high pressure for another minute or two. Quick-release pressure and check beans again. Do this until the beans are all tender."
    },
    {
      "@type": "HowToStep",
      "text": "Once the beans are done, add the reserved garlic, basil, and oregano and check to see if additional salt is needed. Add the pasta and return to medium heat (electric PC–use Sauté or Brown setting). Cook, stirring frequently, until the pasta is almost al dente–just a touch undercooked. Stir in the kale, turn off the heat, and cover the cooker. Allow the kale to cook in the residual heat for about 5 minutes. Check kale and pasta for tenderness and add more time if needed. Stir in nutritional yeast and freshly ground black pepper to taste and serve."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2014/11/pasta-fagioli-with-cranberry-beans-and-kale.html"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-01T07:32:21.416Z"
}
