{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-04T15:47:16.185Z",
  "datePublished": "2022-08-03",
  "description": "This rich, chunky conserve is just as delicious spooned onto ice cream as it is on freshly baked bread. Use really ripe peaches for this recipe – they will be full of flavour and wonderfully scented. You could use ripe nectarines instead, if you prefer.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/precoo128peawal_016:Square-1300x1300"
  ],
  "keywords": "Jam,Orange",
  "name": "Peach & Walnut Conserve Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Condiments",
  "recipeCuisine": "Australian",
  "recipeId": "RGR9862",
  "recipeIngredient": [
    "1 lemon, juice only",
    "1.25kg peaches, ripe",
    "1 orange, peeled, and finely sliced",
    "900g granulated sugar",
    "50g walnuts, roughly chopped",
    "1-2 tbs brandy"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cut a cross in the skin of the peaches and plunge them in a bowl of boiling water for 30 seconds. Then plunge in cold water, remove, and peel away the skins. Cut the peaches in half, remove the stones and reserve them, and roughly chop the flesh. Layer the peaches and orange slices in a large bowl with the sugar, cover, and leave for at least 4 hour or overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tip the fruit and sugar into a preserving pan or a large heavy-based saucepan. Place the peach stones in a small square of muslin, gather into a small bag, tie with string, and add it to the pan. Cook over a gentle heat, stirring until the sugar dissolves. Then bring to the boil and cook at a gentle rolling boil for 15-20 minutes or until the s is reached. Remove the pan from the heat while you test for a set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the muslin bag of peach stones, then stir in the lemon juice, walnuts, and brandy (if using). Ladle into warm sterilized jars, cover with discs of waxed paper, seal, and label. Store in a cool, dark place, and refrigerate after opening."
    }
  ],
  "recipeNameId": "peach-walnut-conserve",
  "recipeYield": "1 kg",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/peach-walnut-conserve"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-04T15:47:16.184Z",
  "url": "https://www.woolworths.com.au/shop/recipes/peach-walnut-conserve"
}
