{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "createdAt": "2022-12-02T18:57:59.749Z",
  "datePublished": "2016-07-16T15:48:40+00:00",
  "description": "These 4 ingredients Peanut Butter Banana Cups are a lighter alternative to more traditional versions and are literally melt in your mouth delicious. Eat from the freezer for an ice-creamy, fudgy type filling, or leave to defrost for a few minutes and they will become super creamy, smooth and oozy!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2016/07/DSC_0704-1.jpg"
  ],
  "keywords": "peanut butter banana cups, peanut butter cups",
  "name": "Peanut Butter Banana Cups",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "90 kcal",
    "carbohydrateContent": "11 g",
    "fatContent": "5.6 g",
    "fiberContent": "1.2 g",
    "proteinContent": "2 g",
    "servingSize": "16 servings",
    "sodiumContent": "38 mg",
    "sugarContent": "8.3 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "190g | 1 cup dairy-free chocolate chips",
    "4 tablespoons | 1/4 cup natural peanut butter (, ( you can sub this for almond butter if you prefer)",
    "1 medium ripe banana",
    "1 tablespoon sugar (I used coconut sugar)",
    "1/4 teaspoon salt (optional but really works with the flavour)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Have a peanut butter cup mold ready (see recipe notes)."
    },
    {
      "@type": "HowToStep",
      "text": "Start by melting the chocolate very gently. You can do this in a microwave or in a small bowl placed over a pan of simmering water."
    },
    {
      "@type": "HowToStep",
      "text": "Drop a dollop of chocolate into each case."
    },
    {
      "@type": "HowToStep",
      "text": "Spread out with a spoon and work up the sides with the back of the spoon, making sure it goes into all the nooks and crannies."
    },
    {
      "@type": "HowToStep",
      "text": "Put into the freezer just for a few minutes while you make the filling."
    },
    {
      "@type": "HowToStep",
      "text": "In a food processor or blender add the banana, peanut butter, sugar and salt."
    },
    {
      "@type": "HowToStep",
      "text": "Blend until smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the molds from the freezer and fill with the peanut butter mixture, leaving enough room to add a top layer of chocolate. Flatten out the peanut butter mixture with a knife or spatula as best you can."
    },
    {
      "@type": "HowToStep",
      "text": "If you want your peanut butter cups to look really good, pop them back into the freezer now so that the peanut butter mixture sets up a bit. It won't take long. 10 - 15 minutes max. If you aren't in this for the looks then you can skip this step."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the freezer if you put them in there and add a layer of chocolate to the top. Smooth with the back of a knife or a spatula and return to the freezer until completely set. They really don't take too long."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://avirtualvegan.com/peanut-butter-banana-cups"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-12-02T18:57:59.749Z"
}
