{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "13",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-02T10:23:34.566Z",
  "datePublished": "2018-06-09T03:00:29+00:00",
  "description": "Incredibly flavorful Thai- and Indonesian-inspired tempeh satay infused with lemongrass, turmeric, peanut butter, and coconut aminos for a hearty, rich depth of flavor. Enjoy over rice, on salads, in wraps, or as an appetizer!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/04/Tempeh-Satay-SQUARE.jpg"
  ],
  "keywords": "tempeh",
  "name": "Peanut & Lemongrass Tempeh Satay",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "255 kcal",
    "carbohydrateContent": "18 g",
    "fatContent": "15.5 g",
    "fiberContent": "3.2 g",
    "proteinContent": "14.3 g",
    "saturatedFatContent": "2.99 g",
    "servingSize": "1 serving",
    "sodiumContent": "298 mg",
    "sugarContent": "9.8 g",
    "unsaturatedFatContent": "11.92 g"
  },
  "prepTime": "PT1440M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "8 ounces tempeh (we like Tofurky brand // ensure gluten-free friendly if needed // ensure grain-free if needed // opt for soy-free if needed)",
    "2 tsp chili garlic sauce (or bird's-eye chilies or red pepper flake to taste)",
    "1 Tbsp sesame oil (if avoiding oil, omit and add a bit more lime, coconut aminos, + maple syrup)",
    "2 Tbsp salted creamy peanut butter (or almond, cashew, or sunflower butter)",
    "6 Tbsp coconut aminos (or sub gluten-free tamari* (which contains soy)",
    "3 Tbsp lime juice",
    "2 Tbsp maple syrup (plus more to taste)",
    "2 tsp fresh turmeric* (optional) )",
    "4 cloves garlic (peeled)",
    "1 Pinch sea salt",
    "1 stalk lemongrass (ends removed, chopped into thirds)",
    "Fresh cilantro",
    "Peanut Sauce",
    "Butter lettuce cups or salads",
    "Noodle Bowls",
    "Sriracha or chili garlic sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To reduce bitterness in the tempeh, add to rimmed skillet or saucepan filled with 1 inch of water and bring to a low boil over medium heat. Steam tempeh (uncovered) for a total of 10-12 minutes, flipping once at the halfway point."
    },
    {
      "@type": "HowToStep",
      "text": "Rinse, pat dry, and cut into bite-size pieces. I prefer slicing the tempeh in half lengthwise then cutting into triangles or rectangles. Keep in mind they need to be thick and large enough to add to skewers (if using). Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Make marinade by adding all ingredients (chili garlic sauce, sesame oil, peanut butter, coconut aminos, lime juice, maple syrup, turmeric (optional), garlic, salt, and lemongrass) to a food processor. Blend until thoroughly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more chili for heat, maple syrup for sweetness, lime juice for acidity, or coconut aminos or salt for saltiness. Don't be shy - you want this extremely flavorful!"
    },
    {
      "@type": "HowToStep",
      "text": "Add the sliced tempeh to the marinade and toss to coat. Then cover and refrigerate for at least 2 hours, preferably 24 hours. I found that 24 hours infused the most flavor! While marinating, toss/stir occasionally to ensure even coating. It's best if the tempeh is marinated in a bag or a shallow dish to ensure all pieces are submerged in the marinade."
    },
    {
      "@type": "HowToStep",
      "text": "Once marinated, preheat oven to 375 degrees F (190 C) and line a baking sheet with parchment paper or a baking mat. Carefully add tempeh to grill/oven-safe skewers and arrange on your baking sheet. Reserve any leftover marinade to brush/serve with the tempeh once baked. (If skipping skewers, proceed to step 8 by placing tempeh directly on baking sheet unskewered.)"
    },
    {
      "@type": "HowToStep",
      "text": "Heat a grill or grill pan until very hot and brush surface with sesame or coconut oil to help prevent sticking. Once hot, add the skewers of tempeh and cook on both sides for about 4 minutes or until grill marks appear."
    },
    {
      "@type": "HowToStep",
      "text": "Place skewers back on baking sheet. Drizzle them with a bit more coconut aminos and leftover marinade for extra flavor. Optional but recommended!"
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 20-30 minutes at 375 F (190 C) or until deep golden brown, flipping once at the halfway point for even cooking. Remove from oven and brush/coat with any remaining marinade (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "This tempeh is delicious on its own or with leftover marinade or peanut sauce. It’s perfect for adding to Asian-inspired dishes like lettuce cups, spring rolls, salads, and noodle dishes! Store leftovers covered in the refrigerator up to 3 days, or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/peanut-lemongrass-tempeh-satay"
  ],
  "totalTime": "PT1490M",
  "updatedAt": "2022-12-02T10:23:34.564Z"
}
