{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "16",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT3M",
  "createdAt": "2022-12-05T23:57:01.204Z",
  "datePublished": "2013-03-26T05:00:21+00:00",
  "description": "Simple, vegan, gluten-free peanut butter eggs with just 5 ingredients and ALL the taste of the original.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2013/03/Homemade-Reeses-Eggs-google.jpg"
  ],
  "keywords": "peanut butter eggs",
  "name": "Peanut Butter Eggs",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "194 kcal",
    "carbohydrateContent": "12 g",
    "fatContent": "13 g",
    "fiberContent": "3.5 g",
    "proteinContent": "6.3 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 eggs",
    "sodiumContent": "45 mg",
    "sugarContent": "7 g"
  },
  "prepTime": "PT35M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 pitted dates (medjool or deglet noor)",
    "1/2 cup raw almonds",
    "1 cup roasted salted peanuts",
    "1/2 cup roasted, salted natural peanut butter (creamy is best, but crunchy is fine, too)",
    "1 cup dairy-free semisweet or dark chocolate"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add dates to a food processor and process until only small bits remain. Next add almonds and peanuts to the food processor and mix until they turn to meal – a few small chunks are OK."
    },
    {
      "@type": "HowToStep",
      "text": "Next add peanut butter in 1 Tbsp at a time (8 Tbsp total as original recipe is written) until the mixture forms a loose dough. If it seems too wet to handle, add more peanuts. If it seems too dry, add more peanut butter. Refrigerate for 5 minutes so it's easier to shape."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop out large rounds of dough - heaping 1 Tbsp - and form into an \"egg\" shape. Place on a parchment lined cookie sheet and pop in the freezer to harden for about 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, melt your dark chocolate over a double boiler or in the microwave in 30 second increments. Then work in small batches to coat the \"eggs.\" Take just 1 egg out of the freezer at a time for dipping - otherwise they'll get too soft to dip well."
    },
    {
      "@type": "HowToStep",
      "text": "To dip, drop eggs one at a time into the chocolate, flip once, pick up with a fork and gently tap on the rim of the bowl to remove excess chocolate. A little excess is OK. Place back on the parchment-lined baking sheet and pop back in the freezer to set."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat until all eggs are dipped, re-warming chocolate as needed."
    },
    {
      "@type": "HowToStep",
      "text": "For optimum freshness, store eggs in an air-tight container in the freezer or fridge until serving."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://minimalistbaker.com/peanut-butter-eggs"
  ],
  "totalTime": "PT38M",
  "updatedAt": "2022-12-05T23:57:01.204Z"
}
