{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "26",
    "ratingValue": "4.81"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-11-25T13:16:17.000Z",
  "datePublished": "2021-04-03T12:03:40+00:00",
  "description": "These Peanut Tofu Noodle Bowls feature light and airy rice noodles, cold crunchy vegetables, and a deliciously bright peanut lime dressing.",
  "image": {
    "@type": "ImageObject",
    "height": 900,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2021/04/Tofu-Peanut-Noodle-Bowl-above-1.jpg",
    "width": 1200
  },
  "keywords": "noodle bowl, peanut lime dressing, Tofu Recipes",
  "name": "Peanut Tofu Noodle Bowls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "534.25 kcal",
    "carbohydrateContent": "32.08 g",
    "fatContent": "38 g",
    "fiberContent": "6.05 g",
    "proteinContent": "25.35 g",
    "servingSize": "1 bowl",
    "sodiumContent": "437.33 mg"
  },
  "prepTime": "PT40M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "14 oz. extra firm tofu ($2.79)",
    "1/4 tsp salt ($0.02)",
    "2 Tbsp cornstarch ($0.06)",
    "1 Tbsp cooking oil ($0.04)",
    "3 Tbsp natural-style peanut butter ($0.38)",
    "1 Tbsp brown sugar ($0.04)",
    "1 clove garlic, minced ($0.08)",
    "1/2 tsp grated fresh ginger ($0.05)",
    "2 Tbsp lime juice ($0.50)",
    "2 tsp soy sauce ($0.04)",
    "1/4 cup neutral oil* ($0.04)",
    "8 oz. rice noodles ($2.69)",
    "1 red bell pepper ($1.50)",
    "1 cucumber ($1.49)",
    "1 carrot ($0.08)",
    "1/2 bunch cilantro ($0.40)",
    "1/4 cup chopped peanuts ($0.12)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by pressing the tofu. Remove the tofu from the package, then place it on a rimmed baking sheet. Place a cutting board, plate, or another flat object over top, then place something heavy on top of that, like a cast iron skillet or a pot of water. Let the tofu sit with the weight on top for about 30 minutes to press the excess moisture out of the tofu."
    },
    {
      "@type": "HowToStep",
      "text": "While the tofu is pressing, prepare the peanut lime dressing. Combine the peanut butter, brown sugar, minced garlic, grated ginger, lime juice, soy sauce and oil in a bowl. Whisk until smooth. Set the dressing aside."
    },
    {
      "@type": "HowToStep",
      "text": "You can also prep the vegetables while the tofu is pressing. Slice the red bell pepper, slice the cucumber into thin sticks, shred the carrot using a cheese grater, and remove the cilantro leaves from the stems (or just roughly chop them)."
    },
    {
      "@type": "HowToStep",
      "text": "After the tofu has been pressing for about 30 minutes, pour off the excess water from the baking sheet. Transfer the pressed tofu to a cutting board, and cut the block into 1/2 -inch cubes."
    },
    {
      "@type": "HowToStep",
      "text": "Place the tofu cubes in a bowl or shallow dish and sprinkle with salt and cornstarch. Gently toss the tofu cubes until they are coated in cornstarch."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the cooking oil in a large non-stick skillet over medium heat. Once hot, add the tofu cubes and cook on each side until golden brown and crispy. Once crispy, remove them from the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Finally, cook the rice noodles. Bring a pot of water to a full boil, then add the noodles. Boil only for about three minutes, or the recommended time on the package. Drain the noodles in a colander and rinse briefly with cool water. Let the noodles drain well."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble the bowls, place 1/4 of the noodles in the bottom of each bowl. Top with some bell pepper, cucumber, carrot, cilantro, and crispy tofu. Sprinkle some chopped peanuts over top, then drizzle with the peanut lime dressing. Enjoy!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/peanut-tofu-noodle-bowls"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-25T11:24:56.911Z"
}
