{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "17",
    "ratingValue": "4.77"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-02T07:57:08.134Z",
  "datePublished": "2016-12-17T05:00:54+00:00",
  "description": "Easy 1-Bowl Peanut Butter Cookies with Peanut Butter Cup Blossoms! Tender, salty-sweet, gluten-free, and perfect for the holidays!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/11/Peanut-Butter-Cup-Cookies-SQUARE.jpg"
  ],
  "keywords": "peanut butter cup cookies",
  "name": "Peanut Butter Cup Cookies (V/GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "263 kcal",
    "carbohydrateContent": "26.6 g",
    "fatContent": "16.1 g",
    "fiberContent": "2.1 g",
    "proteinContent": "5.4 g",
    "saturatedFatContent": "6.6 g",
    "servingSize": "1 cookies",
    "sodiumContent": "105 mg",
    "sugarContent": "13.6 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup softened vegan butter (1 stick = 1/2 cup // or dairy butter if not vegan)",
    "2/3 cup organic cane sugar* (plus more for rolling)",
    "1 tsp vanilla extract",
    "3 Tbsp aquafaba",
    "1/4 cup salted creamy peanut butter",
    "3/4 tsp baking powder",
    "1 pinch sea salt (add 1/4 tsp if peanut butter is unsalted // amount as original recipe is written // adjust if altering batch size)",
    "2/3 cup almond flour*",
    "1/4 cup cornstarch or arrowroot",
    "1 1/3 cup gluten-free flour blend*",
    "15-18 mini vegan peanut butter cups (such as Justin’s brand)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and line two baking sheets with parchment paper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add softened vegan butter to a large mixing bowl and beat until creamy and smooth - about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add sugar and mix on medium speed until fluffy and light - about 1 minute. Then add vanilla and chickpea brine (or other egg substitutes*) and mix again, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add peanut butter and mix once more. Then add baking powder and sea salt and blend to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, add almond flour, cornstarch, and gluten=free flour blend and mix on low until the ingredients are combined."
    },
    {
      "@type": "HowToStep",
      "text": "The dough should be thick and almost difficult to mix at this point. If too soft, continue adding 1 Tbsp each gluten free flour blend, almond flour, and cornstarch until a thick, moldable dough is formed. If it is too dry for some reason, add 1 Tbsp (15 ml) almond milk and stir. Then transfer dough to the refrigerator and chill for 15 minutes*."
    },
    {
      "@type": "HowToStep",
      "text": "Use a cookie scooper (I like this one) or Tablespoon to measure out 1 1/2 Tbsp amounts of dough and gently roll into balls - the dough will still be soft, so be gentle. Arrange on the parchment-lined baking sheets and press down gently with the palm of your hand to smash slightly (see photo). The cookies won't spread much, so don't worry about giving them too much room on the baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 11-12 minutes or until the cookies appear fluffy and the edges are slightly beginning to dry out. Remove from oven and immediately press an unwrapped peanut butter cup down in the center of the cookies. Don't press too hard or it can crack too much. Be gentle - they only need to be inserted enough to stick in place. Let cool on baking sheet for 10 minutes before transferring to a wire rack to cool completely (expedite cooling time by transferring to refrigerator)."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy as is or with a glass of DIY Almond Milk or Hot Cocoa! Storage: Once cooled, store leftover cookies covered at room temperature for 3-4 days or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "18",
  "sameAs": [
    "https://minimalistbaker.com/peanut-butter-cup-cookies-vgf"
  ],
  "totalTime": "PT42M",
  "updatedAt": "2022-12-02T07:57:08.132Z"
}
