{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "4.78"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-30T06:01:58.481Z",
  "datePublished": "2009-12-31T18:54:00+00:00",
  "description": "Pepperoni stuffed chicken is an easy way to transform boring chicken breasts into something your family will ask for again and again!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2009/12/Pepperoni20Stuffed20Chicken.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2009/12/Pepperoni20Stuffed20Chicken-500x479.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2009/12/Pepperoni20Stuffed20Chicken-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2009/12/Pepperoni20Stuffed20Chicken-480x270.jpg"
  ],
  "keywords": "stuffed chicken",
  "name": "Pepperoni Stuffed Chicken",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "533.48 kcal",
    "carbohydrateContent": "23.35 g",
    "fatContent": "32 g",
    "fiberContent": "0.93 g",
    "proteinContent": "35.18 g",
    "servingSize": "1 Serving",
    "sodiumContent": "573.55 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 lb boneless, skinless chicken breasts ($1.98)",
    "2 oz mozzarella cheese ($0.40)",
    "1 1/4 oz approx. 16 slices pepperoni ($0.54)",
    "1 large egg ($0.15)",
    "1/2 cup all purpose flour ($0.14)",
    "1/2 cup breadcrumbs ($0.18)",
    "6 Tbsp vegetable oil ($0.22)",
    "to taste salt and pepper ($0.05)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Trim the chicken breasts of any large clumps of fat that may be still attached. Slice each breast in half diagonally to create two diamond-like shaped pieces. Using a small, sharp knife, cut a pocket into the side of each breast piece. This can be slightly tricky on thinner pieces so be careful. Be sure not to cut all the way through the meat but rather just into one side so that the fillings will stay in. See photos below."
    },
    {
      "@type": "HowToStep",
      "text": "Stuff each piece of chicken with 1/2 oz. of cheese and about 4 slices of pepperoni. Lightly season each piece with salt and pepper. Set the stuffed chicken aside."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat your oven to 350 degrees and line a baking sheet with aluminum foil. Begin to heat a large skillet with 6 Tbsp of vegetable oil over medium/high heat. Collect three shallow dishes and put the flour in one, the egg in another and the bread crumbs in the third. Beat the egg until it is an even consistency (adding a 1/2 tsp of water helps break it up)."
    },
    {
      "@type": "HowToStep",
      "text": "One by one, coat each piece of chicken in the flour, then the egg then the bread crumbs. Use your hands so that you can keep the open side of the pocket pinched closed and keep the fillings in. The flour helps the egg adhere and the egg keeps the bread crumbs in place. This is a basic bread coating."
    },
    {
      "@type": "HowToStep",
      "text": "Test the oil in the skillet to see if it is hot enough by dropping a small pinch of bread crumbs in. The bread crumbs should sizzle and dance A LOT. It is very important that the oil is hot enough or else the breading will soak up a lot of oil and you’ll end up with some really greasy chicken. Place all four pieces of chicken in the skillet and cook until it is golden brown and crispy on each side. This should take no more than 2-3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "When you remove the chicken pieces from the skillet, transfer them to the baking sheet and place it in the oven. Finish baking the chicken (to cook the inside) for about 25 minutes (longer if you have larger pieces). Remove from the oven (check to make sure the chicken is cooked through) and serve immediately!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/pepperoni-stuffed-chicken"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-30T06:01:58.480Z"
}
