{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T02:41:45.490Z",
  "datePublished": "2015-01-28T10:43:50+00:00",
  "description": "Pressure steaming first locks in moisture, and baking for 10-15 minutes concentrates the sweetness.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2015/01/perfect-sweet-potato-sm.jpg"
  ],
  "name": "Perfect Baked Sweet Potatoes in the Pressure Cooker and Oven",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "162 kcal",
    "carbohydrateContent": "37.3 g",
    "fatContent": "0.3 g",
    "fiberContent": "5.9 g",
    "proteinContent": "3.6 g",
    "servingSize": "1 serving",
    "sodiumContent": "64.8 mg",
    "sugarContent": "11.7 g"
  },
  "prepTime": "PT1M",
  "recipeCategory": "Side Dish",
  "recipeIngredient": [
    "1 sweet potato per person",
    "water (boiling preferably)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash the sweet potatoes well. Poke each with a fork a few times."
    },
    {
      "@type": "HowToStep",
      "text": "Put about 1 cup of hot water in your pressure cooker. (This is for a 6-quart Instant Pot; larger cookers may need more. Just make sure water covers the bottom of the pot.)"
    },
    {
      "@type": "HowToStep",
      "text": "Place a steaming rack or basket in the pot. Make sure the water is beneath the level of the rack. Place the potatoes on the rack, out of the water."
    },
    {
      "@type": "HowToStep",
      "text": "How much time you pressure cook them will depend on the size of the sweet potatoes. For small potatoes, start with 14 minutes, medium 16 minutes, large 18 minutes. Lock your lid in place and bring to high pressure. (Instant Pot users, use the Manual setting and set the appropriate time.) It doesn’t matter how many potatoes you are cooking; set the timer according to the size of the largest potato."
    },
    {
      "@type": "HowToStep",
      "text": "Cook at high pressure for the time listed for your size of sweet potatoes. Then remove from heat or turn your electric PC off. Allow the pressure to come down naturally for 10 minutes. Quick release the pressure if necessary after 10 minutes. Check the potatoes by poking down to the center with a fork. They should be relatively soft all the way through. If they seem hard in the middle, return them to the cooker, and pressure cook them for another minute or two. Quick release the pressure and check again. They should be done, but repeat if necessary."
    },
    {
      "@type": "HowToStep",
      "text": "While the pressure is coming down, preheat your oven to 400F. Place the sweet potatoes on a baking sheet and bake for 10-15 minutes. Serve warm."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://blog.fatfreevegan.com/2015/01/perfect-baked-sweet-potatoes-in-the-pressure-cooker-and-oven.html"
  ],
  "totalTime": "PT46M",
  "updatedAt": "2022-12-02T02:41:45.488Z"
}
