{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "233",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T08:52:50.951Z",
  "datePublished": "2017-11-09T01:30:00+00:00",
  "description": "Perfect Vegan Yorkshire Puddings - Tall, crispy, golden sides, soft and slightly gooey bottoms, and a deep hollow just waiting to be filled with tasty gravy! And there&#39;s a gluten-free option! ",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2017/11/Vegan-Yorkshire-Puddings-square-1.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2017/11/Vegan-Yorkshire-Puddings-square-1-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2017/11/Vegan-Yorkshire-Puddings-square-1-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2017/11/Vegan-Yorkshire-Puddings-square-1-480x270.jpg"
  ],
  "keywords": "popovers, vegan, yorkshire puddings",
  "name": "Perfect Vegan Yorkshire Puddings",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "163 kcal",
    "carbohydrateContent": "13 g",
    "fatContent": "10 g",
    "fiberContent": "1.3 g",
    "proteinContent": "3.2 g",
    "saturatedFatContent": "1.5 g",
    "servingSize": "1 pudding",
    "sodiumContent": "226 mg",
    "sugarContent": "1.2 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Side Dish",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "75 g / 1/2 heaping cup all purpose flour (,(plain flour in the UK). SEE RECIPE NOTES FOR GLUTEN-FREE OPTION)",
    "75 g / scant 2/3 cup chickpea flour (, also sometimes known as garbanzo or gram flour)",
    "2 1/4 teaspoons baking powder",
    "1/4 teaspoon fine salt",
    "1/4 teaspoon turmeric (, OPTIONAL - helps to give the puddings a nice yellow colour.)",
    "scant 1/2 teaspoon dijon mustard (, 1/4 teaspoon of Kala Namak can be used instead if you prefer but mustard gives the best flavour. )",
    "3/4 teaspoon apple cider vinegar",
    "6 tablespoons / 90 mls aquafaba (, (the liquid from a can of chickpeas)",
    "360 mls / 1 1/2 cups water",
    "oil for pan"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 425°F (218 °C) and have a shelf set about 3/4 way up with an old baking tray on it. It must be preheated with the oven and is there to catch any oil spillovers when you are cooking the puddings."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, add the all purpose flour, chickpea flour, baking powder and salt and whisk them together. As I mention in my post, I highly recommend weighing the ingredients for optimum results."
    },
    {
      "@type": "HowToStep",
      "text": "In a jug, combine the mustard, apple cider vinegar, aquafaba and water and whisk them together."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the combined liquids into the dry ingredients and whisk together until smooth and bubbly. Pour into a jug to make pouring quick and easy, then leave to rest for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the batter is resting, prepare your muffin pans. They must be metal pans and not ceramic and they must be muffin pans and not shallow Yorkshire pudding pans. If you use a pan with shallow wells they will not work. Add enough oil to give a depth of about 3mm, then swirl it around in the pan so it goes up the sides. For my muffin pans that is about 1 1/4 tablespoons for each well. Don't be tempted to use less as the batter won't get hot enough when you pour it in and that will mean that you won't get nice bowl shaped Yorkshire Puddings. Put the oiled muffin pans in the oven on the old baking tray that preheated in the oven, for 10 minutes. By then they should be absolutely smoking hot. That's what you want. If you don't see smoke rising from them if you open the door to peek, leave them a minute or two longer."
    },
    {
      "@type": "HowToStep",
      "text": "You need to work very quickly now. Make sure your jug of batter is right next to you as you open the oven. Very quickly, but very carefully, remove the muffin pan from the oven, making sure to close the door to keep the heat in.In a long, thin stream, pour the batter into the hot oil in each well of the pan. You need to fill them nearly to the top. The oil will rise above the batter (that's what makes gives you the bowl shape puddings). Stop pouring once the oil is just about level with the rim of the well. You need to do this really quickly because you need to keep the heat in the pan for the puddings to work well. As soon as the wells are all full, put the pan right back into the oven and shut the door quickly. You should get 6 to 8 Yorkshire Puddings from the batter."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the puddings for at least 30 minutes, but maybe up to 35 or 40 minutes until really golden and crispy and until the insides have dried out to your liking. I like them a little gooey inside and 30 minutes will get them there. If you prefer them a little dryer, turn the oven down and let them cook a little longer. Do not open the oven door, not even for a quick peek until you are past 25 minutes of cooking."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the puddings from the oven and serve immediately."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/vegan-yorkshire-puddings"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-01T08:52:50.948Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/mCKNAJF5.mp4",
    "description": "Perfect Vegan Yorkshire Puddings - Tall, crispy, golden sides, soft and slightly gooey bottoms, and a deep hollow just waiting to be filled with tasty gravy! And there's a gluten-free option. Perfect for enjoying with roast vegan beef and all the trimmings!",
    "name": "Vegan Yorkshire Puddings",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/mCKNAJF5-720.jpg",
    "uploadDate": "2022-01-11T23:52:30.000Z"
  }
}
