{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-29T13:20:22.000Z",
  "datePublished": "2017-09-06T15:44:43+00:00",
  "description": "These Pesto Pizza Rolls are a fun way to change up your pizza routine with swirls of cheese, pesto, and pepperoni, plus lots of crispy edges!&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2017/09/Pesto-Pizza-Rolls-eaten.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/09/Pesto-Pizza-Rolls-eaten-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/09/Pesto-Pizza-Rolls-eaten-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/09/Pesto-Pizza-Rolls-eaten-480x270.jpg"
  ],
  "keywords": "Appetizer, Snacks",
  "name": "Pesto Pizza Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "268.86 kcal",
    "carbohydrateContent": "27.4 g",
    "fatContent": "11.33 g",
    "fiberContent": "1.96 g",
    "proteinContent": "8.4 g",
    "servingSize": "1 Serving",
    "sodiumContent": "696.68 mg"
  },
  "prepTime": "PT120M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3/4 cup warm water ($0.00)",
    "2 tsp active dry or instant yeast ($0.18)",
    "1/2 Tbsp sugar ($0.03)",
    "1 Tbsp olive oil ($0.13)",
    "2 cups flour (plus some for dusting) ($0.34)",
    "1 tsp salt ($0.03)",
    "1/2 cup pesto ($0.85)",
    "2 oz. pepperoni ($1.10)",
    "1 cup shredded mozzarella ($1.33)",
    "1/2 cup pizza sauce (for dipping, optional) ($0.33)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine the warm water, yeast, and sugar, and stir until the yeast is dissolved. Let the mixture sit for about five minutes or until the yeast has developed a layer of foam on top of the water."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, add 1 cup of the flour to a large bowl along with the salt."
    },
    {
      "@type": "HowToStep",
      "text": "Once the yeast has become foamy, add the olive oil to the yeast mixture, then pour the mixture into the bowl with the flour and salt. Stir until a thick batter forms. Begin to stir in more flour, a little at a time, until it forms a ball of dough that you can no longer stir with a spoon."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the ball of dough out onto a clean surface dusted with flour. Knead the dough, adding a small amount of flour as you go, for about five minutes. You should have used around 2 cups flour total from the very beginning, give or take a little."
    },
    {
      "@type": "HowToStep",
      "text": "Place the kneaded dough back in the bowl, cover it loosely, and let it rise until double in volume. Once doubled, begin preheating the oven to 400oF."
    },
    {
      "@type": "HowToStep",
      "text": "Punch the dough down, scrape it out of the bowl, and onto a floured surface. Stretch the dough out into roughly shaped rectangle, approximately 10x16 inches. Try to avoid using a rolling pin, if possible, as this will compress the dough and prevent it from being nice and fluffy."
    },
    {
      "@type": "HowToStep",
      "text": "Once shaped, spread the pesto over the surface of the dough from edge to edge. scatter the sliced pepperoni over the surface, then sprinkle half of the cheese on top."
    },
    {
      "@type": "HowToStep",
      "text": "Roll the dough up into a log, then use a very shape knife to slice it into 8 (or more) equal sized slices. Place the sliced rolls in a casserole dish that has been coated in non-stick spray (or oil if you prefer). Make sure to use a dish large enough to allow the rolls room to expand as they bake. Sprinkle the remaining cheese over top of the rolls in the dish, allowing some to fall around the edges and between the rolls."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the Pesto Pizza Rolls in the preheated oven for about 30 minutes, or until they are puffed up, golden brown on top, and the pesto and cheese are bubbling around the edges. Serve warm with pizza sauce for dipping."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/pesto-pizza-rolls"
  ],
  "totalTime": "PT150M",
  "updatedAt": "2022-11-29T12:50:04.917Z"
}
