{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-03T17:04:29.365Z",
  "datePublished": "2017-09-17T12:15:43+00:00",
  "description": "Pindi Chole - Chickpea Curry with Whole Spices. Chickpeas cooked with whole spices then added to a sauce with caramelized onions. Instant Pot or Saucepan. Punjabi Chole Adapted from Rawalpindi style Chole. Vegan Gluten-free Nut-free Soy-free Recipe",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2017/09/vegan-pindi-chole-veganricha-3558-2.jpg",
    "https://www.veganricha.com/wp-content/uploads/2017/09/vegan-pindi-chole-veganricha-3558-2-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2017/09/vegan-pindi-chole-veganricha-3558-2-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2017/09/vegan-pindi-chole-veganricha-3558-2-480x270.jpg"
  ],
  "name": "Pindi Chole - Chickpea Curry with Cinnamon, Cardamom and Caramelized Onion Sauce. Instant Pot or Saucepan",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "226 kcal",
    "carbohydrateContent": "37 g",
    "fatContent": "4 g",
    "fiberContent": "10 g",
    "proteinContent": "10 g",
    "servingSize": "1 serving",
    "sodiumContent": "450 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "1 cup dried chickpeas",
    "1 cinnamon stick (, 2 inch)",
    "2 green cardamoms (, partially cracked open)",
    "1 black cardamom (, optional but definitely use it if you can find it)",
    "2 cloves",
    "2 bay leaves",
    "1/4 tsp kala namak (Indian sulphur Salt)",
    "1 tea bag (black tea plain), optional)",
    "1 tsp oil (, organic safflower )",
    "8 cloves garlic",
    "1 inch ginger",
    "1 medium onion (chopped or minced)",
    "2 tsp chana masala or chole masala spice blend (, or use 1.5 tsp garam masala and 1 tsp coriander powder)",
    "1/4 to 1/2 tsp cayenne",
    "1 tsp amchoor (, dry mango powder (adds a sour profile)",
    "3/4 tsp salt",
    "onion, (lemon juice and pepper flakes for garnish)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak the chickpeas for atleast an hour or 4 hours. Combine in a pressure cooker(instant Pot) with 2 to 2.5 cups water with the rest of the ingredients under chickpeas. Cook for 25 to 30 minutes. Let the pressure release naturally. See note for saucepan option"
    },
    {
      "@type": "HowToStep",
      "text": "Blend the garlic, ginger, onion with a few tbsp of water to make puree. Heat oil in a saucepan over medium heat. Add blended onion ginger garlic. and cook stirring occasionally until golden and onion doesnt smell raw (10 to 13 mins). Alternatively add minced garlic and ginger and cook for a minute, then add finely chopped onion and continue to cook until golden-translucent."
    },
    {
      "@type": "HowToStep",
      "text": "Add the spices and mix in. Cook for half a minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add cooked chickpeas with the whole spices, salt,and some of the cooking water or fresh water to the saucepan and simmer covered for 10 to 15 minutes. (alternatively, add the onion mixture and salt to the chickpeas(In Instant pot). Taste and adjust salt and spice (add more water if needed). Press saute and Simmer for 10 minutes. Add a pinch of sugar to balance if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Serve garnished with chopped onions, lemon juice, pepper flakes with rice or flatbread or over Potato Cutlets (tikki). Or make a bowl with roasted veggies. You can remove the whole spices before serving. I usually keep them in in the serving container, so they stay with the leftover chickpeas that get stored."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/pindi-chole-chickpea-curry-with-whole-spices"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-03T17:04:29.364Z"
}
