{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "4.86"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-02T14:28:12.981Z",
  "datePublished": "2016-12-12T13:17:46+00:00",
  "description": "Melt in your mouth Pine Needle Shortbread Cookies. A twist on an old favourite with just a hint of piney, citrusy flavour. Delicate, delicious &amp; sure to impress!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2016/12/Pine-Needle-Shortbread-Cookies-1-2-copy.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2016/12/Pine-Needle-Shortbread-Cookies-1-2-copy-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2016/12/Pine-Needle-Shortbread-Cookies-1-2-copy-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2016/12/Pine-Needle-Shortbread-Cookies-1-2-copy-480x270.jpg"
  ],
  "keywords": "christmas shortbread, pine needle shortbread, vegan shortbread",
  "name": "Pine Needle Shortbread Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "68 kcal",
    "carbohydrateContent": "6 g",
    "fatContent": "4 g",
    "proteinContent": "1 g",
    "servingSize": "1 cookie",
    "sodiumContent": "34 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Baked Goods",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "40g (heaping 1/3 cup) powdered sugar",
    "100g ( 1/2 cup) hard and cold coconut oil or vegan butter (use refined coconut oil for no coconut flavour)",
    "1/4 to 1/2 teaspoon salt (see recipe note)",
    "1 heaping tablespoon pine needles",
    "165g (1 1/3 cup) all purpose flour (plain flour in the UK)",
    "more powdered sugar for sprinkling"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350°F and get a cookie sheet ready. If your sheet has a tendency to stick then line it with parchment paper or a silicone mat."
    },
    {
      "@type": "HowToStep",
      "text": "Put the flour and pine needles in a blender. Make sure the top is on tight and blend until the pine needles are chopped into little pieces throughout the flour. Don't be alarmed by the really strong pine smell. Once cooked it becomes very subtle. Using a blender is the easiest method for chopping the pine needles. You need the flour in there with them as otherwise it's such a tiny amount they would just fly around and not get cut. I found chopping the needles with a knife pretty tough (literally!). Scissors would be a better option if you don't have a blender."
    },
    {
      "@type": "HowToStep",
      "text": "Combine the powdered sugar, salt and the coconut oil in a bowl. Use a fork to mash together very, very well until you can no longer see any powdered sugar and it's light and fluffy."
    },
    {
      "@type": "HowToStep",
      "text": "Pour in the flour and pine needle mixture and mix by hand until everything is combined. I start by mashing with a fork then stir together with a spoon at the end a bit. Do not over mix or use electric beaters here. Too much mixing will affect the texture of the finished shortbread."
    },
    {
      "@type": "HowToStep",
      "text": "When done it should be slightly crumbly but hold together if you squeeze it together in your hand. The drier you can get away with keeping the dough, the better the texture of your shortbread and you should not need to add any liquid at all."
    },
    {
      "@type": "HowToStep",
      "text": "If the dough is starting to get a bit soft, stop and put it in the fridge for 20 minutes before continuing. It will firm up again then."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly dust a surface with flour and shape your dough into a ball. Roll out to about 3 - 4 mm thick then use a cookie cutter or mason jar lid/rim of a glass to cut into shapes."
    },
    {
      "@type": "HowToStep",
      "text": "Place gently on the prepared cookie sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 10 - 12 minutes.They will start turning a little golden around the edges and on the bottom when done."
    },
    {
      "@type": "HowToStep",
      "text": "Keep an eye on them in the last few minutes as they can turn from ok to overdone very quickly. They will still feel slightly soft in the middle but will firm up as they cool."
    },
    {
      "@type": "HowToStep",
      "text": "Place them on a cooling rack to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Unlike some cookies these are best eaten when completely cooled so be patient!"
    }
  ],
  "recipeYield": "25",
  "sameAs": [
    "https://avirtualvegan.com/pine-needle-shortbread-cookies"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-02T14:28:12.979Z"
}
