{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Shannon @ Yup, it's Vegan"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T13:53:34.179Z",
  "datePublished": "2014-10-09T07:00:40+00:00",
  "description": "Pizza stuffed spaghetti squash, gone vegan with homemade cashew mozzarella from scratch. Gluten-free and soy-free recipe. Ingredient amounts are approximate and may be adjusted to the size of your spaghetti squash. Easily doubled with more squash and filling.",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2014/10/vegan_pizza_stuffed_spaghetti_squash_3.jpg"
  ],
  "keywords": "pizza stuffed spaghetti squash",
  "name": "Pizza Stuffed Spaghetti Squash",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "276 kcal",
    "carbohydrateContent": "59 g",
    "fatContent": "5 g",
    "fiberContent": "13 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 stuffed squash half (minus cashew cheese)",
    "sodiumContent": "188 mg",
    "sugarContent": "26 g",
    "unsaturatedFatContent": "2 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "gluten-free",
  "recipeIngredient": [
    "1 spaghetti squash (halved vertically and seeded)",
    "1 red bell pepper (halved and seeded (or 1 roasted red pepper)",
    "1 recipe cashew mozzarella (add 1 tbsp nutritional yeast and 1/8 tsp ground black pepper)",
    "1/2 cup arrabbiata pasta sauce (or other pasta sauce of choice)",
    "1 medium zucchini (thinly sliced into quarter-moons)",
    "1/4 yellow onion (diced)",
    "additional dried oregano and red pepper flakes (to taste)",
    "(optional) fresh basil or parsley, for topping"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 degrees Fahrenheit. After you've fully removed the guts from the squash, use a fork to poke a few holes in the flesh. Place them, concave side down, in a baking dish. Add two cups of water to the dish. If you aren't using pre-roasted pepper, add that to the dish, too."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for about 45 minutes (removing the pepper earlier if needed), or until soft and fully cooked. Chop up the roasted red pepper."
    },
    {
      "@type": "HowToStep",
      "text": "(Note: while the squash is baking is a great time to make the cashew mozzarella)."
    },
    {
      "@type": "HowToStep",
      "text": "Use a fork to scrape out most of the squash (which will turn into spaghetti right before your eyes!). Add it to a mixing bowl along with the red pepper, about 3 tablespoons of the cashew mozzarella, pasta sauce, zucchini, and onion. Stir until everything is well-mixed, especially the cashew cheese."
    },
    {
      "@type": "HowToStep",
      "text": "Taste for seasoning and adjust if needed. Return the filling to the hollowed-out spaghetti squash, and top with a few more dollops of cashew mozzarella."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for about 20 more minutes, or until the cashew mozzarella is melted and bubbly, and the filling is hot all the way through. Serve garnished with fresh herbs if desired."
    },
    {
      "@type": "HowToStep",
      "text": "A leftover squash half will keep for up to 5-7 days in the fridge, wrapped in foil. Best reheated in the oven."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://yupitsvegan.com/pizza-stuffed-spaghetti-squash"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-02T13:53:34.176Z"
}
