{
  "@type": "Recipe",
  "cookTime": "PT50M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Plum Paste recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1112_plumpaste:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Jam,Pescatarian,Seafood free,Gluten free,Tree nut free,Egg free,Sesame free,Stone fruit,Halal,Soy free,Wheat free,Vegetarian,Vegan,Dairy free,Peanut free",
  "name": "Plum Paste Recipe | Woolworths",
  "prepTime": "PT10M",
  "recipeCategory": "Condiments",
  "recipeCuisine": "Australian",
  "recipeId": "1360",
  "recipeIngredient": [
    "2 tbs lemon juice",
    "4 cup sugar (approximately)",
    "plum"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Halve plums, remove and reserve stones. Roughly chop the flesh. Combine plum flesh, stones and water in a large heavy-based saucepan."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place over low heat and cook for 20 minutes or until the fruit is very soft, stirring occasionally. Remove from heat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Strain mixture by pressing it through a fine-mesh sieve over a bowl. Measure purée and return to the pan. Add an equal amount of sugar (eg. add 4 cups sugar to 4 cups purée) and stir over medium heat until dissolved. Stir in lemon juice. Cook over medium-low heat, stirring frequently, for 30 minutes or until reduced and thickened. To test if it is ready, place a small amount on a spoon and set aside to cool. The mixture should be thick and set."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Line a 18x28cm slice pan with foil and then with baking paper. Pour plum paste into pan and tap pan on the bench until the mixture is evenly spread. Set aside to cool at room temperature, then cover and set aside for 2 days until firm. Invert pan onto a cutting board, remove baking paper and foil and cut paste into squares. Store at room temperature in an airtight plastic container, with layers separated by baking paper. Or for a gift idea, place squares in a clean screw-top jar and label."
    }
  ],
  "recipeNameId": "plum-paste",
  "recipeYield": "2",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/plum-paste"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-24T12:38:06.507Z",
  "url": "https://www.woolworths.com.au/shop/recipes/plum-paste"
}
