{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-27T10:17:17.999Z",
  "datePublished": "2022-08-03",
  "description": "This fresh-tasting granita is a simple, tasty alternative to ice cream, and doesn’t require an ice-cream maker. It’s packed with pomegranates, raspberries, and mint. ",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/supcle146pomras_019:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Granita",
  "name": "Pomegranate & Raspberry Granita Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Italian",
  "recipeId": "RGR11145",
  "recipeIngredient": [
    "1 handful mint leaves (save some to garnish)",
    "1kg seedless watermelon, skinned and diced",
    "175g raspberries (plus extra to garnish)",
    "150g pomegranate seeds",
    "1-2 tbs honey"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place half the watermelon in the blender or food processor, along with half the raspberries, pomegranate seeds, and mint leaves. Process to a liquid and pour into a large bowl. Blend the remaining watermelon, raspberries, pomegranate seeds, and mint, and combine with the first batch of liquid. (Working in batches prevents the blender or food processor from overflowing.)"
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the resulting liquid through a fine metal sieve and strain into a large bowl, pressing down with the back of a spoon to extract all the liquid from the pulp. Discard the pulp. If you are using seeded watermelon, also discard any fragments of seed."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Whisk in the honey as needed, depending on the sweetness of the watermelon. Remember that the sweetness will be dulled on freezing, and adjust according to your taste."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tip the liquid into the container and freeze. Remove from the freezer every 2 hours and use a metal fork to scrape the frozen sides back into the granita, crushing the resulting crystals as you go. Repeat three times, until it is completely frozen."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove from the freezer and put in the fridge for 30 minutes before serving. To serve, scrape out layers of crystals into individual serving bowls or glasses and garnish with extra raspberries, pomegranate seeds, and mint leaves."
    }
  ],
  "recipeNameId": "pomegranate-and-raspberry-granita",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/pomegranate-and-raspberry-granita"
  ],
  "totalTime": "PT15M",
  "updatedAt": "2022-11-27T10:17:17.998Z",
  "url": "https://www.woolworths.com.au/shop/recipes/pomegranate-and-raspberry-granita"
}
