{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-11-27T13:56:09.936Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Pork Kebabs With Chilli Mango Salad recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp442porkeb_024:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Skewer & kebab,Pork",
  "name": "Pork Kebabs With Chilli Mango Salad Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "American",
  "recipeId": "RGR35423",
  "recipeIngredient": [
    "250g pork fillets",
    "1 clove garlic, crushed",
    "2 small fresh hot red chillies, deseeded and finely chopped",
    "1 tbs fresh root ginger, finely chopped",
    "4 tbs olive oil",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "2 large mangoes",
    "1 lime, grated, zested and juiced",
    "1 small fresh hot red chilli, finely sliced"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Soak the skewers in cold water for 30 minutes. Using a sharp knife, remove any sinew from the pork. Cut each fillet in half lengthways, then cut each half across the grain into bite-sized pieces."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the marinade, mix together the garlic, chillies, ginger, and olive oil in a shallow dish. Add the pork, and turn to coat in the marinade. Season with salt and black pepper, and allow to marinate in the refrigerator for 1 hour."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat the barbecue or charcoal grill until hot. Thread the pieces of pork evenly onto the soaked skewers, and brush the grill with a little oil. Grill the pork kebabs over a low heat for about 10 minutes until cooked to your liking, brushing lightly with a little of the marinade while they are cooking. Remove the kebabs to a plate, cover with foil, and leave to rest in a warm place for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the chilli mango salad, peel the mangoes and cut in half (as close as possible to the stone as you can). Cut each half lengthways into thin slices. Put the mango slices in a bowl, add the lime zest and juice, and the chilli, and season with black pepper. Stir gently to mix. Arrange 3 kebabs in the centre of each of 4 serving plates, on top of the chilli mango salad."
    }
  ],
  "recipeNameId": "pork-kebabs-with-chilli-mango-salad",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/pork-kebabs-with-chilli-mango-salad"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-27T13:56:09.934Z",
  "url": "https://www.woolworths.com.au/shop/recipes/pork-kebabs-with-chilli-mango-salad"
}
