{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "44",
    "ratingValue": "4.71"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT80M",
  "createdAt": "2022-11-29T13:20:22.000Z",
  "datePublished": "2016-06-13T15:43:10+00:00",
  "description": "Pressure Cooker Chicken and Rice is an easy and flavorful four-ingredient dinner that leaves zero waste. Slow cooker instructions included.",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2016/06/Pressure-Cooker-Chicken-and-Rice-diagonal-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/06/Pressure-Cooker-Chicken-and-Rice-diagonal-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/06/Pressure-Cooker-Chicken-and-Rice-diagonal-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/06/Pressure-Cooker-Chicken-and-Rice-diagonal-1-480x270.jpg"
  ],
  "keywords": "easy, gluten free, Pressure Cooker",
  "name": "Pressure Cooker Chicken and Rice",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "454.13 kcal",
    "carbohydrateContent": "54.4 g",
    "fatContent": "5.78 g",
    "fiberContent": "0.08 g",
    "proteinContent": "42.2 g",
    "servingSize": "1 Serving",
    "sodiumContent": "154.48 mg"
  },
  "prepTime": "PT15M",
  "recipeIngredient": [
    "1 whole split chicken (3-4 lbs. total) ($10.79)",
    "2 Tbsp (approx.) seasoning blend of choice* ($0.60)",
    "2 cups water ($0.00)",
    "1.5 cups long grain white rice ($0.72)",
    "Handful parsley (optional) ($0.20)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Season the chicken well on both sides with your favorite spice or seasoning blend. If your sblend blend does not contain salt, season the chicken liberally with salt as well."
    },
    {
      "@type": "HowToStep",
      "text": "Add two cups of water to your pressure cooker or slow cooker, then add the chicken pieces (they do not need to be fully submerged)."
    },
    {
      "@type": "HowToStep",
      "text": "Secure the lid, set the pressure cooker to high pressure. Once it reaches full pressure, cook for 30 minutes. Allow the pressure to release naturally. If using a slow cooker, cook on low heat for 8-9 hours or high heat for 4-5 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Once the chicken is finished cooking, carefully lift it out of the cooker and place it on a baking sheet. Adjust your oven rack so that the top of the meat will be 6-8 inches from the broiler. Turn the broiler on to high, place the chicken in the oven, and let it broil for 5-7 minutes or until the chicken skin is brown and crispy. Keep a close eye on the chicken while it's under the broiler, as it can burn quickly."
    },
    {
      "@type": "HowToStep",
      "text": "While the chicken is broiling, pour the remaining liquid (broth) from the pressure cooker through a sieve to strain out any bone or skin fragments. Measure the broth to see how much was left behind. You'll want three cups of broth. If you have less, simply add enough water to make three cups of broth total. Taste the broth and adjust the salt if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add the broth plus 1.5 cups of uncooked long grain white rice back to the pressure cooker. Secure the lid and select the rice function. Once the rice had finished cooking, allow the pressure to decrease naturally, open the cooker, then fluff with a fork. If your pressure cooker does not have a \"rice\" function, you can find manual instructions here. If using a slow cooker, simply cook the rice in the broth on the stove top, following the package instructions."
    },
    {
      "@type": "HowToStep",
      "text": "Serve the tender chicken pieces over the cooked rice, with chopped parsley as a garnish (optional). The pressure cooker (or slow cooker) creates extremely tender meat, so the split chicken can be easily broken into pieces (breast, legs, thighs, wings) for serving."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/pressure-cooker-chicken-rice"
  ],
  "totalTime": "PT95M",
  "updatedAt": "2022-11-29T12:27:36.875Z"
}
