{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-12-04T20:52:59.725Z",
  "datePublished": "2022-08-03",
  "description": "These German breads are great fun to make, and the two-stage glazing method gives an authentic chewy result.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/famkit445pretze_032:Square-1300x1300"
  ],
  "keywords": "Snack",
  "name": "Pretzels Recipe | Woolworths",
  "prepTime": "PT50M",
  "recipeCuisine": "American",
  "recipeId": "RGR17610",
  "recipeIngredient": [
    "1 tsp salt",
    "2 tbs sunflower oil (save 1 tbs for greasing)",
    "2 tbs coarse sea salt",
    "350g strong white bread flour",
    "150g plain flour",
    "2 tbs caster sugar",
    "2 tsp dried yeast",
    "4 tsp bicarbonate of soda",
    "1 egg, lightly beaten"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the 2 types of flour, salt, and sugar into a bowl. Sprinkle the yeast over 300ml of warm water. Stir, leave for 5 minutes, then add the oil. Gradually pour into the flour, stirring to form a soft dough."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Knead for 10 minutes until soft and pliable. Put in an oiled bowl. Cover loosely with cling film and leave in a warm place for 1-2 hours until nearly doubled in size. Turn out onto a floured work surface, and gently knock it back."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "With a sharp knife, cut the dough into 16 equal pieces. Take each piece and roll it to make a log shape. Continue to roll the dough towards each end, until it is 45cm long."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Take each end of the dough and cross it over the other, forming a heart shape. Now twist the ends around each other as though they had linked arms."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Secure the ends to the sides of the pretzel. Repeat to make 16, placing them on baking sheets lined with parchment. Cover with cling film and a tea towel. Leave in a warm place for 30 minutes to puff."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 200°C (Gas 6). Mix the soda in 2 tbs boiling water. Brush the pretzels with the mixture. This gives them a dark colour and chewy exterior. Scatter flakes of sea salt or sesame seeds over the brushed pretzels. Bake for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove from the oven and brush with beaten egg. Bake for 5 minutes. Remove from the oven; they should be shiny. Let cool on a wire rack for at least 5 minutes before serving."
    }
  ],
  "recipeNameId": "pretzels",
  "recipeYield": "16",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/pretzels"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-04T20:52:59.724Z",
  "url": "https://www.woolworths.com.au/shop/recipes/pretzels"
}
