{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-04T01:57:14.458Z",
  "creator": {
    "@type": "Person",
    "name": "Lauren Ko"
  },
  "dateCreated": "2020-11-10T17:16:07-05:00",
  "dateModified": "2020-11-17T09:14:57-05:00",
  "datePublished": "2020-11-10T17:16:07-05:00",
  "description": "Nutty black sesame makes this twist on a very traditional pie nothing short of a show-stopper.",
  "headline": "Pumpkin Black Sesame Pie",
  "HowtoTip": {
    "text": "Storage: This pie does not freeze well. Store any leftovers well sealed in the refrigerator and consume within 3 days.From Pieometry: Modern Tart Art and Pie Design for the Eye and the Palate by Lauren Ko. Copyright © 2020 by Lauren Ko. Reprinted by permission of William Morrow, an imprint of HarperCollins Publishers."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FLarge%20Packages%2F2020-11-FoodFest%2F2020-11-pumpkin-black-sesame-pie%2FKitchn_Holiday_7"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FLarge%20Packages%2F2020-11-FoodFest%2F2020-11-pumpkin-black-sesame-pie%2FKitchn_Holiday_7"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FLarge%20Packages%2F2020-11-FoodFest%2F2020-11-pumpkin-black-sesame-pie%2FKitchn_Holiday_7"
    }
  ],
  "keywords": [
    "baked goods",
    "dessert",
    "kid-friendly",
    "Make Ahead",
    "pie",
    "pumpkin",
    "recipe",
    "thanksgiving",
    "Thanksgiving Food Fest 2020",
    "team:food",
    "purpose:instagram",
    "platform:social",
    "course:dessert",
    "dishtype:pie",
    "dishtype:baked good",
    "cuisine:north america",
    "cuisine:united states",
    "timing:extended",
    "occasion:party format",
    "occasion:thanksgiving",
    "occasion:autumn",
    "occasion:dinner party",
    "occasion:party",
    "occasion:friendsgiving",
    "mainingredients:flour",
    "mainingredients:dairy",
    "mainingredients:pantry",
    "mainingredients:sugar",
    "method:baked",
    "updated:2020-11-17"
  ],
  "name": "Pumpkin Black Sesame Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "295 cal",
    "carbohydrateContent": "30.6 g",
    "cholesterolContent": "0 mg",
    "fatContent": "17.1 g",
    "fiberContent": "1.2 g",
    "proteinContent": "5.8 g",
    "saturatedFatContent": "9.3 g",
    "servingSize": "Serves 16",
    "sodiumContent": "223.6 mg",
    "sugarContent": "14.4 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dessert",
  "recipeCuisine": "North america",
  "recipeIngredient": [
    "1 cup ice",
    "1 cup cold water",
    "2 tablespoons apple cider vinegar",
    "2 1/2 cups all-purpose flour",
    "1/4 cup black sesame seeds",
    "1 tablespoon granulated sugar",
    "1 teaspoon kosher salt",
    "1 cup cold unsalted butter, cut into 1/2-inch cubes",
    "1 (15-ounce) can pumpkin purée (not pumpkin pie filling)",
    "1 (14-ounce) can sweetened condensed milk",
    "2 large eggs",
    "1 teaspoon ground cinnamon",
    "1/2 teaspoon ground ginger",
    "1/2 teaspoon grated nutmeg",
    "1/4 teaspoon ground cloves",
    "1/4 teaspoon ground allspice",
    "1/2 teaspoon kosher salt",
    "3 tablespoons black tahini"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine the ice, water, and apple cider vinegar in a medium bowl. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Put the flour, sesame seeds, sugar, and salt in a large bowl and stir with a spatula to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle in the butter cubes and toss until each cube is coated in the flour mixture."
    },
    {
      "@type": "HowToStep",
      "text": "Flatten each cube of butter with your pointer fingers and thumbs. Toss again to coat the flattened butter pieces. Continue massaging the butter into the flour until the remaining shards resemble cornflakes in a range of sizes."
    },
    {
      "@type": "HowToStep",
      "text": "Add 4 tablespoons of the cold vinegar-water mixture, taking care not to include any ice, and fluff the moisture through the flour with a spatula. Continue adding liquid 1 tablespoon at a time, pressing the dough with a spatula after each addition until it begins to come together. Avoid any heavy kneading, as overworking the dough will lead to a tough crust."
    },
    {
      "@type": "HowToStep",
      "text": "If the dough still has quite a bit of dry mix and doesn’t hold together when a handful is squeezed, add a little more liquid. Be careful not to add too much water (usually 6 to 10 tablespoons total are sufficient). The dough should be smooth and supple. If the dough is quite tacky, you’ve likely added too much liquid. Try gently incorporating a little more flour. If it is still very sticky, I suggest starting over with a new batch of ingredients. Overly hydrated dough will be difficult to roll out and utilize in these designs, and the crust will likely be tough when baked."
    },
    {
      "@type": "HowToStep",
      "text": "When the dough begins to hold together, turn it out onto your work surface and divide it into two portions. Gently form each into a rounded mound with your hands. Wrap each mound tightly in plastic, then gently press each one into a round, flat disk, about 5 inches in diameter and 1 inch in thickness. Refrigerate for at least 3 hours or overnight before rolling. Resting the dough in the fridge allows the gluten to relax and the dough to fully hydrate, and prevents shrinkage during baking. If you plan to freeze the pie dough, do so only after the rest period of at least 3 hours in the fridge."
    },
    {
      "@type": "HowToStep",
      "text": "On a floured surface, roll 1 dough disk into a 14-inch circle. Roll the dough onto the rolling pin and unfurl it over a 9-inch pie pan. Taking the edges of the dough, gently ease the dough into the pan, nestling it into the inner elbows of the pie pan. Trim the excess dough with kitchen shears to create a 1-inch overhang. Fold the overhang back under, creating an elevated edge. Crimp the dough all the way around the pie edge."
    },
    {
      "@type": "HowToStep",
      "text": "Freeze the pie shell solid, about 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°F."
    },
    {
      "@type": "HowToStep",
      "text": "To blind-bake, line the pie shell tightly with foil. Fill to the top with pie weights and place on a rimmed baking sheet. Bake for 25 to 27 minutes, until the foil no longer sticks to the dough. Remove the foil and pie weights and bake until the crust is crisp and opaque, 10 to 15 minutes. Leave the oven on at 350°F and proceed with preparing the filling."
    },
    {
      "@type": "HowToStep",
      "text": "In a large bowl. Combine the pumpkin purée, condensed milk, eggs, cinnamon, ginger, nutmeg, cloves, allspice, and salt. Whisk well."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop 1 cup of the pumpkin mixture into a small bowl and add the black tahini. Whisk well."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pie pan on a rimmed baking sheet. Spread the pumpkin black tahini mixture evenly in the pie shell. Gently spoon the pumpkin filling on top to make a second layer and jiggle the pie slightly to smooth the surface. Use a paring knife to poke away any bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the pie until the filling is just set, 40 to 50 minutes, covering the edges with a shield as necessary. The center of the pie should retain a slight jiggle."
    },
    {
      "@type": "HowToStep",
      "text": "While the pie is baking, on a floured surface, roll the second dough disk into a 12-inch square. Roll the dough onto the rolling pin and unfurl it onto a sheet or parchment paper. Using a 1-inch square cutter, punch out at least 40 squares and place them on a separate sheet of parchment. (Alternatively, using a pastry roller or a paring knife, cut the dough into 40 1-inch squares.)"
    },
    {
      "@type": "HowToStep",
      "text": "Cut each square into quarters on the diagonals with a paring knife to create four isosceles triangles. Arrange the triangles on the parchment so they are not touching."
    },
    {
      "@type": "HowToStep",
      "text": "Slide a flat baking sheet under the parchment and chill the dough in the refrigerator for at least 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the dough triangles (still at 350°F) for 10 to 15 minutes, until crisp."
    },
    {
      "@type": "HowToStep",
      "text": "When the pie and triangles have cooled slightly, lay a ruler horizontally across the center of the pie, resting on the pie crust edges. Starting from the left edge of the pie, line the long side of one baked triangle against the ruler and place another piece in its mirror image above it. Moving right, place two more triangles like the first two but rotated 90 degrees. Repeat the configuration of the first two triangles and continue down the row two triangles at a time, alternating the placement."
    },
    {
      "@type": "HowToStep",
      "text": "When the first row has been completed, lay a second row of triangles below, staggering the placement. While all the triangles should touch corners, the sides of the triangles should align only with the pumpkin pie negative space. Continue placing triangles row by row until the entire surface of the pie has been covered."
    },
    {
      "@type": "HowToStep",
      "text": "Serve the pie chilled or at room temperature."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/pumpkin-black-sesame-pie-recipe-23101243"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FLarge%20Packages%2F2020-11-FoodFest%2F2020-11-pumpkin-black-sesame-pie%2FKitchn_Holiday_7",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-04T01:57:14.456Z",
  "url": "https://www.thekitchn.com/pumpkin-black-sesame-pie-recipe-23101243"
}
