{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Produced for Woolworths"
  },
  "cookTime": "PT65M",
  "createdAt": "2022-11-26T13:26:38.083Z",
  "datePublished": "2022-08-03",
  "description": "Pumpkin replaces half the potatoes in this slightly sweet and indulgent gnocchi dish.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/pumpkin-sage-and-walnut-gnocchi:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Gnocchi,Egg,Pumpkin,Potato",
  "name": "Pumpkin, Sage & Walnut Gnocchi Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "Italian",
  "recipeId": "RGWW338599",
  "recipeIngredient": [
    "1.2kg pumpkin, cut in quarters, seeds removed",
    "600g potatoes",
    "150g plain flour",
    "0.5 tsp nutmeg",
    "3 eggs, 1 lightly beaten, 2 yolks",
    "5 tbs olive oil",
    "80g butter",
    "1 bunch sage, leaves picked",
    "50g walnuts, chopped",
    "60g parmesan, grated"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Pre-heat the oven to 200°C/180°C fan-forced. Place the pumpkin and potatoes on a baking tray and roast for 45 minutes or until both are tender. Remove from the oven, scoop the flesh of the pumpkin in to a bowl and place in the fridge to chill."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Scoop the potato flesh from the skins and pass through a ricer or food mill and in to a large bowl. Place the pumpkin in a large, clean tea towel, wrap tightly and wring out any excess moisture over the sink. Add to the bowl with the potatoes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tip the flour and nutmeg into the bowl with the potato and pumpkin, add the beaten egg and 2 egg yolks and gently mix with your hands to form a dough. Lightly flour baking trays, fill a large pot with water and bring to a rolling boil. Shape the gnocchi mix with two spoons and place on the floured baking trays."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Reduce the heat to a gentle simmer and drop the gnocchi into the pan, working in batches. Cook for 2-3 minutes until they float to the top, remove with a slotted spoon and drain well."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat a third of the oil and butter in a large pan over a medium high heat and cook until the butter begins to foam. Add the sage and walnuts and cook for 2 minutes, remove with a slotted spoon and set aside. Add a third of the gnocchi and cook for 2-3 minutes until golden. Repeat with the remaining oil, butter and gnocchi in 3 batches."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the gnocchi in a large bowl and cover with foil to keep warm Repeat with the remaining oil, butter and gnocchi, cooking in 3 batches. Add the walnuts and sage in to the bowl, mix well and serve divided between 4 bowls with grated parmesan on top."
    }
  ],
  "recipeNameId": "pumpkin-sage-and-walnut-gnocchi",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/pumpkin-sage-and-walnut-gnocchi"
  ],
  "totalTime": "PT105M",
  "updatedAt": "2022-11-26T13:26:38.083Z",
  "url": "https://www.woolworths.com.au/shop/recipes/pumpkin-sage-and-walnut-gnocchi"
}
