{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Sam Turnbull • It Doesn't Taste Like Chicken"
  },
  "cookTime": "PT6M",
  "createdAt": "2022-12-01T09:52:47.926Z",
  "datePublished": "2022-03-23T05:00:44+00:00",
  "description": "This quick and easy vegan bacon recipe is crispy, chewy, smoky delicious, and made with just 6 ingredients! Tofu strips are marinated in a salty, sweet, smoky marinade that tastes just like bacon. This tofu bacon can marinate in the fridge for up to 3 days so you can prep this ahead of time, and cook it up fresh. Cook it in your air-fryer, bake it, or pan fry it. Perfect for a stress-free morning. It’s so easy-peasy you’re gonna love it!",
  "image": [
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2022/03/quick-easy-vegan-bacon-recipe-tofu.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2022/03/quick-easy-vegan-bacon-recipe-tofu-500x500.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2022/03/quick-easy-vegan-bacon-recipe-tofu-500x375.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2022/03/quick-easy-vegan-bacon-recipe-tofu-480x270.jpg"
  ],
  "keywords": "bacon, easy, quick, tofu, vegan",
  "name": "Quick & Easy Vegan Bacon (made with tofu)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "23 kcal",
    "carbohydrateContent": "3 g",
    "fatContent": "1 g",
    "fiberContent": "1 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 vegan bacon strip (recipe makes 20 strips)",
    "sodiumContent": "315 mg",
    "sugarContent": "2 g",
    "unsaturatedFatContent": "2 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "6 tablespoons soy sauce (gluten-free if preferred)",
    "3 tablespoons maple syrup",
    "1 1/2 teaspoons smoked paprika",
    "1 teaspoon garlic powder",
    "3/4 teaspoon liquid smoke",
    "1 (350g/ 12.3oz) block extra-firm tofu (drained and sliced into thin strips (see notes)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Marinate the tofu: In a small bowl mix together the soy sauce, maple syrup, smoked paprika, garlic powder, and liquid smoke. Add the tofu to a sealable container or bag (make sure the container or bag is secure enough that you can flip it upside down without any liquid leaking out). Pour the marinade over the tofu, and gently turn the container or bag to coat the tofu. Let marinate for a minimum of 15 minutes or up to 3 days in the fridge. If you are marinating it for a long time, I like to flip the container every now and then to ensure it marinates evenly. The longer you marinate it, the more flavorful it will become."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the bacon: to cook the vegan bacon you can either pan fry it, air fry it, or bake it. Pan-fry method: heat 1 - 2 tablespoons of oil in a skillet or non-stick frying pan over medium heat. When hot gently add the marinated tofu slices in a single layer, working in batches. Fry 2 - 4 minutes per side until dark golden brown. Flip and repeat on the other side. Cook the tofu on a lower heat and for longer to ensure it gets crispy. Drain on paper towel, the tofu will crisp up and become chewier as it cools. Air Fry method (my fave): preheat your air fryer to 400F (200C). Lightly grease the air fryer basket with a bit of spray oil. Add the tofu slices in a single layer working in batches if needed, and spray the tops with a bit of spray oil. (Omit the oil for oil-free). Air fry for about 6 minutes until the tofu has reduced in size and is golden brown. It will crisp and get chewy as it cools.Oven method: preheat your oven to 425F (220C). Lightly grease a baking sheet or line it with parchment paper. Lay the tofu in a single layer on the baking sheet, using two baking sheets if needed. Bake for 7 - 12 minutes, keeping a close eye on it, until the tofu has reduced in size and is golden brown. It will crisp and get chewy as it cools."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://itdoesnttastelikechicken.com/quick-easy-vegan-bacon-tofu"
  ],
  "totalTime": "PT26M",
  "updatedAt": "2022-12-01T09:52:47.925Z"
}
