{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "25",
    "ratingValue": "4.96"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-12-03T23:03:19.860Z",
  "datePublished": "2016-09-04T05:00:55+00:00",
  "description": "An incredibly satisfying, healthy, nutrient-rich Buddha bowl with steamed kale, from-scratch chickpeas, quinoa, and 3-ingredient tahini sauce! Just 7 ingredients required for this delicious plant-based meal.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/08/Chickpea-Quinoa-Buddha-Bowl-SQUARE.jpg"
  ],
  "keywords": "chickpea buddha bowl",
  "name": "Quinoa Chickpea Buddha Bowl",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "572 kcal",
    "carbohydrateContent": "68.8 g",
    "fatContent": "25.4 g",
    "fiberContent": "15.1 g",
    "proteinContent": "22 g",
    "saturatedFatContent": "3.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "414 mg",
    "sugarContent": "5.5 g"
  },
  "prepTime": "PT65M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup dry chickpeas",
    "Water",
    "1/2 tsp sea salt",
    "1 Tbsp olive, grapeseed, or avocado oil (or coconut)",
    "1 cup white quinoa (well rinsed)",
    "1 3/4 cup water",
    "1 healthy pinch sea salt",
    "1 large bundle curly (dinosaur) kale (rinsed and torn into large pieces)",
    "1/2 cup tahini (raw or roasted)",
    "1/4 tsp sea salt",
    "1/4 tsp garlic powder",
    "1/4 cup water",
    "Fresh lemon juice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Either soak chickpeas overnight in cool water (for 6-8 hours) or use the quick-soak method: Add rinsed chickpeas to a large pot and cover with 2 inches water. Bring to a boil over high heat and boil for 1 minute. Then turn off heat, cover, and let soak for 1 hour. Then drain, rinse, and add back to pot."
    },
    {
      "@type": "HowToStep",
      "text": "To cook soaked chickpeas, add to a large pot and cover with 2 inches water. Bring to a boil over high heat, then reduce heat to a simmer, add salt and stir, and cook uncovered for 40 minutes - 1 hour 20 minutes (depending on the size/freshness of your beans)."
    },
    {
      "@type": "HowToStep",
      "text": "Sample a bean at the 40-minute mark to see how tender they are. You're looking for a just tender bean with a tiny bit of bite, and the skins will start to show signs of peeling (don't go too mushy!). Once cooked, drain beans and set aside and sprinkle with a bit more salt."
    },
    {
      "@type": "HowToStep",
      "text": "In the last 30 minutes of the beans cooking, start your quinoa by heating a medium saucepan over medium heat. Once hot, add oil and rinsed quinoa. Toast for 2-3 minutes, stirring frequently. This will allow some of the water to evaporate and add a nice toasty flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Add water and increase heat to medium-high/high to bring to a boil. Once boiling, reduce heat to low (simmer), cover, and cook for 18-22 minutes, or until the quinoa is tender and the water has completely absorbed. Then remove from heat and loosely drape the pot with a towel or paper towel to continue absorbing any excess moisture."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare dressing by adding tahini, sea salt and garlic powder to a small mixing bowl and whisking to combine. Then add water a little at a time until it forms a pourable sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, steam kale. Add 1/2 inch water to a medium saucepan and bring to a simmer over medium heat. Insert a steamer basket and the kale and cover. Steam for 1-2 minutes, or until kale is vibrant in color and slightly wilted. Immediately remove the kale from the heat and transfer to a small dish for serving."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, divide quinoa, chickpeas and kale between serving bowls and top with tahini sauce. Add a splash of fresh lemon juice for more flavor and a bit of acidity (highly recommended)."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh, though leftover sauce, quinoa, and chickpeas can be stored separately in the refrigerator up to 4 days. Kale is best when (steamed) fresh."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/quinoa-chickpea-buddha-bowl"
  ],
  "totalTime": "PT140M",
  "updatedAt": "2022-12-03T23:03:19.859Z"
}
