{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "39",
    "ratingValue": "4.83"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT105M",
  "createdAt": "2022-11-29T09:04:31.000Z",
  "datePublished": "2021-12-15T09:51:23+00:00",
  "description": "These stuffed vegan cabbage rolls are stuffed with a savory, smoky mixture of quinoa and lentils, then baked up in tomato sauce until piping hot. A delicious and healthy main dish that&#39;s perfect for special occasions!",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2021/12/vegan-cabbage-rolls-sq-1-of-2.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2021/12/vegan-cabbage-rolls-sq-1-of-2-500x500.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2021/12/vegan-cabbage-rolls-sq-1-of-2-500x375.jpg",
    "https://www.connoisseurusveg.com/wp-content/uploads/2021/12/vegan-cabbage-rolls-sq-1-of-2-480x270.jpg"
  ],
  "keywords": "healthy stuffed cabbage, vegan stuffed cabbage",
  "name": "Quinoa & Lentil Stuffed Vegan Cabbage Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "341 kcal",
    "carbohydrateContent": "59.8 g",
    "fatContent": "6 g",
    "fiberContent": "16.7 g",
    "proteinContent": "16.6 g",
    "saturatedFatContent": "0.9 g",
    "servingSize": "2 cabbage rolls (1/4 of recipe)",
    "sodiumContent": "719 mg",
    "sugarContent": "17.4 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Polish",
  "recipeIngredient": [
    "1 large head of green cabbage*",
    "3/4 cup dried brown lentils**",
    "1/2 cup uncooked quinoa***",
    "1 cup vegetable broth",
    "1 small onion, (diced)",
    "1 tablespoon olive oil",
    "1 tablespoon red wine vinegar",
    "2 tablespoons soy sauce or tamari",
    "1 teaspoon smoked paprika",
    "2 tablespoons oat flour, (optional, for binding)",
    "1 (28 ounce or 800 gram) can tomato puree",
    "1 tablespoon maple syrup, (or sweetener of choice)",
    "1 1/2 teaspoons red wine vinegar",
    "Salt and pepper to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place about 3 inches of water into a large pot and add the entire head of cabbage stem side down."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pot over high heat, bring the water to a boil, lower the heat and and cover. Allow the cabbage to steam until leaves peel off easily, about 20 minutes. Remove the pot from heat and allow the cabbage to cool for a few minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the cabbage steams, begin preparing the filling. Place the lentils in a saucepan and cover them with a few inches of water. Place the pot over high heat."
    },
    {
      "@type": "HowToStep",
      "text": "Bring the water to a boil, lower the heat and allow the lentils to simmer until they're are just fully cooked (not mushy), about 25 minutes, adding water to the pot as needed. When the lentils are finished cooking, drain any excess liquid."
    },
    {
      "@type": "HowToStep",
      "text": "While the lentils simmer, place the broth into a small saucepan and add the quinoa. Place the pot over high heat and bring the broth to a boil."
    },
    {
      "@type": "HowToStep",
      "text": "Lower the heat, cover the pot and allow the liquid to simmer until all of the water is absorbed, about 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pot from heat and allow it to sit with the lid on for 5 minutes before taking it off and fluffing the quinoa with a fork."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large skillet with the oil and place it over medium heat. Add the onion and cook it until soft and translucent, about 5 minutes, stirring frequently."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 1/2 cups of the cooked lentils and 1 cup of the cooked quinoa (you'll have just a bit of each leftover), along with red wine vinegar, soy sauce, smoked paprika, salt and pepper to taste. Add oat flour at this time if using. Flip the mixture a few times just to combine the ingredients, then remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°."
    },
    {
      "@type": "HowToStep",
      "text": "Stir all sauce ingredients together in a small bowl, then distribute about 1/2 cup of the sauce into the bottom of 9 x 9 inch (or similarly sized) baking dish."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully peel a leaf off of the cabbage head and place it onto a work surface with the stem side facing you. Trim any very thick portions of the leaf near the base."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon 3 to 4 tablespoons of filling onto the center of the leaf. Fold the base side over the filling, then wrap the sides inward over the filling. Roll the center away from you to wrap everything up. Place the roll, seam side down, into the baking dish. Repeat until all of the filling is used (you'll get about 8 rolls)."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon the remaining sauce over the rolls, cover and bake for 1 hour. The sauce should be bubbly when the cabbage rolls are done baking."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the dish from the oven and allow the rolls to cool for a few minutes before serving."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://connoisseurusveg.com/quinoa-lentil-stuffed-vegan-cabbage-rolls"
  ],
  "totalTime": "PT135M",
  "updatedAt": "2022-11-29T05:48:17.156Z"
}
