{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-04T08:02:47.937Z",
  "creator": {
    "@type": "Person",
    "name": "Paula Disbrowe"
  },
  "dateCreated": "2019-05-29T05:30:46-04:00",
  "dateModified": "2021-06-16T22:30:41-04:00",
  "datePublished": "2019-05-29T05:30:46-04:00",
  "description": "Paula Disbrowe&#x27;s answer to a better grain salads this summer is fresh vegetables and smoked grains. ",
  "headline": "Quinoa &amp; Carrot Salad with Meyer Lemon Vinaigrette",
  "HowtoTip": {
    "text": "Reprinted with permission from Thank You for Smoking: Fun and Fearless Recipes Cooked with a Whiff of Wood Fire on Your Grill or Smoker by Paula Disbrowe, copyright © 2019. Published by Ten Speed Press, an imprint of Penguin Random House."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FEdit%2Fquinoaandcarrotsalad"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FEdit%2Fquinoaandcarrotsalad"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FEdit%2Fquinoaandcarrotsalad"
    }
  ],
  "keywords": [
    "Cookbook Recipe",
    "grilling",
    "Pinterest",
    "recipe",
    "salad dressing",
    "salad",
    "dishtype:salad dressing",
    "dishtype:salad",
    "diet:low-calorie",
    "diet:under 400 calories",
    "diet:low-fat",
    "diet:under 500 calories",
    "updated:2021-06-16"
  ],
  "name": "Quinoa & Carrot Salad with Meyer Lemon Vinaigrette",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "386 cal",
    "carbohydrateContent": "72.0 g",
    "cholesterolContent": "0 mg",
    "fatContent": "5.6 g",
    "fiberContent": "11.2 g",
    "proteinContent": "14.0 g",
    "saturatedFatContent": "0.7 g",
    "servingSize": "Serves 4",
    "sodiumContent": "117.9 mg",
    "sugarContent": "7.8 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Salad dressing",
  "recipeCuisine": [],
  "recipeIngredient": [
    "3 cups (710 ml) water",
    "2 cups (340 g) smoked tricolor quinoa (instructions for smoked grains follow below)",
    "Kosher salt",
    "2 bunches young carrots (preferably a mix of colors), with greens",
    "Extra-virgin olive oil, for drizzling",
    "Freshly ground black pepper",
    "3 green onions",
    "Finely grated zest and juice of 1 Meyer lemon",
    "Handful of arugula or 1/3 cup (15 g) chopped fresh flat-leaf parsley"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare a charcoal grill for two-zone cooking and build a medium fire, or heat a gas grill to medium-high. When the coals are glowing red and covered with a fine gray ash, add your smoke source (chips, chunks, or log). Carefully wipe the preheated grill grates with a lightly oiled paper towel. Using a grill brush, scrape the grill grates clean, then carefully wipe with a lightly oiled towel again. If you’re using a grill basket, allow it to preheat for 5 minutes before cooking."
    },
    {
      "@type": "HowToStep",
      "text": "While the grill heats, cook the quinoa on the stovetop. Bring the water to a boil in a saucepan over medium-high heat and add the quinoa and a pinch of salt. Turn the heat to low, cover the pan, and simmer for 15 minutes. Remove the pan from the heat and let the quinoa sit, covered, for 10 minutes, until the grains are tender and have absorbed all the liquid, then uncover the pan and let the quinoa cool briefly."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, trim the carrots, leaving a small portion of the green stem intact and reserving the nicest fronds. Place the carrots in a large bowl, drizzle with enough olive oil to coat, season generously with salt and pepper, and toss to combine. Remove the fronds from the stems, rinse and dry and then coarsely chop until you have about 1/4 cup (10 g); set aside."
    },
    {
      "@type": "HowToStep",
      "text": "When the fire begins to produce a steady stream of smoke, place the carrots and green onions in the grill basket over direct heat and cover the grill. Open the lid every minute or so to turn the carrots and onions and rotate the pan around the heat as needed to prevent burning, until the vegetables are nicely charred and just tender, about 5 minutes for the green onions and 20 minutes for the carrots. Use tongs to transfer the vegetables as they finish cooking to a cutting board to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Slice the carrots as desired and add them to a large bowl with the quinoa, Meyer lemon zest and juice, and a generous drizzle of olive oil. Trim the stems from the green onions, chop, and add to the quinoa with the arugula and carrot fronds. Toss to combine. Season with salt and pepper to taste, and serve warm or at room temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare a charcoal grill for two-zone cooking and build a medium-high fire, or heat a gas grill to high."
    },
    {
      "@type": "HowToStep",
      "text": "When the coals are glowing red and covered with a fine gray ash, remove the cooking grate and place a drip pan with 1 inch (2.5 cm) of warm water on the side with no coals, and add your smoke source (chips, chunks, or log). Return the cooking grate to its position, allow it to preheat, and then carefully wipe the grates with a lightly oiled paper towel. Using a grill brush, scrape the grill grates clean, then carefully wipe with a lightly oiled towel again."
    },
    {
      "@type": "HowToStep",
      "text": "Place the grains in a disposable aluminum pan or atop two sheets of heavy-duty aluminum foil (crimp the edges of foil upward to create a rim and prevent the grains from sliding off)."
    },
    {
      "@type": "HowToStep",
      "text": "When the fire begins to produce a steady stream of smoke, place the grains over indirect heat, close the grill, vent the grill for smoking, and smoke for 15 to 30 minutes (depending on their size, density, and the heat), until they’ve darkened a few shades, typically from the perimeter of the pan inward (which is why you want to stir them a time or two for even results). The smoking time is a general guide and assumes an internal temperature of around 300°F (150°C), but if the heat in your grill fluctuates, or, say, you’re battling the elements, use your eyes and nose as a guide. If the grains are tinged with color and have a rich smoky smell at 20 minutes, pull them. If they’re still pale after 30 minutes, give them another 10 minutes over the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the grains from the grill and let them cool and dry completely. At this point, they’re ready to be prepared as you normally would — no need to adjust the usual cooking methods. In the meantime, store in a cool, dry place in an airtight container for up to 2 months."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/grilled-quinoa-carrot-salad-22900081"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowFatDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FEdit%2Fquinoaandcarrotsalad",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-04T08:02:47.936Z",
  "url": "https://www.thekitchn.com/grilled-quinoa-carrot-salad-22900081"
}
