{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-24T08:45:23.000Z",
  "datePublished": "2022-09-26",
  "description": "Medium is considered the best way to cook a rack of lamb, with the meat at its most succulent. The breadcrumbs mixed with parsley give a crisp finish to this dish.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/meacoo204raclam_026:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Roast lamb,Lamb",
  "name": "Rack Of Lamb With Parsley Crumb Recipe | Woolworths",
  "prepTime": "PT35M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "Australian",
  "recipeId": "RGR11043",
  "recipeIngredient": [
    "2 tbs olive oil",
    "1 pinch salt",
    "1 bunch flat-leaf parsley, leaves only, finely chopped",
    "0.5 cup white wine",
    "1 pinch freshly ground black pepper",
    "1.5-2kg lamb, each, chine bones removed",
    "2 cloves garlic, cut into slivers",
    "4 slices white bread, crusts removed",
    "45g butter",
    "1 cup lamb, chicken stock",
    "0.5 tbs corn flour, mixed with a little warm water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 230°C (Gas 8). French trim both the racks of lamb. Then make several incisions in the meat using the sharp point of a knife and push the garlic slivers into the slits. Transfer the racks to a large roasting tin and place them with the ribs facing down. Wrap the bones in foil to prevent them from burning. Spoon the oil over the meat and sprinkle with salt and pepper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Roast the rack in the oven for 25-30 minutes, basting with the cooking juices at least twice, until the meat shrinks away from the bones and the internal temperature of the meat reaches 60°C."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the parsley crumb, place the bread in a food processor and pulse to form crumbs. Melt the butter in a frying pan, add the breadcrumbs, and cook for 2-3 minutes, stirring, until just golden. Stir in the parsley and season."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Transfer the racks to a chopping board. Discard the foil covering the bones, then cover the racks with more foil and set aside to rest. Set the grill at its highest setting."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the gravy, discard the fat from the roasting tin. Add the wine to the tin and boil until reduced by half, stirring to dissolve the roasting juices from the bottom of the tin. Add the stock and boil for 5-7 minutes, until the gravy is well flavored. Season to taste, strain, and keep warm. For a thicker gravy, add the corn flour to the sauce and mix well."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Press the breadcrumb mixture onto the top of the racks and baste with the roasting juices. Grill the racks, breadcrumb-side up, for 1-2 minutes until lightly browned, making sure the breadcrumb coating does not burn. Carve and serve on warmed plates with the gravy on the side."
    }
  ],
  "recipeNameId": "rack-of-lamb-with-parsley-crumb",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/rack-of-lamb-with-parsley-crumb"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-24T08:26:58.720Z",
  "url": "https://www.woolworths.com.au/shop/recipes/rack-of-lamb-with-parsley-crumb"
}
