{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Fresh Ideas"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-11-25T02:09:40.000Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Rainbow Icing Cake recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1510-rainbow-icing-cake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Celebration cake,Pescatarian,Seafood free,Soy free,Vegetarian,Tree nut free,Sesame free,Baking,Peanut free",
  "name": "Rainbow Icing Cake Recipe | Woolworths",
  "prepTime": "PT60M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "3996",
  "recipeIngredient": [
    "1.33 cup milk",
    "4-8 drops food colouring",
    "0.5 cup plain flour, sifted",
    "3 cup self-raising flour, sifted",
    "750g unsalted butter, softened (save 500g unsalted butter softened for buttercream icing)",
    "2 tsp vanilla extract",
    "6 cup icing sugar mixture (for buttercream icing)",
    "6 eggs, at room temperature",
    "2 cup caster sugar"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 180°C. Grease base and side of two 20cm round cake pans and line with baking paper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Use electric beaters to beat butter, sugar and vanilla until light and fluffy. Beat in eggs, 1 at a time. Stir in sifted flours and milk in two batches."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Divide batter among prepared pans and smooth tops. Bake for 50 minutes or until skewer comes out clean. Cool in pans for 10 minutes before turning out onto a wire rack to cool completely."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, for the buttercream, beat butter for 5-8 minutes until very light and fluffy. Gradually add icing sugar, a spoon at a time, beating until combined. Gradually beat in 1/4 cup boiling water, only adding enough to make the mixture light and fluffy."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Trim tops of cakes so that they are flat, then split the cakes in half horizontally. Place base of one cake layer on a plate and spread top with 1/2 cup buttercream. Top with another layer of cake. Repeat the process, finishing with upside-down base of second cake. Spread buttercream thinly over the sides of the cake, then spread a generous amount over the top."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Divide remaining buttercream between six small bowls. Use food colouring to shade each bowl of icing a different colour (we used red, orange, yellow, green, blue and violet). Transfer the coloured buttercream mixtures to six disposable piping bags, each fitted with a 1.5cm plain piping nozzle."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Working on the side of the cake, in vertical rows from bottom to top, pipe a single row of dots of each colour, each the size of a 10-cent piece. Use a small palette knife to smear each dot to the right to create a dragged effect, cleaning the palette knife after each colour. Start the next row using the last colour from the previous row (this creates a cascading, diagonal effect). Continue until the side of the cake is complete."
    }
  ],
  "recipeNameId": "rainbow-icing-cake",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/rainbow-icing-cake"
  ],
  "totalTime": "PT110M",
  "updatedAt": "2022-11-26T11:00:25.794Z",
  "url": "https://www.woolworths.com.au/shop/recipes/rainbow-icing-cake"
}
