{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-12-02T15:17:27.560Z",
  "datePublished": "2008-05-02T11:37:00+00:00",
  "description": "Rasedar Rajma is a homestyle kidney bean curry, with fresh ginger and garam masala. This vegan version can be sped up by using the pressure cooker or Instant Pot.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2008/05/rasedar-rajma-kidney-beans-curry.jpg"
  ],
  "name": "Rasedar Rajma (Kidney Beans in Curry Sauce)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "240 kcal",
    "carbohydrateContent": "44 g",
    "fatContent": "1 g",
    "fiberContent": "17 g",
    "proteinContent": "16 g",
    "servingSize": "1 serving",
    "sodiumContent": "386 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "2 cups dried kidney beans",
    "6 cups water",
    "1 tablespoon ginger root",
    "1 teaspoon salt",
    "1 onion (,minced)",
    "1 teaspoon garlic (, minced)",
    "1/2 teaspoon ajwain seeds or dried thyme",
    "2 cups tomatoes (, finely diced)",
    "1/4 cup unsweetened non-dairy yogurt (or soymilk thickened with 1 tsp. lemon juice)",
    "2 tablespoons ground coriander",
    "1 teaspoon ground fenugreek",
    "3/4 teaspoon turmeric",
    "1 teaspoon garam masala",
    "1/8 teaspoon red chilli pepper or cayenne (more to taste)",
    "chopped cilantro (optional garnish)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Rinse the kidney beans and put them in a large pot or pressure cooker along with 6 cups water, the ginger root, and the salt. Bring to a boil and boil for 1 minute. (In a pressure cooker, bring to high pressure and then remove from heat.)"
    },
    {
      "@type": "HowToStep",
      "text": "Remove from heat and allow the beans to rest, covered, for at least 1 hour. Drain the water, add another 6 cups of water, and bring to a boil. Simmer until beans are tender, about an hour. (Alternately, pressure cook the beans: bring to high pressure and cook for 8-10 minutes. Remove from heat and allow pressure to come down naturally.) When the beans are done, leave them in their cooking liquid while you make the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a non-stick saucepan over medium-high heat until hot. Add the minced onion, and cook until it’s beginning to brown, stirring constantly. Add the garlic and ajwain and stir for 1 minute. Add the tomatoes and cook until their liquid has evaporated, about 5 minutes. Stir in the non-dairy yogurt and the coriander, fenugreek, turmeric, garam masala, and chilli pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Drain 2 cups of liquid from the beans and stir half of it into the sauce. Add the sauce to the beans and stir. If the sauce is too thick or dry, add some or all of the reserved bean cooking liquid. Simmer over low heat, stirring occasionally, for at least 20 minutes, until the sauce has thickened and flavors have blended. Check seasonings and add salt to taste. Transfer to a serving dish, garnish with cilantro if you like, and serve with basmati rice or chapatis, paranthas, or naan."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2008/05/rasedar-rajma-kidney-beans-in-curry.html"
  ],
  "totalTime": "PT110M",
  "updatedAt": "2022-12-02T15:17:27.559Z"
}
