{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-26T10:25:02.074Z",
  "datePublished": "2022-08-03",
  "description": "This light yet rich ice cream truly tastes like summer in a bowl. Make it when the berries are cheap and plentiful.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/famkit331rasmer_032:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Ice-cream",
  "name": "Raspberry Meringue Ice Cream Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "North American",
  "recipeId": "RGR17456",
  "recipeIngredient": [
    "1 cup whipping cream",
    "1.8 cup whole milk",
    "6 egg, yolks only",
    "125g caster sugar",
    "1 tsp vanilla extract",
    "100g raspberries",
    "2 tbs caster sugar",
    "2 meringues, ready-made meringue nests (For the ripple)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat the cream and milk in a heavy-based saucepan over a medium heat until hot, but not boiling."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Whisk together the egg yolks, sugar, and vanilla extract. Very gradually, whisk the hot cream and milk into the egg mixture in a thin stream, whisking constantly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Return the custard to the rinsed-out pan and heat over a medium heat, whisking constantly, until it thickens and just coats the back of a spoon. Do not heat it too fast or for too long, or the eggs will “scramble” in the custard. Take it off the heat and transfer it to a cold bowl immediately, continuing to whisk for a couple of minutes to cool it down a little."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cool the custard completely, then cover the surface with a layer of cling film (placing it directly on the surface) to prevent a skin forming. Transfer it to the fridge and chill it for a minimum of 4 hours, or overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, make the raspberry ripple by putting the raspberries, sugar, and 1 tbs of water in a blender or food processor. Blend until completely smooth, then pass it through a nylon sieve to get rid of any pips. Put the meringues into a plastic bag and bash them with a rolling pin to make small “pebbles” of meringue."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Pour the chilled custard into an ice-cream maker and churn it until it is a thick, scoopable ice cream."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Transfer the ice cream to a wide, shallow plastic container and stir in the meringue pieces, being sure to distribute them fairly evenly. Pour the ripple over the surface in thick irregular lines. Use a chopstick to swirl it through the ice cream. Freeze until needed."
    }
  ],
  "recipeNameId": "raspberry-meringue-ice-cream",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/raspberry-meringue-ice-cream"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-11-26T10:25:02.073Z",
  "url": "https://www.woolworths.com.au/shop/recipes/raspberry-meringue-ice-cream"
}
