{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "113",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-04T12:48:24.206Z",
  "datePublished": "2018-10-28T03:00:35+00:00",
  "description": "Raw vegan carrot cake made with 10 wholesome ingredients! Tender, 30 minutes to make, and topped with an optional cashew cream cheese frosting! ",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/08/Raw-Carrot-Cake-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/08/Raw-Carrot-Cake-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/08/Raw-Carrot-Cake-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/08/Raw-Carrot-Cake-SQUARE-480x270.jpg"
  ],
  "keywords": "carrot cake",
  "name": "Raw Carrot Cake with Vegan Cream Cheese Frosting",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "217 kcal",
    "carbohydrateContent": "30.5 g",
    "fatContent": "10.8 g",
    "fiberContent": "5 g",
    "proteinContent": "3.6 g",
    "saturatedFatContent": "1.5 g",
    "servingSize": "1 slice",
    "sodiumContent": "54.2 mg",
    "sugarContent": "23.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/4 cup raw cashews",
    "1/2 cup coconut cream or full-fat coconut milk",
    "2 Tbsp lemon juice",
    "3 Tbsp maple syrup",
    "1 tsp vanilla extract",
    "2 cups finely shredded carrots",
    "2 cups packed pitted medjool dates (measured after pits removed)",
    "2 1/2 cups raw walnuts",
    "2 tsp vanilla extract",
    "1/4 tsp sea salt",
    "1 1/4 tsp ground cinnamon",
    "3/4 tsp ground ginger",
    "1 pinch nutmeg",
    "1/2 cup coconut flour (or sub almond flour)",
    "1/4 cup raisins"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If making the frosting (optional), soak the cashews in hot water for 30 minutes - 1 hour. Then rinse and drain. Add to a high-speed blender along with coconut cream, lemon juice, maple syrup, and vanilla and blend on high until very creamy and smooth scraping side as needed. Cover and refrigerate to chill."
    },
    {
      "@type": "HowToStep",
      "text": "Using a box grater or the grater attachment on your food processor, grate the carrots and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To a large (at least 7-cup) food processor, add the pitted dates and blend until small bits remain or a ball forms. Remove from food processor and set aside. (Smaller food processors can be used - the ingredients just need to be blended in batches as to not overflow the bowl."
    },
    {
      "@type": "HowToStep",
      "text": "To the food processor, add the walnuts, vanilla, salt, and spices. Blend until a semi-fine meal is achieved. Then add dates back in, along with shredded carrots, and pulse in 1-second measurements until a loose dough forms and the carrots are just incorporated. Be careful not to over-blend. You're looking for a pliable dough, not a purée."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a large mixing bowl. Add coconut flour and raisins and stir to combine. By mixing gently as opposed to blending in a food processor, you can keep a lighter, less dense, more \"cake-like\" texture. Once well combined, set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare a 7-9 inch springform pan (or large cake pan or an 8x8-baking dish with high edges) by adding parchment paper along the bottom and sides. Then add the cake mixture, and spread and press down evenly to pack. Use a flat-bottomed object, such as a drinking glass, to help press everything into an even layer. If the mixture sticks to the glass, wrap it in parchment paper. (NOTE: You could also scoop and roll these into balls to enjoy as cake bites!)"
    },
    {
      "@type": "HowToStep",
      "text": "At this point, you can enjoy the cake by carefully lifting or sliding the cake out of its pan. However, if adding the frosting, pour the frosting on and tap out any air bubbles. Then place on a baking sheet (to keep level) and freeze for 3-4 hours or until the frosting is semi-firm to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, make sure the cake isn't fully frozen so it's soft enough to cut (letting it thaw on the counter for 30 minutes should help). Then use a hot knife to carefully cut out slices and enjoy. Garnish with more nuts, raisins, or other desired toppings (all optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers covered in the refrigerator up to 1 week or in the freezer up to 1 month. It's best enjoy slightly chilled (not frozen). You can let it sit out at room temperature up to 2 hours, but the frosting can begin to get soft."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://minimalistbaker.com/raw-carrot-cake-with-vegan-cream-cheese-frosting"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T12:48:24.203Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=hA2XSmOOCvQ",
    "description": "Raw vegan carrot cake made with 10 wholesome ingredients! Tender, 30 minutes to make, and topped with an optional cashew cheese cream frosting! \n\nFull Recipe: https://minimalistbaker.com/raw-carrot-cake-with-vegan-cream-cheese-frosting/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M1S",
    "embedUrl": "https://www.youtube.com/embed/hA2XSmOOCvQ?feature=oembed",
    "name": "Raw Carrot Cake with Vegan Cream Cheese Frosting | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/hA2XSmOOCvQ/hqdefault.jpg",
    "uploadDate": "2018-10-31T21:30:00+00:00"
  }
}
