{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-04T09:08:39.850Z",
  "creator": {
    "@type": "Person",
    "name": "Casey Barber"
  },
  "dateCreated": "2015-09-28T10:30:00-04:00",
  "dateModified": "2020-01-22T00:06:03-05:00",
  "datePublished": "2015-09-28T10:30:00-04:00",
  "headline": "Recipe: Scallion Pancake Pierogies",
  "HowtoTip": {
    "text": "To freeze the pierogis: Line a rimmed baking sheet with waxed paper or parchment paper (can be the same sheet as used when assembling pierogies). Place pierogies in a single layer on the sheet and freeze at least 30 minutes or until hard. Transfer frozen pierogies to a zip-top freezer bag or FoodSaver-style bag for vacuum sealing. Store up to 3 months.Keep some of the dough scraps on hand for this one: sometimes the scallions pop through and create holes when the pierogies are being filled, so you may have to plug them up.Reprinted with permission from Pierogi Love: New Takes on an Old-World Comfort Food, © 2015 by Casey Barber. Published by Gibbs Smith."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2Fb8bd6464f7e9b3924a04e57cafb4559f7460ae60"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Fb8bd6464f7e9b3924a04e57cafb4559f7460ae60"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Fb8bd6464f7e9b3924a04e57cafb4559f7460ae60"
    }
  ],
  "keywords": [
    "appetizer",
    "butter",
    "chinese",
    "dinner",
    "Freezer Friendly",
    "lunch",
    "Main Dish",
    "Make Ahead",
    "Pancakes",
    "Party Food",
    "poultry",
    "recipe",
    "snacks",
    "stovetop",
    "asian",
    "course:main dish",
    "course:appetizer",
    "dishtype:poultry dish",
    "dishtype:pancake",
    "cuisine:chinese",
    "cuisine:asia",
    "mainingredients:poultry",
    "method:stovetop",
    "diet:low-calorie",
    "diet:under 400 calories",
    "diet:under 300 calories",
    "diet:under 500 calories",
    "meal:lunch",
    "meal:dinner",
    "meal:snack",
    "updated:2020-01-22"
  ],
  "name": "Recipe: Scallion Pancake Pierogies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "266 cal",
    "carbohydrateContent": "15.7 g",
    "cholesterolContent": "0 mg",
    "fatContent": "18.8 g",
    "fiberContent": "0.7 g",
    "proteinContent": "8.8 g",
    "saturatedFatContent": "7.2 g",
    "servingSize": "Serves 14",
    "sodiumContent": "260.5 mg",
    "sugarContent": "4.2 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Snack",
  "recipeCuisine": "Chinese",
  "recipeIngredient": [
    "2 tablespoons vegetable oil",
    "1 pound skinless, boneless chicken thighs, chopped into 2-inch pieces",
    "1 large shallot, minced",
    "1 large garlic clove, minced",
    "1 half-inch-thick piece fresh ginger, peeled and minced",
    "1/2 teaspoon crushed red pepper flakes",
    "1 cup chicken broth",
    "1 tablespoon soy sauce",
    "1 tablespoon unseasoned rice vinegar",
    "1 tablespoon light brown sugar",
    "2 large eggs",
    "1/2 cup (4 ounces) sour cream or plain Greek yogurt (full-fat, reduced-fat, or nonfat)",
    "2 tablespoons toasted seame oil",
    "1 tablespon unsalted butter, melted and slightly cooled",
    "1 teaspoon kosher salt",
    "1 1/2 cups (6 3/8 ounces) unbleached all-purpose flour",
    "1/2 cup minced scallions, green parts only",
    "1 tablespoon water",
    "2 tablespoons soy sauce",
    "2 tablespoons unseasoned rice vinegar",
    "2 tablespoons honey",
    "1/2 teaspoon hot chili sesame oil or garlic-chili paste",
    "1 minced scallion, green parts only (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat the oil in a medium (3- to 4-quart) Dutch oven or heavy pot over medium-high heat. Add the chicken and cook until browned, about 5 minutes. Flip the chicken and stir in the shallot, garlic, ginger, and pepper flakes. Cook about 5 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the broth, soy sauce, vinegar, and sugar, and bring the liquid to a simmer. Reduce the heat to medium-low, cover, and simmer for about 45 minutes, until the chicken is very tender."
    },
    {
      "@type": "HowToStep",
      "text": "Uncover and take a look: If the liquid hasn’t fully reduced to a thick and sticky sauce, continue simmering for about 5 to 10 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the heat and let the chicken cool slightly, then shred the chicken and sauce with 2 forks, or place into a stand mixer bowl and shred with the paddle attachment on low speed. (The filling can be made up to 2 days ahead. Cover and refrigerate until ready to assemble.)"
    },
    {
      "@type": "HowToStep",
      "text": "Whisk 1 of the eggs, sour cream or yogurt, sesame oil, butter, and salt in a bowl. Pour the flour into a large bowl. Gently stir wet ingredients into flour. The dough will initially be very dry and shaggy, seeming as if it will never come together, but have no fear: Keep stirring, and it will pull itself into shape."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk 1 of the eggs, sour cream or yogurt, sesame oil, butter, and salt in a bowl. Pour the flour into a large bowl. Gently stir wet ingredients into flour. The dough will initially be very dry and shaggy, seeming as if it will never come together, but have no fear: Keep stirring, and it will pull itself into shape."
    },
    {
      "@type": "HowToStep",
      "text": "Tip dough and any remaining shaggy flakes out onto a clean work surface. Knead until smooth, about 1 minute. Cover dough with the bowl and let rest 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk remaining egg and water in a small bowl for egg wash."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the soy sauce, vinegar, honey, and sesame oil in a bowl until the honey dissolves. Divide among 4 shallow bowls. Sprinkle each with scallion if desired. (Without the scallions, the sauce can be made up to 1 week ahead. Cover and refrigerate, and add the scallions just before serving.)"
    },
    {
      "@type": "HowToStep",
      "text": "Line a rimmed baking sheet with waxed paper or parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the rested dough into 4 equal pieces with a bench scraper or knife. Set aside 3 dough pieces and cover with the mixing bowl. Roll remaining dough as thinly as possible into a rough 8x12-inch rectangle."
    },
    {
      "@type": "HowToStep",
      "text": "Using a 3-inch round cookie cutter, cut out 6 rounds of dough. If the dough isn’t quartered evenly, you may get 5 rounds from one piece and 7 from another. Resist the temptation to re-roll dough scraps for additional rounds. It seems wasteful, but the dough won’t be as tender the second time around."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon 1 teaspoon filling into the center of the dough rounds and top with a pickled jalapeño."
    },
    {
      "@type": "HowToStep",
      "text": "Using your finger, swipe a very scant amount of egg wash — just a light touch — around the dough edge."
    },
    {
      "@type": "HowToStep",
      "text": "Fold into a half-moon shape: Either fold the dough over the filling on the work surface — I call this “the blanket” — or gently cup the pierogi in your hand in a U shape — I call this “the taco.” Gently but firmly seal the pierogi by pinching and squeezing the edges together with your thumb and pointer finger. Start with one pinch at the top, then move to one “corner” of the pierogi and pinch along the edge back to the top. Repeat on the opposite side to finish sealing the pierogi."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to the baking sheet and repeat with remaining dough rounds and filling."
    },
    {
      "@type": "HowToStep",
      "text": "At this point, the pierogis can be frozen for up to 3 months. See Recipe Notes for freezing instructions."
    },
    {
      "@type": "HowToStep",
      "text": "To boil fresh or frozen pierogis: Boil a pot of water over medium-high heat (fill approximately 1 quart water for every 6 pierogies). Add pierogies and cook until floating, 2 to 3 minutes for fresh and 4 to 5 minutes for frozen.To pan-fry fresh or boiled pierogis: Heat 1 tablespoon neutral oil (like canola or vegetable) or melt 1 tablespoon unsalted butter in a skillet over medium heat. Add as many pierogies as will fit in a single layer without crowding. Cook until pierogies are brown and crispy, about 2 minutes per side. Repeat with additional oil or butter and pierogies.To cook large batches for parties, you can also pan-fry pierogies on an electric or two-burner stovetop griddle.To deep-fry fresh or frozen pierogis: Use an electric deep fryer or a large, high-sided pot filled with at least 2 inches of vegetable or canola oil (fill the pot no more than 1/3 full). Heat oil to 350°F. Add pierogies and cook until golden brown; frying time varies based on equipment, about 3 minutes for fresh and 5 minutes for frozen.Line a baking sheet with paper towels. Transfer pierogies to the baking sheet and cool for 1 minute."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/recipe-scallion-pancake-pierogies-223935"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2Fb8bd6464f7e9b3924a04e57cafb4559f7460ae60",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-04T09:08:39.849Z",
  "url": "https://www.thekitchn.com/recipe-scallion-pancake-pierogies-223935"
}
