{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 3,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT5400S",
  "createdAt": "2022-12-05T07:32:57.800Z",
  "creator": {
    "@type": "Person",
    "name": "Christine Gallary"
  },
  "dateCreated": "2018-09-18T09:00:00-04:00",
  "dateModified": "2019-05-01T01:24:54-04:00",
  "datePublished": "2018-09-18T09:00:00-04:00",
  "description": "A bag of coleslaw makes a batch of chicken potstickers easy and quick.",
  "headline": "Recipe: Easy Chicken Potstickers",
  "HowtoTip": {
    "text": "Make ahead: The sauce can be made and the potstickers filled, covered in plastic wrap, and refrigerated up to 1 day ahead before cooking. The uncooked potstickers can also be frozen solid on the baking sheet, then transferred to a zip-top bag and frozen for up to 3 months. Cook frozen potstickers straight from the freezer according to the directions, but they may need an extra minute or two to brown on each side.Storage: Leftovers can be refrigerated in an airtight container for up to 4 days. Refrigerate the sauce separately.Using square wonton wrappers: If you can’t find round dumpling wrappers, use square wonton wrappers instead. Fill as directed above, folding the wrapper in half over the filling to form a triangle. If the wrappers are wider than 3 1/2 inches, use a 3 1/2-inch round cutter to cut each square into a round. "
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2Fc2a67a536878521ccaeb044549a835b0284111e2"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Fc2a67a536878521ccaeb044549a835b0284111e2"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Fc2a67a536878521ccaeb044549a835b0284111e2"
    }
  ],
  "keywords": [
    "appetizer",
    "asian",
    "chicken",
    "children",
    "chinese",
    "Dairy-Free",
    "dinner",
    "eggs",
    "Freezer Friendly",
    "Keeps Well",
    "lunch",
    "Make Ahead",
    "Nut-Free",
    "oils",
    "Party Food",
    "Pinterest",
    "poultry",
    "recipe",
    "stovetop",
    "vegetables",
    "video",
    "vinegar",
    "purpose:search",
    "platform:search",
    "course:appetizer",
    "dishtype:egg dish",
    "dishtype:poultry dish",
    "cuisine:chinese",
    "cuisine:asia",
    "mainingredients:poultry",
    "mainingredients:chicken",
    "method:stovetop",
    "diet:dairy-free",
    "diet:low-calorie",
    "diet:under 400 calories",
    "diet:under 500 calories",
    "meal:lunch",
    "meal:dinner",
    "updated:2019-05-01"
  ],
  "name": "Recipe: Easy Chicken Potstickers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "395 cal",
    "carbohydrateContent": "35.7 g",
    "cholesterolContent": "0 mg",
    "fatContent": "20.1 g",
    "fiberContent": "2.1 g",
    "proteinContent": "17.7 g",
    "saturatedFatContent": "2.6 g",
    "servingSize": "Serves 8",
    "sodiumContent": "1027.7 mg",
    "sugarContent": "1.3 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT600S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Lunch",
  "recipeCuisine": "Chinese",
  "recipeIngredient": [
    "8 ounces finely shredded cabbage or coleslaw mix (about 3 packed cups)",
    "1 teaspoon kosher salt",
    "1 large egg",
    "2 medium scallions, thinly sliced (about 1/4 cup)",
    "2 tablespoons soy sauce",
    "2 cloves garlic, minced",
    "1/4 teaspoon freshly ground black pepper",
    "1 pound ground chicken",
    "1 (10- to 12-ounce) package round Asian dumpling wrappers (about 3 1/2 inches in diameter, sometimes labeled gyoza or potsticker wrappers)",
    "1/2 cup vegetable oil, divided",
    "1/4 cup soy sauce",
    "3 tablespoons rice vinegar",
    "1 medium scallion, thinly sliced",
    "1 to 2 teaspoons chile-garlic sauce, such as sambal oelek (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the filling: Place the slaw or cabbage in a colander in the sink (if using coleslaw mix, pick through and remove any large pieces of cabbage). Sprinkle with the salt and toss to combine. Let sit for 10 minutes. Meanwhile, place the egg, scallions, soy sauce, garlic, and pepper in a large bowl; set aside. Fill a small bowl with water and set aside. Have a baking sheet ready. If not cooking the potstickers immediately, line the baking sheet with parchment paper or a silicone baking mat."
    },
    {
      "@type": "HowToStep",
      "text": "After 10 minutes, squeeze any liquid from the slaw or cabbage out with your hands into the sink, really crushing the cabbage. Place the cabbage into the bowl with the egg. Stir to combine. Add the chicken and use your hands to mix thoroughly, pressing the mixture against the side of the bowl until it just forms a sticky mass."
    },
    {
      "@type": "HowToStep",
      "text": "Form the potstickers: Lay 6 wrappers on a clean work surface and place 1 level tablespoon of filling slightly below the center of each wrapper, leaving about a 1/2-inch border. Dip your finger in the water and trace around the edge of a wrapper to moisten it. Fold the wrapper in half by bringing the bottom up to the top, then pinch to completely seal. (If you’d like to pleat the dumplings, see our step-by-step directions and photos.)"
    },
    {
      "@type": "HowToStep",
      "text": "Lift the potsticker off the work surface from the midpoint so that the seam is vertical, then place it on the baking sheet gently to form a flat bottom. Repeat sealing the remaining potstickers, making sure they are not touching on the baking sheet. (You might not use all the wrappers.) Continue wrapping potstickers 6 at a time until the filling or wrappers are used up — whichever comes first."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the potstickers in 4 batches: Arrange a rack in the middle of the oven and heat to 200°F to keep each batch warm. For each batch, heat 2 tablespoons of the oil in a 12-inch or larger nonstick frying pan or cast iron skillet over medium-high heat until shimmering. Add 12 of the potstickers pleat-side up, making sure they do not touch. Fry undisturbed until the bottoms are light golden-brown, 2 to 3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully add 1/4 cup of water (be careful because the oil may spatter). Cover and cook for 3 minutes. Uncover and, using tongs or chopsticks, turn the potstickers onto another side. Continue cooking until the filling is cooked through and the second side is golden-brown, 3 to 4 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the potstickers to a baking sheet and place in the oven to keep warm. Wipe the skillet clean with paper towels and repeat cooking the remaining potstickers in 3 more batches. Meanwhile, make the dipping sauce by stirring all the ingredients together in a small bowl. Serve the potstickers with the dipping sauce."
    }
  ],
  "recipeYield": 8,
  "sameAs": [
    "https://thekitchn.com/easy-chicken-potstickers-261538"
  ],
  "suitableforDiet": "https://schema.org/LowCalorieDiet,https://schema.org/LowLactoseDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2Fc2a67a536878521ccaeb044549a835b0284111e2",
  "totalTime": "PT6000S",
  "updatedAt": "2022-12-05T07:32:57.799Z",
  "url": "https://www.thekitchn.com/easy-chicken-potstickers-261538",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://cdn.jwplayer.com/previews/xZaaxgtn",
    "description": "Steamed and pan-fried Chinese dumplings, often known as potstickers, were always a favorite of mine when I was growing up. The doughy-looking dumplings magically transform into a juicy filling of meat and vegetables wrapped in a tender, crisp wrapper, perfect for dunking in a tangy dipping sauce of vinegar, soy sauce, and chili paste. Making potstickers is definitely a labor of love since you have to make the filling and wrap each dumpling, but there are a few tricks I have up my sleeve to make the whole process just a bit more streamlined and worth the effort. These chicken potstickers are also a good excuse to recruit family or friends in the wrapping process — many hands make for less work!",
    "name": "Easy Chicken Potstickers",
    "thumbnailUrl": [
      "https://cdn.jwplayer.com/v2/media/xZaaxgtn/poster.jpg?width=720"
    ],
    "uploadDate": "2022-12-01T16:04:02"
  }
}
