{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-04T13:01:17.954Z",
  "creator": {
    "@type": "Person",
    "name": "Paola Thomas"
  },
  "dateCreated": "2018-05-09T09:00:00-04:00",
  "dateModified": "2020-01-21T22:31:05-05:00",
  "datePublished": "2018-05-09T09:00:00-04:00",
  "description": "This simple chocolate sponge cake with a rich ganache frosting can be turned into a birthday cake or an after-dinner dessert.",
  "headline": "Recipe: Chocolate Sponge Cake with Ganache Frosting",
  "HowtoTip": {
    "text": "Storage: Although best eaten as fresh as possible, you can store any leftover cake in an airtight container in the refrigerator for up to 4 days.Make ahead: The unadorned cake layers will freeze beautifully, ready to be defrosted, filled, and frosted on the day you plan to assemble and serve. "
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F21c0c83c26111c0768f25b0c0ed49c71fc346f19"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F21c0c83c26111c0768f25b0c0ed49c71fc346f19"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F21c0c83c26111c0768f25b0c0ed49c71fc346f19"
    }
  ],
  "keywords": [
    "baking",
    "british",
    "butter",
    "cake",
    "children",
    "chocolate",
    "chocolate cake",
    "dessert",
    "eggs",
    "flour",
    "frosting &amp; icing",
    "Nut-Free",
    "Party Food",
    "recipe",
    "sugar",
    "sweets",
    "vegetarian",
    "european",
    "pantry",
    "baked goods",
    "course:dessert",
    "dishtype:baked good",
    "dishtype:sweets",
    "dishtype:egg dish",
    "dishtype:chocolate cake",
    "dishtype:frosting & icing",
    "dishtype:cake",
    "cuisine:europe",
    "cuisine:english",
    "mainingredients:pantry",
    "mainingredients:chocolate",
    "method:baked",
    "diet:vegetarian",
    "updated:2020-01-21"
  ],
  "name": "Recipe: Chocolate Sponge Cake with Ganache Frosting",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "747 cal",
    "carbohydrateContent": "66.8 g",
    "cholesterolContent": "0 mg",
    "fatContent": "54.6 g",
    "fiberContent": "4.5 g",
    "proteinContent": "8.2 g",
    "saturatedFatContent": "31.9 g",
    "servingSize": "Serves 12",
    "sodiumContent": "173.9 mg",
    "sugarContent": "46.6 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dessert",
  "recipeCuisine": "Europe",
  "recipeIngredient": [
    "1 1/2 cups all-purpose or cake flour",
    "1/2 cup almond flour or all-purpose flour",
    "2 teaspoons baking powder",
    "1/4 teaspoon kosher salt",
    "1/4 cup unsweetened cocoa powder",
    "1/4 cup hot water, plus more as needed",
    "1 teaspoon vanilla extract",
    "2 sticks (8 ounces) unsalted butter, at room temperature, plus more for the pans",
    "1 cup granulated sugar",
    "4 large eggs, divided",
    "10 ounces coarsely chopped semisweet or bittersweet chocolate or chocolate chips",
    "1 tablespoon unsalted butter",
    "Pinch salt",
    "1 cup heavy cream",
    "12 ounces coarsely chopped semisweet or bittersweet chocolate or chocolate chips",
    "2 tablespoons unsalted butter",
    "1 1/4 cups heavy cream",
    "For decorating (optional): Fresh fruit, sprinkles"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Arrange a rack in the middle of the oven and heat to 325°F. Coat 2 (8-inch) round cake pans with butter, then line the bottoms with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Place the 1 1/2 cups flour, baking powder, and salt in a medium bowl and whisk to combine. Add the 1/2 cup almond or all-purpose flour and whisk everything thoroughly to combine; set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Sift the cocoa powder into a small bowl. Add the 1/4 cup hot water and vanilla and stir until a smooth paste forms; set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Place the butter and sugar in a stand mixer fitted with the paddle attachment. Beat on medium speed until very pale and fluffy, 3 to 5 minutes, scraping down the sides of the bowl as needed; set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 of the eggs and a spoonful of the flour mixture into the butter mixture and beat to combine. Repeat with the remaining eggs, accompanying each egg with a spoonful of flour and beating thoroughly and scraping down the sides of the bowl with a rubber spatula between each addition. The flour should ensure that the batter does not curdle and split, but if that happens, add another tablespoon of flour and keep beating. If you can’t rescue the batter, don’t worry — it just means your cake won’t rise quite as much but will otherwise be fine."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cocoa paste and beat until the batter is uniformly brown. Gently fold in the rest of the flour mixture with a metal spoon or plastic spatula. You should end up with a mousse-like mixture that slides easily off a downward-pointing metal spoon. This is called \"dropping consistency.\" If necessary, add a tablespoon or two of hot water to get to the right consistency."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the batter equally between the two cake pans, spreading it right to the edges and smoothing out the top with the spatula."
    },
    {
      "@type": "HowToStep",
      "text": "Bake until the cakes are dark brown, firm and springy, and starting to pull away from the sides, 30 to 35 minutes. A fingertip pressed gently on the top of the cake should leave no imprint. Let the cakes cool in the pans on wire racks for 5 minutes. Run a small metal spatula or thin knife around the edges of the cakes, then flip them out onto the rack to cool comletely. While the cake is baking and cooling, make the whipped ganache."
    },
    {
      "@type": "HowToStep",
      "text": "Place the chocolate, butter, and salt into a large heatproof bowl. Heat the cream in a small saucepan over low heat until bubbling round the edges (being careful that it doesn’t boil over), then pour it over the chocolate mixture. Let sit for about 10 minutes, then stir with a spatula until completely smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Refrigerate the ganache until it is at room temperature, but not firm, about 1 hour. Whip the ganache with an electric hand mixer until soft, fluffy, and lighter in color, about 2 minutes, being careful not to overbeat. I like to refrigerate the ganache to firm up slightly for about 10 minutes before filling the cake. Spread the whipped ganache over one cooled cake, then place the other cake on top. Smooth off the sides if any whipped ganache has leaked out."
    },
    {
      "@type": "HowToStep",
      "text": "Place the chocolate, butter, and salt in a large heatproof bowl. Heat the cream in a small saucepan over low heat until bubbling round the edges (being careful that it doesn’t boil over), then pour it over the chocolate mixture. Let sit for about 10 minutes, then stir with a spatula until completely smooth. Let it cool at room temperature for about 10 minutes, then use it as soon as it starts to thicken up."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the thick liquid ganache over the cake, either spreading it over the sides with a spatula or leaving it to drip naturally for a more naked look. Let the ganache set before serving. Decorate with fresh fruit or sprinkles if desired."
    }
  ],
  "recipeYield": 12,
  "sameAs": [
    "https://thekitchn.com/easy-chocolate-sponge-257179"
  ],
  "suitableforDiet": "https://schema.org/VegetarianDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F21c0c83c26111c0768f25b0c0ed49c71fc346f19",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-04T13:01:17.952Z",
  "url": "https://www.thekitchn.com/easy-chocolate-sponge-257179"
}
