{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-03T02:10:37.367Z",
  "creator": {
    "@type": "Person",
    "name": "Christine Gallary"
  },
  "dateCreated": "2017-11-15T09:00:00-05:00",
  "dateModified": "2019-11-14T20:38:28-05:00",
  "datePublished": "2017-11-15T09:00:00-05:00",
  "description": "Spicy black pepper and sweet maple syrup mix together in a compound butter to flavor this easy roast turkey.",
  "headline": "Recipe: Black Pepper &#038; Maple Roast Turkey",
  "HowtoTip": {
    "text": "Thawing instructions: The simplest and safest way to thaw a whole frozen turkey is in the refrigerator. It will need 24 hours for every 5 pounds of turkey.Make ahead: The compound butter can be made and refrigerated up to 2 days in advance. Let come to room temperature before using.Storage: Leftovers can be stored in an airtight container in the refrigerator for up to 4 days."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2Farchive%2F3ce6d68f323168e1ff58feed91f1543851022add"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2F3ce6d68f323168e1ff58feed91f1543851022add"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2F3ce6d68f323168e1ff58feed91f1543851022add"
    }
  ],
  "keywords": [
    "anheuser busch thanksgiving",
    "butter",
    "christmas",
    "dinner",
    "easy",
    "flour",
    "Main Dish",
    "Other Sweeteners",
    "pepper",
    "poultry",
    "recipe",
    "roasting",
    "salt",
    "thanksgiving",
    "turkey",
    "course:main dish",
    "dishtype:poultry dish",
    "mainingredients:poultry",
    "mainingredients:turkey",
    "meal:dinner",
    "updated:2019-11-14"
  ],
  "name": "Recipe: Black Pepper & Maple Roast Turkey",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "864 cal",
    "carbohydrateContent": "14.2 g",
    "cholesterolContent": "0 mg",
    "fatContent": "44.7 g",
    "fiberContent": "0.7 g",
    "proteinContent": "97.0 g",
    "saturatedFatContent": "13.1 g",
    "servingSize": "Serves 10",
    "sodiumContent": "886.1 mg",
    "sugarContent": "7.6 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": [],
  "recipeIngredient": [
    "8 tablespoons (1 stick) unsalted butter, at room temperature",
    "1/4 cup plus 1 tablespoon maple syrup, divided",
    "1 1/2 teaspoons coarsely ground black pepper, plus more for seasoning",
    "1 teaspoon kosher salt, plus more for seasoning",
    "1 (12- to-15-pound) whole turkey, thawed if frozen",
    "2 cups low-sodium chicken or turkey broth",
    "1 tablespoon soy sauce",
    "Vegetable oil or unsalted butter, as needed",
    "1/4 cup all-purpose flour",
    "Up to 1 1/2 cups low-sodium chicken or turkey broth, as needed",
    "Tamari or soy sauce",
    "Kosher salt",
    "Coarsely ground black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Roast the turkey: Arrange a rack in the lower third of the oven, remove any racks above it, and heat to 450°F. Have a roasting pan fitted with a roasting rack ready. (If you don't have a roasting rack, crumple up a few sheets of aluminum foil and place them on the bottom of a regular or disposable roasting pan.)"
    },
    {
      "@type": "HowToStep",
      "text": "Place the butter, 1 tablespoon of the maple syrup, 1 1/2 teaspoons pepper, and 1 teaspoon salt in a small bowl and smash together with a spoon or rubber spatula until combined; set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the turkey's neck and giblets, or save for another use. Pat the cavity and the outside of the turkey dry with paper towels and place breast-side up on a cutting board or rimmed baking sheet. Loosen the skin on the breast and the legs by gently sliding your hand between the meat and the skin and separating it without tearing it. Distribute the butter evenly under the loosened skin. Season the outside and cavity of the turkey generously with salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Place the turkey breast-side up on the roasting rack. Tie the legs together with kitchen twine if desired. Pour the broth into the roasting pan."
    },
    {
      "@type": "HowToStep",
      "text": "Place the roasting pan in the oven. Immediately turn the temperature down to 350°F. Roast for 1 1/2 hours. Meanwhile, stir the remaining 1/4 cup maple syrup and soy sauce together in a small bowl; set aside."
    },
    {
      "@type": "HowToStep",
      "text": "After 1 1/2 hours, brush the turkey with the reserved maple syrup mixture every 20 minutes. Start checking the temperature after 2 hours total roasting time. The turkey is ready when a meat thermometer inserted into the thickest part of the thigh not touching bone registers at least 165°F, 2 1/2 to 3 1/2 hours total (about 13 minutes per pound)."
    },
    {
      "@type": "HowToStep",
      "text": "When the turkey is ready, place the roasting pan on the stove or heatproof surface. Lift the neck end of the turkey up at an angle with a wadded-up paper towel so that the juices in the cavity pour out into the roasting pan. Transfer the turkey to a clean cutting board or serving platter and let rest at least 30 minutes before carving. Meanwhile, remove the roasting rack and make the gravy."
    },
    {
      "@type": "HowToStep",
      "text": "Make the gravy: Fit a fine-mesh strainer over a heatproof medium bowl. Using a wooden spoon, scrape up any browned bits from the bottom of the roasting pan. Pour the pan juices through the strainer and discard the contents of the strainer. Set aside for a few minutes for the fat to rise to the surface."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon off 1/4 cup of the fat from the surface of the pan juices into a medium saucepan (if you don't have enough fat, add oil or butter as needed to get to 1/4 cup). Spoon off and discard the remaining fat. Measure the remaining juices, known as drippings, and add broth as needed to get to 2 1/2 cups (if you have more than 2 1/2 cups of drippings already, that's fine); set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Place the saucepan over medium-high heat until the fat is shimmering. Whisk in the flour and cook until slightly darkened in color, about 1 minute. Pour in the reserved pan juices, whisk to combine, and bring to a simmer. Simmer until thickened to the desired consistency. Taste and season with soy sauce (1 teaspoon at a time), salt, and more coarsely ground pepper as needed. Pour the gravy into a serving bowl or gravy boat and serve with the carved turkey."
    }
  ],
  "recipeYield": 10,
  "sameAs": [
    "https://thekitchn.com/recipe-black-pepper-amp-maple-roast-turkey-250974"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2Farchive%2F3ce6d68f323168e1ff58feed91f1543851022add",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-03T02:10:37.365Z",
  "url": "https://www.thekitchn.com/recipe-black-pepper-amp-maple-roast-turkey-250974"
}
