{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T11:16:12.739Z",
  "datePublished": "2013-03-28T17:59:00+00:00",
  "description": "This red lentil cauliflower burger with chipotle habanero mayo is fantastic. Topped with onion rings and roasted peppers. Vegan, gluten-free option.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2014/07/Lentil-cauliflower-burger-Sweet-potato-bake-145-002.jpg",
    "https://www.veganricha.com/wp-content/uploads/2014/07/Lentil-cauliflower-burger-Sweet-potato-bake-145-002-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2014/07/Lentil-cauliflower-burger-Sweet-potato-bake-145-002-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2014/07/Lentil-cauliflower-burger-Sweet-potato-bake-145-002-480x270.jpg"
  ],
  "keywords": "lentil burger recipe, red lentil cauliflower burger, vegan burger recipe",
  "name": "Red Lentil Cauliflower Burger",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "82 kcal",
    "carbohydrateContent": "14 g",
    "fatContent": "1 g",
    "fiberContent": "6 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "337 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Burger",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "1/2 cup dried whole red/Indian brown lentils(sabut Masoor) or other lentils (brown/green)",
    "1/3 tsp salt",
    "1/2 tsp garlic powder (or 3-4 garlic cloves minced)",
    "1/2 tsp spice mix of choice (like berbere or garam masala)",
    "1 3/4 cups water",
    "1/2 head cauliflower grated (1 1/2 - 2 cups)",
    "1 Tbsp onion flakes (or 3 Tbsp finely chopped onion)",
    "1/2 tsp cumin powder",
    "1/2 tsp piri piri (or cayenne or chili powder or other chili to taste)",
    "1/2 tsp garlic powder",
    "1/2 tsp salt",
    "2 Tbsp chickpea flour (or breadcrumbs or other flour as needed)",
    "Baby spinach/greens, onion rings (recipe below), roasted mini peppers (recipe below), pickled jalapenos, chopped fresh cilantro, chipotle habanero mayo (recipe below), avocado slices, tomato slices"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak the lentils for half an hour or more in warm hot water."
    },
    {
      "@type": "HowToStep",
      "text": "Wash, drain, add to a pot with all the ingredients (salt, garlic, spice, 1 3/4 cups water) and cook on low-medium, partially covered for half an hour or until easily squished. Stir a few times in between. Cook until all the water is absorbed. (drain the lentils if they are well cooked and water is not absorbed). Or use 1.5 cups of cooked lentils."
    },
    {
      "@type": "HowToStep",
      "text": "Grate the cauliflower (in a food processor, blender or by hand), spread on a parchment lined baking sheet and bake at pre-heated 400 degrees F for 12-15 minutes until some of the cauliflower gets crisp and golden. (You can also dry roast the grated cauliflower on stove top in a large pan at medium heat for 5-6 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Add cooked red lentils, roasted cauliflower, spices, salt to a bowl and mix well. Mash a bit. Taste and adjust salt and spice. (You can use this mixture as is to load a burger or a taco too.)"
    },
    {
      "@type": "HowToStep",
      "text": "Add chickpea flour, mix until the lentil cauliflower mixture easily comes together. Add more flour or breadcrumbs if needed (depends on moisture content in the lentils, cauliflower, etc). Shape into burger patties by hand or by pushing through a 3 inch cookie cutter."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle with olive oil, if using. Bake on parchment lined sheet for 20 minutes at 400 degrees F."
    },
    {
      "@type": "HowToStep",
      "text": "Assemble the Burger: Top the bun with spinach/greens, some mayo, onion rings, warm lentil patties, roasted peppers, pickled jalapenos, more chipotle habanero mayo, fresh cilantro and bun.Or use your own toppings like cucumbers, raw red onion slices, pepper slices and such for a quicker fix up."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/2013/03/red-lentil-cauliflower-burger-with.html"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-03T11:16:12.737Z"
}
