{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-05T19:18:04.299Z",
  "datePublished": "2016-05-12T05:00:57+00:00",
  "description": "6-ingredient rhubarb strawberry margaritas with silver tequila, lime juice, and a homemade rhubarb-strawberry syrup. Tart-sweet, easy to make, and perfect for spring!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/04/Strawberry-Rhubarb-Margarita-SQUARE.jpg"
  ],
  "keywords": "strawberry margaritas",
  "name": "Rhubarb Strawberry Margaritas",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "204 kcal",
    "carbohydrateContent": "8 g",
    "fatContent": "0.2 g",
    "fiberContent": "1 g",
    "proteinContent": "0.5 g",
    "servingSize": "1 margarita",
    "sodiumContent": "148 mg",
    "sugarContent": "5.5 g"
  },
  "prepTime": "PT105M",
  "recipeCategory": "Beverage",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cups chopped rhubarb (green stems removed)",
    "1 1/2 cups hulled, sliced strawberries",
    "3 Tbsp organic cane sugar*",
    "3/4 cup water",
    "1 Tbsp orange juice (optional // for natural sweetness and a slight orange flavor)",
    "1/3 cup strawberry rhubarb syrup",
    "1 Tbsp lime juice",
    "1 ounce silver tequila (1 ounce equals ~2 Tbsp)",
    "1-2 tsp agave nectar (plus more to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add rhubarb, strawberries, organic cane sugar, water and orange juice (optional) to a medium saucepan and bring to a simmer over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "Once simmering, reduce heat to low and continue cooking until softened and it looks like pie filling - about 5 minutes. While cooking, use a wooden spoon to stir and mash the fruit."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from heat and let cool slightly, then add a fine mesh strainer over a mixing bowl and pour over the mixture. Use a spoon to make sweeping motions across the bottom of the mesh strainer to encourage the liquid to strain. Continue until you've extracted as much of the liquid \"syrup\" as possible."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer syrup to a glass jar to the refrigerator to cool - at least a few hours. To speed cooling time, place in freezer for about 45 minutes to 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Run a lime wedge around desired number of serving glasses and dip in salt or organic cane sugar (I like salt for a flavor contrast). Add a large ice cube (or several small ice cubes) to the glass, and set aside. Set in the freezer for an extra chilly margarita!"
    },
    {
      "@type": "HowToStep",
      "text": "Next, to make one margarita, add 75 ml strawberry rhubarb syrup (amount as original recipe is written // adjust if altering batch size) to a cocktail shaker, along with lime juice, tequila, agave nectar, and a handful of ice."
    },
    {
      "@type": "HowToStep",
      "text": "Shake vigorously to combine. Pour out a small amount to sample, then adjust flavors as needed, adding more agave nectar for sweetness, lime juice for acidity, or strawberry rhubarb syrup for fruitiness."
    },
    {
      "@type": "HowToStep",
      "text": "Pour over serving glass and enjoy! The syrup makes enough for about 3-4 margaritas, and will keep in the refrigerator covered up to 1 week (sometimes longer)."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/rhubarb-strawberry-margaritas"
  ],
  "totalTime": "PT115M",
  "updatedAt": "2022-12-05T19:18:04.298Z"
}
