{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "130",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-01T08:56:33.967Z",
  "datePublished": "2016-05-19T05:00:55+00:00",
  "description": "30-minute rice noodle bowls with fresh veggies and crispy almond butter tofu! A flavorful, healthy, satisfying plant-based meal.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/04/Thai-Noodle-Bowls-SQUARE.jpg"
  ],
  "keywords": "thai noodle bowl",
  "name": "Rice Noodle Bowls with Almond Butter Tofu",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "622 kcal",
    "carbohydrateContent": "64.1 g",
    "fatContent": "34 g",
    "fiberContent": "5.3 g",
    "proteinContent": "16.5 g",
    "saturatedFatContent": "4.8 g",
    "servingSize": "1 Bowls",
    "sodiumContent": "838 mg",
    "sugarContent": "22 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Chinese-Inspired",
  "recipeIngredient": [
    "16 ounces extra-firm tofu*",
    "5 Tbsp sesame oil (divided)",
    "4 Tbsp salted creamy almond, cashew, or peanut butter",
    "2 Tbsp tamari (or soy sauce if not GF)",
    "2 Tbsp lime juice",
    "2-4 Tbsp maple syrup or coconut sugar",
    "2 medium birds eye chili (crushed // or sub 1/4 tsp red pepper flake)",
    "6 Tbsp cornstarch",
    "10 ounces very thin rice noodles",
    "4 cups thinly sliced or ribboned* carrots (2 carrots yield ~2 cups)",
    "2 cups cucumber (sliced on a bias, then halved // ~1 small cucumber)",
    "1 cup chopped red bell pepper (optional)",
    "1 cup thinly sliced green onion",
    "1 cup fresh cilantro or basil (torn/chopped)",
    "4 cloves garlic, minced (2 cloves yield ~1 Tbsp)",
    "2 medium fresh or dried bird's eye chili (crushed // more to taste // or sub 1/4 tsp red pepper flake)",
    "2 Tbsp maple syrup (plus more to taste)",
    "4 tsp tamari (or soy sauce if not gluten-free)",
    "4 Tbsp rice vinegar (or sub white or apple cider vinegar with varied results)",
    "2 Tbsp sesame oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start by wrapping tofu in a clean towel and setting something heavy on top (like a cast iron skillet) to press out excess moisture for 10 minutes. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the tofu sauce in a medium mixing bowl by whisking together 2 Tbsp sesame oil (amount as original recipe is written // if altering batch size, use 1/3 the amount in \"tofu\" section), almond butter, tamari, lime juice, maple syrup, and crushed chili. Taste and adjust seasonings as needed, adding more tamari for saltiness, lime juice for acidity, chili pepper for heat, or maple syrup for sweetness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Next, prepare rice noodles according to package instructions. Then rinse with cold water, drain thoroughly, and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prep vegetables next. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare salad dressing by adding all ingredients to a small mixing bowl (or jar) and whisking (or shaking vigorously) to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavors as needed, adding more chilies for heat, tamari for saltiness, lime juice for acidity, or maple syrup for sweetness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large rimmed skillet over medium heat (if too small, cook the tofu in 2 batches as to not crowd the pan) and cut pressed tofu into small rectangles. Toss in cornstarch and sauté in remaining sesame oil (3 Tbsp as original recipe is written // adjust if altering batch size), flipping once browned on the underside to ensure even browning – about 5 minutes total."
    },
    {
      "@type": "HowToStep",
      "text": "Add the almond butter sauce and stir gently to combine. Cook for another 3-4 minutes, stirring gently to ensure even cooking on all sides. Remove from heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To assemble, divide noodles, vegetables and tofu among serving bowls. Serve with dressing. For more heat, serve with sriracha or chili garlic sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh, though leftovers keep well when stored separately in the refrigerator up to 3 days."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/thai-noodle-bowls-almond-butter-tofu"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T08:56:33.965Z"
}
