{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "23",
    "ratingValue": "4.83"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-03T01:57:25.667Z",
  "datePublished": "2021-01-19T03:00:00+00:00",
  "description": "Incredibly flavorful roasted butternut squash pasta with garlicky alfredo sauce and optional shiitake bacon. Savory-sweet, comforting, 10 simple ingredients required! Naturally plant-based and gluten-free.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/11/Roasted-Butternut-Squash-Pasta-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/11/Roasted-Butternut-Squash-Pasta-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/11/Roasted-Butternut-Squash-Pasta-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/11/Roasted-Butternut-Squash-Pasta-SQUARE-480x270.jpg"
  ],
  "keywords": "butternut squash pasta",
  "name": "Roasted Butternut Squash Pasta",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "403 kcal",
    "carbohydrateContent": "76.4 g",
    "fatContent": "8.4 g",
    "fiberContent": "8.5 g",
    "proteinContent": "10.8 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "352 mg",
    "sugarContent": "4.5 g",
    "unsaturatedFatContent": "4.93 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 medium to large butternut squash",
    "1 tsp avocado oil",
    "1 healthy pinch each sea salt and black pepper",
    "2 cloves garlic, peeled and left whole",
    "1/4 cup raw cashews (if nut-free, try subbing sunflower or hemp seeds)",
    "2 cloves garlic, peeled (plus more to taste)",
    "2 Tbsp nutritional yeast",
    "1/2 tsp sea salt",
    "3/4 cup unsweetened almond milk (or other neutral flavored dairy-free milk, such as oat or rice)",
    "Water to cook",
    "1 healthy pinch sea salt",
    "10 ounces gluten-free pasta (ensure vegan-friendly as needed // we prefer Trader Joe’s brown rice quinoa fusilli)",
    "1 tsp oil (or sub water, adding more as needed as it evaporates)",
    "1/3 cup very thinly sliced onion or shallot",
    "1 pinch red pepper flake",
    "Shiitake Bacon",
    "Vegan parmesan cheese",
    "Red pepper flake"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If serving with shiitake bacon, prepare first and set aside (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 425 degrees F (218 C). Line a baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Slice your squash in half lengthwise, leaving skin on (reserve the other half for another use, such as Butternut Squash Soup!). NOTE: Your squash should be bright orange in color. If pale, it’d be best to try another squash. Scoop out seeds and discard or compost."
    },
    {
      "@type": "HowToStep",
      "text": "Rub squash in a bit of oil and sprinkle with salt and pepper. Place garlic cloves on the prepared baking sheet and top with squash cut-side down (the squash should cover the garlic so it doesn’t burn). Bake for 35-40 minutes, or until the skin is blistered, golden brown, and a knife inserted into the squash comes out very easily."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare sauce by soaking raw cashews in very hot water for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the cashews are almost done soaking, bring a pot of water to a boil and season with a healthy pinch of salt. Once boiling, add pasta and cook according to package instructions. Drain and set aside until serving (ideally the pasta is ready within a few minutes of serving — try to time accordingly). OPTIONAL: Toss cooked pasta in a little oil and cover to keep warm and prevent it from sticking until serving."
    },
    {
      "@type": "HowToStep",
      "text": "Once cashews are done soaking, drain and add to a small blender with remaining sauce ingredients (garlic, nutritional yeast, salt, and almond milk), as well as the garlic cloves that were roasted under the squash (roasted garlic is much milder and sweeter and adds dimension to the sauce). Blend until creamy and smooth. The sauce should be somewhat thin and pourable."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavors as needed, adding more nutritional yeast for cheesiness, salt to taste, or raw garlic for zing. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once your sauce is ready and pasta is almost ready, heat a large rimmed skillet (non-stick if you have it — such as Always Pan) over medium heat. Once hot, add a small amount of oil (if oil-free, use water) and add sliced onion or shallot. Season with a pinch of red pepper flake and sauté for 2-3 minutes or until tender and slightly brown. Then turn heat to low."
    },
    {
      "@type": "HowToStep",
      "text": "Add cooked drained pasta to the skillet along with the roasted squash in bite-sized spoonfuls (it should be very tender), and pour over the sauce. Toss to combine over low heat until everything is warmed through and just combined (be careful not to overstir so there are still chunks of squash intact)."
    },
    {
      "@type": "HowToStep",
      "text": "Serve as is, or garnish with shiitake bacon, vegan parmesan cheese, or red pepper flake (optional). Store leftovers covered in the refrigerator for up to 3-4 days (reheat in the microwave or on the stovetop until hot, adding a little dairy-free milk if it appears dry). Not freezer friendly."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/roasted-butternut-squash-pasta"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-03T01:57:25.656Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=hvEgq0HseOA",
    "description": "Incredibly flavorful roasted butternut squash pasta with garlicky alfredo sauce and optional shiitake bacon. Savory-sweet, comforting, 10 simple ingredients required! Naturally plant-based and gluten-free.\n\nFull Recipe: https://minimalistbaker.com/roasted-butternut-squash-pasta/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT48S",
    "embedUrl": "https://www.youtube.com/embed/hvEgq0HseOA?feature=oembed",
    "name": "Roasted Butternut Squash Pasta | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/hvEgq0HseOA/hqdefault.jpg",
    "uploadDate": "2021-01-19T09:00:30+00:00"
  }
}
