{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-01T08:15:42.627Z",
  "datePublished": "2010-05-11T15:08:02+00:00",
  "description": "The fresh flavor of asparagus shines through in this simple, creamy soup.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2010/05/asparagus-soup1-1.jpg"
  ],
  "keywords": "vegan asparagus soup",
  "name": "Roasted Asparagus Soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "76 kcal",
    "carbohydrateContent": "12.4 g",
    "fatContent": "1.9 g",
    "fiberContent": "5.2 g",
    "proteinContent": "6.4 g",
    "servingSize": "1 Serving",
    "sodiumContent": "502 mg",
    "sugarContent": "5 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Soup",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "2 pounds asparagus (ends trimmed)",
    "2 cloves garlic (peeled)",
    "1/2 small onion (sliced)",
    "2 cups warm vegetable broth or “no-chicken” broth",
    "1/2 ounce raw cashews (1 heaping tablespoon) or 1 tablespoon cashew butter)",
    "1/8 teaspoon white pepper",
    "salt to taste",
    "grated peel of 1/2 lemon or orange"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 450F. Place the asparagus spears on a baking sheet lined with a silicone liner or parchment paper. Roast for 10 minutes. Turn asparagus and sprinkle the onion and garlic over it. Roast for about 10 more minutes, until asparagus is very tender. If anything looks like it’s browning too much, take it out. (Important Note: These directions are for thicker asparagus. Thin asparagus may take much less time so start with 6 minutes, turn and add onions and garlic, and check again in 5.)"
    },
    {
      "@type": "HowToStep",
      "text": "While the asparagus is roasting, blend 1/2 cup of the broth with the cashews and pepper until smooth. Leave it in the blender."
    },
    {
      "@type": "HowToStep",
      "text": "When the asparagus is done, select several of the best-looking spears, remove the tops, and set aside to use as garnish. Cut the remaining asparagus into pieces and put it and the onion and garlic into the blender, along with the remaining broth. Cover the blender and blend on high until perfectly smooth."
    },
    {
      "@type": "HowToStep",
      "text": "If you’re using a Vita-Mix, you can blend it on high for a few more minutes until piping hot (remove the center cup and cover with a kitchen towel to allow steam to escape). Otherwise, pour the soup into a saucepan and heat until hot, stirring frequently. Add salt, if needed, to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Pour into bowls and sprinkle with grated lemon or orange peel. Garnish each bowl with the reserved asparagus spears and serve hot."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2010/05/roasted-asparagus-soup.html"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T08:15:42.626Z"
}
