{
  "@type": "Recipe",
  "cookTime": "PT180M",
  "createdAt": "2022-11-22T12:23:57.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Roast Turkey recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/1012_roastturkey:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Roast turkey,Low saturated fat,Roast,Tree nut free,Low sugar,High protein,High fibre,Christmas,Turkey,Peanut free",
  "name": "Roast Turkey Recipe | Woolworths",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "959 calories",
    "carbohydrateContent": "50.7 g",
    "fatContent": "32.1 g",
    "fiberContent": "7.3 g",
    "proteinContent": "110 g",
    "saturatedFatContent": "7.2 g",
    "sodiumContent": "2290 millig",
    "sugarContent": "8.5 g",
    "transFatContent": "0.2 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Lunch,Mains",
  "recipeCuisine": "North American",
  "recipeId": "1327",
  "recipeIngredient": [
    "20g butter",
    "1 leek, sliced",
    "0.5 cup parsley, chopped",
    "1 lemon, rind grated",
    "1 pinch pepper (for seasoning)",
    "5kg whole turkey",
    "1 egg",
    "1 tbs thyme",
    "5 cup fresh white breadcrumbs",
    "1 pinch salt (for seasoning)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 180°C. Place a rack into a large roasting pan and pour 2 cups water into pan."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat butter and oil in a nonstick frying pan. Add leek and cook for 5 minutes until soft. Cool slightly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add breadcrumbs, parsley, thyme, grated rind of 1 lemon, salt and black pepper and 1 egg. Stir until well combined."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Rinse turkey and pat dry with paper towel. Fill both cavities loosely with stuffing. Pull neck flap under bird and secure with a skewer. Tuck wings under."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tie legs together with kitchen string then run string between legs and body, crossing over underneath. Bring string up and over wings and back underneath the body to the legs. Tie securely."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place turkey onto rack in prepared pan. Brush with melted butter and season with salt and pepper. Cover with baking paper and then foil."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Roast for 2 hours 20 minutes then remove foil and paper. Baste with pan juices or more melted butter and cook for a further 3540 minutes until golden and cooked through. Transfer to a platter. Cover to keep warm. Stand for 10 minutes before carving."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Carve slices from the sides of the turkey working towards the centre. This way each slice should also contain some of the stuffing. Remove legs and wings and carve off meat. Transfer to a serving platter. Serve. Note: You can use bought breadcrumbs to crumb foods, but if you have a food processor it's easy to make your own. Remove the crusts from dayold white bread slices and cut into cubes. Transfer the cubes to the bowl of a food processor and process until finely chopped. To cut the turkey, start by cutting the bank of the skin holding the drumsticks. Hold the end of the drumstick and place your knife between the drumstick, thigh and body of the turkey. Cut through the skin, now remove the entire leg by pulling it out and back (use the point of the knife to help disjoin it)."
    }
  ],
  "recipeNameId": "roast-turkey",
  "recipeYield": "10",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/roast-turkey"
  ],
  "totalTime": "PT210M",
  "updatedAt": "2022-11-22T08:27:33.808Z",
  "url": "https://www.woolworths.com.au/shop/recipes/roast-turkey"
}
