{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "73",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T21:25:04.196Z",
  "datePublished": "2017-01-10T05:00:22+00:00",
  "description": "Hearty and flavorful harvest bowls with roasted vegetables, quinoa, and a creamy, 3-ingredient tahini dressing! A healthy, plant-based, gluten-free meal!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/12/Harvest-Bowls-SQUARE.jpg"
  ],
  "keywords": "harvest bowl",
  "name": "Roasted Vegetable & Quinoa Harvest Bowls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "530 kcal",
    "carbohydrateContent": "65.4 g",
    "fatContent": "26.3 g",
    "fiberContent": "10.3 g",
    "proteinContent": "14.2 g",
    "saturatedFatContent": "3.7 g",
    "servingSize": "1 side servings",
    "sodiumContent": "152 mg",
    "sugarContent": "14.2 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "4 medium whole carrots (peeled and quartered // large pieces halved)",
    "1 1/2 cups quartered baby yellow potatoes",
    "2 Tbsp maple syrup (divided)",
    "2 Tbsp olive oil (divided)",
    "1 healthy pinch each sea salt + black pepper",
    "1 Tbsp chopped fresh rosemary (or dried)",
    "2 cups halved Brussels sprouts",
    "1 cup white quinoa (well rinsed + drained)",
    "1 3/4 cups water",
    "1 pinch sea salt",
    "1/2 cup tahini",
    "1 medium lemon, juiced (yields ~3 Tbsp or 45 ml as original recipe is written)",
    "2-3 Tbsp maple syrup",
    "Fresh herbs (parsley, thyme, etc.)",
    "Pomegranate arils"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and line a baking sheet with parchment paper (or more baking sheets if increasing batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Add the carrots and potatoes to the sheet and drizzle with half of the maple syrup, half of the olive oil, the salt, pepper, and rosemary (as original recipe is written, 1 Tbsp maple syrup and 1 Tbsp olive oil // adjust if altering batch size). Toss to combine. Then bake for 12 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat a saucepan over medium-high heat. Once hot, add rinsed quinoa to lightly sautée before adding water to evaporate leftover moisture and bring out a nutty flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for 2-3 minutes, stirring frequently. Then add water and a pinch of salt. Bring to a low boil over medium-high heat. Then reduce heat to a simmer and cover. Cook for 18-22 minutes or until liquid is absorbed and quinoa is fluffy. Then open lid and fluff the quinoa with a fork. Tilt the lid, remove from the heat, and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "When the veggies are at the 12-minute mark, remove pan from the oven and add the Brussels sprouts. Top with remaining 1 Tbsp olive oil, 1 Tbsp maple syrup, and another pinch each salt and pepper (amounts as original recipe is written // adjust if altering batch size). Loosely toss to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Return pan to oven and roast for 10-12 minutes more or until Brussels sprouts are golden brown and the carrots and potatoes are fork tender. (This ensures that the potatoes and carrots are cooked through and the Brussels don't get too soft.)"
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, prepare dressing by adding tahini, lemon juice, and maple syrup to a small mixing bowl and whisking to combine. Add 2 Tbsp (30 ml) warm water at a time and whisk until thick but pourable. Taste and adjust flavor as needed, adding more maple syrup for sweetness or lemon juice for acidity."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, divide quinoa and vegetables between serving bowls and top with a generous drizzle of tahini sauce. Top with garnish of choice, such as pomegranate arils or fresh herbs."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/roasted-vegetable-quinoa-harvest-bowls"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T21:25:04.195Z"
}
