{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "41",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-25T13:16:17.000Z",
  "datePublished": "2020-02-15T13:27:42+00:00",
  "description": "These light and flavorful Roasted Cauliflower Taco Bowls have tons of color, flavor, and texture to keep you coming back for more! Great for meal prep!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2020/02/Roasted-Cauliflower-Taco-Bowls-close-above.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/02/Roasted-Cauliflower-Taco-Bowls-close-above-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/02/Roasted-Cauliflower-Taco-Bowls-close-above-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/02/Roasted-Cauliflower-Taco-Bowls-close-above-480x270.jpg"
  ],
  "keywords": "bowl meals, lunch recipes, meal prep recipes",
  "name": "Roasted Cauliflower Taco Bowls with Cilantro Lime Ranch",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "515.33 kcal",
    "carbohydrateContent": "68.85 g",
    "fatContent": "22.1 g",
    "fiberContent": "12.78 g",
    "proteinContent": "13.68 g",
    "servingSize": "1 bowl",
    "sodiumContent": "647.78 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1/4 cup mayonnaise ($0.13)",
    "1/4 cup sour cream ($0.11)",
    "1 lime ($0.50)",
    "1/4 tsp garlic powder ($0.02)",
    "1/8 tsp onion powder ($0.01)",
    "1 Tbsp finely chopped cilantro ($0.05)",
    "1 green onion, chopped ($0.11)",
    "1/4 tsp salt ($0.02)",
    "1 head cauliflower ($2.39)",
    "2 Tbsp olive oil ($0.32)",
    "1/2 Tbsp chili powder* ($0.15)",
    "1/2 tsp smoked paprika ($0.05)",
    "1/2 tsp ground cumin ($0.05)",
    "1/8 tsp cayenne pepper ($0.02)",
    "1/4 tsp dried oregano ($0.02)",
    "freshly cracked pepper ($0.03)",
    "1 cup long grain white rice ($0.62)",
    "1.5 cups water ($0.00)",
    "1 15 oz. can black beans ($0.89)",
    "1 cup frozen corn ($0.20)",
    "1 Tbsp cooking oil ($0.08)",
    "1 pint grape tomatoes ($2.29)",
    "Fresh cilantro and sliced green onion for garnish ($0.20)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare the cilantro lime ranch first, so the flavors have time to blend. Zest the lime, then squeeze the juice from half, and cut the other half into wedges for serving. You'll need about 1 Tbsp lime juice. Finely chop about 1 Tbsp cilantro and one green onion."
    },
    {
      "@type": "HowToStep",
      "text": "Combine the ingredients for the cilantro lime ranch in a bowl (mayonnaise, sour cream, 1 Tbsp lime juice, 1/2 tsp lime zest, garlic powder, onion powder, chopped cilantro, chopped green onion, salt). Refrigerate the cilantro lime ranch until you're ready to eat."
    },
    {
      "@type": "HowToStep",
      "text": "Next, preheat the oven to 400oF. Line a baking sheet with parchment paper. Cut the head of cauliflower into florets, then place them in a bowl. In a separate small bowl, combine the ingredients for the taco seasoning (chili powder, smoked paprika, cumin, cayenne, oregano, salt, and some freshly cracked pepper). Drizzle the olive oil over the cauliflower, followed by the taco seasoning, then toss until the cauliflower is evenly coated in oil and spices."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the seasoned cauliflower out over the prepared baking sheet. Roast the cauliflower in the preheated oven for 20-30 minutes, or until it's brown and crispy on the edges."
    },
    {
      "@type": "HowToStep",
      "text": "While the cauliflower is roasting, begin cooking the rice. Add the rice and 1.5 cups water to a sauce pot. Place a lid on top, turn the heat up to high, and bring the water up to a boil. Once it reaches a full boil, turn the heat down to low and let the rice simmer for 15 minutes without lifting the lid. After 15 minutes, turn the heat off and let the rice rest for 5 minutes without lifting the lid. Finally, fluff the rice with a fork and divide it between four bowls or containers."
    },
    {
      "@type": "HowToStep",
      "text": "Add the undrained can of black beans to a small sauce pot and heat over medium-low, stirring occasionally, until heated through (if making the bowls for meal prep, skip heating the beans)."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 Tbsp cooking oil to a large skillet and heat over medium. Once the oil is hot and shimmering, add the frozen corn. Cook the corn, stirring only occasionally, until it is browned and blistered (about 7-8 minutes). Season with a pinch of salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Slice the grape tomatoes, roughly chop the cilantro, and slice a green onions for garnish."
    },
    {
      "@type": "HowToStep",
      "text": "To build the bowls, divide the roasted cauliflower, cooked rice, beans, corn, and tomatoes between four bowls or containers. Top with a pinch of cilantro, sliced green onion, and a wedge of lime. Drizzle the cilantro lime ranch over top just before eating."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/roasted-cauliflower-taco-bowls/comment-page-4"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-29T12:38:57.131Z"
}
