{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT120M",
  "createdAt": "2022-12-01T08:44:03.111Z",
  "datePublished": "2015-09-28T12:25:56+00:00",
  "description": "A sweet, savory, and spicy chili with meaty sweet potatoes. Vegan and gluten-free!",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2015/09/Sweet-Potato-Chili-Vegan-5-1.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/09/Sweet-Potato-Chili-Vegan-5-1-500x500.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/09/Sweet-Potato-Chili-Vegan-5-1-500x375.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/09/Sweet-Potato-Chili-Vegan-5-1-480x270.jpg"
  ],
  "name": "Roasted Sweet Potato Chili - Vegan and Gluten-Free",
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3 medium sweet potatoes (peeled and diced into bite sized cubes)",
    "2 tablespoon 30 ml extra-virgin olive oil, divided",
    "Salt and pepper to taste",
    "1 poblano chili pepper (roasted)",
    "1 red onion (chopped)",
    "1 medium carrot (peeled and finely chopped)",
    "3 celery ribs leaves on (diced)",
    "1 orange bell pepper (seeded and chopped)",
    "1 bay leaf",
    "1 tablespoon 15 g cumin",
    "1/4 teaspoon chipotle chili powder (add slowly to taste)",
    "1 teaspoon paprika",
    "1 tablespoon 15 g chili powder, add more if desired",
    "3 garlic cloves (minced)",
    "1/2 cup 120 ml white wine",
    "4 to 6 cups 960 to 1440 ml boiling water",
    "2 15 oz [439 g] cans of kidney beans, drained and rinsed",
    "2 medium tomatoes (seeded and diced)",
    "1 1/2 teaspoon 8 g ground sea salt, or to taste",
    "Pepper to taste",
    "1/2 cup 20 g cilantro leaves, coarsely chopped"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400°F (204°C)"
    },
    {
      "@type": "HowToStep",
      "text": "Spread the potatoes out evenly on a baking sheet and drizzle with 1 tbsp (15 ml) olive oil, and grind salt and pepper over them to taste. Toss to coat and roast for ten minutes. Turn the potatoes and roast for ten more minutes. Turn the potatoes and roast for five to ten more minutes or until the potatoes are golden and fork tender. They shouldn’t be hard and crunchy just firm. Remove from the oven and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Roast the poblano pepper over an open flame on a gas cooktop, or in a 400°F (204°C) oven until the skin is blistered and mostly black. Turn often while roasting. Cool on a plate with a bowl over it so it steams."
    },
    {
      "@type": "HowToStep",
      "text": "In a large stock pot heat the remaining tbsp. (15 ml) of olive oil on medium heat. When the oil is hot, add the onion, carrot, and celery, stir and cook for five minutes, stir frequently. Add bell pepper, stir to combine and cook for four minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the bay leaf, cumin, chipotle chili powder, paprika, chili powder, and garlic, stir to combine. This will release the flavors in the spices. Cook for 2 minutes. Deglaze the pan with the wine then add just enough hot water to cover the vegetables. Bring to a boil."
    },
    {
      "@type": "HowToStep",
      "text": "Scrape the blistered skin off of the pablano pepper and seed it. Dice and test the pepper to see how hot it is. Add it to the chili according to your taste."
    },
    {
      "@type": "HowToStep",
      "text": "Add the beans and cover with more water. Don’t fill the pan, you just want enough water to cover the vegetables and beans. Bring to a boil and then reduce the heat to a gentle simmer."
    },
    {
      "@type": "HowToStep",
      "text": "Add the tomatoes and simmer for one and a half hours, or until the chili thickens. Stir frequently to avoid scorching."
    },
    {
      "@type": "HowToStep",
      "text": "Add the salt and black pepper to taste, and the sweet potatoes. Cook for ten minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cilantro, stir well, and serve."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy!"
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganosity.com/the-blood-moon-and-roasted-sweet-potato-chili-vegan-and-gluten-free"
  ],
  "totalTime": "PT150M",
  "updatedAt": "2022-12-01T08:44:03.109Z"
}
