{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-03T15:30:36.183Z",
  "datePublished": "2011-02-03T11:41:12+00:00",
  "description": "Old or large parsnips can have a hard core, particularly near the top. If you find that your parsnips are overly woody, cut out and discard the hardest part.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/02/roasted-parsnip-soup2.jpg"
  ],
  "name": "Roasted Parsnip and Garlic Soup with Mushrooms",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "175 kcal",
    "carbohydrateContent": "38 g",
    "fiberContent": "8.5 g",
    "proteinContent": "7.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "478 mg",
    "sugarContent": "7.3 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Soup",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 pound parsnips (, peeled and cut into 1/2-inch pieces)",
    "1 head garlic",
    "1 small onion (, thinly sliced)",
    "1 rib celery (including leaves), chopped)",
    "4-5 cups No-Chicken broth",
    "1/4 teaspoon white pepper or to taste (white pepper adds spiciness)",
    "1/2 cup great northern beans",
    "6-8 ounces mushrooms (, stemmed and sliced)",
    "1 green onion (, sliced thin)",
    "salt to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400F. Place the parsnip cubes on a baking sheet lined with parchment paper or a silicone mat. Cut the top off of the head of garlic, just enough to expose the tops of the cloves. Place it on a square of aluminum foil, spritz it quickly with a 1/2-second spray of olive oil (optional), and wrap it up. Place it on the baking sheet with the parsnips and put it into the oven. Bake for 15 minutes, turn over the parsnips, and cook for 10-15 more minutes until parsnips are tender and just touched with brown. Remove from oven and allow the garlic to cool in its wrapper."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a non-stick saucepan and cook the onion until it’s translucent. Add the celery and cook for a couple minutes more. Add 3 cups of the broth, the parsnips, and the pepper. Squeeze the garlic out of the cloves into the pan. Cook for a few minutes, until parsnips have softened. Add the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Puree the soup in one of two ways: (1)place it into a blender in one or two batches, being careful not to fill more than half full and adding more broth if necessary (preferred), or (2) use a stick blender and carefully blend right in the pan. The smoother you get it, the better, so a Vita-Mix or other high-powered blender is great here. Return the pureed soup to the pan and warm over low heat. If the soup is too thick, add more broth until it reaches your desired consistency. Keep it covered because it will “erupt” from time to time."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the sliced mushrooms in a small non-stick skillet until they soften and release their juices. Season them with salt and add the green onion. Stir most of them into the soup, setting some nice-looking ones aside to use as a garnish. Season with salt and white pepper to taste (careful with the white pepper if you don’t like things spicy!)"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2011/02/roasted-parsnip-garlic-soup-mushrooms.html"
  ],
  "totalTime": "PT55M",
  "updatedAt": "2022-12-03T15:30:36.183Z"
}
