{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-03T03:01:34.000Z",
  "datePublished": "2006-12-13T10:39:00+00:00",
  "description": "Coconut water lends a very light coconut taste to the sauce but is really not essential. I just had a can open and decided to use it; apple juice and water should work as well.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2006/12/delicata-caul.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2006/12/delicata-caul-334x375.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2006/12/delicata-caul-334x270.jpg"
  ],
  "name": "Roasted Delicata Squash and Cauliflower with Curry Sauce",
  "prepTime": "PT20M",
  "recipeCategory": "Vegetable",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "1 delicata squash or other small winter squash (about 1 pound)",
    "1 head cauliflower",
    "canola oil spray or parchment paper",
    "black pepper",
    "1 medium onion (chopped)",
    "1 clove garlic",
    "1/4 teaspoon canola oil (see note)",
    "1/2 tablespoon good curry powder (homemade or store-bought, to taste)",
    "1/2 cup coconut water or 1/4 cup apple juice mixed with 1/4 cup water",
    "salt to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400F. Oil or line a large rectangular baking dish with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the squash by peeling it (not necessary with delicata, but necessary for all others), removing the seeds, and slicing it or cutting it into 1/2-inch cubes. Cut the cauliflower into medium-sized florets. Place squash and cauliflower into the baking dish, mist them with canola oil, and sprinkle with freshly-ground black pepper. Put into the oven. Bake for 15 minutes, stir, and check for doneness. Check again every 5 minutes until squash is tender--a fork should be able to pierce it easily, but it is not falling apart. Remove from oven and toss with sauce (below)."
    },
    {
      "@type": "HowToStep",
      "text": "While the vegetables are roasting, sauté the onion in a little water or broth over medium heat until it becomes translucent. Add the garlic and sauté one minute more. Pour in the oil and immediately add the curry powder. Stir and cook for 30 seconds, and then add the coconut water or apple juice/water mixture. Stir well and add the roasted vegetables. Add salt to taste, toss to coat well, and serve. Serves 2-3 people."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://blog.fatfreevegan.com/2006/12/flowers-and-florets.html"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-03T03:01:33.999Z"
}
