{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "4.67"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT85M",
  "createdAt": "2022-11-29T13:20:22.000Z",
  "datePublished": "2020-09-28T12:26:26+00:00",
  "description": "Layers of pasta, flavorful roasted vegetables, a simple homemade red sauce, and melty cheese make this roasted vegetable baked penne to die for!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2020/09/Roasted-Vegetable-Baked-Penne-scoop.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/09/Roasted-Vegetable-Baked-Penne-scoop-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/09/Roasted-Vegetable-Baked-Penne-scoop-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/09/Roasted-Vegetable-Baked-Penne-scoop-480x270.jpg"
  ],
  "keywords": "Baked Pasta, Casserole Recipes, pasta casserole, penne, Roasted Vegetables",
  "name": "Roasted Vegetable Baked Penne",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "494.86 kcal",
    "carbohydrateContent": "60.24 g",
    "fatContent": "19.79 g",
    "fiberContent": "5.35 g",
    "proteinContent": "20.76 g",
    "servingSize": "1 serving",
    "sodiumContent": "681.56 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 red onion ($0.44)",
    "1 zucchini ($0.79)",
    "1 yellow squash ($1.11)",
    "1 bell pepper ($1.69)",
    "2 Tbsp olive oil ($0.26)",
    "1/8 tsp salt ($0.02)",
    "1/8 tsp pepper ($0.02)",
    "1 yellow onion ($0.32)",
    "2 Tbsp butter ($0.26)",
    "1 28oz. can crushed tomatoes ($0.79)",
    "3 Tbsp tomato paste ($0.12)",
    "1 Tbsp Italian seasoning* ($0.30)",
    "1/4 tsp salt ($0.02)",
    "1/2 cup water ($0.02)",
    "1 lb. penne ($1.00)",
    "15 oz. ricotta ($2.19)",
    "2 cups shredded Italian cheese blend**, divided ($1.86)",
    "1/4 tsp pepper ($0.02)",
    "2 Tbsp chopped fresh parsley (optional garnish) ($0.11)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400oF. Dice the red onion, zucchini, yellow squash, and bell pepper into 1-inch pieces. Spread the diced vegetables out over a large baking sheet. Drizzle with oil and a pinch of salt and pepper. Toss until all the vegetables are coated in oil."
    },
    {
      "@type": "HowToStep",
      "text": "Roast the vegetables in the preheated oven, stirring once half way through, for about 45 minutes or until the vegetables are soft and the edges are brown and caramelized."
    },
    {
      "@type": "HowToStep",
      "text": "While the vegetables are roasting, begin the red sauce. Finely dice the yellow onion and add it to a sauce pot with the butter. Sauté for a few minutes, or until the onion is soft. Add the crushed tomatoes, tomato paste, Italian seasoning, salt, and water."
    },
    {
      "@type": "HowToStep",
      "text": "Stir the sauce to combine. Allow the sauce to come up to a simmer, then turn the heat down to low and let the sauce simmer, stirring occasionally, until the vegetables are finished roasting (about 30 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, stir together the ricotta cheese, 1 cup of the shredded Italian cheese blend, and 1/4 tsp each of salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of water to a boil for the penne. Once boiling, add the penne and continue to boil until the pasta is tender. Drain the penne in a colander, then return it to the pot with the heat turned off."
    },
    {
      "@type": "HowToStep",
      "text": "Stir one cup of the red sauce into the drained pasta to coat the pasta in flavor. Add the roasted vegetables to the remaining red sauce and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "To layer the casserole, place half of the sauce coated penne in the bottom of a 9x13\" or 3 quart casserole dish. Add half of the cheese mixture on top in dollops, followed by half of the roasted vegetable and red sauce mixture. The ingredients do not need to create a solid layer or completely cover the previous layer. Repeat with a second layer of pasta, cheese, and vegetable red sauce. Finally, top the casserole with the second cup of shredded Italian cheese blend."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the casserole with foil, making sure it doesn't touch the cheese on top. Place the casserole in the oven (still turned on to 400oF) and bake for 35 minutes. After 35 minutes, remove the foil and switch the oven from bake to broil. Broil the top of the casserole to brown the cheese for 3-5 minutes (watch closely as broilers can vary quite a bit from oven to oven). Top with chopped parsley if desired and serve!"
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/roasted-vegetable-baked-penne"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-11-29T11:54:13.253Z"
}
