{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-12-02T02:38:26.751Z",
  "datePublished": "2010-10-12T09:18:08+00:00",
  "description": "This recipe may seem daunting due to all of the various working parts, but it doesn't have to be. A store-bought ricotta is a perfectly fine substitute for home made, and seriously, save yourselves the headache and just buy some fresh lasagna noodles or use no-bake ones. If you do use no-bake, you'll want to add a little extra sauce to compensate for what the noodles will absorb. If you roast the pumpkin ahead of time, or even make the béchamel in advance, this can come together quite quickly. Be sure to heat the milk up before you add it to the roux, otherwise you run the risk of your sauce becoming clumpy.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2010/10/133.jpg"
  ],
  "name": "roasted pumpkin lasagna with sage béchamel sauce",
  "prepTime": "PT60M",
  "recipeIngredient": [
    "Béchamel sauce:",
    "4 cups milk (heated)",
    "1/3 cup olive oil",
    "1/3 cup all purpose flour",
    "2 Tbsp crumbled dried sage leaves",
    "salt and pepper",
    "Lasagna:",
    "1 medium-small pumpkin (the one I used was just under 2 kg, and there was a bit of roasted pumpkin left over)",
    "olive oil",
    "2 cups ricotta cheese",
    "1 cup grated Parmesan cheese",
    "1 package of lasagna noodles (you won't need the whole thing)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "For the Béchamel sauce, heat the milk up in a separate saucepan, or in the microwave."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, heat olive oil in a large saucepan over medium-high heat."
    },
    {
      "@type": "HowToStep",
      "text": "Add the flour and stir with a whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Continue to stir as oil is all absorbed, and let the flour become toasted and nutty smelling, but not burnt, about 2-3 min."
    },
    {
      "@type": "HowToStep",
      "text": "Ensuring your milk is hot, and whisking continuously, start to add the milk in about 1/2 cup at a time. Stir until fully incorporated after each addition."
    },
    {
      "@type": "HowToStep",
      "text": "When you have added all of the milk, continue to whisk and ensure there are no lumps."
    },
    {
      "@type": "HowToStep",
      "text": "Add the sage, and season with salt and pepper to taste. Remember that the rest of the lasagna ingredients are really neutral in flavour, so this sauce is where the majority of the taste will come from. Season it up good!"
    },
    {
      "@type": "HowToStep",
      "text": "Cook for another 2-3 min, and then reduce the heat to low, or set aside for later."
    },
    {
      "@type": "HowToStep",
      "text": "Pre-heat oven to 200°C /400°F. Scoop the seeds and stringy bits out of the pumpkin, and do what you will with it to get it peeled and sliced into uniformly sized bits. Remember, looks do not count here."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pumpkin slices into a roasting pan and toss with olive oil to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Place into hot oven, and roast until just barely tender. Remember the pumpkin will continue to cook in the lasagna, so it doesn't need to be very soft."
    },
    {
      "@type": "HowToStep",
      "text": "Deal with your noodles however you decided was best for you. If you're boiling them first, strain and set aside to cool so you can handle them."
    },
    {
      "@type": "HowToStep",
      "text": "When your pumpkin is cooked and slightly cooled and you're ready to start building your lasagna, get a nice big lasagna dish ready."
    },
    {
      "@type": "HowToStep",
      "text": "Spread some of your sauce on the bottom, followed by a layer of noodles."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the noodles in a nice amount of sauce, a good 1/2 cup or so."
    },
    {
      "@type": "HowToStep",
      "text": "Layer down half of the pumpkin so that there is an even layer over the noodles, and sprinkle the pumpkin with 1/4 cup of Parmesan cheese."
    },
    {
      "@type": "HowToStep",
      "text": "Cover with noodles, and lay down all of the ricotta."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the ricotta with a little salt and pepper, and maybe a teensy sprinkle of crumbled sage as well."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat with noodles, sauce, the other half of the pumpkin, another quarter cup of Parmesan, and finishing with a top layer of noodles and the remainder of the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "If you think it's way too much sauce for the top, it's not. Just pour it all on, it'll thicken up as it cooks. Cover the sauce with the remaining 1/2 cup of Parmesan."
    },
    {
      "@type": "HowToStep",
      "text": "Bake covered for 30 min."
    },
    {
      "@type": "HowToStep",
      "text": "Uncover and bake for an additional 15 min, until top is brown and crispy."
    },
    {
      "@type": "HowToStep",
      "text": "Let stand for 10 min before serving."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://heynutritionlady.com/roasted-pumpkin-lasagne"
  ],
  "totalTime": "PT150M",
  "updatedAt": "2022-12-02T02:38:26.748Z"
}
