{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "42",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-12-04T16:10:38.841Z",
  "datePublished": "2018-12-06T03:00:14+00:00",
  "description": "Roasted stuffed butternut squash makes the perfect plant-based entrée or side for the holiday season (and beyond). Stuffed with quinoa, kale, and mushrooms; 10 ingredients required; and incredibly flavorful!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/10/Stuffed-Butternut-Squash-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/10/Stuffed-Butternut-Squash-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/10/Stuffed-Butternut-Squash-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/10/Stuffed-Butternut-Squash-SQUARE-480x270.jpg"
  ],
  "keywords": "Stuffed butternut squash",
  "name": "Roasted Stuffed Butternut Squash",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "245 kcal",
    "carbohydrateContent": "46.2 g",
    "fatContent": "5.1 g",
    "fiberContent": "9.7 g",
    "proteinContent": "5.8 g",
    "saturatedFatContent": "0.6 g",
    "servingSize": "1 serving",
    "sodiumContent": "91 mg",
    "sugarContent": "8.9 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 cups cooked quinoa (cooked from ~3/4 cups raw - see instructions)",
    "1 Tbsp avocado or coconut oil",
    "3 cups loosely packed sliced shiitake mushrooms",
    "2 Tbsp coconut aminos (or sub tamari, but start with a lesser amount as it’s saltier)",
    "2 cloves garlic, minced",
    "2 cups loosely packed chopped kale",
    "1/2 cup roughly chopped walnuts (or other nut or seed of choice) (optional)",
    "1 large butternut squash, halved lengthwise, seeds removed",
    "1 Tbsp avocado or melted coconut oil",
    "2 Tbsp coconut sugar",
    "1/4 tsp ground cinnamon (optional)",
    "1 healthy pinch sea salt",
    "1 cup balsamic vinegar (reduced down on stovetop)",
    "Crispy Sautéed Shallot* (1 cup shallot or 2 medium shallots) (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and set out a baking sheet with parchment paper or a silicon liner or grease a 9x13-inch (or similar size) baking dish."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, if you haven’t already done so, prepare quinoa by adding quinoa and water to medium saucepan and bringing to a boil over high heat. Once boiling, reduce heat to a low simmer, cover, and cook for 18-20 minutes, or until fluffy and the water is absorbed. Remove lid and let cool completely (uncovered) on the stovetop."
    },
    {
      "@type": "HowToStep",
      "text": "Halve the squash lengthwise (tip and stem) by inserting your knife point into the squash and rocking toward the base. Then remove your knife, flip the squash around 180 degrees and insert the point into the same spot, but rock it toward the stem, pressing down firmly but carefully to split the squash in half."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop out seeds with a spoon or ice cream scoop. Then brush with oil (or water) and sprinkle with coconut sugar, cinnamon (optional), and salt. Place cut-side down on a lined baking sheet or baking pan."
    },
    {
      "@type": "HowToStep",
      "text": "Bake squash for 15 minutes, then flip the squash over to cut-side up. Bake for another 30-45 minutes (sometimes more depending on the size of your squash), or until a knife easily pierces the squash (especially in thicker parts). It's better for the squash to be on the more tender side than firm, in our experience."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare your balsamic reduction by adding balsamic vinegar to a small saucepan and bringing to a low boil over medium high heat. Once bubbling, reduce heat to a healthy simmer - about medium low heat - and cook for about 12-15 minutes. You’ll know it’s done when it’s reduced in volume by about half, it appears syrupy, and it has visible bubbles on the top. Set aside to cool. It will thicken as it cools."
    },
    {
      "@type": "HowToStep",
      "text": "Once your quinoa is cooked and cooled, heat a large rimmed metal or cast iron skillet over medium heat. One hot, add oil or water and quinoa. Sauté for 5-8 minutes, stirring occasionally, until slightly crispy and browned. Season with half the coconut aminos for flavor. Then remove from skillet and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To the still hot skillet add the mushrooms and the other half of the coconut aminos. Sauté for 2-3 minutes, or until browned and reduced in size. Then add garlic and kale and walnuts (optional) and sauté for another 1-2 minutes or until kale is just wilted. Then add quinoa back to the pan and toss to coat (see photo). Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once your squash is roasted, place cut-side up on the baking sheet or dish and fill to the brim with quinoa filling. Then place back in the oven to roast another 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, arrange on a serving platter or individual plates. We loved garnishing ours with some crispy pan-fried shallot*, parsley, and a drizzle of balsamic reduction. However, this would also pair well with a simple salad dressing like a vinaigrette, tahini dressing, or even Vegan Gravy."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers covered in the fridge up to 4-5 days. Reheat in a 350 degree F (176 C) until hot."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/roasted-stuffed-butternut-squash"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-12-04T16:10:38.839Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=fihCwgvEuM8",
    "description": "Roasted stuffed butternut squash makes the perfect plant-based entrée or side for the holiday season (and beyond). Stuffed with, quinoa, kale, and mushrooms; 10 ingredients required; and incredibly flavorful!\n\nFull Recipe: https://minimalistbaker.com/roasted-stuffed-butternut-squash/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M14S",
    "embedUrl": "https://www.youtube.com/embed/fihCwgvEuM8?feature=oembed",
    "name": "Roasted Stuffed Butternut Squash | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/fihCwgvEuM8/hqdefault.jpg",
    "uploadDate": "2018-12-06T11:30:00+00:00"
  }
}
