{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-11-29T22:46:26.000Z",
  "datePublished": "2010-01-11T19:37:00+00:00",
  "description": "This Roasted Poblano and Sweet Potato Salad is hearty and flavorful. Flavor, texture, and color make this salad as beautiful as it is delicious!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2010/01/roasted20poblano20and20sweet20potato20salad.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2010/01/roasted20poblano20and20sweet20potato20salad-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2010/01/roasted20poblano20and20sweet20potato20salad-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2010/01/roasted20poblano20and20sweet20potato20salad-480x270.jpg"
  ],
  "keywords": "poblano peppers, sweet potato recipes",
  "name": "Roasted Poblano and Sweet Potato Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "300.71 kcal",
    "carbohydrateContent": "44.04 g",
    "fatContent": "11.73 g",
    "fiberContent": "10.23 g",
    "proteinContent": "7.83 g",
    "servingSize": "1 Serving",
    "sodiumContent": "606.3 mg"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Salad",
  "recipeCuisine": "Southwest",
  "recipeIngredient": [
    "2.5 lbs. sweet potatoes ($2.43)",
    "2 poblano peppers ($0.98)",
    "1 15oz. can black beans ($0.78)",
    "1 cup frozen corn kernels ($0.32)",
    "1/4 diced red onion (optional) ($0.12)",
    "1 lime ($0.20)",
    "3 Tbsp olive oil ($0.32)",
    "1 bunch fresh cilantro ($0.66)",
    "2 tsp ground cumin ($0.10)",
    "1/2 tsp salt ($0.05)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat your oven to 400 degrees on the broiler setting. Line a baking sheet with foil and spray your poblanos with non-stick spray. Place the baking sheet with the peppers about 4 inches below the broiler coils(this is the second rack level on my oven). Roast the peppers under the broiler for 15 minutes on one side, flip them over then broil for another 5 minutes on the other side. You want the skin on the peppers to be all blistered and blackened. This will give them a nice smokey flavor. Don’t worry, you will be peeling away the charred skin."
    },
    {
      "@type": "HowToStep",
      "text": "While the peppers are roasting, peel the sweet potatoes and cut them into even chunks about one inch square. Place the chunks in a bowl and toss them together with 3 Tbsp of olive oil, 2 tsp of cumin, 1/2 tsp of salt and about half a bunch of chopped cilantro leaves. Mix it all up until the sweet potato chunks are well coated. The peppers should be done roasting at this point."
    },
    {
      "@type": "HowToStep",
      "text": "When the peppers come out of the oven, put them into a resealable freezer bag and let them cool. The peppers will steam themselves in the bag as they cool allowing you to easily peel away the skin."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the oven from broil to bake (still on 400 degrees), pour out the bowl of sweet potato chunks onto the baking sheet that was used for the peppers, and roast the sweet potatoes for 30 minutes. Stir the chunks half way through."
    },
    {
      "@type": "HowToStep",
      "text": "Drain and rinse the can of black beans. Thaw one cup of frozen corn kernels. Finely chop 1/4 of a red onion (if desired). Put the beans, corn and onion together in a bowl. When the poblanos have cooled, peel off their skin, open them up to remove the seeds, seed pod and stem then cut the flesh into chunks. Put the chopped poblanos in the bowl with the other vegetables."
    },
    {
      "@type": "HowToStep",
      "text": "When the sweet potatoes are done, let them cool for about 10 minutes. In the mean time, chop the other half of the cilantro, and juice the lime. Mix the sweet potatoes, cilantro and lime together with the rest of the ingredients and serve. This dish can be eaten warm or cold!"
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://budgetbytes.com/roasted-poblano-and-sweet-potato-salad"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-29T19:58:33.769Z"
}
