{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "22",
    "ratingValue": "4.96"
  },
  "author": {
    "@type": "Person",
    "name": "Annie and Dan Shannon"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-11-29T22:46:26.000Z",
  "datePublished": "2015-05-26T10:08:11+00:00",
  "description": "Tender rosemary dumplings, vegan chicken and veggies are simmered in a rich herbed broth in this hearty vegan chicken and dumplings stew from Mastering the Art of Vegan Cooking.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2015/05/vegan-chickn-dumplins-featured.jpg"
  ],
  "keywords": "dumplings, stew",
  "name": "Rosemary Vegan Chicklins & Dumplins Stew",
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 tablespoons olive oil",
    "1 cup vegan chicken",
    "1/2 cup whole wheat flour",
    "5 cups vegan chicken broth or vegetable broth",
    "1 cup nutritional yeast",
    "2 tablespoons soy sauce or Bragg’s Liquid Aminos",
    "1 teaspoon dried thyme",
    "11/2 teaspoons rubbed sage",
    "2 teaspoons dried rosemary (crushed)",
    "1 teaspoon onion powder",
    "1 clove garlic (minced)",
    "1/4 teaspoon crushed black peppercorn (plus more to sprinkle over the top)",
    "2 tablespoons chopped fresh parsley",
    "1/4 teaspoon celery seed",
    "2 bay leaves",
    "2 carrots (chopped)",
    "3 stalks celery (chopped)",
    "1/2 cup frozen peas",
    "2 cups all-purpose flour",
    "2 teaspoons baking powder",
    "1/2 teaspoon sea salt",
    "2 tablespoons vegan margarine",
    "3/4 cup soy milk",
    "1 teaspoon dried rosemary (crushed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the chicklins stew: In your favorite Dutch oven or stew pot, heat the olive oil over medium heat. Toss in the vegan chicken and cook until it is browned and has crispy edges. Transfer it to a plate lined with a paper towel to soak up any extra oil, leaving the oil in the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Using a wooden spoon, stir the flour into the hot oil left in the pan. Add the vegan chicken broth and whisk in the nutritional yeast. Using a large wooden spoon, stir in the soy sauce, thyme, sage, rosemary, onion powder, garlic, peppercorns, parsley, celery seed, bay leaves, carrots, celery, and peas."
    },
    {
      "@type": "HowToStep",
      "text": "Reduce the heat to low, cover, and let simmer for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, make the dumplins: In a large bowl, combine all the dumplins ingredients and use an electric handheld mixer to mix the ingredients until they form a firm batter."
    },
    {
      "@type": "HowToStep",
      "text": "If you like a large dumpling, roll a portion of the dough into a ball about the size of your palm—but if you want to get more servings out of one recipe, use a soup spoon to form smaller dumplings instead."
    },
    {
      "@type": "HowToStep",
      "text": "Raise the heat under the pot of stew to bring it to a boil. Drop the raw dumplings into the hot stew one at a time and stir them in with a wooden spoon. Make sure the dumplings get completely covered so they cook evenly."
    },
    {
      "@type": "HowToStep",
      "text": "Let the dumplings simmer in the stew for 10 to 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Single out the largest dumpling for sacrifice, remove it from the stew, and break it open. If it’s firm on the inside, you’re ready to eat! Mix in the cooked vegan chicken before serving with a few pinches of pepper over the top."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/rosemary-chicklins-dumplins-stew-mastering-the-art-of-vegan-cooking-cookbook-review?fbclid=IwAR2T3t9xbGNJOyZeHWRoMN6fnHSn5XkFcJ50OWTYIdukzd__0ArTjKQEQqE"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-30T22:00:13.641Z"
}
