{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "117",
    "ratingValue": "4.65"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T03:45:50.428Z",
  "datePublished": "2017-12-21T03:00:05+00:00",
  "description": "Flavorful, 30-minute Moroccan-spiced lentils with paprika, peppers, tomato, and fresh herbs. A healthy plant-based side or addition to bowls and salads!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/11/Moroccan-Lentils-SQUARE.jpg"
  ],
  "keywords": "Moroccan-spiced lentils",
  "name": "Saucy Moroccan-Spiced Lentils",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "147 kcal",
    "carbohydrateContent": "27 g",
    "fatContent": "0.6 g",
    "fiberContent": "11 g",
    "proteinContent": "9.2 g",
    "saturatedFatContent": "0.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "167 mg",
    "sugarContent": "5.9 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 cups water",
    "1 cup green lentils (rinsed and well drained // or sub canned lentils lightly rinsed and well drained)",
    "3 cloves garlic* (skins removed)",
    "1/2 medium onion (or 2 small shallots // chopped)",
    "1 large red bell pepper (or use 2 small), seeds removed, roughly chopped)",
    "2 Tbsp tomato paste",
    "1 1/2 Tbsp coconut sugar or maple syrup (or stevia to taste)",
    "1/2 tsp sea salt (plus more to taste)",
    "1 Tbsp smoked or sweet paprika (plus more to taste)",
    "1 tsp ground cumin (plus more to taste)",
    "1/2 tsp ground coriander (plus more to taste)",
    "1 tsp ground ginger (plus more to taste)",
    "1/2 tsp ground turmeric (plus more to taste)",
    "1/2 tsp cayenne pepper (more or less to preferred spice level)",
    "1 1/2 Tbsp apple cider vinegar (or lemon juice)",
    "3/4 cup fresh chopped parsley or cilantro (I used 1/2 cilantro + 1/2 parsley)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cook lentils first by bringing water to a boil and adding lentils. Bring back to a boil. Then reduce heat to low and simmer (uncovered) for about 20 minutes or until lentils are tender."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, to a food processor or small blender, add garlic*, onion or shallot*, bell pepper, tomato paste, coconut sugar, sea salt, paprika, cumin, coriander, ginger, turmeric, cayenne pepper, and apple cider vinegar. Mix to thoroughly combine."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more tomato paste for depth of flavor, spices for more overall flavor (especially coriander and paprika), cayenne for heat, coconut sugar for sweetness, apple cider vinegar for acidity, or salt for saltiness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the lentils have cooked, drain off any excess liquid and then add spice mixture and parsley or cilantro and mix well to combine (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately with salads, rice (or cauliflower rice), bowls, and more. Store leftovers in the refrigerator up to 4-5 days or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/saucy-moroccan-spiced-lentils"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T03:45:50.427Z"
}
