{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "37",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T02:24:21.145Z",
  "datePublished": "2016-11-09T05:00:50+00:00",
  "description": "Insanely saucy and delicious portobello mushroom and butternut squash tacos. Hearty, healthy, and ready in less than 30 minutes. The perfect plant-based, gluten-free lunch or dinner.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/09/Saucy-Portobello-Butternut-Tacos-SQUARE.jpg"
  ],
  "keywords": "Portobello Tacos",
  "name": "Saucy Portobello & Butternut Squash Tacos",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "454 kcal",
    "carbohydrateContent": "77.1 g",
    "fatContent": "13.5 g",
    "fiberContent": "17.8 g",
    "proteinContent": "4.7 g",
    "saturatedFatContent": "1.6 g",
    "servingSize": "1 three-taco servings",
    "sodiumContent": "777 mg",
    "sugarContent": "13.9 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3 cups cubed butternut squash",
    "1 Tbsp grape seed or melted coconut oil",
    "1 pinch each sea salt, ground cinnamon, chili powder, and cumin",
    "1 15-oz can black beans (drained, warmed on the stovetop)",
    "1 Tbsp grape seed oil, avocado oil, or coconut oil",
    "1/4 cup diced white onion",
    "3 cloves garlic, minced (3 cloves yield ~1 1/2 Tbsp)",
    "1 15-ounce can tomato sauce*",
    "1 whole chipotle pepper in adobo sauce (plus 1 tsp adobo sauce as original recipe is written // more or less to taste)",
    "1/2 cup water",
    "1/4 tsp each cumin + chili powder",
    "1-2 Tbsp coconut sugar (or sub maple syrup)",
    "5 large portobello mushrooms (stems removed and cut into 1/2-inch slices)",
    "12 small white or yellow corn tacos (warmed in the oven // or microwave wrapped in a damp towel)",
    "Fresh chopped cilantro (optional)",
    "Fresh chopped red onion (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C). Add cubed butternut squash to a baking sheet and drizzle with oil, and add the spices. Toss to combine, then bake for 15-20 minutes, or until tender."
    },
    {
      "@type": "HowToStep",
      "text": "Add beans to a small saucepan over medium-low heat and cook until bubbly, then turn off heat and cover to keep warm."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare sauce. Heat large skillet over medium heat. Once hot, add oil, onion, and garlic. Cook, stirring frequently, until soft and slightly browned and translucent - about 4-5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Turn heat to low and add tomato sauce, diced chipotle pepper, adobo sauce, water, cumin, chili powder, and coconut sugar. Stir to combine and simmer for 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer sauce to a blender and blend well for a completely smooth sauce. Taste and adjust seasonings as needed, adding more adobo sauce for heat, water to thin, or coconut sugar for sweetness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the butternut squash is nearly done roasting, heat a large skillet over medium-high heat. Once hot, add 1 Tbsp oil (amount as original recipe is written // adjust if altering batch size) and portobello mushrooms. Sauté for 3-4 minutes, or until softened and browned. Then add 1/4 cup (~60 g) of the Adobo Sauce (amount as original recipe is written // adjust if altering batch size). Sir to combine and cook for 2-3 minutes more. Then remove from heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add cooked butternut squash to a mixing bowl along with black beans and 1/4 cup (~60 g) of the Adobo Sauce (amount as original recipe is written // adjust if altering batch size). Stir to combine and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Warm tortillas in the still-warm oven to 2-3 minutes, or wrap in a damp towel and microwave for 45 seconds to soften."
    },
    {
      "@type": "HowToStep",
      "text": "Divide toppings between warmed tortillas and garnish with additional sauce (you’ll have leftovers*), diced red onion, and fresh cilantro (optional). Tacos are best when fresh - especially mushrooms. Fillings will keep in the refrigerator for 2-3 days, and sauce will keep in the refrigerator up to 1 week or in the freezer for 1 month (see notes for other uses)."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/saucy-portobello-butternut-squash-tacos"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T02:24:21.144Z"
}
