{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-11-29T22:46:49.883Z",
  "datePublished": "2017-11-17T10:14:15+00:00",
  "description": "Layers of phyllo pastry are wrapped around a savory mix of lentils, mushrooms, walnuts and cranberries, and baked to golden, flaky perfection to make these scrumptious savory vegan hand pies.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2017/11/lentil-mushroom-hand-pies-1-of-3.jpg"
  ],
  "keywords": "lentils, mushrooms, phyllo",
  "name": "Savory Lentil Mushroom Vegan Hand Pies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "196 kcal",
    "carbohydrateContent": "23 g",
    "fatContent": "8.8 g",
    "fiberContent": "3.7 g",
    "proteinContent": "5.6 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "383 mg",
    "sugarContent": "2.5 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "3 tablespoons olive oil, (divided)",
    "10 ounces cremini mushrooms, (coarsely chopped)",
    "1 large leek, (white and pale green parts only, cleaned and chopped)",
    "2 medium carrots, (diced)",
    "2 celery stalks, (diced)",
    "3 garlic cloves, minced",
    "1/2 cup dry white wine",
    "1 tablespoon fresh thyme leaves (or 1 teaspoon dried)",
    "1 tablespoon chopped fresh rosemary (or 1 teaspoon dried)",
    "1 tablespoon chopped fresh sage (or 1 1/2 teaspoon dried rubbed sage)",
    "2 cups cooked brown lentils",
    "3 tablespoons soy sauce",
    "3/4 cup dried cranberries",
    "1/2 cup chopped walnuts",
    "1 teaspoon white wine vinegar",
    "Salt and pepper to taste",
    "1 pound frozen phyllo pastry (18 sheets, thawed)",
    "Olive oil",
    "Super Simple Vegan Gravy"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To make the filling, begin by coating the bottom of a large skillet with 2 tablespoons of olive oil. When the oil is hot, add the mushrooms in an even layer. Cook about 5 minutes, flip and then cook another 5 minutes, until browned. Remove the mushrooms from the skillet and transfer them to a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining tablespoon of oil to the skillet. Once the oil is hot, add the leeks, carrots, and celery. Sauté for about 10 minutes, until softened. Add the garlic and sauté about 1 minute more, until very fragrant."
    },
    {
      "@type": "HowToStep",
      "text": "Add the wine, thyme, rosemary, and sage to the skillet. Raise the heat and bring the mixture to a simmer. Allow to cook until most of the wine has cooked off, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Return the mushrooms to the skillet and add the lentils, soy sauce, cranberries, walnuts, and vinegar to the skillet. Flip everything a few times to incorporate, and then remove the skillet from the heat. Taste test the mixture and season with salt (if needed) and pepper to taste. Adjust any other seasonings to your liking. Allow the mixture to cool for a few minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375° and line a couple of baking sheets with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Place a couple of tablespoons of olive oil into a small bowl. Remove the phyllo from the package. Remove one sheet and arrange it on a work surface with one of the wider sides facing you. Cover the rest of the phyllo sheets with a damp dish towel to prevent them from drying out."
    },
    {
      "@type": "HowToStep",
      "text": "Brush the top of the phyllo sheet with olive oil. Place a heaping 1/4 cup of the filling in one of the corners closest to you, leaving about an inch between it and the sides. Fold the sheet in half, width-wise, so it covers the filling. Fold the sheet in half again, width wise. At this point you should have a 4-layer strip of pastry extending away from you with the filling located near the end towards you. Fold the section with the filling at an angle away from you, forming a triangle containing the filling. Fold the triangle away from you. Continue folding in this manner, so the pastry wraps the filling as you fold, gently pressing the pastry between folds to work out any big air pockets. At the end you should just have a triangular pocket containing the filling. Place it on the baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Continue folding pies until you run out of filling and phyllo. Arrange them all on the baking sheet and brush the tops with olive oil. Cut a slit or two in each with a sharp knife."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the pies until golden, 22-25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with Super Simple Vegan Gravy."
    }
  ],
  "recipeYield": "18",
  "sameAs": [
    "https://connoisseurusveg.com/savory-vegan-hand-pies"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-11-29T22:46:49.879Z"
}
