{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "4.6"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-05T02:16:25.955Z",
  "datePublished": "2021-09-03T03:00:00+00:00",
  "description": "Savory, Ethiopian-inspired teff crepes with a nourishing miso and roasted vegetable filling. Gluten-free, plant-based, and perfect for fall. Just 9 ingredients required!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2021/07/Savory-Teff-Crepes-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/07/Savory-Teff-Crepes-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/07/Savory-Teff-Crepes-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/07/Savory-Teff-Crepes-SQUARE-480x270.jpg"
  ],
  "keywords": "savory crepes, teff crepes",
  "name": "Savory Teff Crepes with Miso Squash Filling",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "283 kcal",
    "carbohydrateContent": "49.7 g",
    "fatContent": "7.4 g",
    "fiberContent": "9.9 g",
    "proteinContent": "8.3 g",
    "saturatedFatContent": "0.9 g",
    "servingSize": "1 crepe with filling",
    "sodiumContent": "472 mg",
    "sugarContent": "8.3 g",
    "unsaturatedFatContent": "6.1 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Ethiopian-Inspired",
  "recipeIngredient": [
    "1 cup teff flour",
    "2 Tbsp flaxseed meal",
    "1/4 tsp sea salt",
    "1 1/2 cups water",
    "Avocado oil (for greasing pan)",
    "4 cups cubed butternut squash, peeled, deseeded, and cut into 1/2-inch cubes",
    "4 cups thinly sliced red cabbage",
    "2 cups sliced red onion, cut into 1/2- to 3/4-inch slices",
    "1/4 cup chickpea miso paste",
    "2 Tbsp avocado oil",
    "1 tsp garlic powder (optional)",
    "1/4 cup water",
    "4 cups loosely packed chopped kale"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To make teff flour, add whole grain teff to a high-speed blender and blend on high for ~1-2 minutes, stopping and tapping the sides of the blender as needed. Transfer to a sealed container and store in the refrigerator for up to 3 months."
    },
    {
      "@type": "HowToStep",
      "text": "CREPE BATTER: To a high-speed blender, add 1 cup (160 g) teff flour, flaxseed meal, salt, and 1 1/2 cups (360 ml) water (adjust amounts if altering number of servings). Blend on high until a smooth and thick but pourable batter forms. If too thick, add water 1 tablespoon (15 ml) at a time and blend again. Set batter aside while preparing the filling."
    },
    {
      "@type": "HowToStep",
      "text": "FILLING: Preheat the oven to 400 F (204 C) and line two large baking sheets with parchment paper. Add butternut squash, red cabbage, and red onion (do not add the kale yet)."
    },
    {
      "@type": "HowToStep",
      "text": "To a small bowl, add chickpea miso paste, avocado oil, and garlic powder (optional) and whisk until smooth. Slowly stir in water (we used 1/4 cup (60 ml) // adjust amount if altering batch size) until a thin paste forms. Drizzle vegetables with half of the miso mixture and toss to thoroughly coat. Bake for 25-30 minutes or until the vegetables are tender with golden brown edges. Toss the kale with half of the remaining miso mixture. Set aside tossed kale (will be roasted later) and remaining mixture for serving."
    },
    {
      "@type": "HowToStep",
      "text": "CREPES: Meanwhile, cook the crepes by heating a small non-stick skillet (or a well-seasoned cast iron skillet) over medium heat. Use a pastry brush or paper towel to evenly grease the skillet with a small amount of oil (roughly 1/4 tsp). Once the pan is hot (water droplets should sizzle when sprinkled in the pan), add 1/4 - 1/3 cup (60-80 ml) of the batter to the center of the pan and gently rotate and shake it to evenly distribute batter. Cook undisturbed for 3 minutes or until the edges become crispy and lift away from the pan (avoid flipping too soon or the batter will stick to the pan). Increase heat to medium-high if the edges are not lifting yet. Flip the crepe and cook for 1-2 minutes on the second side. Transfer to a plate and cover with a clean kitchen towel to keep warm. Repeat with the remaining batter, brushing the pan with more oil as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Once the vegetables are roasted, add kale and cook an additional 3-5 minutes or until the kale is wilted and tender."
    },
    {
      "@type": "HowToStep",
      "text": "Top half of each crepe with the roasted vegetable filling, fold, and drizzle with reserved miso mixture. These would also be delicious served with our serrano white bean dip."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Leftovers will keep stored separately in the refrigerator for up to 2-3 days. Freeze leftover crepes in a sealed container between pieces of parchment paper for up to 1 month. Reheat refrigerated crepes and filling separately on the stovetop until warmed. Crepes can be reheated directly from frozen in the microwave for 30 seconds or the stovetop in a dry skillet over medium heat."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/savory-teff-crepes-with-miso-squash-filling"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-05T02:16:25.954Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=YFO1XUq1TBA",
    "description": "Savory, Ethiopian-inspired teff crepes with a nourishing miso and roasted vegetable filling. Gluten-free, plant-based, and perfect for fall. Just 9 ingredients required!\n\nFull Recipe: https://minimalistbaker.com/savory-teff-crepes-with-miso-squash-filling/\n\nTeff is native to Eastern Africa and used to make the (AMAZING!) Ethiopian fermented flatbread called injera. These crepes are inspired by injera, but do not require fermenting!\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M2S",
    "embedUrl": "https://www.youtube.com/embed/YFO1XUq1TBA?feature=oembed",
    "name": "Savory Teff Crepes with Miso Squash Filling | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/YFO1XUq1TBA/hqdefault.jpg",
    "uploadDate": "2021-09-03T08:00:09+00:00"
  }
}
