{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-01T01:02:58.811Z",
  "datePublished": "2015-11-30T10:26:48+00:00",
  "description": "These hearty vegan mushroom burgers are made with a savory blend of sautéed mushrooms, white beans and tahini, grilled up to perfection and topped with a rich and creamy tahini cheese sauce.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2015/11/mushroom-burger-featured.jpg"
  ],
  "keywords": "mushrooms, tahini, veggie burger",
  "name": "Savory Mushroom Burgers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "520 kcal",
    "carbohydrateContent": "66.7 g",
    "fatContent": "19.6 g",
    "fiberContent": "14 g",
    "proteinContent": "22.8 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 burger",
    "sodiumContent": "665 mg",
    "sugarContent": "7.5 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Sandwich",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1/2 cup brown rice",
    "1 cup vegetable broth",
    "2 tbsp. olive oil, (plus a little more)",
    "1 onion, (diced)",
    "1 lb. white button mushrooms, (cleaned, stemmed and coarsely chopped)",
    "3 garlic cloves, (minced)",
    "1-14 oz. can cannellini beans, (drained and rinsed)",
    "1 cup panko breadcrumbs",
    "1/4 cup tahini",
    "1/4 cup nutritional yeast flakes",
    "2 tbsp. white wine vinegar",
    "2 tbsp. ground flax seeds",
    "1/2 tsp. dried thyme",
    "salt and pepper to taste",
    "2 tbsp. nutritional yeast flakes",
    "1 tbsp. soy sauce",
    "1 tbsp. white wine vinegar",
    "2 tsp. maple syrup or agave",
    "2-3 tbsp. water",
    "6 burger buns",
    "lettuce",
    "tomato",
    "onions, (sautéed onions go great here)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place brown rice and vegetable broth into a small saucepan and place over high heat. Bring to a boil, lower heat, cover and allow to simmer until rice is fully cooked and water is absorbed, 40-45 minutes. Remove from heat and allow to sit, covered, 5 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "While rice cooks, coat the bottom of a large skillet with 2 tablespoons of olive oil and place over medium heat. Add onion and cook until softened, about 5 minutes. Push onions to the side of skillet and add mushrooms in an even layer. Allow to cook until tender and lightly browned, about 4 minutes, flip and cook until lightly browned on opposite sides, about 4 minutes more. Add garlic to skillet and flip everything a few times. Cook about 1 minute more and remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Place cooked rice, mushroom mixture, beans, panko breadcrumbs, tahini, nutritional yeast, vinegar, flax seeds, thyme, salt and pepper into food processor bowl. Pulse everything a few times to mix. Do not overblend. Mixture should be moist, but firm enough to shape into patties. Add a bit more panko if mixture seems too moist."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large skillet with a bit of olive oil and place over medium heat. Working in batches, shape mixture into patties and place in hot skillet, being careful not to overcrowd the skillet. Cook about 5 minutes on each side, until browned, lightly pressing down on the tops of patties, and then drawing the sides in with a spatula to help shape the patties during cooking."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/savory-mushroom-burgers"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-01T01:02:58.811Z"
}
