{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-29T22:46:26.000Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Seafood Risotto With Tomatoes recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp378searis_027:Square-1300x1300"
  ],
  "keywords": "Risotto,Tomato,Prawn",
  "name": "Seafood Risotto With Tomatoes Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "Italian",
  "recipeId": "RGR35336",
  "recipeIngredient": [
    "2-3 tbs olive oil",
    "450g shelled uncooked prawns",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "450g mixed white fish, such as monkfish, sea bass, and haddock, cut into bite-sized pieces",
    "16 scallops, cleaned",
    "2 knobs butter",
    "2 onions, finely chopped",
    "4 cloves garlic, grated or finely chopped",
    "2L vegetable stock, hot",
    "675g risotto rice",
    "2 large glasses white wine",
    "6 tomatoes, skinned and finely chopped",
    "1 large handful fresh flat-leaf parsley, finely chopped",
    "1 handful fresh dill, finely chopped",
    "1 lemon, cut into wedges (to serve)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat 1 tablespoon of the oil in a frying pan, add the prawns and a pinch of salt and black pepper, and cook over a medium to high heat for a couple of minutes, or until they turn pink. Remove and put to one side. Add the fish, and a little more oil, if needed, and cook over a medium heat for a couple of minutes, or until the fish is opaque and cooked. Remove and put to one side."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Season the scallops with salt and black pepper, add to the pan with a little more oil, if needed, and cook for 2 minutes on each side, or until opaque. Remove and put to one side. Add a knob of butter to the pan, followed by the onion, and cook over a low heat for 5-8 minutes, or until soft and translucent. Stir through the garlic and cook for a few seconds. Meanwhile, put the hot stock in a large pan and keep on a low simmer."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add the rice to the frying pan and stir well so it soaks up all the buttery juices. Season with salt and black pepper, then pour in the wine and raise the heat a little. Allow to boil for a few seconds while the alcohol evaporates. Start adding the stock a ladleful at a time, stirring until it has been absorbed before adding more. Continue like this until the rice is cooked but still has a bit of bite to it - about 20 minutes. You may have some stock left over or you may need a little more."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Stir through the tomatoes, return the seafood and fish to the pan, then stir in the herbs and remaining butter. Taste and season with salt and black pepper if needed, then serve with lemon wedges."
    }
  ],
  "recipeNameId": "seafood-risotto-with-tomatoes",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/seafood-risotto-with-tomatoes"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-29T14:45:14.160Z",
  "url": "https://www.woolworths.com.au/shop/recipes/seafood-risotto-with-tomatoes"
}
