{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-30T04:03:55.978Z",
  "datePublished": "2017-11-11T20:10:43+00:00",
  "description": "This simple Seeded No-Knead Bread is packed with seeds for extra texture, flavor, and nutrients!&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2017/11/Seeded-No-Knead-Bread-front.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/11/Seeded-No-Knead-Bread-front-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/11/Seeded-No-Knead-Bread-front-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/11/Seeded-No-Knead-Bread-front-480x270.jpg"
  ],
  "keywords": "Homemade Bread, No Knead Bread",
  "name": "Seeded No-Knead Bread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "209.58 kcal",
    "carbohydrateContent": "61.28 g",
    "fatContent": "6.58 g",
    "fiberContent": "8.33 g",
    "proteinContent": "12.28 g",
    "servingSize": "1 Serving",
    "sodiumContent": "493.8 mg"
  },
  "prepTime": "PT780M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 Tbsp rolled oats ($0.02)",
    "1 Tbsp chia seeds ($0.16)",
    "1 Tbsp hemp seed hearts ($0.17)",
    "1 Tbsp ground flaxseed ($0.04)",
    "1/2 cup warm water ($0.00)",
    "1 cup all-purpose flour ($0.08)",
    "1/2 cup whole wheat flour ($0.10)",
    "3/4 tsp salt ($0.02)",
    "1/8 tsp instant yeast (or bread machine yeast) ($0.02)",
    "1/2 cup room temperature water ($0.00)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the oats, chia seeds, hemp hearts, and flaxseed in a small bowl. Add 1/2 cup warm water and stir to combine. Let the seeds soak for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate large bowl, combine the all-purpose flour, whole wheat flour, salt, and yeast. Stir until very well combined. Add the soaked seeds and then stir until they are as combined as possible (the mixture will be fairly dry). Add about 1/2 cup water, or just enough to form a sticky dough. The dough should be wet enough that there is no dry flour left on the bottom of the bowl, but not so wet that it appears slimy. It should be sticky to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the bowl of dough loosely with plastic and let it sit at room temperature for 12-18 hours. If you can not tend to the dough within 18 hours, you can press \"pause\" on the fermentation by transferring the bowl to the refrigerator."
    },
    {
      "@type": "HowToStep",
      "text": "When you're ready to make the bread, the dough should have expanded and have an almost fluffy appearance. Sprinkle it liberally with flour and scrape it away from the edges of the bowl. Turn the dough over on itself in the bowl a few times, adding more flour as needed to keep it from sticking to your hands, until it forms a smooth ball and is no longer quite as sticky."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the ball of dough to a piece of parchment paper and let it rise for one hour. About half way through the rise time, place a Dutch oven, with its lid, into your oven and set it to bake at 425oF. Allow the Dutch oven to preheat inside the oven for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the dough has risen a bit on the parchment (it will tend to spread out and not so much up), it's time to bake. Carefully remove the Dutch oven from the oven, remove the lid, and then lift up the entire piece of parchment with the dough and place them inside the Dutch oven. Place the lid back on the Dutch oven and carefully return it to the hot oven."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the bread in the Dutch oven for 30 minutes, then carefully remove the lid and bake for another 10 minutes so the top can brown. When finished baking, carefully pick up the parchment to lift the bread out of the Dutch oven and allow the bread to cool slightly before cutting and serving."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/seeded-no-knead-bread"
  ],
  "totalTime": "PT820M",
  "updatedAt": "2022-11-30T04:03:55.975Z"
}
