{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "11",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-03T08:42:08.451Z",
  "datePublished": "2009-01-17T14:44:00+00:00",
  "description": "Don’t be scared off by the number of ingredients or instructions. The scaloppine themselves are super-easy to make and take only about 35 minutes. You can make them ahead of time and store them in the fridge until you’re ready to put them together with the sauce.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2009/01/seitan-scaloppine-fb.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2009/01/seitan-scaloppine-fb-500x500.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2009/01/seitan-scaloppine-fb-500x375.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2009/01/seitan-scaloppine-fb-480x270.jpg"
  ],
  "keywords": "vegan scaloppine",
  "name": "Seitan Scaloppine with Lemon-Olive Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "215 kcal",
    "carbohydrateContent": "14 g",
    "fatContent": "7 g",
    "fiberContent": "2 g",
    "proteinContent": "28 g",
    "servingSize": "1 serving",
    "sodiumContent": "581 mg"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 cup vital wheat gluten",
    "2 tablespoons nutritional yeast",
    "1 teaspoon onion powder",
    "1/2 teaspoon salt",
    "1/4 teaspoon basil",
    "3/4 cup Imagine No-Chicken Broth (or other vegetable broth)",
    "2 tablespoons tahini or cashew butter",
    "1 tablespoon unbleached flour",
    "1 lemon (sliced)",
    "3 cloves garlic (crushed slightly)",
    "10 green olives (pitted and sliced)",
    "1 1/4 cups No-Chicken Broth",
    "2-3 tablespoons white wine or vermouth",
    "2 tablespoons lemon juice",
    "1 tablespoon minced flat-leaf parsley",
    "salt and pepper",
    "additional vegetable broth (as necessary)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Tear off 4 pieces of aluminum foil about 10 inches long. (See tips below for a foil-free way of making the scaloppine.) Begin heating water in a steamer."
    },
    {
      "@type": "HowToStep",
      "text": "In a large bowl, mix the vital wheat gluten with the nutritional yeast, onion powder, salt, and basil. In a smaller bowl, whisk together the broth and tahini (or cashew butter). Stir the wet mixture into the dry until well blended. Knead gently 10 times. Quickly divide dough into 4 equal pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Take a piece of dough and shape and flatten it into a thin oval cutlet. Place it on a sheet of foil, a little higher than center. Fold the bottom of the foil over to meet the top, and then fold the two edges over about 1/2 inch to form a seam. Continue folding the foil by half inches until it reaches just above the cutlet. Flatten the cutlet down a little more, and then fold the left and right edges in the same way until the packet is snug around the cutlet. Repeat with all pieces of dough."
    },
    {
      "@type": "HowToStep",
      "text": "Place the packets flat into the steamer and cover. Steam for 25 minutes. Keep packets sealed until you’re ready to use them."
    },
    {
      "@type": "HowToStep",
      "text": "Spray a non-stick skillet (or some other non-iron skillet) with olive oil spray. Begin heating it as you prepare a plate containing the flour sprinkled with a little salt and pepper. Once the skillet is hot, unwrap each cutlet and lightly dredge each side in the flour and then place in the skillet. Cook until brown and then turn over and brown other side. Remove to a plate. (If you’d rather not use any oil at all, skip the flouring of the cutlets and just brown them alone. Your sauce may not thicken unless you add a little flour to it later.)"
    },
    {
      "@type": "HowToStep",
      "text": "Add the garlic and lemon slices to the pan. Cook until the lemon slices have softened, 2-3 minutes, and then remove them from the pan, leaving the garlic. Add the olives, broth, wine, and lemon juice and cook on medium heat until the liquid starts to reduce. Remove the garlic, add salt and pepper to taste, and return the cutlets to the pan. Turn them over to coat with the sauce. Simmer briefly to warm them through, and if the sauce becomes too thick, add a little broth to thin. Stir in the parsley, and remove the cutlets to plates. Spoon some sauce over each cutlet and garnish with lemon slices."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2009/01/seitan-scaloppine-with-lemon-olive.html"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-03T08:42:08.449Z"
}
