{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "27",
    "ratingValue": "4.75"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-11-30T06:36:33.453Z",
  "datePublished": "2020-12-06T15:33:08+00:00",
  "description": "This Sheet Pan Cranberry Chicken Dinner is an easy and flavorful weeknight dinner that requires very little prep and cleanup!",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2020/12/Sheet-Pan-Cranberry-Chicken-Dinner-front.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/12/Sheet-Pan-Cranberry-Chicken-Dinner-front-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/12/Sheet-Pan-Cranberry-Chicken-Dinner-front-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2020/12/Sheet-Pan-Cranberry-Chicken-Dinner-front-480x270.jpg"
  ],
  "keywords": "one pan dinner, Sheet Pan, tray bake",
  "name": "Sheet Pan Cranberry Chicken Dinner",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "552.53 kcal",
    "carbohydrateContent": "42.33 g",
    "fatContent": "26.03 g",
    "fiberContent": "4.23 g",
    "proteinContent": "35.98 g",
    "servingSize": "1 serving",
    "sodiumContent": "779.7 mg"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 lb. Brussels sprouts ($1.99)",
    "1.5 lbs. sweet potatoes ($1.79)",
    "2 Tbsp olive oil ($0.32)",
    "1/4 tsp salt ($0.02)",
    "1/4 tsp freshly crackd black pepper ($0.03)",
    "1/4 tsp garlic powder ($0.03)",
    "2 boneless, skinless chicken breasts (1.33 lbs. total) ($7.70*)",
    "2 Tbsp butter, room temperature ($0.28)",
    "1/2 tsp dried sage ($0.05)",
    "1/4 tsp dried thyme ($0.03)",
    "1/8 tsp garlic powder ($0.01)",
    "1/2 cup whole berry cranberry sauce (canned) ($0.30)",
    "1/4 cup balsamic vinegar ($0.55)",
    "1 Tbsp butter ($0.14)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400oF. Rinse the Brussels sprouts and then cut them in half. Peel and dice the sweet potatoes into 1/2 to 3/4 -inch pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Place the Brussels sprouts on one half of a large baking sheet and the sweet potatoes on the other half. Drizzle 1 Tbsp olive oil over each side. Sprinkle 1/4 tsp salt and 1/4 tsp pepper over the vegetables, then add 1/4 tsp garlic powder just to the Brussels sprouts. Toss the vegetables, keeping each on its own side, until they're coated in oil and seasoning. Spread the seasoned vegetables out so they are in an even layer. Transfer the baking sheet with the vegetable to the preheated oven and roast for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the vegetables are roasting, prepare the herb baked chicken. In a small bowl, combine the room temperature butter, sage, thyme, garlic powder, and salt. Stir together until it forms an herb-butter paste."
    },
    {
      "@type": "HowToStep",
      "text": "Place the chicken breast on a cutting board and cover with a piece of plastic wrap. Use a mallet or rolling pin to gently pound the chicken breasts out to an even 3/4 -inch thickeness. Cut each pounded chicken breast in half to make two pieces. Pat the chicken dry, then spread the herb butter over the surface of each piece of chicken."
    },
    {
      "@type": "HowToStep",
      "text": "Once the vegetables have been roasting for 15 minutes, remove the baking sheet from the oven and give the vegetables a stir, keeping each on their own side. Push the vegetables to the side a bit (it's okay if they pile up a little) to make room for the chicken breast. Place the four butter and herb coated pieces of chicken down the center of the baking sheet. Return the baking sheet to the oven and bake for an additional 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the chicken and vegetables finish cooking, prepare the cranberry balsamic sauce. Add the cranberry sauce and balsamic vinegar to a sauce pot. Stir and cook the two together over medium heat, allowing the mixture to come up to a simmer. Once simmering, lower the heat slightly and allow it to simmer for 10 minutes, stirring occasionally. After ten minutes, remove the sauce from the heat and stir in the butter. Set the cranberry balsamic sauce aside."
    },
    {
      "@type": "HowToStep",
      "text": "After roasting for 20 minutes, check the internal temperature of the chicken breasts. It should be 165oF. If it's not, bake for an additional 5-10 minutes, or until the internal temperature reaches 165oF."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, spoon the cranberry balsamic sauce over the chicken. Divide the roasted Brussels sprouts and sweet potatoes between four plates and add one piece of chicken to each."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/sheet-pan-cranberry-chicken-dinner"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-30T06:36:33.452Z"
}
