{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "29",
    "ratingValue": "4.8"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-25T11:17:53.195Z",
  "datePublished": "2021-03-06T10:42:43+00:00",
  "description": "These Sheet Pan BBQ Meatballs are easy, colorful, and delicious. Plus the leftovers hold up great, so they're meal prep friendly!",
  "image": {
    "@type": "ImageObject",
    "height": 900,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2021/03/Sheet-Pan-BBQ-Meatballs-H.jpg",
    "width": 1200
  },
  "keywords": "Easy Dinner, meatballs, pineapple bbq, sheet pan meals, tray bake",
  "name": "Sheet Pan BBQ Meatballs",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "549.03 kcal",
    "carbohydrateContent": "77.25 g",
    "fatContent": "14.1 g",
    "fiberContent": "4.15 g",
    "proteinContent": "28.68 g",
    "servingSize": "1 serving",
    "sodiumContent": "823.63 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 lb. ground turkey ($3.89)",
    "1 large egg ($0.21)",
    "1/4 cup breadcrumbs ($0.07)",
    "6 Tbsp BBQ sauce, divided ($0.20)",
    "1/4 tsp garlic powder ($0.03)",
    "1/2 tsp smoked paprika ($0.05)",
    "1/2 tsp salt ($0.02)",
    "1 20oz. can pineapple slices (in juice) ($0.89)",
    "1 yellow onion ($0.32)",
    "1 red bell pepper ($1.50)",
    "1 Tbsp cooking oil ($0.04)",
    "1/8 tsp salt ($0.02)",
    "2 green onions, sliced ($0.20)",
    "1 cup long grain white rice (uncooked) ($0.40)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400oF. Combine the ground turkey, egg, breadcrumbs, 2 Tbsp of BBQ sauce (reserve the remaining 1/4 cup for later), garlic powder, smoked paprika, and salt in a bowl. Mix the ingredients together by hand until evenly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Divide and shape the meat mixture into 16 meatballs. This is easiest by first dividing the mixture into four equal portions, then dividing and shaping each of those portions into four meatballs. The mixture may be fairly wet. That is okay. Place the meatballs on a parchment lined baking sheet and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Slice the bell pepper and onion into 1/4 -inch wide strips. Place the pepper and onion slices on a second baking sheet (lined or unlined, your choice) and drizzle with cooking oil. Toss to coat, then season with salt. Spread the peppers and onions evenly over one side of the baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pineapple slices from the can and blot them dry with paper towel. Lay the pineapple slices over the second half of the baking sheet with the peppers and onions."
    },
    {
      "@type": "HowToStep",
      "text": "Place both baking sheets in the preheated oven and roast for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the sheet pans are in the oven, begin cooking the rice. Add the rice and 1.5 cups water to a sauce pot. Place a lid on top and bring the water up to a boil. Once boiling, turn the heat down to low. Let the rice simmer for 15 minutes. After 15 minutes, turn the heat off and let the rice rest, undisturbed and with the lid on, until the rest of the meal is finished."
    },
    {
      "@type": "HowToStep",
      "text": "After roasting for 15 minutes, take the sheet pan with the vegetables out and give the peppers and onions a stir. Use a brush to lightly coat the pineapple slices with about 2 Tbsp BBQ sauce. Return that sheet pan to the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the sheet pan with the meatballs and use the brush to lightly coat the meatballs with the remaining 2 Tbsp BBQ sauce. Return the sheet pan to the oven. Finish roasting both sheet pans for an additional 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "After the meatballs, peppers, onions, and pineapple have finished roasting, it's time to serve! Fluff the rice with a fork, then add about 3/4 cup rice to each bowl or meal prep container. Divide the meatballs, peppers, onions, and pineapple slices between the four bowls. Top with sliced green onion, then enjoy!"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/sheet-pan-bbq-meatballs"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-25T11:17:53.193Z"
}
