{
  "@type": "Recipe",
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "createdAt": "2022-12-05T10:04:40.170Z",
  "creator": {
    "@type": "Person",
    "name": "Andrea Nguyen"
  },
  "dateCreated": "2021-06-23T10:16:06-04:00",
  "dateModified": "2021-06-22T21:11:40-04:00",
  "datePublished": "2021-06-23T10:16:06-04:00",
  "description": "Here, coconut water is reduced with other ingredients until it caramelizes a bit to create a lovely syrupy sauce for the shrimp.",
  "headline": "Shrimp in Coconut Caramel Sauce",
  "HowtoTip": {
    "text": "Reprinted with permission from Vietnamese Food Any Day: Simple Recipes for True, Fresh Flavors by Andrea Nguyen, copyright © 2019. Published by Ten Speed Press, an imprint of Penguin Random House.Photography credit: Aubrie Pick © 2019"
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FEdit%2FVietnamese_Food_Any_Day_Shrimp_in_Coconut_Caramel_Sauce"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FEdit%2FVietnamese_Food_Any_Day_Shrimp_in_Coconut_Caramel_Sauce"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FEdit%2FVietnamese_Food_Any_Day_Shrimp_in_Coconut_Caramel_Sauce"
    }
  ],
  "keywords": [
    "Cookbook Recipe",
    "dinner",
    "Gluten-Free",
    "Kitchn Cookbook Club",
    "Main Dish",
    "pescatarian",
    "recipe",
    "Shopping",
    "shrimp",
    "vietnamese",
    "asian",
    "seafood",
    "quick",
    "team:news",
    "platform:search",
    "platform:social",
    "course:main dish",
    "cuisine:asia",
    "cuisine:vietnamese",
    "timing:quick",
    "mainingredients:seafood",
    "mainingredients:shellfish",
    "mainingredients:shrimp",
    "method:sauteed",
    "diet:pescatarian",
    "diet:gluten-free",
    "meal:dinner",
    "updated:2021-06-22"
  ],
  "name": "Shrimp in Coconut Caramel Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "328 cal",
    "carbohydrateContent": "43.1 g",
    "cholesterolContent": "0 mg",
    "fatContent": "8.5 g",
    "fiberContent": "2.0 g",
    "proteinContent": "21.2 g",
    "saturatedFatContent": "6.4 g",
    "servingSize": "Serves 4",
    "sodiumContent": "1439.1 mg",
    "sugarContent": "33.7 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Main dish",
  "recipeCuisine": "Asia",
  "recipeIngredient": [
    "1 1/4 pounds extra-large or jumbo shrimp, peeled and deveined",
    "1 1/3 cups coconut water",
    "1 1/2 tablespoons sugar, plus more as needed",
    "1 tablespoon Caramel Sauce (recipe follows), or 1 1/2 teaspoons molasses",
    "1 1/2 tablespoons fish sauce, plus more as needed",
    "2 tablespoons virgin coconut oil",
    "1 large shallot, halved and sliced",
    "3 large garlic cloves, sliced",
    "Recently ground black pepper",
    "1 green onion, green part only, thinly sliced",
    "2 tablespoons water, plus 1/4 cup",
    "1/8 teaspoon unseasoned rice, apple, or distilled white vinegar (optional)",
    "1/2 cup cane sugar"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Pat the shrimp with paper towels to remove excess moisture, and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, combine the coconut water, sugar, caramel sauce, and fish sauce and stir to mix; taste and make sure it’s pleasantly salty-sweet. It will cook down later and intensify but use this opportunity to check the flavor. If needed, add up to 1 1/2 teaspoons sugar or fish sauce, or both. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a skillet or sauteuse pan over medium heat, melt the coconut oil. When the oil is barely shimmering, add the shallot and garlic and cook, stirring frequently, for 3 to 4 minutes, until the garlic is pale blond. Remove from the heat and, once the cooking action subsides, add the coconut water mixture."
    },
    {
      "@type": "HowToStep",
      "text": "Return the skillet to high heat and bring to a boil. Cook, without stirring, for 10 to 14 minutes, until reduced to between 1/3 and 1/2 cup, a bit thickened, and slightly darkened. Add the shrimp and continue cooking at a swift simmer, stirring frequently, for 3 to 5 minutes, until the shrimp curls up and cooks through and the sauce is slightly syrupy. (Expect the shrimp’s natural juices to release, thin out, and flavor the sauce.) If the shrimp cooks too fast, remove it from the pan, let the sauce cook down, and then return the shrimp. Remove from the heat, season with lots of pepper, and stir in the green onion. Let sit for 5 minutes for the flavors to settle and deepen."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the shrimp to a shallow bowl or plate and serve."
    },
    {
      "@type": "HowToStep",
      "text": "Fill the sink (or a large bowl or pot) with enough water to come halfway up the sides of the saucepan."
    },
    {
      "@type": "HowToStep",
      "text": "In the saucepan, combine the 2 tablespoons water, vinegar (if using), and sugar. Set over medium heat and cook, stirring with a heatproof spatula or metal spoon; when the sugar has nearly or fully dissolved, stop stirring. Let the sugar syrup bubble vigorously for 5 to 6 minutes, until it takes on the shade of light tea. Turn the heat to medium-low to stabilize the cooking. Turn on the exhaust to vent the inevitable smoke. (Don’t worry if sugar crystallizes on the pan wall. But if things get crusty in the bubbling sugar syrup, add another drop of vinegar to correct it.) For even cooking, you may occasionally lift and swirl the saucepan."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the syrup for about 2 minutes longer, until it is the color of dark tea. The next 1 to 2 minutes are critical because the sugar will darken by the second. Monitor the cooking and, to control the caramelization, frequently pick up the saucepan and slowly swirl the syrup. When a dark reddish cast sets in—think the color of Pinot Noir—let the sugar cook a few seconds longer to a color between Cabernet and black coffee. Remove from the heat and place the pan in the water to stop the cooking. Expect the pan bottom to sizzle upon contact."
    },
    {
      "@type": "HowToStep",
      "text": "Leaving the pan in the sink, add the remaining 1/4 cup water. The sugar will seize up, which is okay. When the dramatic bubbling reaction stops, return the pan to medium-high heat, and cook briefly, stirring to loosen and dissolve the sugar."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pan from the heat and return to the water in the sink for about 1 minute, stirring, to stop the cooking process and cool the caramel sauce to room temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Use the sauce immediately, or transfer to a small heatproof glass jar, let cool completely, and then cap and store in a cool, dark place indefinitely."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/shrimp-in-coconut-caramel-sauce-23169700"
  ],
  "suitableforDiet": "https://schema.org/GlutenFreeDiet",
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FEdit%2FVietnamese_Food_Any_Day_Shrimp_in_Coconut_Caramel_Sauce",
  "totalTime": "PT0S",
  "updatedAt": "2022-12-05T10:04:40.169Z",
  "url": "https://www.thekitchn.com/shrimp-in-coconut-caramel-sauce-23169700"
}
