{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "21",
    "ratingValue": "4.96"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-02T02:11:50.747Z",
  "datePublished": "2017-03-31T14:40:23+00:00",
  "description": "The beauty of the Instant Pot and other electric pressure cookers is that you can cook dried beans without soaking them first and you don't have to hover over the pot making sure that they don't dry out. In this 6-ingredient recipe, I use boiling water to decrease the amount of time it takes the Instant Pot to come to pressure.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2017/03/instant-pot-black-bean-soup2.jpg"
  ],
  "keywords": "pressure cooker, quick",
  "name": "Simple Instant Pot Black Bean Soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "329 kcal",
    "carbohydrateContent": "65 g",
    "fatContent": "1 g",
    "fiberContent": "15 g",
    "proteinContent": "18 g",
    "servingSize": "1 medium bowl",
    "sodiumContent": "707 mg",
    "sugarContent": "7 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "1 pound dried black beans",
    "1 large onion (diced)",
    "6 cups boiling water",
    "2 teaspoons cumin",
    "1 teaspoon salt",
    "1/4 teaspoon chipotle chile powder",
    "12 ounces frozen corn kernels",
    "1 cup salsa",
    "additional seasonings to taste",
    "avocado, soy yogurt, salsa, squeeze of lime",
    "baked tortilla chips"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Check over the beans for small stones, misshapen beans, or other debris. Rinse well. Start boiling 6 cups of water while you chop the onion."
    },
    {
      "@type": "HowToStep",
      "text": "Turn your Instant Pot on Sauté (other electric pressure cookers may call this \"Brown\"), add the onion, and cook until it's softened and beginning to brown, stirring often."
    },
    {
      "@type": "HowToStep",
      "text": "Add the beans, boiling water, cumin, salt, and chipotle chili powder to the pot. Turn off the Sauté function and lock the lid in place, making sure the pressure release valve is set to Pressure. Press Manual to select high pressure. Adjust the time to 30 minutes. Pot will begin coming to pressure and will count down to zero once pressure is reached."
    },
    {
      "@type": "HowToStep",
      "text": "When the pot is finished cooking at pressure, allow the pressure to come down naturally for 20 minutes. (You can either turn it off or leave it on warm.) Turn the pressure release knob to Steam to release the pressure."
    },
    {
      "@type": "HowToStep",
      "text": "Open the lid carefully, angling it away from you so you won't get steamed. Check the beans for doneness. If they are still hard, replace the lid and give them an extra 2 minutes at high pressure. (Check the liquid level first--if it seems dry, add more water.)"
    },
    {
      "@type": "HowToStep",
      "text": "Once the beans are cooked, you may blend part of the soup or leave it as-is. (I removed 3-4 cups of the beans with a slotted spoon and used a hand blender to blend the soup in the pot. Then I returned the beans to the pot.) Add the corn and salsa. Add water if it seems dry. Taste the soup. Add extra salt, cumin, and chipotle powder as needed. Set the pot on Sauté and adjust the heat to low. Cook, stirring often, scraping up from the bottom, until it's hot throughout. Serve with garnishes of your choice."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2017/03/simple-instant-pot-black-bean-soup.html"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-02T02:11:50.747Z"
}
