{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "52",
    "ratingValue": "4.97"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-01T08:19:45.508Z",
  "datePublished": "2018-08-17T03:00:00+00:00",
  "description": "A simple take on potato salad with fresh herbs, onion, and a light mustard vinaigrette. The perfect plant-based side for cookouts, sandwiches, and more!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Fresh-Style-Potato-Salad-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Fresh-Style-Potato-Salad-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Fresh-Style-Potato-Salad-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Fresh-Style-Potato-Salad-SQUARE-480x270.jpg"
  ],
  "keywords": "potato salad",
  "name": "Simple French-Style Potato Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "80 kcal",
    "carbohydrateContent": "12.2 g",
    "fatContent": "3 g",
    "fiberContent": "1.6 g",
    "proteinContent": "1.5 g",
    "saturatedFatContent": "0.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "111.1 mg",
    "sugarContent": "0.8 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Salad",
  "recipeCuisine": "French-Inspired",
  "recipeIngredient": [
    "2 pounds baby yellow potatoes (we used half yellow, half red)",
    "1 Pinch sea salt and black pepper",
    "1 Tbsp apple cider vinegar",
    "1 cup diced green onion",
    "1/4 cup fresh chopped parsley (optional)",
    "2 1/2 Tbsp spicy brown mustard (or dijon mustard)",
    "3 cloves garlic, minced",
    "1/4 tsp each sea salt and black pepper (plus more to taste)",
    "3 Tbsp red wine vinegar (or white wine vinegar)",
    "3 Tbsp good olive oil (if avoiding oil, see notes*)",
    "1/4 cup fresh chopped dill"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Rinse and scrub potatoes, then slice into 1/4-inch slices. Add to a large saucepan and cover with water. Add a healthy dash of salt (for flavor) and bring to a boil. Once boiling, reduce heat slightly (to medium/high) and continue cooking for 10-15 minutes or until the potatoes are easily pierced with a knife and also easily slide off the knife. Be sure not to undercook the potatoes or they can be waxy and difficult to eat. When in doubt, carefully scoop out a potato and test it to see if it’s the right doneness."
    },
    {
      "@type": "HowToStep",
      "text": "Once the potatoes have finished cooking, drain and rinse with cool water. Then once mostly dry, add to a large serving bowl. Season with a dash of salt and black pepper and apple cider vinegar. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While potatoes are cooking, prepare dressing. Add mustard, garlic, salt, pepper, red wine vinegar, and apple cider vinegar to a mixing bowl and whisk to combine. Then, while continuing to whisk, slowly stream in the olive oil to emulsify the oil and vinegar. Add the dill and whisk once more."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more salt for saltiness, black pepper for spice, mustard for intense mustard flavor, vinegar for more acidity, or dill for herbal flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Add the dressing to the potatoes along with the green onion and parsley (optional), and toss to combine. Taste the potato salad and adjust salt and pepper again (we added a bit more of each). It’s now ready to enjoy, but it also soaks in more of the flavor of the dressing the longer it sits."
    },
    {
      "@type": "HowToStep",
      "text": "Serve warm, chilled, or room temperature. Store leftovers covered in the refrigerator up to 4 days. Not freezer friendly."
    }
  ],
  "recipeYield": "14",
  "sameAs": [
    "https://minimalistbaker.com/simple-french-style-potato-salad"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T08:19:45.508Z"
}
