{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "43",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Yup, it's Vegan"
  },
  "createdAt": "2022-12-01T08:56:40.701Z",
  "datePublished": "2015-02-21T15:11:29+00:00",
  "description": "Amazingly easy vegan cultured cashew cream cheese, made from just two ingredients: cashews and nondairy yogurt. This vegan cream cheese will make a believer out of any skeptic. Naturally paleo, gluten-free, grain-free and no sugar added!",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2015/02/basic-cashew-cream-cheese-yogurt-cultured-vegan-dairy-free.jpg"
  ],
  "keywords": "cashew cream cheese",
  "name": "Simple Cultured Cashew Cream Cheese",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "81 kcal",
    "carbohydrateContent": "4 g",
    "fatContent": "6 g",
    "fiberContent": "1 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "1 g",
    "servingSize": "2 tablespoons",
    "sodiumContent": "76 mg",
    "sugarContent": "1 g",
    "unsaturatedFatContent": "5 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "basics",
  "recipeCuisine": "gluten-free",
  "recipeIngredient": [
    "2 cups raw cashews (soaked overnight in filtered water (raw macadamia nuts also work - but will take a lot longer to blend)",
    "2 tbsp plain, unsweetened non-dairy yogurt (see notes)",
    "1/2 tsp sea salt (plus more to taste)",
    "filtered water (as needed to blend)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare a clean and dry glass or other nonreactive container. I use a Pyrex container. It may not be strictly required, but it's best to sterilize all of your equipment with boiling water before getting started."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the liquid off of the soaked cashews. Add them to a blender or food processor and blend until completely smooth. If you aren't used a high-powered blender, it will take several minutes for the cashews to break down and release oils in order to become a smooth mixture. Stop to scrape down the sides as needed; you can also add filtered water a tablespoon at a time if you're having trouble blending."
    },
    {
      "@type": "HowToStep",
      "text": "Note: if your blender has warmed the mixture very much, it's best to take a break now and wait for it to cool down (we don't want to kill the yogurt cultures with heat). Then, add the yogurt and salt and pulse to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to the clean container and cover. Let sit out at room temperature for 24 hours. Use a clean utensil to taste the mixture, and add more sea salt to taste; let it culture for another 12-24 hours if you want a stronger tang."
    },
    {
      "@type": "HowToStep",
      "text": "Store in the refrigerator for up to 1 weeks. (Note: length of storage time may depend on the culturing conditions and brand of yogurt used)."
    },
    {
      "@type": "HowToStep",
      "text": "(Optional step) This recipe makes cultured cashew cream cheese with a texture more like \"whipped\" dairy cream cheese. For a firmer texture like block cream cheese, press out the liquid using cheesecloth."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://yupitsvegan.com/basic-cultured-cashew-cream-cheese"
  ],
  "totalTime": "PT10M",
  "updatedAt": "2022-12-01T08:56:40.700Z"
}
