{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "10",
    "ratingValue": "3.8"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-02T11:53:46.333Z",
  "datePublished": "2011-09-12T08:58:31+00:00",
  "description": "This barbecue sauce contains no refined sugar and is lower in sodium than packaged barbecue sauce. If you’re used to highly salted foods, it may taste bland unless you add more salt. I recommend you do this after it’s cooked so you’ll have a good idea of how much is needed.If you don't have a slow cooker, follow the Oven Instructions instead.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/09/thai-salad-slow-cooked-tofu-2.jpg"
  ],
  "name": "Slow-Cooked Tofu in Pineapple Barbecue Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "239 kcal",
    "carbohydrateContent": "31 g",
    "fatContent": "7 g",
    "fiberContent": "4.5 g",
    "proteinContent": "16 g",
    "servingSize": "1 serving",
    "sodiumContent": "453 mg",
    "sugarContent": "20.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Slow Cooker",
  "recipeIngredient": [
    "2 14-ounce packages extra-firm tofu (frozen and defrosted)",
    "1 large onion (chopped)",
    "8 large cloves garlic (minced)",
    "1/2 cup pitted dates (about 2.5 ounces)",
    "1 1/2 cup crushed pineapple in own juice",
    "1/3 cup water",
    "2 fresh hot chile peppers (chopped)",
    "2 inches ginger-root (peeled and minced (about 3 tablespoons minced)",
    "5 tablespoons tomato paste",
    "2 tablespoons tamari or lite soy sauce",
    "1 tablespoon lime juice",
    "1 tablespoon cider vinegar",
    "generous grating of black pepper",
    "Salt (optional), to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "At least 1 day before you plan to cook, place two packages of extra-firm tofu (water-pack style, not silken) into the freezer. Freeze at least 24 hours (this makes it firmer and sponge-like, which helps it hold up to long, slow cooking). Remove from freezer and allow to defrost in the refrigerator or use a quick defrost method (microwave or hot water bath)."
    },
    {
      "@type": "HowToStep",
      "text": "When tofu is completely defrosted, cut each block into halves horizontally and cut each half again vertically. Take each piece of tofu between your hands and gently press over a sink to squeeze out as much water as possible. Cut into 1/2-inch cubes."
    },
    {
      "@type": "HowToStep",
      "text": "Saute the onion in a non-stick pan (or on the browning setting, if your crock-pot has one) until it begins to brown. Add the garlic and cook for another minute. Scrape the onion/garlic into a blender and add all remaining ingredients except tofu and salt. Blend on high speed until sauce is a uniform consistency."
    },
    {
      "@type": "HowToStep",
      "text": "Place the tofu into the slow cooker (sprayed with non-stick spray or canola oil, if necessary) and pour the sauce over it. Stir very gently to make sure all sides of the tofu are covered. Cover and cook on Low for 8 hours or until sauce is absorbed and thickened. (Note: some crockpots run hotter than others so check once or twice to make sure the tofu isn’t sticking or falling apart.) Check seasonings and add salt and extra lime juice as needed. Serve over salad greens."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2011/09/thai-salad-with-slow-cooked-tofu-in-pineapple-barbecue-sauce.html"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-02T11:53:46.332Z"
}
