{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "31",
    "ratingValue": "4.68"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T08:54:53.483Z",
  "datePublished": "2016-09-10T05:00:44+00:00",
  "description": "Protein-packed tempeh marinated in a smoky red chipotle sauce over brown rice, black beans, and veggies! A hearty, 9-ingredient plant-based meal!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/08/Smoky-tempeh-Burrito-Bowls-SQUARE.jpg"
  ],
  "keywords": "tempeh",
  "name": "Smoky Tempeh Burrito Bowls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "602 kcal",
    "carbohydrateContent": "79 g",
    "fatContent": "21.8 g",
    "fiberContent": "7.7 g",
    "proteinContent": "28.7 g",
    "saturatedFatContent": "3.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "756 mg",
    "sugarContent": "7.2 g"
  },
  "prepTime": "PT75M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup uncooked brown rice + water for cooking",
    "1 15-ounce can black beans (if unsalted, add salt)",
    "1/2 tsp cumin powder",
    "10 ounces tempeh (ensure gluten-free if GF* // cubed)",
    "1 Tbsp olive or avocado oil",
    "1/2 large white onion (diced)",
    "2 cloves garlic, minced (2 cloves yield ~1 Tbsp)",
    "1 15-ounce can tomato sauce*",
    "1 whole chipotle in adobo sauce (canned // plus 1 Tbsp sauce // adjust according to preferred spice)",
    "Fresh cilantro, chopped",
    "Red cabbage, thinly sliced",
    "Hot sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If serving with rice, start using this method from Saveur - my absolute favorite for fluffy (not sticky at all) brown rice! It takes 45 minutes, so start it now to be ready for serving."
    },
    {
      "@type": "HowToStep",
      "text": "Next steam tempeh by adding 1 inch of water to a large saucepan and bringing to a simmer. Then insert steamer basket and top with tempeh (still whole or cut into large chunks). Cover and steam for 15 minutes - this will soften the texture slightly and most importantly, draw out some of the bitterness. Once steamed, cube and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Make sauce by heating a medium cast iron or metal skillet over medium heat. Once hot, add oil and onion. Cook, stirring frequently, until soft and slightly browned - 3 minutes. Then add garlic and cook for 1-2 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Add tomato sauce, chipotle pepper, and adobo sauce and stir. Heat until bubbly, then reduce heat to low and simmer for 3-4 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer sauce to a blender and blend on high for a completely smooth sauce. For a chunkier sauce, pulse and leave some texture (I prefer mine smooth). Taste and adjust seasonings as needed, adding a pinch of salt for more flavor or adobo sauce for heat."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer sauce back to skillet and heat over low, stirring occasionally, to thicken the sauce and deepen the flavors."
    },
    {
      "@type": "HowToStep",
      "text": "Next add black beans to a small saucepan and heat over medium heat. Once bubbling, reduce heat, add cumin and a pinch of sea salt, stir, and reduce heat to low/simmer (to keep warm until serving). For a refried bean texture, mash with the back of a wooden spoon until thick and paste-like (I left mine whole)."
    },
    {
      "@type": "HowToStep",
      "text": "Heat another large skillet over medium heat. Once hot, add oil and the cubed (steamed) tempeh and crisp and brown on all sides - about 6-8 minutes total. Then add to the red sauce and stir gently to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Cover with a lid for 2-3 minutes to allow the flavors to meld, then remove lid and continue simmering on very low temperature until serving."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, divide the rice, beans, tempeh, and vegetables of choice between 2-3 serving bowls. Garnish with lime and fresh cilantro (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers covered in the refrigerator up to 3 days."
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://minimalistbaker.com/smoky-tempeh-burrito-bowls"
  ],
  "totalTime": "PT105M",
  "updatedAt": "2022-12-01T08:54:53.480Z"
}
