{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "createdAt": "2022-12-04T21:58:01.162Z",
  "datePublished": "2015-11-02T08:33:47+00:00",
  "description": "A smoky black bean, rice and veggie mixture is the perfect filling for these smoky, Southwestern-style avocado cups. Serve them as they are, or with chips for scooping.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2015/11/Avocado-Cups-5-of-6-1.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2015/11/Avocado-Cups-5-of-6-1-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2015/11/Avocado-Cups-5-of-6-1-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2015/11/Avocado-Cups-5-of-6-1-480x270.jpg"
  ],
  "keywords": "Avocado Cups, Smoky Southwestern Avocado Cups",
  "name": "Smoky Southwestern Avocado Cups",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "527 kcal",
    "carbohydrateContent": "47 g",
    "fatContent": "37 g",
    "fiberContent": "18 g",
    "proteinContent": "9 g",
    "saturatedFatContent": "5 g",
    "servingSize": "2 g",
    "sodiumContent": "264 mg",
    "sugarContent": "4 g",
    "unsaturatedFatContent": "30 g"
  },
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 tablespoon cumin seeds",
    "4 small to medium avocados",
    "2 tablespoons avocado oil (divided)",
    "1/4 onion (diced)",
    "1/2 small zucchini (chopped)",
    "Pinch of sea salt",
    "1/2 small bell pepper (any color, chopped)",
    "1/4 teaspoon dried oregano",
    "1/4 teaspoon paprika or smoked paprika",
    "1/2 cup black beans (drained)",
    "1/2 cup rice or another grain (cooked al dente (we used Lundberg Family Farms' black pearl rice)",
    "1 chipotle pepper in adobo sauce (chopped + 1/2 tablespoon of adobo sauce from can)",
    "1 medium tomato (diced)",
    "2-3 pinches of coarse salt for garnish (we used a smoked habanero Himalayan salt)",
    "1-2 small lime (cut into wedges, for garnish)",
    "Cilantro for garnish (optional)",
    "Tortilla or rice chips for serving (optional - we used Lundberg Family Farms Sea Salt rice chips)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat a small, heavy-bottom skillet over medium heat. Add the cumin seeds and toast, stirring frequently, until they're fragrant and just turning golden-brown. This may take anywhere from 45 seconds to 3 minutes depending on the pan and your stove. Make sure to watch the seeds carefully so they don't burn (a little smoke is normal). Set the cumin seeds aside."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the avocados in half, removing the pits. Using a small knife, carefully scoop out the flesh from the middle of each avocado half, leaving a little bit of avocado around the sides. You may need a small spoon to help lift the avocado flesh out of the skin."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange the avocado \"shells\" on a serving plate, and cover them with an upside-down mixing bowl or plastic wrap. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Place the avocado flesh on a cutting board and dice gently, being careful not to mash. Set the diced avocado flesh aside and cover it with plastic wrap or an upside-down mixing bowl to prevent browning."
    },
    {
      "@type": "HowToStep",
      "text": "Heat 1 tablespoon of oil in a large skillet over medium-high heat. Sauté the onion until soft and beginning to brown, 3 to 5 minutes. Add zucchini and pinch of sea salt into the pan and sauté until the zucchini just browns, about 3 minutes. Add the bell pepper and sauté until slightly soft, about 3 minutes. Add the oregano, paprika, beans, rice, chipotle pepper and adobo sauce, and half of the toasted cumin seeds to the pan, stir and adjust heat to low, cooking until heated through. (If the pan gets too dry, add a little water or a squeeze of lime juice.)"
    },
    {
      "@type": "HowToStep",
      "text": "Spoon about 1 tablespoon of the rice mixture into each of the 8 avocado shells, until the mixture is about level with the top of the shell (you might have extra rice). Top each shell with about 1 tablespoon of diced avocado, then sprinkle with tomato until they're all filled just above the shell."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle the avocado cups evenly with the remaining avocado oil, then sprinkle them with the remaining cumin seeds and coarse salt to taste. Garnish with cilantro if desired, and serve alongside lime wedges that can be squeezed onto the cups and chips for scooping (optional)."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://ohmyveggies.com/smoky-southwestern-avocado-cups-lundberg-family-farms-harvest-recap"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet",
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T21:58:01.162Z"
}
