{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "173",
    "ratingValue": "4.5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-02T16:04:49.254Z",
  "datePublished": "2014-09-18T05:00:55+00:00",
  "description": "10-ingredient, smoky black bean beet burgers with walnuts, quinoa, and a blend of spices. Hearty, nutritionally dense, and simple to prepare.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/09/Quinoa-Beet-Burgers-SQUARE.jpg"
  ],
  "keywords": "beet burgers",
  "name": "Smoky Black Bean Beet Burgers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "125 kcal",
    "carbohydrateContent": "17.2 g",
    "fatContent": "4.9 g",
    "fiberContent": "3.8 g",
    "proteinContent": "6.1 g",
    "servingSize": "1 patty",
    "sodiumContent": "257 mg",
    "sugarContent": "1.8 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 cup cooked quinoa",
    "1/2 large red onion (finely diced // 1/2 onion yields ~3/4 cup)",
    "1 cup finely chopped mushrooms (shitake, baby bella, or white button)",
    "1 pinch each salt & pepper",
    "1 15-ounce can black beans (well rinsed and drained)",
    "1 cup finely grated raw beet",
    "1 tsp cumin",
    "1/2 tsp chili powder (or sub extra cumin)",
    "1/4 tsp smoked paprika",
    "~1/2 cup raw walnuts (crushed or ground into a loose meal)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you do not already have cooked quinoa, prepare it at this time. 1/4 cup uncooked quinoa will yield ~3/4 cup cooked."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium-low heat and add some nonstick spray or a bit of olive oil. Once hot add the onion and sauté, seasoning with a pinch each salt and pepper."
    },
    {
      "@type": "HowToStep",
      "text": "When the onions are soft – about 5 minutes – turn up the heat to medium and add the mushrooms. Season with another pinch of salt and pepper and cook until the mushrooms and onions are slightly browned and fragrant – about 3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from heat and add black beans and mash. You’re looking for a rough mash, so you can leave a bit of texture if you want."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to a mixing bowl and add the quinoa, beets, spices and stir. For even more flavor, add a shake of vegan worcestershire or A-1 sauce (optional). Taste and adjust, adding more salt for overall flavor (we added another 1/4 tsp)."
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, add the walnut meal a little at a time until the mixture is able enough to form into patties. Set in the fridge to chill while your oven preheats to 375 degrees F (190 C) (skip this step if cooking on the stovetop - see notes)."
    },
    {
      "@type": "HowToStep",
      "text": "Coat a baking sheet with nonstick spray or olive oil. Form mixture into roughly 1/3-cup sized patties (8-9 patties // adjust if altering batch size). I use a peanut butter jar lid lined with plastic wrap to get the perfect shape (a tip I learned from Iowa Girl Eats). You can also just take handfuls and mash them into loose patties."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange burgers on a baking sheet and brush or spray the tops with olive oil. Bake at 375 F (190 C) for a total of 30-45 minutes, gently flipping after 25-30 minutes. Cook longer to dry them out even more and achieve more crisp, but it’s not necessary."
    },
    {
      "@type": "HowToStep",
      "text": "Serve on small buns or atop mixed greens with desired toppings. See notes for freezing instructions."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/smoky-black-bean-beet-burgers"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-02T16:04:49.251Z"
}
