{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "94",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-01T12:37:27.552Z",
  "datePublished": "2018-03-18T03:00:20+00:00",
  "description": "Smoky, hearty black bean burgers with sweet potato, mushrooms, quinoa, and pecans. Wholesome, satisfying, BIG on flavor, and just 10 ingredients required! The ultimate veggie burgers for the grill or stovetop.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/02/BBQ-Black-Bean-Burger-SQUARE.jpg"
  ],
  "keywords": "veggie burger",
  "name": "Smoky BBQ Black Bean Burger",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "369 kcal",
    "carbohydrateContent": "42.1 g",
    "fatContent": "18.8 g",
    "fiberContent": "11.9 g",
    "proteinContent": "11.1 g",
    "saturatedFatContent": "4.2 g",
    "servingSize": "1 burger",
    "sodiumContent": "823 mg",
    "sugarContent": "7 g",
    "unsaturatedFatContent": "13.3 g"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup cooked + cooled quinoa (divided // see notes for cooking instructions)",
    "1 15-ounce can black beans (rinsed and dried)",
    "2/3 cup raw pecans",
    "1 Tbsp coconut or avocado oil (plus more for cooking burgers // or water)",
    "1 heaping cup sliced and peeled sweet potato (cut into 1/4-inch rounds)",
    "2 heaping cups thinly sliced cremini or button mushrooms",
    "2 Tbsp coconut aminos (optional)",
    "1/2 tsp sea salt (plus more to taste)",
    "2 1/2 tsp chili powder",
    "2 1/2 tsp cumin powder",
    "3 Tbsp vegan-friendly BBQ sauce ( (I like Annie’s organic original BBQ sauce // plus more for glazing)",
    "Vegan-friendly hamburger buns OR lettuce wraps (and gluten-free if needed)",
    "Veggies of choice (i.e. onion, cabbage, tomato, pickles)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven’t yet, cook quinoa and set aside to cool (see notes for instructions)."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and spread rinsed, dried black beans onto a parchment-lined baking sheet. Bake beans for 6 minutes. Then add pecans to the baking sheet and bake for 10 minutes more. The nuts should be fragrant and golden brown (be careful not to burn), and the beans should appear dry and cracked open (this way, they do not become mushy in the burger mix). Set aside to cool. Increase oven temperature to 375 degrees F (190 C)."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat a medium to large cast-iron or metal skillet over medium/medium-low heat. Once hot, add oil (or water) and the sweet potato. Cover and cook for 3-4 minutes, turning heat down if the potatoes are browning too quickly. Once browned on the underside, flip and cook for 3-4 minutes more or until tender and golden brown. Remove from the pan."
    },
    {
      "@type": "HowToStep",
      "text": "To the still-hot pan, add the sliced mushrooms and coconut aminos (optional - sub a little salt otherwise) and cook on medium/medium-high for about 4-5 minutes, stirring frequently, or until they’re browned, fragrant, and cooked down to half their size. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To a food processor, add beans and pecans and blitz/pulse into a loose meal (some texture is good - you don’t want a powder)."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add cooked sweet potato, mushrooms, half the quinoa, sea salt, chili powder, cumin, and BBQ sauce and pulse a few times to combine (again, some texture is good here - you're not going for a purée)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to a mixing bowl and stir in the rest of the quinoa. Then taste and adjust flavor as needed, adding more cumin for smokiness, chili powder for heat, BBQ sauce for sweetness / depth of flavor, or salt for saltiness."
    },
    {
      "@type": "HowToStep",
      "text": "If the mixture appears too wet, add more quinoa. If it looks too dry, add more BBQ sauce (or a little coconut aminos) to moisten."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the mixture into four even balls and form into patties with your hands or by lining a 1/2 cup measuring cup with plastic wrap, packing the mixture inside, then lifting the plastic wrap out - mash slightly into more of a disc. Refrigerate burgers for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once chilled, heat the cast-iron or metal pan from earlier over medium heat. Once hot, add a bit more oil (or water) and the burgers. Cook for 4-5 minutes. Then carefully flip and cook for 4-5 minutes on the other side. Then turn off heat, glaze/brush with a bit more BBQ sauce, and transfer the pan to the oven. Bake at 375 F (190C) for 10-15 minutes more. The burgers should appear browned."
    },
    {
      "@type": "HowToStep",
      "text": "Serve as is or with toppings. We enjoyed ours on buns with butter lettuce, shredded red pepper, shredded cabbage, pickles, radish, and more BBQ sauce. Store leftovers in the refrigerator for 3-4 days or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/smoky-bbq-black-bean-burger"
  ],
  "totalTime": "PT105M",
  "updatedAt": "2022-12-01T12:37:27.551Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=Dgq-LJV0_ro",
    "description": "Smoky, hearty black bean burgers with sweet potato, mushrooms, quinoa, and pecans. Wholesome, satisfying, BIG on flavor, and just 10 ingredients required! The ultimate veggie burgers for the grill or stovetop.\n\nFull Recipe: https://minimalistbaker.com/smoky-bbq-black-bean-burger/\n\nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M3S",
    "embedUrl": "https://www.youtube.com/embed/Dgq-LJV0_ro?feature=oembed",
    "name": "Smoky BBQ Black Bean Burgers | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/Dgq-LJV0_ro/hqdefault.jpg",
    "uploadDate": "2018-03-18T10:00:03+00:00"
  }
}
