{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "11",
    "ratingValue": "4.73"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T06:19:26.167Z",
  "datePublished": "2014-04-17T17:09:30+00:00",
  "description": "These fun and flavorful Smores Macarons are a baking challenge, but worth every bit of effort. Get the full tutorial here.&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2014/04/Smores-Macarons-text-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2014/04/Smores-Macarons-text-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2014/04/Smores-Macarons-text-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2014/04/Smores-Macarons-text-1-480x270.jpg"
  ],
  "name": "S'mores Macarons",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "111.24 kcal",
    "carbohydrateContent": "17.66 g",
    "fatContent": "4.21 g",
    "fiberContent": "0.94 g",
    "proteinContent": "2.08 g",
    "servingSize": "1 Serving",
    "sodiumContent": "25.97 mg"
  },
  "prepTime": "PT120M",
  "recipeIngredient": [
    "2 large eggs, whites only ($0.44)",
    "1/2 cup granulated sugar ($0.08)",
    "1/8 tsp cream of tartar ($0.05)",
    "pinch of salt ( $0.01)",
    "1/4 tsp vanilla extract ($0.07)",
    "2/3 cup slivered almonds ($1.66)",
    "1 cup powdered sugar ($0.18)",
    "2 Tbsp unsweetened cocoa powder ($0.08)",
    "2 large eggs, whites only ($0.04)",
    "1/4 cup granulated sugar ($0.04)",
    "2 oz. dark chocolate ($1.70)",
    "1/4 cup heavy cream ($0.44)",
    "2-3 squares graham crackers, crushed ($0.18)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin by making the marshmallow cream. In a glass or metal bowl, whisk together the egg whites, granulated sugar, cream of tartar, and a pinch of salt until well combined. Place about 1 inch of water in a small sauce pot and bring it to a boil. Place the bowl with the egg white mixture over the boiling water and whisk by hand for 6 minutes. Remove the bowl from the heat, add the vanilla, and use a hand mixer or stand mixer to whip the egg white mixture to glossy peaks (about 5 minutes). Refrigerate until ready to use."
    },
    {
      "@type": "HowToStep",
      "text": "Next, begin the macaron shells. Place the almonds, powdered sugar, and cocoa powder in a food processor. Process the mixture until it is a super fine powder. Sift the mixture through a wire sieve into a bowl."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate bowl (glass or metal) combine the egg whites, sugar, and cream of tartar. Stir or whisk together until combined, then use a hand mixer or stand mixer to whip the whites into stiff, glossy peaks (about 5 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Fold about 1/3 of the cocoa almond mixture at a time into the whipped egg whites until no dry powder remains. After all of the dry mixture has been folded in, the mixture should have the consistency of thick, hot lava."
    },
    {
      "@type": "HowToStep",
      "text": "Cover two baking sheets with parchment paper. Use a pastry bag to pipe the macaron mixture into 1.5 inch rounds on the parchment paper. Leave enough space for the macarons to spread slightly without touching. After piping all of the macarons onto the sheet, slam the baking sheet on a counter a few times to force any larger air bubbles to the surface. Let the cookies sit out at room temperature for about 30 minutes so that the surface dries slightly (this helps form a \"foot\" or ruffle on the bottom of the macaron)."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 degrees. After 30 minutes of sitting, the macarons should have a dull, less glossy appearance. Bake one sheet at a time for 13 minutes each. Allow the macarons to cool to room temperature before removing from the parchment."
    },
    {
      "@type": "HowToStep",
      "text": "To make the ganache, break up the chocolate into small pieces and place in a microwave safe bowl. Add the heavy cream. Microwave on high for 15 seconds, then stir well. Microwave for 15 seconds once more, then stir until the chocolate is completely melted and has created a smooth mixture with the cream. Let cool."
    },
    {
      "@type": "HowToStep",
      "text": "Fill a pastry bag with the marshmallow creme and a second bag with the chocolate ganache. Flip half of the macarons over and pipe a circle of marshmallow creme around the outside edge of the bottom. Fill the center of the marshmallow creme circle with ganache, then place a second macaron shell on top and press down slightly. Dip the filled macarons in the crushed graham crackers to make it stick to the marshmallow creme. Tip: Dip soon after filling as the marshmallow dries a bit and gets less tacky as it sits."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://budgetbytes.com/smores-macarons"
  ],
  "totalTime": "PT150M",
  "updatedAt": "2022-12-02T06:19:26.165Z"
}
