{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-12-04T15:46:55.942Z",
  "datePublished": "2017-02-27T05:42:45+00:00",
  "description": "Soft Whole Wheat Dinner Rolls. Moist and soft Whole wheat Rolls 100% Whole grain rolls. Use as Wheat Buns for Burgers or Sliders. Vegan Whole Grain Dinner Rolls. Soy-free Palm Oil-free Recipe. Makes an 8 by 8 or 9 by 9 inch square pan.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2017/02/vegan-soft-wheat-dinner-rolls-veganricha-9574-1-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2017/02/vegan-soft-wheat-dinner-rolls-veganricha-9574-1-1-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2017/02/vegan-soft-wheat-dinner-rolls-veganricha-9574-1-1-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2017/02/vegan-soft-wheat-dinner-rolls-veganricha-9574-1-1-480x270.jpg"
  ],
  "name": "Soft Whole Wheat Dinner Rolls with Tangzhong Starter",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "176 kcal",
    "carbohydrateContent": "26 g",
    "fatContent": "6 g",
    "fiberContent": "3 g",
    "proteinContent": "4 g",
    "servingSize": "1 serving",
    "sodiumContent": "197 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Bread",
  "recipeCuisine": "Side",
  "recipeIngredient": [
    "1/4 scant cup whole wheat flour (a bit less than 1/4 cup)",
    "1/2 cup water",
    "1 cup whole wheat flour",
    "1 cup warm water",
    "2.5 tbsp maple syrup or other sweetener of choice (i like to use 1.5 tbs mapel and 1 tbsp sugar)",
    "1 tbsp active yeast (1 tablespoon = 3 tsp)",
    "2 cups whole wheat flour (or 1 cup whole wheat and 1 cup whole spelt flour)",
    "1 tsp salt",
    "3 tbsp extra virgin olive oil",
    "1 tsp lemon juice",
    "1/4 tsp almond extract (optional, adds nice bakery like smell)",
    "olive oil or vegan butter for brushing"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a small saucepan combine 1/4 cup flour and 1/2 cup water over medium heat. mix well and cook until gel like, smooth and starting to get shiny, stirring frequently. Set this tangzhong starter lump aside."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the ingredients under Sponge in a bowl. Mix with a large spoon for 2 minutes until the batter is very smooth and starting to get gluten-ny."
    },
    {
      "@type": "HowToStep",
      "text": "Let the bowl sit covered for 1 hour in a warm place. (Use a large bowl as the sponge will triple)."
    },
    {
      "@type": "HowToStep",
      "text": "In a stand mixer, add the sponge, tangzhong. Mix the salt into the 2 cups flour and add the flour to the stand mixer. Start kneading. Add in the oil, lemon juice and continue to knead for 5 minutes. Let the dough rest for 2 minutes. Check the dough to see if it needs more flour or water (it should be soft and smooth. not stiff and not sticky). Add more flour 1 tbsp at a time if needed. The dough should be soft and slightly tacky, but not overly sticky or not too stiff."
    },
    {
      "@type": "HowToStep",
      "text": "Knead for another 5 to 7 minutes. The dough should not break immediately when a small portion is pulled out. (I knead at setting 2 on my kitchen aid). You can let the dough rest for 15-20 minutes at this point."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the dough in 12 equal balls. flatten each ball into an oval then roll it up like a jelly roll. Place seam side down in the baking pan. Repeat for all rolls. Spray oil on top. Sprinkle sesame seeds or oats. * See Notes for refrigeration or freezing instructions."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the pan with a towel and let rise for 25 to 40 minutes or until the rolls double in size."
    },
    {
      "@type": "HowToStep",
      "text": "Pre-heat the oven to 375 degrees F/ 190oc. Bake the bread for 20 to 22 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pan from the oven and brush oil or vegan butter on top. Remove the bread from the pan after 10 minutes. Wait for another 5 before serving the warm rolls with olive oil or vegan butter or as a side with anything."
    },
    {
      "@type": "HowToStep",
      "text": "Store in a bread container on the counter for upto 2 days or refrigerate for upto a week."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://veganricha.com/soft-whole-wheat-dinner-rolls"
  ],
  "totalTime": "PT105M",
  "updatedAt": "2022-12-04T15:46:55.941Z"
}
