{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT1800S",
  "createdAt": "2022-12-06T11:17:41.842Z",
  "creator": {
    "@type": "Person",
    "name": "Jesse Szewczyk"
  },
  "dateCreated": "2021-09-15T08:01:07-04:00",
  "dateModified": "2021-09-20T10:58:42-04:00",
  "datePublished": "2021-09-15T08:01:07-04:00",
  "description": "A step-by-step recipe for making cinnamon rolls with sourdough starter.",
  "headline": "Sourdough Cinnamon Rolls",
  "HowtoTip": {
    "text": "Sourdough starter: This recipe calls for a bubbly, active sourdough starter that has been recently fed. It should look airy and have a strong sour scent. If you are unsure if your starter is active, place a tablespoon of the starter in a bowl of room-temperature water. If the starter floats, it’s active and ready to use. (Read more: How to Know if Your Sourdough Starter Is Ready for Bread Baking)Overnight baking option: To make the cinnamon rolls the day before baking, shape, cut, and assemble the sliced dough log in a baking pan as written in the recipe (including the initial rising times), tightly cover in plastic wrap, and store in the refrigerator overnight (up to 12 hours). The next day, when ready to bake, let the cinnamon rolls rest on the counter at room temperature lightly covered in plastic wrap until puffy and the dough springs back slightly when touched, 1 to 1 1/2 hours, then bake as written in the recipe.Freezing the unbaked rolls: To freeze the cinnamon rolls and bake at a later date, prepare the rolls up until the final rise, tightly wrap in plastic wrap, and store in the freezer. When ready to bake, let the baking dish sit on the counter at room temperature for 1 hour, unwrap the cinnamon rolls, and bake. (It’s OK if the rolls are still slightly frozen.) Bake as written in the recipe and check for doneness. Because the cinnamon rolls are baked from frozen, they will most likely need an additional 5 to 15 minutes to fully bake.Storage: Leftover cinnamon rolls can be refrigerated in an airtight container for up to 5 days."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FRecipes%2F2021-09-Sourdough-Cinnamon-Rolls%2FCinnamon-Rolls-043"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FRecipes%2F2021-09-Sourdough-Cinnamon-Rolls%2FCinnamon-Rolls-043"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipes%2F2021-09-Sourdough-Cinnamon-Rolls%2FCinnamon-Rolls-043"
    }
  ],
  "keywords": [
    "baking",
    "breakfast",
    "brunch",
    "cinnamon rolls",
    "kid-friendly",
    "Make Ahead",
    "recipe",
    "sourdough",
    "pantry",
    "dairy",
    "Freezer Friendly",
    "baked goods",
    "Cooking with Kids",
    "children",
    "team:food",
    "platform:search",
    "lifestyle:edible gift",
    "lifestyle:kid-friendly",
    "dishtype:breakfast sweet",
    "dishtype:baked good",
    "dishtype:cinnamon roll",
    "cuisine:united states",
    "timing:make-ahead",
    "timing:extended",
    "timing:freezer-friendly",
    "timing:overnight",
    "timing:all-day",
    "occasion:timing",
    "occasion:weekend",
    "mainingredients:butter",
    "mainingredients:cream cheese",
    "mainingredients:pantry",
    "mainingredients:sugar",
    "mainingredients:dairy",
    "mainingredients:flour",
    "method:baked",
    "meal:breakfast",
    "meal:brunch"
  ],
  "name": "Sourdough Cinnamon Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "309 cal",
    "carbohydrateContent": "46.4 g",
    "cholesterolContent": "0 mg",
    "fatContent": "12.4 g",
    "fiberContent": "1.0 g",
    "proteinContent": "3.7 g",
    "saturatedFatContent": "6.9 g",
    "servingSize": "Serves 20",
    "sodiumContent": "158.6 mg",
    "sugarContent": "28.4 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT1800S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Breakfast",
  "recipeCuisine": "United states",
  "recipeIngredient": [
    "4 tablespoons (1/2 stick) unsalted butter",
    "1 cup ripe, fed, active room-temperature sourdough starter (see Recipe Note)",
    "2/3 cup milk (any kind)",
    "1/2 cup granulated sugar",
    "1 large egg",
    "2 teaspoons vanilla extract",
    "1 teaspoon kosher salt",
    "3 1/3 cups all-purpose flour, plus more as needed",
    "Cooking spray",
    "4 tablespoons unsalted butter",
    "1 cup packed light brown sugar",
    "2 tablespoons ground cinnamon",
    "8 ounces cream cheese",
    "2 cups powdered sugar",
    "1 teaspoon vanilla extract"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place 4 tablespoons unsalted butter in a small microwave-safe bowl and microwave on HIGH in 10-second increments until fully melted, 30 to 40 seconds total. Pour into the bowl of a stand mixer (or large bowl if kneading by hand)."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 cup sourdough starter, 2/3 cup milk, 1/2 cup granulated sugar, 1 large egg, 2 teaspoons vanilla extract, and 1 teaspoon kosher salt. Mix on medium-low speed with the dough hook until combined with no streaks of egg yolk, 1 to 2 minutes. (If kneading by hand, stir with a rubber spatula until combined.)"
    },
    {
      "@type": "HowToStep",
      "text": "Add 3 1/3 cups all-purpose flour and mix on low speed until the flour is moistened, 30 seconds to 1 minute. Increase the speed to medium-low and knead until the dough is smooth, soft, and forms a ball on the dough hook, 2 to 3 minutes. If the dough is sticking to the sides of the bowl, add more flour 1 tablespoon at a time and continue mixing. (If kneading by hand, stir until the dough comes together and forms a shaggy mass, then knead on a heavily floured work surface until it forms a smooth ball, 2 to 3 minutes.)"
    },
    {
      "@type": "HowToStep",
      "text": "Gently remove the dough from the bowl and coat the bowl in cooking spray. Return the dough to the bowl, spray the top with cooking spray, and tightly cover the bowl in plastic wrap. Let rise at room temperature for 1 1/2 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the dough onto itself from bottom to top four times as if creating a tight ball, then flip it upside down so the seam is on the bottom. (This helps make the dough stronger and smoother.) Cover the bowl with plastic wrap again and let rise in a warm place until the dough is puffy but not doubled in size (it should spring back slightly when poked and feel soft), about 2 hours more. Meanwhile, make the filling."
    },
    {
      "@type": "HowToStep",
      "text": "Place 4 tablespoons unsalted butter for the filling on the counter and let sit at room temperature to soften. Place 1 cup packed light brown sugar and 2 tablespoons ground cinnamon in a medium bowl and toss with your hands until the cinnamon is evenly distributed."
    },
    {
      "@type": "HowToStep",
      "text": "When the dough is ready, coat a 9x13-inch baking dish with cooking spray. Punch the dough down and transfer onto a lightly floured work surface. Flour a rolling pin and roll the dough into a 16x11 rectangle (about 1/4-inch thick), with a long side closer to you."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the softened butter for the filling evenly over the entire surface from edge to edge with an offset spatula. Sprinkle the cinnamon-sugar evenly over the butter. Starting at the long end closest to you, roll the dough up tightly into a log, using a bench scraper as needed to help release the dough from the work surface. Pinch the seam together at the top."
    },
    {
      "@type": "HowToStep",
      "text": "Position the log seam-side down. Cut crosswise into 12 pieces with a sharp knife or piece of unflavored dental floss. (It’s easiest to cut the log into 4 equal pieces, then cut each piece into 3 rolls.) Arrange the cut rolls cut-side up in the baking dish, 4 across and 3 down."
    },
    {
      "@type": "HowToStep",
      "text": "Loosely cover in plastic wrap and let rise at room temperature until the rolls are puffy, fill out the pan more, and spring back slightly when touched, 2 to 3 1/2 hours. (The rolls might not double in volume like traditional yeast-risen cinnamon rolls, but they should be very puffy and visually larger.) Meanwhile, place 8 ounces cream cheese and 4 tablespoons unsalted butter in the bowl of a stand mixer (or lage bowl if using an electric hand mixer). Let sit at room temperature to soften."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange a rack in the middle of the oven and heat the oven to 375°F. Uncover the cinnamon rolls and bake until puffed, golden-brown, and a toothpick or skewer inserted in several spots comes out clean, 25 to 30 minutes. Remove from the oven and let cool for 30 minutes until warm but not hot. Meanwhile, make the frosting."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 teaspoon vanilla extract to the cream cheese and butter. Beat with the paddle attachment on low speed until mostly smooth."
    },
    {
      "@type": "HowToStep",
      "text": "With the mixer on low speed, slowly add 2 cups powdered sugar and continue beating until the sugar is mostly incorporated, 2 to 3 minutes. Increase the speed to medium and beat until smooth and fluffy, 30 seconds to 1 minute more. Frost the warm cinnamon rolls with the frosting and serve."
    }
  ],
  "recipeYield": null,
  "sameAs": [
    "https://thekitchn.com/sourdough-cinnamon-rolls-recipe-23213454"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipes%2F2021-09-Sourdough-Cinnamon-Rolls%2FCinnamon-Rolls-043",
  "totalTime": "PT3600S",
  "updatedAt": "2022-12-06T11:17:41.841Z",
  "url": "https://www.thekitchn.com/sourdough-cinnamon-rolls-recipe-23213454"
}
