{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths  ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-11-22T22:15:22.671Z",
  "datePublished": "2022-08-03",
  "description": "There is nothing quite like freshly baked bread. This recipe takes time but the results are worth it.  For German Sourdough Bread (Bauernbrot), replace 2 cups of the bread flour in the dough with rye flour.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/tik072soubre_024:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Sourdough bread",
  "name": "Sourdough Bread with Fennel Seeds Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Entrees",
  "recipeCuisine": "Australian",
  "recipeId": "RGR12125",
  "recipeIngredient": [
    "240g bread flour",
    "7g envelope instant yeast",
    "2.25 cups tepid water",
    "760g bread flour, plus more for dusting",
    "1 tbs sugar",
    "1 tbs fennel seeds",
    "1 tsp salt",
    "1.5 cups tepid water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "To make the starter, mix the flour and yeast together in a large bowl. Using a wooden spoon, gradually stir in the water to make a smooth batter. Cover with plastic wrap. Let stand in the kitchen (not necessarily in a warm place) for 2 days, stirring daily. The finished starter will look separated and have a sharp aroma."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the bread, mix the flour, yeast, sugar, fennel, and salt together in a large bowl. Make a well in the center. Stir the starter well. Add 1/4 cup of the starter and the water to the flour mixture."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Stir until the dough comes together, adding a little more water if needed. Knead on a lightly floured work surface for 810 minutes, until the dough is smooth and elastic. Shape into a ball. Transfer to a clean bowl and cover with plastic wrap. Let stand in a warm place until doubled in volume."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Oil a large baking sheet. Punch down the dough and knead briefly on a lightly floured surface. Shape into a ball and flatten the top. Transfer to the baking sheet. Cover with plastic wrap and let stand in a warm place until doubled."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 220°C. Lightly dust the loaf with flour then, using a sharp knife, slash the top in a diamond pattern. Bake for 15 minutes. Lower the oven temperature to 190°C and bake for 2025 minutes, or until the bread sounds hollow when tapped underneath. Transfer to a wire rack and let cool."
    }
  ],
  "recipeNameId": "sourdough-bread-with-fennel-seeds",
  "recipeYield": "2  loaves",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/sourdough-bread-with-fennel-seeds"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-11-22T22:15:22.671Z",
  "url": "https://www.woolworths.com.au/shop/recipes/sourdough-bread-with-fennel-seeds"
}
