{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-11-25T10:08:59.000Z",
  "datePublished": "2022-10-11",
  "description": "The trick for keeping this dish crisp, light, and juicy is to maintain the oil at the correct temperature.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/amecoo096soufri_031:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Fried chicken,Chicken",
  "name": "Southern Fried Chicken Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "American",
  "recipeId": "RGR3705",
  "recipeIngredient": [
    "1 tsp salt",
    "0.25 cup sunflower oil, for frying",
    "2 cup buttermilk",
    "1 tbs hot chilli sauce",
    "8 small skin-on chicken pieces, preferably legs and small thighs",
    "150g self-raising flour",
    "25g cornflour",
    "1 tsp garlic powder",
    "1 tsp cayenne pepper",
    "1 tsp paprika",
    "1 tsp black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Whisk together the buttermilk and hot chilli sauce, and season well. Put the chicken pieces into a dish in a single layer and pour the buttermilk over them. Cover the dish in cling film and chill for at least 4 hours, or preferably overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "When you are ready to cook the chicken, put all the dry ingredients together in a large plastic bag and shake well to combine. Take the chicken pieces out of the buttermilk mixture and shake off any excess. Put the chicken pieces into the bag, one at a time, and shake until they are well covered with the coating. Lay them on a wire rack as you work, and allow them to rest for 30 minutes at room temperature (this will help the coating to stick during frying)."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "In a large, heavy-based saucepan or deep-fat fryer, heat the oil to 190°C and carefully lower the chicken pieces into the oil, without overcrowding the pan. Cook for 5-7 minutes on each side (depending on the size of the pieces), turning them over occasionally so that they brown evenly. The temperature of the oil will dip when the chicken is added, and should be maintained at 150-160°C. The chicken is ready if the juices run clear when a skewer is inserted into the thickest part of the meat."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Remove the chicken pieces from the pan with a slotted spoon and drain well on kitchen paper. If you are cooking in more than one batch, keep the fried chicken warm in the oven at 150°C (Gas 2) while you cook the remaining pieces."
    }
  ],
  "recipeNameId": "southern-fried-chicken",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/southern-fried-chicken"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-11-25T08:12:00.422Z",
  "url": "https://www.woolworths.com.au/shop/recipes/southern-fried-chicken"
}
