{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T13:02:42.082Z",
  "datePublished": "2016-07-27T12:15:35+00:00",
  "description": "A fresh, spicy, savory Southwestern salad that's perfect for a meal, a side, or a dip.",
  "image": [
    "https://www.veganosity.com/wp-content/uploads/2016/07/Southwestern-Roasted-Corn-and-Black-Bean-Salad-3-1.jpg",
    "https://www.veganosity.com/wp-content/uploads/2016/07/Southwestern-Roasted-Corn-and-Black-Bean-Salad-3-1-500x500.jpg",
    "https://www.veganosity.com/wp-content/uploads/2016/07/Southwestern-Roasted-Corn-and-Black-Bean-Salad-3-1-500x375.jpg",
    "https://www.veganosity.com/wp-content/uploads/2016/07/Southwestern-Roasted-Corn-and-Black-Bean-Salad-3-1-480x270.jpg"
  ],
  "keywords": "corn and black bean dip, roasted corn and black bean salad",
  "name": "Southwestern Roasted Corn and Black Bean Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "90 kcal",
    "carbohydrateContent": "17 g",
    "fatContent": "1 g",
    "fiberContent": "6 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "1 g",
    "servingSize": "0.5 cup",
    "sodiumContent": "440 mg",
    "sugarContent": "2 g",
    "unsaturatedFatContent": "2 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "32 ounce black beans, drained and rinsed well",
    "1 tablespoon sea salt, divided",
    "1 tablespoon cumin",
    "1 tablespoon chipotle pepper",
    "2 ears of corn – leave in husks and soak in water for thirty minutes before grilling or remove the husks and brush with olive oil and sprinkle with salt and pepper.",
    "1 large Vidalia or sweet white onion (sliced into 1/2 inch thick slices)",
    "2 poblano peppers",
    "1 orange bell pepper (chopped)",
    "1 cup cilantro, coarsely chopped",
    "2 large colorful heirloom tomatoes (seeded and diced)",
    "Juice from 2 large limes"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cover the beans in water in a medium sauce pan and bring to a boil. Reduce the heat to low and add one tablespoon of salt, the cumin, and the chipotle pepper. Cook for 15 minutes then drain the beans in a colander and place in a large bowl. NOTE: much of the salt and spices will drain with the water so don’t be afraid to add the full amount."
    },
    {
      "@type": "HowToStep",
      "text": "NOTE: Prepare the corn and onions before grilling so you can grill the corn, onion, and poblano peppers while the beans are cooking."
    },
    {
      "@type": "HowToStep",
      "text": "Grill the corn. If you soaked the corn in the husks grill for approximately 15 minutes. Turn frequently. If the husks are removed then brush lightly with olive oil and sprinkle with salt and pepper and grill for approximately 10 minutes and turn frequently. Let cool until you can safely remove the husks and cut the corn off of the cobs. NOTE: Cut the corn off of the cobs over the bowl with the beans so you don’t lose any of the kernels."
    },
    {
      "@type": "HowToStep",
      "text": "Brush the onion slices with a light coat of olive oil and sprinkle with salt and pepper and grill for approximately 4 minutes per side or until they show grill marks. You don’t want to cook them until they’re soft, they should maintain their crispness. Dice them and put them in the bowl with the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Grill the poblano peppers about 4 minutes per side or until the skins begin to blacken and blister. When cool enough to handle scrape the skin off, seed, and dice. Put them in the bowl with the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Seed and dice the bell pepper and put them in the bowl with the beans."
    },
    {
      "@type": "HowToStep",
      "text": "Squeeze the juice of one of the limes over the bean and vegetable mixture while it’s hot and sprinkle 2 tsps (5 g) of salt (or to taste) and toss to coat. Refrigerate for at least 20 minutes to cool."
    },
    {
      "@type": "HowToStep",
      "text": "NOTE: The acid in the lime juice will continue the cooking process of the beans and vegetable s so make sure you add the juice of the lime at this step."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the salad from the refrigerator and add the cilantro and tomatoes and the juice of the second lime. Toss to combine."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://veganosity.com/southwestern-roasted-corn-black-bean-salad"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-02T13:02:42.080Z"
}
