{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "34",
    "ratingValue": "4.77"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T08:34:06.142Z",
  "datePublished": "2016-05-16T16:29:38+00:00",
  "description": "Spaghetti Carbonara is fast and easy dinner with just a few ingredients and a luxuriously creamy sauce.",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2016/05/Spaghetti-Carbonara-eat-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/05/Spaghetti-Carbonara-eat-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/05/Spaghetti-Carbonara-eat-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2016/05/Spaghetti-Carbonara-eat-1-480x270.jpg"
  ],
  "keywords": "Bacon Pasta, Cheap Food, Easy Pasta Dish, Easy Pasta Recipe",
  "name": "Spaghetti Carbonara",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "537.43 kcal",
    "carbohydrateContent": "67.53 g",
    "fatContent": "18.18 g",
    "fiberContent": "2.83 g",
    "proteinContent": "24.23 g",
    "servingSize": "1 Serving",
    "sodiumContent": "759.65 mg"
  },
  "prepTime": "PT10M",
  "recipeIngredient": [
    "3 oz. bacon ($0.88)",
    "2 cloves garlic ($0.16)",
    "12 oz. spaghetti ($0.66)",
    "3 large eggs ($0.92)",
    "3/4 cup grated Parmesan ($1.44)",
    "Freshly cracked pepper ($0.10)",
    "Salt to taste ($0.05)",
    "Handful fresh parsley (optional) ($0.10)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Fill a large pot with water for the pasta and season with salt. Place a lid on the pot and bring it up to a boil over high heat."
    },
    {
      "@type": "HowToStep",
      "text": "While waiting for the water to boil, cut the bacon into small pieces. Cook the bacon in a large skillet over medium-low heat until brown and crispy. Remove the cooked bacon from the skillet, then turn the heat down to low. Mince two cloves of garlic, add them to the warm skillet, and sauté for about one minute or until fragrant and softened, then turn off the heat."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, whisk together the eggs, 1/2 cup of the Parmesan, and a generous dose of freshly cracked pepper."
    },
    {
      "@type": "HowToStep",
      "text": "The water should be boiling at this point, so add the pasta, stir well, and continue to boil the pasta until al dente. Reserve one cup of the starchy pasta cooking water, then drain the pasta in a colander."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1/4 cup of the reserved pasta water to the skillet that was used to cook the bacon. Stir the warm water in the skillet and dissolve the browned bits from the surface of the skillet. Add the steaming hot drained pasta to the skillet and toss in the bacon liquid in the skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the egg and Parmesan mixture over the hot pasta and immediately begin to stir or toss the pasta. Continue to stir the hot pasta in the egg mixture until a creamy sauce forms. Add the remaining Parmesan, a little more freshly cracked pepper, and the reserved bacon bits, and toss again. If the pasta becomes too thick or dry, add a splash more of the reserved pasta water."
    },
    {
      "@type": "HowToStep",
      "text": "Finally, taste the pasta and adjust the salt, Parmesan, or pepper if needed. Top with a pinch or two of roughly chopped parsley leaves."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/spaghetti-carbonara"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-02T08:34:06.142Z"
}
