{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "135",
    "ratingValue": "4.95"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT80M",
  "createdAt": "2022-12-03T21:03:23.385Z",
  "datePublished": "2015-10-27T05:00:15+00:00",
  "description": "Flavorful, hearty 10-ingredient Spaghetti Squash Lasagna Bake with simple tofu ricotta and vegan parmesan cheese! A plant-based meal that's perfect for fall and winter!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/09/Spaghetti-Squash-Lasagna-Bake-SQUARE.jpg"
  ],
  "keywords": "spaghetti squash",
  "name": "Spaghetti Squash Lasagna Bake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "325 kcal",
    "carbohydrateContent": "37.7 g",
    "fatContent": "16.8 g",
    "fiberContent": "6.3 g",
    "proteinContent": "10.2 g",
    "saturatedFatContent": "3.2 g",
    "servingSize": "1 serving",
    "sodiumContent": "871 mg",
    "sugarContent": "15.8 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 large (~3-4 pounds each) spaghetti squash",
    "3-4 Tbsp extra virgin olive oil (plus more for squash)",
    "~1/2 tsp each sea salt + black pepper (to taste // plus more for squash)",
    "2 lemons, juiced (2 lemons yield ~1/3 cup or 80 ml)",
    "12 ounces extra-firm tofu (drained and pressed dry for 10 minutes)",
    "3 Tbsp nutritional yeast",
    "1/2 cup packed fresh basil",
    "1 Tbsp dried oregano",
    "1/4 cup vegan parmesan cheese",
    "Vegan parmesan cheese",
    "25 ounces favorite marinara (/ red sauce)",
    "Fresh basil, chopped (optional)",
    "Red pepper flakes (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and line a large baking sheet with foil."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully halve your spaghetti squash lengthwise using a sharp knife. I find the best way is to pierce the skin with the very tip of the knife and push it all the way through to the other side. Rock the knife back and forth to cut one half all the way through, then repeat on the other side."
    },
    {
      "@type": "HowToStep",
      "text": "Use an ice cream scoop (or sharp spoon) to scrape out the seeds and most of the stringy parts. It should appear pretty clean."
    },
    {
      "@type": "HowToStep",
      "text": "Brush the interior with oil and sprinkle with a little salt and pepper. Place cut-side down on baking sheet. Roast for 45 minutes, or until a knife easily pierces the skin and flesh. Remove from oven and set aside to cool slightly. Also reduce oven heat to 375 degrees F (190 C)."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add all tofu filling ingredients to a food processor or blender and pulse to combine, scraping down sides as needed. You are looking for a semi-pureed mixture with bits of basil still intact."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed, adding more salt and pepper for flavor, nutritional yeast for cheesiness, and lemon juice for brightness."
    },
    {
      "@type": "HowToStep",
      "text": "Once fully baked and slightly cooled, use a fork to scoop out spaghetti squash into fine strings. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly grease a 9x13-inch (or similar size) baking dish (adjust dish size/number if altering the number of servings) and lay down 1/3 of the squash. Top with several spoonfuls of tofu ricotta, then pour on a layer of marinara sauce. Repeat until all ricotta filling and marinara is used up - about 3 layers. Make sure the top layer is sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Loosely cover the dish with foil and bake for 20 minutes at 375 degrees F (190 C). Then remove foil and bake for an additional 10-15 minutes, or until the sauce is bubbly and the top is golden brown. Cover with foil if the squash is browning too quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Let cool briefly, then serve with desired toppings (listed above). I prefer red pepper flakes and vegan parmesan cheese. Fresh basil adds a nice pop of color."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Store leftovers covered in the refrigerator for 2-3 days. Reheat in a 350-degree F (176 C) oven for 20-25 minutes or until completely warmed through."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/spaghetti-squash-lasagna-bake?asin=B000I1YIDQ&isAmazonFulfilled=1&marketplaceID=ATVPDKIKX0DER&ref_=dp_merchant_link&seller=A1Z0FNYMD2P58N"
  ],
  "totalTime": "PT95M",
  "updatedAt": "2022-12-05T22:19:53.875Z"
}
