{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-04T10:05:30.656Z",
  "datePublished": "2016-11-18T05:00:06+00:00",
  "description": "10-ingredient spicy vegan cheeseball with pimento peppers and nutritional yeast! Creamy, simple to make, and incredibly flavorful! The perfect holiday dip!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/11/Spicy-Vegan-Cheese-Ball-SQUARE.jpg"
  ],
  "keywords": "cheese ball",
  "name": "Spicy Vegan Pimento Cheese Ball",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "106 kcal",
    "carbohydrateContent": "5.1 g",
    "fatContent": "9 g",
    "fiberContent": "0.7 g",
    "proteinContent": "2.6 g",
    "saturatedFatContent": "2.5 g",
    "servingSize": "2 two-Tbsp servings",
    "sodiumContent": "66 mg",
    "sugarContent": "2.6 g"
  },
  "prepTime": "PT750M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 cups raw cashews",
    "2 cloves garlic, minced (2 cloves yield ~1 Tbsp)",
    "1/2 tsp garlic powder (plus more to taste)",
    "1 medium lemon, zested + juiced (yields ~3 Tbsp or 45 ml juice as original recipe is written)",
    "3-4 Tbsp nutritional yeast (to taste)",
    "1/2 tsp sea salt (plus more to taste)",
    "2 Tbsp olive oil",
    "4 oz. vegan cream cheese* (I like Trader Joe's or Toffuti)",
    "1 4-oz. jar pimento peppers (drained)",
    "1/2 tsp smoked paprika",
    "1/8 tsp cayenne pepper (optional)",
    "1/4 cup chopped raw walnuts or pecans",
    "1 Tbsp nutritional yeast",
    "1 tsp smoked paprika",
    "1 tsp chili powder",
    "1 pinch cayenne pepper",
    "1 healthy pinch sea salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place cashews in a bowl and cover with cool water. Soak overnight or for at least 6 hours. If you can't get to them right away, drain, place back in bowl, and cover with plastic wrap. They will keep refrigerated for up to 2 days. Although not ideal for this recipe, you can also quick soak the cashews by covering with boiling hot water and soaking for 1 hour, then draining and proceeding with recipe as instructed."
    },
    {
      "@type": "HowToStep",
      "text": "Once soaked, drain cashews thoroughly and add to your food processor (or a blender - though it's a little tougher to blend as there's not that much liquid added)."
    },
    {
      "@type": "HowToStep",
      "text": "Add minced garlic, garlic powder, lemon zest, lemon juice, nutritional yeast, salt and olive oil. Blend until very creamy and smooth, scraping down sides as needed. Then add vegan cream cheese, pimento peppers, smoked paprika and cayenne (optional). Blend once more until creamy and smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed, adding more lemon zest for tartness, nutritional yeast for cheesiness, garlic for zing, salt for saltiness, paprika for smokiness, or cayenne for heat. I added a bit more nutritional yeast, salt, cayenne and paprika. You want this to be super flavorful, so don't be shy!"
    },
    {
      "@type": "HowToStep",
      "text": "Place a fine mesh strainer (or colander) over a medium mixing bowl, and lay down two layers of cheesecloth (or a clean, fine, absorbent towel)."
    },
    {
      "@type": "HowToStep",
      "text": "Use a spatula to scoop all of the cheese over the cheesecloth, then gather the corners and twist the top gently to form the cheese into a \"disc.\" Secure with a rubber band."
    },
    {
      "@type": "HowToStep",
      "text": "Place in refrigerator to set for at least 6 hours, preferably 12-24, or until semi-firm to the touch. There likely won't be any liquid in the bowl, but the cheesecloth absorbs excess moisture and the cheese hardens in the refrigerator."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, unwrap from cheesecloth and gently invert onto a serving platter. Reform with hands or cheesecloth as needed."
    },
    {
      "@type": "HowToStep",
      "text": "To make coating (optional), mix together nuts and spices and use hands to gently roll the ball around until coated. It is fragile, so handle gently."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately with crackers, vegetables or tortilla chips. I prefer this cheese with crackers or chips because it pairs better with carbs than vegetables in my opinion!"
    },
    {
      "@type": "HowToStep",
      "text": "Cheese will hold its form for 1-2 hours out of the refrigerator, but best when chilled. Leftovers keep well covered in the refrigerator up to 5 days."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://minimalistbaker.com/spicy-vegan-pimento-cheese-ball"
  ],
  "totalTime": "PT750M",
  "updatedAt": "2022-12-04T10:05:30.655Z"
}
