{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Kiersten"
  },
  "createdAt": "2022-12-02T11:51:53.382Z",
  "datePublished": "2019-04-30T08:00:00+00:00",
  "description": "Reprinted with permission from The Vegetable Gardener's Cookbook by Danielle Majeika, Page Street Publishing Co. 2019. Photo credit: Danielle Majeika.",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2019/04/Vegetable-Gardeners-spicyroastedcarrothummus.jpg"
  ],
  "name": "Spicy Roasted Carrot Hummus",
  "recipeCategory": "Snacks &amp; Appetizers",
  "recipeIngredient": [
    "2 medium carrots",
    "1 large clove garlic",
    "1 tsp sesame oil",
    "Pinch of salt (plus more to taste)",
    "1 1/2 cups 246 g cooked chickpeas (or 1 [15-oz (425-g)] can), drained and rinsed, plus more for serving",
    "1/4 cup 70 g tahini",
    "3 tbsp 45 ml fresh lemon juice",
    "1 tbsp 16 g chili paste, such as sambal oelek",
    "1/4 tsp cumin",
    "1/4 tsp coriander",
    "2 tbsp 30 ml extra-virgin olive oil, plus more for serving",
    "Chopped parsley and sesame seeds (for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 425°F (218°C)."
    },
    {
      "@type": "HowToStep",
      "text": "Line a roasting pan with parchment paper and spread out the carrots and garlic clove. Toss them with the sesame oil and a small pinch of salt. Roast the carrots until tender, 40 to 50 minutes. Allow them to cool to room temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Process the roasted carrots, garlic, chickpeas, tahini, lemon juice, chili paste, cumin and coriander in a food processor until the mixture is smooth, about 1 minute. With the motor running, stream in the olive oil until the hummus is light and creamy. Season to taste with salt."
    },
    {
      "@type": "HowToStep",
      "text": "Serve the hummus in a shallow bowl and garnish with parsley, sesame seeds, chickpeas and a drizzle of olive oil. Store the hummus in the refrigerator for 5 to 7 days."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://helloveggie.co/roasted-carrot-hummus"
  ],
  "updatedAt": "2022-12-02T11:51:53.380Z"
}
