{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "88",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T21:01:08.568Z",
  "datePublished": "2016-02-18T05:00:24+00:00",
  "description": "Simple, 30-minute spicy red pasta sauce with red lentils for added protein and fiber. Serve over gluten-free pasta for a delicious and hearty plant-based meal!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/01/Spicy-Red-Lentil-Pasta-SQUARE.jpg"
  ],
  "keywords": "red pasta",
  "name": "Spicy Red Pasta with Lentils",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "778 kcal",
    "carbohydrateContent": "138.6 g",
    "fatContent": "11.3 g",
    "fiberContent": "30.9 g",
    "proteinContent": "33.3 g",
    "saturatedFatContent": "2.2 g",
    "servingSize": "1 serving",
    "sodiumContent": "1100 mg",
    "sugarContent": "20.8 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup dry red lentils (rinsed in cool water for 1 minute)",
    "2 cups water",
    "1 pinch sea salt",
    "1 Tbsp olive oil",
    "3 cloves garlic, minced (3 cloves yield ~1 1/2 Tbsp)",
    "1/4 cup carrots (very finely diced)",
    "1/4 cup diced tomatoes (optional)",
    "1 15-ounce can tomato sauce*",
    "2 Tbsp tomato paste",
    "1 pinch sea salt (plus more to taste)",
    "1/2 tsp red chili flakes (divided)",
    "1 Tbsp dried or fresh oregano",
    "1 Tbsp dried or fresh basil",
    "1-2 Tbsp sweetener of choice (such as organic cane sugar or coconut sugar)",
    "1 Tbsp vegan parmesan cheese",
    "8 ounces gluten-free pasta"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add lentils and water to a small saucepan and bring to a low boil over medium heat, then reduce heat slightly to achieve a mild simmer (not boil)."
    },
    {
      "@type": "HowToStep",
      "text": "Cook lentils to preferred doneness - 15 minutes for a slight bite, 20-22 minutes for more tender lentils. For this dish, I prefer 'al dente' so they don't become mushy."
    },
    {
      "@type": "HowToStep",
      "text": "When lentils are finished cooking, drain off any excess cooking liquid, season with a pinch of salt, and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While lentils are cooking, heat a large, rimmed metal or cast iron skillet over medium heat. Once hot, add olive oil, garlic, carrots and tomato (optional). Sauté for 3 minutes, stirring frequently."
    },
    {
      "@type": "HowToStep",
      "text": "To prevent splattering, remove skillet from heat and add tomato sauce, tomato paste, pinch sea salt, chili flake, oregano, basil, sweetener, and vegan parmesan cheese (optional), and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Place back over heat and bring to a low simmer over medium-low heat. Once simmering, reduce heat to low and continue cooking for 10-15 minutes, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "If serving with pasta, cook according to package instructions at this time. Then drain and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Sample pasta sauce and adjust seasonings as needed. Add more sweetener to balance and enhance the flavors: chili flake for heat, salt for saltiness, or more herbs for depth of flavor. If too thick, thin with a little water."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cooked, drained lentils to the sauce and stir to combine. To serve, either spoon sauce over noodles, or add pasta to the sauce and toss to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with any additional toppings, such as red pepper flakes, vegan parmesan cheese, and fresh basil."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Store leftovers separately in the refrigerator up to 3 days. Reheat sauce in the microwave or saucepan. Add a little water to thin if too thick. I've found gluten free pasta doesn't keep well, so cook fresh for each batch."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://minimalistbaker.com/spicy-red-pasta-with-lentils"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-03T21:01:08.567Z"
}
