{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Sponsored"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-11-22T22:23:08.163Z",
  "datePublished": "2022-11-21",
  "description": "You’ll love this pear cake frosted with a warming creamy chai cashew frosting. Perfect for a special afternoon tea or dessert.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2106-spiced-pear-cake:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Cake,Pescatarian,Seafood free,Egg free,Lemon,Sesame free,Pear,Wheat free,Vegetarian,Vegan,Dairy free",
  "name": "Spiced Pear Cake with Chai Cashew Frosting Recipe | Woolworths",
  "prepTime": "PT20M",
  "recipeCategory": "Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "11431",
  "recipeIngredient": [
    "1 cup loosely packed Whole Earth brown sugar replacement",
    "2 cups buckwheat flour",
    "75g blanched almond meal",
    "1.5 tsp baking powder",
    "1.5 tsp ground cinnamon",
    "0.75 tsp fine salt",
    "2 pears, pureed (see tip)",
    "1 cup soy milk (or almond milk)",
    "0.25 cup grapeseed oil (or light olive oil)",
    "2 tsp apple cider vinegar",
    "11.5 cups loosely packed Whole Earth icing powder",
    "1.5 cups raw cashews (soaked in water for 3+ hours)",
    "1 tsp ground cinnamon",
    "0.5 tsp ground cardamom",
    "0.5 tsp ground ginger",
    "0.25 tsp ground nutmeg",
    "1 tsp vanilla paste/extract",
    "0.5 cup canned coconut cream",
    "12 tsp lemon juice",
    "2 tbs coconut oil, melted and cooled for 5 minutes"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 180 C and line a small rectangle baking tin (our tin was 15 x 25cm). Set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "In a large mixing bowl add the pear puree, milk, oil, vinegar and brown sugar replacement. Whisk together until well incorporated. Sift in the remaining ingredients and then gently fold the batter together until just mixed. You want to make sure there are no more dry spots of flour, but don't overmix it. Pour into your prepared pan and bang the tin on the bench to even out and remove any air bubbles. Bake for approximately 50mins or until cooked when tested insert a skewer into the middle of the cake. When removed there should be a few moist crumbs but no wet batter. Allow the cake to cool for 5 minutes and then gentle transfer to a wire rack to cool completely."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {
        "tipId": "Storage",
        "tipText": "Store the frosted cake in an air-tight container in the fridge for up to 5 days. The unfrosted cake is freezer friendly. "
      },
      "text": "Meanwhile, make the chai frosting. Drain the cashews and add to a highspeed blender with remaining ingredients (starting with the lesser amount of icing powder). Blend until smooth. The mixture is thick so using your tamper if necessary. Taste the frosting and add more icing powder if you like. Transfer the chai frosting to a bowl (or piping bag with a medium round shaped nozzle, if desired) and set in the fridge for 2+ hours."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Once the cake has completely cooled frost with chai frosting, sprinkling with chopped nuts if you like."
    }
  ],
  "recipeNameId": "spiced-pear-cake-with-chai-cashew-frosting",
  "recipeYield": "12",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/spiced-pear-cake-with-chai-cashew-frosting"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-11-22T22:23:08.162Z",
  "url": "https://www.woolworths.com.au/shop/recipes/spiced-pear-cake-with-chai-cashew-frosting"
}
