{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Katie Trant"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T20:42:15.694Z",
  "datePublished": "2015-04-14T15:30:00+00:00",
  "description": "Spicy harissa paste, chewy halloumi cheese, and salty capers come together in this quick and easy one-pan frittata that's perfect for breakfast, lunch, and dinner.",
  "image": [
    "https://www.heynutritionlady.com/wp-content/uploads/2015/04/spicy_cauliflower_fritatta.jpg"
  ],
  "name": "spicy cauliflower frittata",
  "prepTime": "PT5M",
  "recipeCategory": "easy",
  "recipeIngredient": [
    "1 medium head cauliflower (trimmed and broken into bite-sized florets)",
    "1 Tbsp extra virgin olive oil",
    "1-2 Tbsp harissa paste (depending on how spicy you like things)",
    "1 200 g package halloumi (torn into small pieces)",
    "8 large eggs",
    "2 Tbsp capers",
    "salt and pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Set a large oven-proof skillet over medium-high heat."
    },
    {
      "@type": "HowToStep",
      "text": "In a large-enough bowl, toss the cauliflower florets with the harissa paste until each piece is as evenly coated as possible."
    },
    {
      "@type": "HowToStep",
      "text": "Add the oil to the skillet, swirl to coat the pan, and then add the cauliflower. The harissa paste can be quite fumey as it hits the heat, so be sure to have your fan going."
    },
    {
      "@type": "HowToStep",
      "text": "Leave the cauliflower to brown quite well on one side, then give it a good toss and let it brown on the other side. I find this takes about 5 minutes per side. The cauliflower doesn't need to be cooked through, it can still have a good amount of crunch at this point, but should be nicely browned."
    },
    {
      "@type": "HowToStep",
      "text": "When the cauliflower is ready, scatter the torn halloumi over the top."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the eggs (you can use the same bowl as you used for the cauliflower) and pour over top of the cauliflower and halloumi."
    },
    {
      "@type": "HowToStep",
      "text": "At this point reduce the heat to medium, and let the frittata gently simmer until it is well set on the bottom but still wet and jiggly on top - about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Turn on your broiler to heat up while the eggs are cooking on the stovetop."
    },
    {
      "@type": "HowToStep",
      "text": "Scatter the capers over the top of the frittata, and then remove from the stovetop and place in the oven under the broiler to finish - about 5 - 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "You'll need to watch it carefully here. The top should be puffed and golden, but not burnt. If your broiler doesn't heat evenly, rotate the pan halfway through."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the frittata from the oven and let it sit for about 5 minutes before serving. Leave a kitchen towel wrapped around the handle in case anyone tries to grab it, as it'll be good and hot!"
    },
    {
      "@type": "HowToStep",
      "text": "Now you can either slice the frittata in the pan, or slide it out onto a cutting board to be sliced. Serve hot, cold, or at room temperature."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://heynutritionlady.com/spicy-cauliflower-frittata"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-02T20:42:15.693Z"
}
