{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "70",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-04T00:33:25.464Z",
  "datePublished": "2018-06-24T03:00:04+00:00",
  "description": "Spicy Vegan Jackfruit Tacos made in 1 pan in about 30 minutes! An insanely delicious, easy-to-make filling that&#039;s perfect for tacos, taco salads, burritos, nachos, and more!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/04/Easy-Jackfruit-Tacos-6.jpg"
  ],
  "keywords": "jackfruit tacos",
  "name": "Spicy Jackfruit Tacos (1-Pot Meal!)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "148 kcal",
    "carbohydrateContent": "19.4 g",
    "fatContent": "7.6 g",
    "fiberContent": "4.9 g",
    "proteinContent": "1.2 g",
    "saturatedFatContent": "0.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "808.4 mg",
    "sugarContent": "10.2 g",
    "unsaturatedFatContent": "6.22 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 20-ounce cans jackfruit in water or brine (NOT in syrup)",
    "2 Tbsp avocado or coconut oil (if avoiding oil, sub water)",
    "1/2 large white or yellow onion (thinly sliced)",
    "4 cloves garlic (minced)",
    "1/2 tsp sea salt",
    "1 Tbsp ground smoked paprika",
    "1 Tbsp ground cumin",
    "1 Tbsp chili powder",
    "2-3 Tbsp coconut sugar (or maple syrup or organic brown sugar)",
    "1-2 small chipotle peppers in adobo sauce (from a can // roughly chopped)",
    "3 tsp adobo sauce (use more or less to preferred spice level)",
    "1/4 cup coconut aminos*",
    "2/3 cup water (plus more as needed)",
    "3 Tbsp lime juice",
    "Corn or flour tortillas",
    "Shredded red cabbage",
    "Cilantro",
    "Lime wedges",
    "1 15-ounce can refried pinto or black beans",
    "Salsa",
    "Chimichurri",
    "Extra Hot Habanero Sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Thoroughly rinse and drain jackfruit. Then begin sorting. The pieces come in chunks or triangle shapes. Cut off the center \"core\" portion of the jackfruit that's tougher in texture and separate it from the rest of the fruit. Then chop into smaller pieces. For the remaining portion of the jackfruit that appears more stringy, use your hands to pull into small shredded pieces. You're basically trying to get the jackfruit into small, shredded/chopped pieces. Rinse the jackfruit once more in a colander, drain, and thoroughly dry."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium heat. Once hot, add oil of choice, onion, and garlic. Sauté for 4-5 minutes or until onions are golden brown and softened."
    },
    {
      "@type": "HowToStep",
      "text": "Add jackfruit, salt, paprika, cumin, chili powder, coconut sugar (starting with 2 Tbsp // or less if making a smaller batch), chipotle peppers and their adobo sauce (starting with 1 pepper and working your way up), coconut aminos, water, and lime juice. Stir to coat and reduce heat to low - medium. Cover and cook for about 20 minutes, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "For finer texture, as your jackfruit is cooking, use your spoon to mash the jackfruit into smaller pieces, or use two forks to shred the jackfruit as it cooks down. This will create a more realistic “meat-like” texture."
    },
    {
      "@type": "HowToStep",
      "text": "Once the jackfruit has been properly simmered, taste and adjust flavor as needed, adding more paprika or cumin for smokiness, chili powder for heat, chipotle pepper or adobo sauce for spice, coconut sugar or maple syrup for sweetness, coconut aminos for saltiness / depth of flavor, or lime for acidity."
    },
    {
      "@type": "HowToStep",
      "text": "Turn up heat to medium-high and cook for 2-3 more minutes to get a little extra color/texture. Then remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy as is, on top of salads or nachos, or in enchiladas, burritos, tacos! We prefer corn tortillas, refried black beans, jackfruit, cabbage, cilantro, and hot sauce!"
    },
    {
      "@type": "HowToStep",
      "text": "Store leftover jackfruit up to 4-5 days in the refrigerator or 1 month in the freezer. To reheat, heat on a skillet until hot and moisten with more water if it appears dry."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/spicy-jackfruit-tacos-1-pot-meal"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-04T00:33:25.463Z"
}
