{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-01T04:47:33.381Z",
  "datePublished": "2017-10-23T09:30:09+00:00",
  "description": "Creamy roasted garlic cashew sauce is slathered over a crust and topped with garlicky spinach, marinated artichoke hearts, and smoky roasted red peppers to make this scrumptious vegan white pizza.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2017/10/spinach-artichoke-vegan-white-pizza-1-of-2-2.jpg"
  ],
  "keywords": "artichoke hearts, pizza, spinach",
  "name": "Spinach & Artichoke Vegan White Pizza",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "463 kcal",
    "carbohydrateContent": "53.8 g",
    "fatContent": "22.7 g",
    "fiberContent": "3.9 g",
    "proteinContent": "14.3 g",
    "saturatedFatContent": "3.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "629 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 garlic bulb",
    "1/4 cup olive oil, (divided)",
    "1 pound prepared pizza dough",
    "2 tablespoons cornmeal (optional)",
    "2 garlic cloves, (minced (this is in addition to the whole bulb listed above)",
    "6 ounces fresh spinach, (roughly chopped)",
    "1/2 cup marinated artichoke hearts",
    "Red pepper flakes, (to taste)",
    "1/2 teaspoon salt, (plus more to taste)",
    "1 cup raw cashews, (soaked in water 4-8 hours, drained and rinsed)",
    "1/3 cup unsweetened soy or almond milk, (plus more as needed)",
    "2 teaspoons red wine vinegar",
    "1/2 cup fresh basil leaves",
    "1/4 cup fresh parsley",
    "1/4 cup roasted red peppers, (roughly chopped)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400°."
    },
    {
      "@type": "HowToStep",
      "text": "Use a sharp knife to cut the top off of the garlic bulb, exposing the cloves. Place the garlic on a sheet of foil and drizzle with about 1 tablespoon of olive oil. Loosely wrap the garlic in the foil and roast it until the cloves are soft and browned, about 40 minutes. Remove it from the oven and open the foil so the garlic can cool a bit."
    },
    {
      "@type": "HowToStep",
      "text": "While the garlic roasts, coat the bottom of a large skillet with 1 tablespoon of olive oil and place it over medium heat. When the oil is hot, add the 2 cloves of minced garlic and sauté until very fragrant, about 1 minute. Add the spinach and continue to sauté until it wilts, about 4 minutes. Stir in the artichoke hearts, then season with red pepper flakes and salt to taste. Remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Place the cashews, milk, vinegar and 1/2 teaspoon of salt into a food processor bowl. Squeeze the garlic to extract the roasted cloves and add them to the food processor bowl. Blend until smooth, thinning with extra milk if needed. You want the mixture to be the consistency of whipped cream cheese. Add the basil and parsley and pulse a few times to blend. Taste-test and add more salt if you like."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly oil a baking sheet. Roll the pizza dough to a 14-inch circle and transfer it to the baking sheet. Brush the top with 2 tablespoons of olive oil and optionally sprinkle it with cornmeal."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the crust for 10 minutes, then remove it from the oven and slather with the cashew mixture, optionally reserving a couple tablespoons for topping. Distribute the spinach artichoke mixture over the cashew mixture, then top with roasted red peppers. Place the crust back in the oven and continue baking until lightly browned, about 10 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "If you reserved some of the cashew sauce, thin it with a bit of water or non-dairy milk, then drizzle over the pizza. Slice and serve."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-white-pizza"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-12-01T04:47:33.378Z"
}
