{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "75",
    "ratingValue": "4.82"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-01T03:05:39.486Z",
  "datePublished": "2017-04-17T06:29:45+00:00",
  "description": "White beans make an inexpensive and fiber filled alternative to chicken in these creamy Spinach White Spinach White Bean Enchiladas.",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2017/04/Spinach-White-Bean-Enchiladas-front.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/04/Spinach-White-Bean-Enchiladas-front-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/04/Spinach-White-Bean-Enchiladas-front-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/04/Spinach-White-Bean-Enchiladas-front-480x270.jpg"
  ],
  "keywords": "Vegetarian Dinner",
  "name": "Spinach White Bean Enchiladas with Pepper Jack Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "637.35 kcal",
    "carbohydrateContent": "68.58 g",
    "fatContent": "33.5 g",
    "fiberContent": "9.93 g",
    "proteinContent": "33.53 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1086.28 mg"
  },
  "prepTime": "PT15M",
  "recipeIngredient": [
    "12 6-inch corn tortillas ($1.10)",
    "4 oz pepper jack cheese ($1.00)",
    "1/2 lb frozen chopped spinach ($0.85)",
    "15 oz can white beans* ($1.00)",
    "1/4 tsp garlic powder ($0.02)",
    "1/2 tsp cumin ($0.05)",
    "1/4 tsp salt ($0.02)",
    "Freshly cracked pepper ($0.02)",
    "Handful fresh chopped cilantro for garnish (optional) ($0.13)",
    "1 Tbsp butter ($0.14)",
    "1 clove garlic, minced ($0.08)",
    "4 oz cream cheese ($1.00)",
    "3/4 cup whole milk ($0.29)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Toast the tortillas on each side in a dry skillet over medium-low heat until they are a slightly stiff and have browned just a bit on the edges. Stack them on a plate until ready to use. Toasting the tortillas increases the flavor and helps prevent them from cracking. Shred an 8oz. block of pepper jack cheese. Half will be used for the enchilada filling and half will be used for the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Defrost the frozen spinach in a microwave or take it out of the freezer before beginning to allow it time to defrost naturally. Squeeze as much moisture out of the thawed spinach as possible. Place the spinach in a large bowl. Rinse and drain the white beans, then add them to the bowl with the spinach. Also add 4oz. of the shredded cheese, garlic powder, cumin, salt, and a little freshly cracked pepper. Stir until the mixture is evenly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350oF. Begin preparing the pepper jack sauce by adding the butter and minced garlic to a small sauce pot. Sauté the garlic in the butter for one minute over medium heat. Add the milk and cream cheese to the pot. Stir and heat until the cream cheese has fully melted into the milk and the mixture has thickened slightly. Season with salt. Begin adding the remaining shredded pepper jack, a handful at a time, and stirring it in until fully melted before adding more. Once all the cheese has been melted into the sauce, turn the heat off and allow it to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the inside of a casserole dish with non-stick spray. Begin filling the toasted tortillas with the spinach and white bean mixture and rolling them closed. Line up the filled tortillas in the casserole dish, seam sides facing down. Choose a casserole dish that fits 12 of the rolled enchiladas snugly to help keep them from unrolling."
    },
    {
      "@type": "HowToStep",
      "text": "Once the tortillas are filled and in the casserole dish, pour the pepper jack sauce over top. Bake the enchiladas in the preheated oven for 35-40 minutes, or until the edges of the tortillas are brown and the pepper jack sauce is thick and browned on the edges. Sprinkle chopped cilantro over top, if desired."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/spinach-white-bean-enchiladas-pepper-jack-sauce"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-01T03:05:39.484Z"
}
