{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Lindsey Johnson"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T08:51:57.660Z",
  "datePublished": "2022-03-28T08:00:00+00:00",
  "description": "This simple to make, beautiful quiche is made without eggs or dairy and is loaded with fresh, crisp spring veggies for a delightful dish that can be served for breakfast, brunch, a light lunch, or anytime. Perfect for spring holidays and parties too.",
  "image": [
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Tofu-Quiche-Hello-Veggie-19.jpg",
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Tofu-Quiche-Hello-Veggie-19-500x500.jpg",
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Tofu-Quiche-Hello-Veggie-19-500x375.jpg",
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Tofu-Quiche-Hello-Veggie-19-480x270.jpg"
  ],
  "name": "Spring Vegetable Vegan Quiche",
  "prepTime": "PT25M",
  "recipeCategory": "Breakfast",
  "recipeIngredient": [
    "1 9-inch partially baked vegan pie crust (see notes)",
    "14 ounces silken or firm tofu (drained but not pressed)",
    "1/4 cup chickpea flour",
    "1/4 cup nutritional yeast",
    "1 tablespoon fresh lemon juice",
    "Finely grated zest of 1 lemon",
    "2 teaspoons Dijon mustard",
    "1 teaspoon salt (plus more to taste)",
    "1 teaspoon white miso (optional)",
    "1/4 teaspoon ground turmeric (optional)",
    "Freshly ground black pepper (to taste)",
    "1/4 cup water (if needed)",
    "1 tablespoon olive oil",
    "1 small bunch scallions or spring onions (thinly sliced, both white and tender green parts)",
    "2 garlic cloves (minced)",
    "1 pound fresh asparagus (ends snapped off and cut into 1-inch pieces)",
    "1/2 cup peas (fresh or frozen)",
    "2 tablespoons finely minced fresh parsley",
    "1 tablespoon thinly sliced chives"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350°F."
    },
    {
      "@type": "HowToStep",
      "text": "Place the tofu, chickpea flour, nutritional yeast, lemon juice and zest, mustard, salt, miso and turmeric (if using), and freshly ground black pepper into the bowl of a food processor or blender. Pulse a few times to help break up the tofu, then process or blend until smooth. Add 1/4 cup water, if needed, and process again until smooth and creamy. (If using silken tofu, the water probably won't be necessary.)"
    },
    {
      "@type": "HowToStep",
      "text": "Heat the olive oil in a large skillet. Add the green onions and garlic; sauté for 1-2 minutes, then add the asparagus and peas. Season lightly with salt and pepper and sauté for another 2-3 minutes until the veggies are bright green and still crisp. Remove from heat and transfer the vegetables into the partially baked crust."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the tofu mixture over the veggies. Gently stir with a silicone spatula to distribute the tofu mixture evenly and smooth the surface. Bake for 40-45 minutes, or until the top is golden brown and the center is set - it should still wobble a little bit when lightly tapped. Allow the quiche to sit and set up for a few minutes before serving. If the crust starts to brown too quickly, tent the quiche lightly with foil or parchment, or use a pie shield."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, cut into wedges and sprinkle with fresh parsley and chives."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://helloveggie.co/vegan-quiche"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-12-02T08:51:57.658Z"
}
