{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-08-03",
  "description": "Try our easy to follow Steak, Mushroom & Ale Pie recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cooexp215stemus_023:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Savoury pie & tart,Mushroom",
  "name": "Steak, Mushroom & Ale Pie Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "British",
  "recipeId": "RGR35142",
  "recipeIngredient": [
    "1 tbs olive oil",
    "900g braising steak, chopped into bite-sized pieces",
    "2-3 sprigs fresh rosemary, leaves picked and finely chopped",
    "1 beef stock cube",
    "2 tbs plain flour (save 1tbs for dusting)",
    "0.6 cup pale ale",
    "1.2 cup water, hot",
    "30g butter",
    "200g chestnut mushrooms, quartered",
    "1 pinch salt",
    "1 pinch freshly ground black pepper",
    "300g ready-made puff pastry",
    "1 egg, lightly beaten, for egg wash"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat the oil in a large frying pan over a medium-high heat. Add the meat, and cook, stirring from time to time, for 4-6 minutes until the meat is browned all over. Add the rosemary, crumble over the stock cube, and sprinkle in the flour. Stir until well combined. Increase the heat to high, and add a little of the ale, stirring all the time. Pour in the remaining ale, and let boil for a couple of minutes. Add the hot water, and boil for a few minutes more. Reduce the heat to low, cover the pan, and simmer for about 30 minutes, stirring occasionally, so that the meat doesn’t catch and burn. If the mixture dries out too much, add a little more hot water."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, preheat the oven to 200°C. Melt the butter in a small frying pan over a medium heat. Add the mushrooms, and sauté for 4-6 minutes until golden. Tip into the meat mixture, and stir through. Season well with salt and black pepper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Spoon the meat filling into the pie dish. On a floured work surface, roll out the pastry so that it is about 5cm larger all around than the top of the pie dish. Cut out a strip of pastry about 2.5cm in from the edge to make a collar. Wet the edge of the pie dish with a little water; fit the pastry strip all the way around, and press down firmly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Brush the pastry collar with a little of the egg wash, then top with the pastry lid. Trim away the excess. Using your finger and thumb, pinch together the edges to seal. Brush the top of the pie all over with the egg wash, and make 2 slits in the top with a sharp knife to allow steam to escape. Bake in the oven for 20-30 minutes until the pastry is puffed and golden. Serve hot with creamy mashed potato."
    }
  ],
  "recipeNameId": "steak-mushroom-and-ale-pie",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/steak-mushroom-and-ale-pie"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-11-24T14:51:39.533Z",
  "url": "https://www.woolworths.com.au/shop/recipes/steak-mushroom-and-ale-pie"
}
