{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.78"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT1M",
  "createdAt": "2022-12-02T01:32:26.759Z",
  "datePublished": "2017-07-30T22:54:15+00:00",
  "description": "This Strawberry Mug Cake is quick, easy, super soft and squidgy and stuffed to bursting with sweet, juicy strawberries. Then for extra decadence, it&#039;s drizzled in super simple, free flowing, thick, sweet frosting! ",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2017/07/strawberry-sweet-roll-mug-cake-1.jpg"
  ],
  "keywords": "mug cake recipe, vegan mug cake, vegan mug cake recipe",
  "name": "Strawberry Mug Cake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "437 kcal",
    "carbohydrateContent": "99 g",
    "fatContent": "1.1 g",
    "fiberContent": "3 g",
    "proteinContent": "8.2 g",
    "servingSize": "1 sweet roll",
    "sodiumContent": "202 mg",
    "sugarContent": "48 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "9 tablespoons all purpose flour (strong white flour in the UK) (, plus more for dusting your surface. I like to use unbleached flour )",
    "3/4 teaspoon baking powder",
    "2 tablespoon sugar (, lighter coloured varieties are best)",
    "1 pinch salt",
    "enough water",
    "3 medium fresh strawberries",
    "3 tablespoons natural powdered sugar",
    "a few drops water, plant-based milk or lemon juice (, no more than a teaspoon)",
    "a a tiny dab of oil for greasing the mug (, I used coconut oil (OPTIONAL _ omit to make oil-free)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Grease a mug and set aside. Straight sided mugs work best for this recipe."
    },
    {
      "@type": "HowToStep",
      "text": "First make the frosting. In a small bowl mix the powdered sugar with either water, plant-based milk or lemon juice. Add the liquid a tiny bit at a time. It doesn't take much at all. Literally a few little drops. You need much less than you will think you do so do it very gradually drop by drop. The most you will need is 3/4 teaspoon of water, perhaps a tiny drop more if you are using milk. Stir well until smooth and pretty thick like in my video then set aside. If you accidentally add too much liquid add a little more powdered sugar to thicken it up again."
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl add the flour, baking powder, 1 tablespoon of the sugar and salt. Add the water gradually stirring between each addition to form a slightly tacky dough. Use your hand to knead it a couple of times to bring it together. If you need a tiny drop more water because it's too dry just add it little by little. If you accidentally go too far and it's a bit sticky add a small sprinkle of flour."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle a little flour on your surface and some on the dough ball. Roll the dough out into a long strip about 4 inches wide and a couple of millimetres thick. Don't be afraid to add a little more flour if you need to. (If you don't have a rolling pin a clean wine bottle or beer bottle will do)."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the strawberry pieces all along the dough leaving a clear margin of about an inch all around the edges. Then sprinkle the strawberries with the remaining sugar."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the long edges inwards to seal the strawberry pieces inside and stop them all falling out when you roll it and put it into the mug. (Watch my video above to see how I did it if you aren't sure). You will be left with a long narrow strip."
    },
    {
      "@type": "HowToStep",
      "text": "Roll the strip up (see my video above) then gently lift it and put it into the mug."
    },
    {
      "@type": "HowToStep",
      "text": "Pour over 1/2 a teaspoon of water then place in the microwave uncovered and cook on full power for around 1 min 10 seconds. My microwave is 1200 watts. You will need to adjust the time a bit up or down depending on the strength of your microwave and the first time you make this it will be a bit of a case of trial and error. All microwaves are different so be careful not to overcook it. If you overcook it it will become tough so be sure to check how powerful your microwave is first and adjust accordingly. The very maximum time it will need is about 1 min 25 seconds and that is only if you have a really low powered microwave. A tiny bit under done is better than overdone as then it will go tough. If it needs longer cook in 5 second increments to avoid over cooking it."
    },
    {
      "@type": "HowToStep",
      "text": "When done it will have swollen up nicely and will still appear a little damp and doughy on top. That is normal. It will be cooked in the middle and it will continue to cook for a little while once removed from the microwave. Don't make the mistake of thinking it's not done and cook it for too long."
    },
    {
      "@type": "HowToStep",
      "text": "Turn out of the mug onto a plate. You might need to give it a little hand with a knife up the side of the mug if it swells a lot but it should come out really easily."
    },
    {
      "@type": "HowToStep",
      "text": "Pour over the frosting and serve immediately. Do not leave it to cool. It needs to be eaten freshly cooked, and be careful (especially when serving it to children) because the strawberries will be very hot."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://avirtualvegan.com/strawberry-sweet-roll-mug-cake"
  ],
  "totalTime": "PT6M",
  "updatedAt": "2022-12-02T01:32:26.758Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/D1NHNrjH.mp4",
    "description": "This Strawberry Mug Cake is big, soft, squidgy, stuffed with sweet, juicy strawberries &amp; drizzled in free flowing, thick, sweet frosting.",
    "name": "Strawberry Mug Cake",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/D1NHNrjH-720.jpg",
    "uploadDate": "2017-07-31T00:00:00.000Z"
  }
}
