{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "13",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T15:48:40.430Z",
  "datePublished": "2015-07-14T05:00:48+00:00",
  "description": "A flavorful, 30-minute arugula salad with strawberries, brown sugar pecans, hemp seeds, and a tangy balsamic vinaigrette!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/07/Strawberry-Arugula-Salad-SQUARE.jpg"
  ],
  "keywords": "arugula salad",
  "name": "Strawberry Arugula Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "267 kcal",
    "carbohydrateContent": "14.2 g",
    "fatContent": "22.8 g",
    "fiberContent": "3.9 g",
    "proteinContent": "5.6 g",
    "saturatedFatContent": "6 g",
    "servingSize": "1 side salads",
    "sodiumContent": "39 mg",
    "sugarContent": "9.2 g",
    "unsaturatedFatContent": "14.58 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Salad",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup raw pecan halves",
    "1 1/2 Tbsp coconut oil (or sub vegan butter or olive oil // melted)",
    "1 Tbsp coconut sugar, brown sugar, or cane sugar",
    "1 pinch each sea salt, ground cinnamon and cayenne pepper",
    "3 Tbsp olive oil (divided)",
    "2 medium shallots (thinly sliced)",
    "1 pinch each sea salt and pepper (~1/8th tsp as original recipe is written)",
    "1/3 cup balsamic vinegar",
    "1-2 Tbsp maple syrup (or sub other sweetener of choice)",
    "1 1/2 cups hulled quartered strawberries (organic when possible)",
    "7 ounces arugula (organic when possible)",
    "3 Tbsp hemp seeds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and place pecans on a foil- or parchment-lined baking sheet. Roast for 8 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add coconut oil, coconut sugar, sea salt, cinnamon and cayenne pepper to a small mixing bowl and whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Remove toasted pecans from oven and toss with spice mixture. Spread back onto the baking sheet and toast for another 4-7 minutes or until fragrant and golden brown, being careful not to burn."
    },
    {
      "@type": "HowToStep",
      "text": "Once out of the oven, let cool briefly and then sample to test flavor. Toss with a touch more salt or coconut sugar as needed. Set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "While the pecans are roasting, heat a small saucepan over medium heat. Once hot, add 1/3 of the olive oil (1 Tbsp as original recipe is written) and all of the shallot. Sauté until soft and fragrant - 3-4 minutes. Remove from heat and set aside to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Add shallot to blender or food processor with balsamic vinegar, remaining olive oil (2 Tbsp as original recipe is written), maple syrup and a pinch each salt and pepper. Blend until completely pureed. Taste and adjust seasonings as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add arugula, hemp seeds, strawberries and most of the roasted pecans to a large mixing bowl and top with 2-3 Tbsp dressing (as original recipe is written // adjust if altering batch size). Gently toss to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Plate salad and garnish with remaining pecans. Serve additional dressing on the side. Serves 2 as an entrée or 4 as a side dish. Best when fresh."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/strawberry-arugula-salad"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T15:48:40.430Z"
}
