{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "21",
    "ratingValue": "4.77"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-02T12:09:47.713Z",
  "datePublished": "2015-09-24T05:00:30+00:00",
  "description": "10-ingredient vegan arancini with cauliflower rice, sun-dried tomatoes, and basil. Inspired by an Italian dish that's typically cooked rice stuffed with cheese and fried, only my version is healthier and veganized!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/09/Vegan-Arancini-SQUARE-image.jpg"
  ],
  "keywords": "arancini",
  "name": "Sun-Dried Tomato & Basil Arancini (Vegan)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "93 kcal",
    "carbohydrateContent": "9 g",
    "fatContent": "5.4 g",
    "fiberContent": "1.7 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "0.9 g",
    "servingSize": "1 arancini",
    "sodiumContent": "140 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3 cups cauliflower rice",
    "4 cloves garlic, minced (4 cloves yield ~2 Tbsp or 12 g)",
    "2 Tbsp olive oil (divided plus more for sautéing)",
    "1 Tbsp flaxseed meal (to make flax egg)",
    "2 1/2 Tbsp water (to make flax egg)",
    "1/2 cup sun-dried tomatoes (chopped)",
    "3 Tbsp fresh basil (chopped // plus more for serving // or 1 Tbsp dried basil per 3 Tbsp fresh)",
    "2 tsp dried oregano",
    "1/2 cup vegan parmesan cheese",
    "1/2 cup panko bread crumbs*",
    "1/4 tsp each sea salt and black pepper (plus more to taste)",
    "3 Tbsp panko bread crumbs",
    "1 Tbsp vegan parmesan cheese",
    "1 cup favorite marinara sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and line a baking sheet with foil."
    },
    {
      "@type": "HowToStep",
      "text": "In a large skillet over medium heat, sauté cauliflower rice and garlic in half the olive oil (1 Tbsp as original recipe is written // adjust if altering batch size) for 5 minutes, with a lid on, stirring frequently. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare flax egg by adding flaxseed meal and water to a blender or food processor. Wait 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add sun-dried tomatoes, basil, oregano, vegan parmesan cheese, and panko bread crumbs, and pulse/mix to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Add cauliflower rice to food processor or blender, along with salt and pepper and remaining olive oil (1 Tbsp as original recipe is written // adjust if altering batch size). Pulse/mix a few more times and then transfer to a mixing bowl to avoid getting the mixture too paste-like."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed. Add more bread crumbs and/or vegan parmesan cheese if the mixture feels too wet. It should be moldable when squeezed together."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to refrigerator to chill for 30 minutes, or freezer for 15 minutes. At this time, mix together panko bread crumbs and vegan parmesan cheese in a shallow bowl. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once chilled, use a Tablespoon or cookie scoop (I like this one from Amazon) to scoop out rounded Tablespoon amounts of the arancini mixture."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully form into balls by resting the arancini in your palm and using your other hand's fingers to gently roll until a ball is formed. They are fragile, so work carefully. There should be 13-14 total (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Coat arancini one at a time in the panko-vegan parmesan mixture, then set aside on a baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium heat. Once hot, add 1-2 Tbsp oil and brown 6-7 arancini at a time for 4-5 minutes total, rolling with a spoon or fork to brown on all sides. Turn down heat if browning too quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Once all are browned, place back on a baking sheet and bake in a 375-degree F (190 C) oven for 15-20 minutes. In the meantime, prepare/heat sauce (optional) and any other desired toppings or sides."
    },
    {
      "@type": "HowToStep",
      "text": "Let arancini cool for 5 minutes, then serve with marinara and additional vegan parmesan cheese. These are best eaten with a fork as they are tender."
    },
    {
      "@type": "HowToStep",
      "text": "Leftovers keep for 2-3 days in the refrigerator, though best when fresh. Reheat in the microwave or in a 375-degree F (190 C) oven until warmed through."
    }
  ],
  "recipeYield": "14",
  "sameAs": [
    "https://minimalistbaker.com/sun-dried-tomato-basil-arancini-vegan"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-12-02T12:09:47.711Z"
}
