{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "4.78"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T16:24:04.144Z",
  "datePublished": "2018-01-08T03:00:19+00:00",
  "description": "Amazingly cheesy, crispy kale chips baked in a sunflower seed-nutritional yeast coating! Healthy, simple ingredients, BIG flavor and nutrients!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/12/Cheesy-Sunflower-Kale-Chips-SQUARE.jpg"
  ],
  "keywords": "kale chips",
  "name": "Sunflower-Coated Cheesy Kale Chips",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "174 kcal",
    "carbohydrateContent": "17.5 g",
    "fatContent": "9.7 g",
    "fiberContent": "4.1 g",
    "proteinContent": "8.1 g",
    "saturatedFatContent": "0.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "207 mg",
    "sugarContent": "0.8 g"
  },
  "prepTime": "PT75M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup raw sunflower seeds* (soaked in very hot water for 1 hour or in cool water overnight)",
    "1 Tbsp lemon juice",
    "1/4 cup nutritional yeast (plus more to taste)",
    "1/2 tsp ground turmeric",
    "1/2 tsp sea salt",
    "1/8 tsp cayenne powder (adjust to preferred spice level)",
    "1/4 cup water (plus more as needed)",
    "2 large bundles curly kale (stems removed + torn into large pieces // organic when possible)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak sunflower seeds and then drain thoroughly. Then add to a high-speed blender along with lemon juice, nutritional yeast, ground turmeric, sea salt, cayenne pepper, and water. Blend on high until creamy and smooth. Then taste and adjust flavor as needed, adding more spices for overall flavor, nutritional yeast for cheesiness, or lemon juice for acidity."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 225 degrees F (107 C). Use convection bake if you have it to speed cooking time and help chips crisp up even more. Place parchment paper on two large baking sheets to prevent sticking. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Rinse and thoroughly dry kale. Then tear into small pieces and discard any large stems (they won't crisp well). Add to a large mixing bowl and add the sunflower mixture. Toss thoroughly to combine, using hands to distribute the seasonings evenly. If possible, try and massage well enough to avoid large clumps of sauce on the kale or they may have trouble crisping up."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the kale over the parchment-lined baking sheets, ensuring that the kale touches as little as possible to help crisp while baking. Depending on size of baking sheets, you may need to do this in several batches. The important thing is to make sure the kale isn’t overlapping."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 20 minutes. Then turn the pans around and lightly toss/stir kale to ensure even baking. Bake for 10-20 minutes more or until kale is crispy and very slightly golden brown. If some of the chips are still wet with the seasoning, you can leave the pans in the oven a little longer at 200 F (93 C) to further dry / crisp up."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from oven and let cool completely - chips will crisp up even more once out of the oven. Enjoy immediately! Best when fresh, although you can loosely cover leftovers (try not to seal) at room temperature for 2-3 days."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/sunflower-coated-cheesy-kale-chips"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-12-03T16:24:04.143Z"
}
