{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-29T05:36:15.000Z",
  "datePublished": "2015-10-14T10:45:43+00:00",
  "description": "Celebrate fall with these vegan sweet potato latkes from Crossroads by Tal Ronnen. They're a little sweet, a little savory, very decadent and served with a kicky brandy-spiked apple sauce.",
  "image": {
    "@type": "ImageObject",
    "height": 933,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2015/10/sweet-potato-latkes-featured.jpg",
    "width": 700
  },
  "keywords": "latkes, sweet potatoes",
  "name": "Sweet Potato Latkes with Spiked Apple Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "259 kcal",
    "carbohydrateContent": "39.4 g",
    "fatContent": "9.5 g",
    "fiberContent": "8.8 g",
    "proteinContent": "3.9 g",
    "saturatedFatContent": "0.5 g",
    "servingSize": "1 latke",
    "sodiumContent": "109 mg",
    "sugarContent": "11.8 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 tablespoon Ener-G Powdered Egg Replacer",
    "1 cup filtered water",
    "1/2 cup ground chia seeds",
    "1 onion",
    "2 sweet potatoes, (about 1 1/2 pounds, peeled)",
    "1 russet baking potato (about 1/2 pound), peeled)",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons rice flour",
    "2 tablespoons chia seeds",
    "10 fresh chives, (finely chopped, plus more for garnish)",
    "Expeller pressed canola oil, (for frying)",
    "3 Gala or Fuji apples, (peeled, cored and coarsely chopped)",
    "3 Granny Smith apples, (peeled, cored and coarsely chopped)",
    "Juice of 1 lemon",
    "2 tablespoons light brown sugar, (or to taste)",
    "2 cinnamon sticks",
    "1/8 teaspoon kosher salt",
    "2 tablespoons brandy or unfiltered apple juice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 250°F. Put a wire rack on a baking sheet and place in the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the egg replacer, water and ground chia seeds in a bowl until they have the consistency of beaten eggs. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Using the large shredding blade of a food processor, shred the onion into long, thin ribbons. Transfer to a mixing bowl. Shred the sweet potatoes and russet potato in the food processor and add them to the bowl. Toss the potatoes with the onions as you go to keep them from discoloring. (If you do not have a food processor with a large shredding blade, use the large holes of a box grater, grating down the length of the onion and potatoes to get long strands.)"
    },
    {
      "@type": "HowToStep",
      "text": "Wrap the shredded potatoes and onion in a large square of cheesecloth or a dish towel and twist it tightly to wring out the excess liquid. Put the potatoes and onion in a clean bowl and season generously with salt and pepper. Fold in the egg replacement mixture, along with the flour and chives, to bind the mixture together, making sure the ingredients are thoroughly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Put a large cast-iron or nonstick skillet over medium heat, add 1/4 inch of oil and heat until hot. Working in batches, spoon about 1/4 cup of the potato mixture into the hot oil for each latke, pressing lightly with a spatula to for 4-inch pancakes that are about 1/4 inch thick. Take care not to overcrowd the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Fry, turning once, until crispy and golden, 3 to 4 minutes on each side. Transfer the fried latkes to the rack on the pan in the oven to keep warm while you cook the remaining batter, adding more oil as needed."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://connoisseurusveg.com/sweet-potato-latkes-with-spiked-apple-sauce"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-29T03:42:56.649Z"
}
