{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-29T22:46:26.000Z",
  "datePublished": "2015-03-03T10:00:57+00:00",
  "description": "Tender roasted sweet potatoes, savory chickpeas, and plenty of flavorful Middle Eastern spices go into these hearty sweet potato falafel burgers. These burgers pair beautifully with hummus or rich maple tahini sriracha sauce.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2015/03/sweet_potato_falafel_burger_featured.jpg"
  ],
  "keywords": "burger, Falafel",
  "name": "Sweet Potato Falafel Burgers",
  "prepTime": "PT40M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 medium sweet potato",
    "1 small onion (quartered)",
    "3 garlic cloves",
    "1 cup cooked or canned chickpeas (drained and rinsed)",
    "1/2 cup panko",
    "1/4 cup chickpea flour",
    "1/4 cup fresh cilantro",
    "1 tbsp. lemon juice",
    "2 tbsp. olive oil (divided)",
    "2 tsp. ground cumin",
    "1 tsp. ground coriander",
    "1/2 tsp. salt",
    "1/4 tsp. pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400o. Scrub sweet potato and puncture several times with a knife. Bake until easily pierced with a knife, about 35 minutes. You want it to be slightly firmer than if you were going to eat it like a baked potato. Remove from oven, cut open and allow to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop sweet potato insides into food processor bowl and add onion, garlic, chickpeas, panko, chickpea flour, cilantro, lemon juice, 1 tablespoon of olive oil, cumin, coriander, salt and pepper. Pulse until chickpeas are well chopped and ingredients are incorporated, stopping to scrape down sides of bowl as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Test a bit of the mixture by pressing it together with your hands. If it doesn't quite hold together, transfer mixture to a bowl, cover, and refrigerate at least 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Shape the sweet potato mixture into 4 patties."
    },
    {
      "@type": "HowToStep",
      "text": "Coat a large skillet with remaining oil and place over medium heat. Working in batches if needed, place patties into skillet and cook until browned on bottoms, about 5 minutes. Flip and cook until browned on opposite sides, about 5 minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with your favorite burger/falafel toppings. I recommend some hummus or maple tahini dressing."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/sweet-potato-falafel-burgers"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-29T19:06:20.033Z"
}
