{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "19",
    "ratingValue": "4.95"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT120M",
  "createdAt": "2022-12-05T19:14:51.436Z",
  "datePublished": "2020-06-14T02:00:00+00:00",
  "description": "Easy tamales stuffed with roasted sweet potatoes and chipotle-seasoned black beans. Just 10 ingredients and simple methods required for this hearty, plant-based, naturally gluten-free dish!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2020/04/Sweet-Potato-Black-Bean-Tamales-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/04/Sweet-Potato-Black-Bean-Tamales-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/04/Sweet-Potato-Black-Bean-Tamales-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2020/04/Sweet-Potato-Black-Bean-Tamales-SQUARE-480x270.jpg"
  ],
  "keywords": "vegan tamales",
  "name": "Sweet Potato Black Bean Tamales",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "79 kcal",
    "carbohydrateContent": "13.9 g",
    "fatContent": "1.9 g",
    "fiberContent": "2.4 g",
    "proteinContent": "2.1 g",
    "saturatedFatContent": "0.2 g",
    "servingSize": "1 tamale",
    "sodiumContent": "301 mg",
    "sugarContent": "1 g",
    "unsaturatedFatContent": "1.56 g"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3-4 medium-large sweet potatoes",
    "2 cups masa harina (not cornmeal // masa harina has been cooked and soaked in lime water, then ground into flour)",
    "1 1/2 cups water",
    "1 1/2 tsp sea salt",
    "1 3/4 tsp baking powder",
    "2 1/2 Tbsp avocado oil (or sub dairy-free butter or organic dairy butter as tolerated)",
    "2/3 - 3/4 cup vegetable broth (or water (warm temperature is best)",
    "3-4 Tbsp water (or sub oil and reduce amount by half)",
    "1/4 cup diced white or red onion",
    "1 15-oz can black beans, slightly drained",
    "1 chipotle pepper in adobo sauce, chopped",
    "1 1/2 tsp adobo sauce (omit or reduce for less heat)",
    "1/2 tsp sea salt, plus more to taste",
    "1/2 tsp ground cumin",
    "1-2 tsp coconut sugar (optional)",
    "1 package dried cornhusks, soaked in water 30 minutes",
    "Plain dairy-free yogurt",
    "Hot sauce",
    "Cilantro",
    "Lime juice"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat oven to 375 degrees F (190 C) and place whole sweet potatoes on a parchment-lined baking sheet. Poke sweet potatoes a few times with a fork to allow steam to escape. Bake for 45 minutes to 1 hour or until tender. NOTE: For quicker bake time, halve sweet potatoes, rub with a little oil, and bake cut-side down for 35-40 minutes or until tender (as pictured)."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add masa harina to a large mixing bowl and pour the water over. Stir to combine. It will likely appear a bit dry — that's okay. Let rest 15 minutes to hydrate."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add dried corn husks to a large mixing bowl and cover with room temperature water. Set something on top to submerge them (such as a small skillet). Set aside and let soak (at least 15 minutes and up to 1 hour)."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat a saucepan over medium heat. Once hot, add water (or oil) and onion. Sauté, stirring occasionally, for 4-5 minutes or until tender and slightly browned."
    },
    {
      "@type": "HowToStep",
      "text": "Add slightly drained black beans, chopped chipotle pepper, adobo sauce (omit or reduce for less heat), salt, cumin, and coconut sugar (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Bring to a simmer over medium heat, then reduce heat to a simmer and cover. Cook for 10-15 minutes, stirring occasionally. Taste and adjust flavor as needed, adding more salt to taste, cumin for smokiness, coconut sugar to balance the flavors, or adobo sauce for heat. Turn off heat and uncover. Set aside to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Remove baked sweet potatoes from oven and let cool to the touch. Then peel away the skin, transfer to a mixing bowl or shallow plate, and mash with a potato masher or fork until mostly smooth. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To the soaked masa mixture add salt, baking powder, and avocado oil and stir. Then add broth (warm or room temperature for best results) a little at a time until a thick paste is achieved. It shouldn't be liquidy or crumbly (see photo). Be sure to stir well so it's fully combined. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Remove corn husks from water and pat dry (when water remains on the husks, the masa can have a hard time adhering). Then take one husk in your non-dominant hand (or place on a flat, clean surface) with the wider/broader edge facing toward you (narrow end away from you)."
    },
    {
      "@type": "HowToStep",
      "text": "Add 2 - 2 1/2 Tbsp masa, then use the back of a spoon to spread the mixture from the bottom 1/3 center of the husk to the right edge (see photo). Spread into a thin layer — somewhere between 1/8th-inch and 1/4-inch thick (not too thin or the fillings spill through, not too thick or the tamale takes longer to cook)."
    },
    {
      "@type": "HowToStep",
      "text": "Then add ~1 1/2 Tbsp of the mashed sweet potatoes to the center of the masa and top with ~1 Tbsp of beans (see photo). Tuck the right side of the corn husk over the bean filling, right where the masa's left edge is. Then continue rolling until the seams meet. Then fold the narrow edge of corn husk over the seam and set in a loaf pan or dish that will keep your tamales upright. Continue until you have used all your masa mixture and filling (as original recipe is written, ~24 tamales)."
    },
    {
      "@type": "HowToStep",
      "text": "To a large pot or Dutch oven, add a steamer basket. Fill pot with water until it almost touches the base of the steamer basket. Then add the tamales, keeping them upright if possible (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Turn heat to high, then, once boiling, reduce heat to low, cover, and simmer to steam the tamales for about 1 hour. You’ll know they’re done when the masa appears cooked. If you aren’t sure, you can remove one tamale, let it cool for a few minutes (as they stiffen up the more they cool), unwrap, and test. If they’re cooked through, they’re ready to enjoy. If not, steam for 5-10 minutes more, or longer as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooked, remove the lid and let steam escape for a few minutes. Then they're ready to enjoy! Top with desired garnishes. We loved hot sauce, cilantro, lime juice, and a little dairy-free yogurt (Culina plain is our favorite, though vegan sour cream would be delicious, too)."
    },
    {
      "@type": "HowToStep",
      "text": "Store cooled tamales covered in the refrigerator up to 4-5 days. Reheat in the microwave or in a cast iron skillet on the stovetop until hot."
    },
    {
      "@type": "HowToStep",
      "text": "To freeze, let tamales cool, then add to a parchment-lined baking sheet and arrange in a single layer. Freeze until firm, then transfer to a well-sealed container where they should keep for at least 1 month, oftentimes longer. To cook from frozen, let thaw, then heat either in the microwave or in a cast iron skillet on the stovetop until hot. Or microwave for 1 minute, remove husk, and then continue heating in the microwave or in a cast iron skillet on the stovetop until hot."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://minimalistbaker.com/sweet-potato-black-bean-tamales-vegan"
  ],
  "totalTime": "PT180M",
  "updatedAt": "2022-12-05T19:14:51.433Z"
}
