{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths  ©️ Dorling Kindersley Ltd"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-22T05:08:03.507Z",
  "datePublished": "2022-08-03",
  "description": "Tender salmon fillets, marinated in a sweet orange juice and honey mixture, arebeautifully paired with a rich and spicy stir-fry sauce, nutty quinoa, and freshgreens to make a flavour-packed and filling supper.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/gramai116swespi_022:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Seafood stir-fry,Orange,Salmon",
  "name": "Sweet & Spicy Salmon And Quinoa Stirfry Recipe | Woolworths",
  "prepTime": "PT10M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "Asian",
  "recipeId": "RGR10900",
  "recipeIngredient": [
    "1 tbs light olive oil",
    "300g salmon fillets",
    "100g quinoa",
    "1 head pak choi, white core removed and leaves sliced into ribbons",
    "200g beansprouts",
    "0.8 cup orange juice",
    "4 tbs honey",
    "0.5 tsp dried chilli flakes",
    "1 tbs soy sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "For the marinade, place all the ingredients in a large saucepan and bring to the boil over a mediumhigh heat. Then reduce the heat to a simmer and cook for about 8-10 minutes until the liquid has reduced. Remove from the heat and leave to cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the salmon in a large plastic bag and pour the marinade over. Seal the bag, place in the fridge, and leave to marinate for about 2 hours or overnight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the oven to 200°C (Gas 6). Remove the salmon from the bag and place each one in the middle of a square sheet of foil. Roll up the sides to make baskets and pour over any remaining marinade. Continue to roll up the sides to seal the parcels and place them on a baking tray. Bake for about 20 minutes or until the salmon is cooked."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, rinse the quinoa under running water and place in a large saucepan. Add 250ml of water and bring to a simmer over a medium heat. Cook for about 15 minutes or until all the liquid has been absorbed and the grain is fluffy."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat the oil in a large frying pan over a high heat. Add the pak choi and bean sprouts and fry for 34 minutes. Then add the cooked quinoa, mix well, and remove from the heat. Divide the quinoa and vegetable mixture between two plates. Place the salmon steaks on top and pour over any remaining juices from the foil parcels. Serve hot."
    }
  ],
  "recipeNameId": "sweet-and-spicy-salmon-and-quinoa-stirfry",
  "recipeYield": "2",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/sweet-and-spicy-salmon-and-quinoa-stirfry"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-11-22T05:08:03.506Z",
  "url": "https://www.woolworths.com.au/shop/recipes/sweet-and-spicy-salmon-and-quinoa-stirfry"
}
