{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "12",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-29T22:46:26.000Z",
  "datePublished": "2017-10-03T15:27:42+00:00",
  "description": "The earthy flavor and subtle sweetness of molasses makes these Sweet Molasses Dinner Rolls the perfect addition to your fall holiday table.&nbsp;",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2017/10/Buttered-Sweet-Molasses-Dinner-Rolls-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/10/Buttered-Sweet-Molasses-Dinner-Rolls-1-500x500.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/10/Buttered-Sweet-Molasses-Dinner-Rolls-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2017/10/Buttered-Sweet-Molasses-Dinner-Rolls-1-480x270.jpg"
  ],
  "keywords": "Bread, Dinner Rolls, Holiday, Homemade Bread, Side Dish, Thanksgiving",
  "name": "Sweet Molasses Dinner Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "155.28 kcal",
    "carbohydrateContent": "31.14 g",
    "fatContent": "1.93 g",
    "fiberContent": "1.92 g",
    "proteinContent": "4.03 g",
    "servingSize": "1 Serving",
    "sodiumContent": "115.57 mg"
  },
  "prepTime": "PT150M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 tsp Instant or rapid rise yeast ($0.18)",
    "1 tsp brown sugar ($0.01)",
    "1 cup warm water ($0.00)",
    "1 cup whole wheat flour ($0.13)",
    "1/2 tsp salt ($0.01)",
    "1 Tbsp butter, melted ($0.13)",
    "1 Tbso unsweetened cocoa powder ($0.10)",
    "1/3 cup molasses ($0.92)",
    "1.5-2 cups all-purpose flour ($0.12)",
    "1 large egg (optional) ($0.27)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine the yeast, brown sugar, and warm water in a bowl and stir to dissolve the yeast and sugar. Let the yeast mixture sit for about 5 minutes, or until the mixture becomes frothy on top."
    },
    {
      "@type": "HowToStep",
      "text": "While waiting for the yeast to bloom, Add the whole wheat flour, salt, melted butter, cocoa powder, and molasses to a large bowl (no need to stir them together just yet)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the yeast mixture is frothy, pour it into the bowl with the flour and other ingredients, and stir until a smooth mixture forms."
    },
    {
      "@type": "HowToStep",
      "text": "Begin stirring in all-purpose flour, 1/2 cup at a time, until a ball of dough forms and you can no longer stir it with a spoon. Turn the dough out onto a floured surface and knead for five minutes, slowly adding more flour as you knead to prevent the dough from sticking."
    },
    {
      "@type": "HowToStep",
      "text": "After kneading for five minutes, you should have a soft, buoyant ball of dough that no longer sticks to your hands. You should have used between 1.5 and 2 cups of all-purpose flour total. Place the dough back in the mixing bowl, cover loosely with plastic, and allow it to rise for one hour, or until it is double in volume (rise time will depend on the ambient temperature)."
    },
    {
      "@type": "HowToStep",
      "text": "When the dough has risen, sprinkle a little flour on top to keep your hand from sticking, then punch it down to deflate. Scrape the dough out of the bowl and transfer it to a lightly floured surface. Cut the dough into four equal sized pieces, then cut each of the quarters into three smaller pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Shape each piece of dough into a ball, then place it in a baking dish coated in non-stick spray, oil, or butter. Allow the shaped rolls to rise for another 45 minutes to an hour, or until double in size again."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375oF. Add the egg to a small bowl along with a splash of water. Whisk the egg until smooth, then carefully brush it over the surface of the rolls (this creates a dark glossy finish to the rolls and is optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the rolls in the preheated oven for 25 minutes, or until they are deep brown and sound hollow when tapped. Allow the rolls to cool slightly, then serve."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://budgetbytes.com/sweet-molasses-dinner-rolls"
  ],
  "totalTime": "PT175M",
  "updatedAt": "2022-11-29T19:34:58.634Z"
}
