{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "24",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT5M",
  "createdAt": "2022-12-02T02:50:29.515Z",
  "datePublished": "2016-07-23T05:00:27+00:00",
  "description": "A decadent yet healthy 30-minute vegan dessert! Fresh dates stuffed with tahini, dipped in DIY 4-ingredient chocolate, and sprinkled with coconut and sesame seeds.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/07/Tahini-Stuffed-Dates-SQUARE.jpg"
  ],
  "keywords": "stuffed dates",
  "name": "Tahini-Stuffed Dates (aka Tahini Bombs!)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "141 kcal",
    "carbohydrateContent": "9.7 g",
    "fatContent": "11.9 g",
    "fiberContent": "2.1 g",
    "proteinContent": "1.3 g",
    "saturatedFatContent": "7 g",
    "servingSize": "1 stuffed dates",
    "sodiumContent": "15 mg",
    "sugarContent": "6.1 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/4 cup finely chopped cocoa butter*",
    "2 heaping Tbsp coconut oil",
    "2 Tbsp maple syrup",
    "1 cup cacao or unsweetened cocoa powder",
    "25 whole medjool dates",
    "4 Tbsp tahini (divided // from raw or roasted sesame seeds)",
    "1 pinch sea salt",
    "2 Tbsp unsweetened desiccated coconut flake or sesame seeds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add 2 inches of water to a medium saucepan and bring to a rolling simmer over medium-high heat. Then reduce heat to medium and set a medium glass or ceramic mixing bowl on top, making sure it's not touching the water (this creates a \"double boiler\")."
    },
    {
      "@type": "HowToStep",
      "text": "To the mixing bowl, add finely chopped cocoa butter and coconut oil and let melt, stirring occasionally with a wooden spoon or whisk - about 2-3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once melted, carefully remove bowl from heat (turn off stove top) and add the maple syrup and cacao or cocoa powder. Use a whisk or wooden spoon to mix until fluid and thoroughly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed. I added about 2 Tablespoons maple syrup total (amount as original recipe is written // adjust if altering batch size), but it’s completely up to how sweet you prefer your chocolate."
    },
    {
      "@type": "HowToStep",
      "text": "Because the chocolate is quite thin at this point, set in the refrigerator to chill and slightly thicken and make dipping the dates easier - about 15-20 minutes total, removing to stir/whisk occasionally. You'll know it's ready when it's more like pourable hot fudge than melted coconut oil."
    },
    {
      "@type": "HowToStep",
      "text": "Next, carefully remove pits from dates and be careful to keep one side of the date intact, as opposed to splitting it into two separate pieces. You're trying to create a small crevice in the date (see photo) so it's easy to add/contain the tahini. Once pitted, fill with tahini - about 1/2 - 1 tsp depending on size of date."
    },
    {
      "@type": "HowToStep",
      "text": "Add dates to a parchment-lined baking sheet and pop in freezer to chill while chocolate thickens."
    },
    {
      "@type": "HowToStep",
      "text": "Once chocolate has thickened (if it got too thick, briefly microwave or set back over the double boiler to thin), add one date at a time and flip with a slotted spoon or fork to fully coat, then tap off any excess chocolate. Set back on the parchment baking sheet and immediately sprinkle with a little sea salt and either sesame seeds or coconut. Repeat until all dates are coated."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately. Store leftovers in the refrigerator for 1 week or the freezer for 1 month. Let come to room temperature before enjoying for best flavor/texture."
    }
  ],
  "recipeYield": "25",
  "sameAs": [
    "https://minimalistbaker.com/tahini-stuffed-dates-aka-tahini-bombs"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T02:50:29.514Z"
}
