{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "87",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-25T13:59:36.000Z",
  "datePublished": "2019-12-06T12:08:00+00:00",
  "description": "Teriyaki Meatball Bowls include fragrant jasmine rice, tender pork meatballs, homemamde teriyaki sauce, and broccoli florets for an easy meal prep friendly meal!",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2012/01/Teriyaki-Meatball-Bowls-drizzle-close.jpg",
    "width": 800
  },
  "keywords": "Meal Prep Recipe, meatballs",
  "name": "Teriyaki Meatball Bowls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "714.88 kcal",
    "carbohydrateContent": "87.28 g",
    "fatContent": "26.68 g",
    "fiberContent": "4.98 g",
    "proteinContent": "31.8 g",
    "servingSize": "1 Serving",
    "sodiumContent": "1985.83 mg"
  },
  "prepTime": "PT20M",
  "recipeIngredient": [
    "1 lb. ground pork ($3.49)",
    "1 large egg ($0.23)",
    "1/2 cup breadcrumbs ($0.13)",
    "1 clove garlic, minced ($0.08)",
    "1 tsp grated fresh ginger ($0.10)",
    "1/2 tsp soy sauce ($0.02)",
    "2 green onions, sliced ($0.2)",
    "1/2 cup soy sauce ($0.48)",
    "1/2 cup brown sugar ($0.18)",
    "2 tsp grated fresh ginger ($0.20)",
    "2 cloves garlic ($0.16)",
    "1 cup water ($0.00)",
    "2 Tbsp corn starch ($0.06)",
    "1 cup jasmine rice ($0.66)",
    "2 cups water ($0.00)",
    "2 green onions ($0.08)",
    "1 Tbsp sesame seeds ($0.08)",
    "1 lb. frozen broccoli florets ($2.59)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400oF. Begin with the meatball mixture. Add the ground pork, egg, breadcrumbs, minced garlic, ginger, soy sauce, and sliced green onions to a bowl. Use your hands to mix the ingredients until evenly combined."
    },
    {
      "@type": "HowToStep",
      "text": "Divide and shape the meatball mixture into 16 ping pong sized balls. Place the shaped meatballs on a baking sheet lined with parchment paper. Baked the meatballs for about 20 minutes, or until they are golden brown and have reached an internal temperature of at least 160oF."
    },
    {
      "@type": "HowToStep",
      "text": "While the meatballs are cooking, begin the rice. Add the jasmine rice and water to a sauce pot. Place a lid on top and turn the heat onto high. Bring the pot up to a full boil, then turn the heat down to low and allow it to simmer, undisturbed for 15 minutes. After simmering for 15 minutes, turn the heat off and let it sit, with the lid still in place, for an additional 5 minutes. Fluff with a fork before serving."
    },
    {
      "@type": "HowToStep",
      "text": "While the rice and meatballs are cooking, prepare the teriyaki sauce. Combine the soy sauce, brown sugar, minced garlic, grated ginger, water, and cornstarch in a medium sauce pot. Stir to dissolve the cornstarch. Place the pot over medium heat. Stir and cook the sauce until it begins to simmer, at which point the sauce will thicken and turn from opaque to a shiny sauce. Remove the sauce from the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Finally, if serving the meatball bowls immediately, cook the frozen broccoli florets according to the package instructions. If you're packing the bowls as meal prep, the broccoli florets can be added in their frozen state."
    },
    {
      "@type": "HowToStep",
      "text": "Once the meatballs have finished baking, add them to the sauce pot with the teriyaki sauce and stir to coat."
    },
    {
      "@type": "HowToStep",
      "text": "To build the bowls, divide the cooked rice and broccoli florets between four bowls or containers. Add four meatballs to each bowl, then drizzle the extra sauce overtop. Finish the bowls by adding sliced green onion and sesame seeds to each bowl."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/teriyaki-meatball-bowls"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-11-25T13:32:15.339Z"
}
