{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "8",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Sarah McMinn"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T07:54:19.012Z",
  "datePublished": "2021-01-08T07:00:00+00:00",
  "description": "This Thai Red Curry is made with crispy tofu and sautéd red peppers and broccoli cooked in a creamy peanut red curry sauce. Serve it over rice or rice noodles for an easy vegan and gluten-free meal.  ",
  "image": [
    "https://www.mydarlingvegan.com/wp-content/uploads/2021/01/Red-Thai-Curry1.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/2021/01/Red-Thai-Curry1-500x500.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/2021/01/Red-Thai-Curry1-500x375.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/2021/01/Red-Thai-Curry1-480x270.jpg"
  ],
  "keywords": "Thai Red Curry",
  "name": "Thai Red Curry with Tofu",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "382 kcal",
    "carbohydrateContent": "50 g",
    "fatContent": "17 g",
    "fiberContent": "5 g",
    "proteinContent": "10 g",
    "saturatedFatContent": "9 g",
    "servingSize": "1 serving",
    "sodiumContent": "418 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Thai",
  "recipeIngredient": [
    "1 cup sprouted brown rice",
    "2 tbsp. coconut oil, (divided)",
    "8 ounces extra firm tofu, (cut into triangles)",
    "1 small yellow onion, (thinly sliced)",
    "1 tbsp. fresh ginger (peeled and grated)",
    "2-3 garlic clove (minced)",
    "1 red bell pepper (seeded and thinly sliced)",
    "2 cups broccoli florets, (cut into bite-sized pieces)",
    "1/2 cup vegetable broth",
    "1 (14 oz) can full-fat coconut milk",
    "1/4 cup peanut butter",
    "1-2 tbsp. red curry paste",
    "1 tbsp. Tamari soy sauce",
    "2 tsp. maple syrup",
    "juice of 1 lime",
    "salt, (to taste)",
    "small handful cilantro (chopped)",
    "lime wedges",
    "chopped peanuts"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin by making the rice. Add one cup of dried rice along with 2 1/2 cups water to a medium-sized pot. Place over medium heat and bring to a soft boil. Cover with a tight-fitting lid and reduce heat to low. Simmer for 40-45 minutes until all the water has absorbed and the rice has doubled in size. Note: if using white rice, follow the instructions on the back of the packaging as the amounts will be different."
    },
    {
      "@type": "HowToStep",
      "text": "Pat the tofu dry and cut it into 1/2 inch rectangles. Cut each rectangle in half and then diagonally to create triangles. (See photo above). Add one tablespoon of coconut oil to a large skillet or wok. Heat the oil over medium heat. When the oil is hot, add the tofu. Stir fry the tofu for about 5 to 6 minutes or until it is browned on both sides. Remove from the skillet and set aside. Wipe down the skillet and return it to the stovetop."
    },
    {
      "@type": "HowToStep",
      "text": "Thinly slice the onions and peppers. Break the broccoli into small bite-sized pieces. Mince the garlic and peel and grate the ginger. Heat the remaining oil in the same skillet. Reduce heat to medium. Add onions and sauté until the onions are translucent and fragrant, about 4-5 minutes. Stir in the garlic and ginger, sautéing for an additional 30 seconds. Stir in the red peppers and broccoli and sauté for an additional 2-3 minutes until the vegetables are vibrant in color."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the vegetable broth, coconut milk, curry paste, and peanut butter, stirring until the curry paste has completely dissolved. Bring to a boil and then reduce heat to a simmer. Simmer for 5 minutes, until the broccoli is soft and the liquid has begun to thicken slightly. Stir in the tamari, lime juice, maple syrup, and salt. Taste and adjust seasonings. Once it’s seasoned to perfection, stir in the cooked tofu so that it is completely coated. Serve immediately over rice. Top with fresh cilantro, peanuts, and lime juice."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://mydarlingvegan.com/red-thai-curry-bowl?swcfpc=1"
  ],
  "suitableForDiet": [
    "https://schema.org/GlutenFreeDiet",
    "https://schema.org/VeganDiet"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-03T07:54:19.011Z"
}
