{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Lindsey Johnson"
  },
  "createdAt": "2022-12-02T13:31:45.660Z",
  "datePublished": "2021-05-17T08:01:39+00:00",
  "description": "This easy-to-make and easy-to-take noodle jar is perfect for a delicious, healthy lunch. Just add the ingredients to the jar, take it with you, and add boiling water when you're ready to eat.",
  "image": [
    "https://helloglow.co/wp-content/uploads/2017/01/Thai-Noodle-Jar-7.jpg"
  ],
  "name": "Thai Curry Noodle Soup in a Jar",
  "recipeCategory": "main dish",
  "recipeCuisine": "Thai",
  "recipeIngredient": [
    "1 ounce dry rice sticks (pad Thai noodles, to yield about 3/4 cup softened noodles)",
    "2-3 cups boiling water (plus 3/4 cup for serving)",
    "1/4 cup kale ribbons",
    "1/4 cup shredded carrots",
    "1/2 cup cooked tofu cubes or sliced rotisserie chicken",
    "1 green onion (thinly sliced)",
    "2 teaspoons Thai curry paste (see notes)",
    "2 teaspoons tamari or soy sauce",
    "2 tablespoons coconut cream"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the dry rice sticks (noodles) into a medium bowl. Add 2-3 cups boiling water to cover the noodles. Let stand 8-10 minutes, or until softened. (Note - when the noodles are softened they shouldn't be mushy, but will be more al dente.) Drain and rinse in cool water."
    },
    {
      "@type": "HowToStep",
      "text": "In a pint (16-ounce) canning jar or another container with tight-fitting lid, layer the softened noodles, kale ribbons, shredded carrots, tofu (or chicken), and sliced green onion. Gently press down as you layer so there is enough room for all of the ingredients. Add the curry paste, tamari, and coconut cream to the jar. Seal the jar or container. Refrigerate until ready to use."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare: Pour 3/4 cup boiling water into the jar. Replace the lid and let stand for 5-7 minutes to allow all of the ingredients to heat up. Open and stir well, then eat!"
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://helloveggie.co/thai-curry-noodle-soup-in-jar"
  ],
  "updatedAt": "2022-12-02T13:31:45.659Z"
}
