{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "33",
    "ratingValue": "4.22"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT65M",
  "createdAt": "2022-12-02T11:05:41.340Z",
  "datePublished": "2010-11-17T18:12:55+00:00",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2010/11/meatloaf2.jpg"
  ],
  "keywords": "holiday recipes, vegan meatloaf",
  "name": "Thanksgiving Meatless Loaf",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "315 kcal",
    "carbohydrateContent": "43 g",
    "fatContent": "8.8 g",
    "fiberContent": "10 g",
    "proteinContent": "19 g",
    "servingSize": "1 serving",
    "sodiumContent": "683 mg",
    "sugarContent": "3.8 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "1 medium sweet potato",
    "1 medium onion",
    "2 ribs celery",
    "1 medium carrot",
    "2 cloves garlic (minced)",
    "1 15- ounce can cannellini beans or other white beans (drained and rinsed)",
    "14 ounces extra-firm tofu or an additional can of white beans",
    "2 tablespoons gluten-free soy sauce or coconut aminos",
    "2 tablespoons tomato paste",
    "1 tablespoon spicy brown or whole-grain prepared mustard",
    "1/4 cup fresh parsley (chopped)",
    "1/2 tablespoon rubbed sage",
    "1 tablespoon thyme leaf",
    "1/2 tablespoon dried rosemary (crushed)",
    "1 1/2 teaspoon salt (or to taste)",
    "1/2 teaspoon black pepper",
    "1 teaspoon smoked paprika",
    "2 tablespoons nutritional yeast",
    "1/2 cup chopped walnuts (optional)",
    "3/4 cup quinoa flakes or quick oatmeal"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash a medium sweet potato (about 7 ounces), pierce it several times with a fork, wrap it in a paper towel, and microwave until done, 4-5 minutes. (Alternately, bake or steam the sweet potato.) Allow to cool enough to handle and then peel and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Mince the onion, celery, and carrot. You can do this quickly by cutting each vegetable in quarters and then pulsing in a food processor until finely chopped."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large, non-stick skillet. Add the minced vegetables, including garlic, and cook, stirring regularly, until they become tender, about 6-10 minutes. Add water by the teaspoon if necessary to keep the vegetables from sticking or becoming dry. Once they’re softened, add the drained beans and mash them lightly with a slotted spoon or spatula."
    },
    {
      "@type": "HowToStep",
      "text": "Place the peeled sweet potato into the food processor along with the tofu, soy sauce, and all seasonings, including nutritional yeast. Process until fairly smooth. Add the walnuts and pulse a few more times. Scrape the tofu mixture into a large mixing bowl and add the quinoa flakes and the cooked vegetables. Stir well."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375F. If you have a silicone baking mat (recommended) place it on a baking sheet. Otherwise line the baking sheet with parchment paper or spray with non-stick spray. Spoon the tofu mixture onto the prepared baking surface, using dampened hands to shape it into an oblong or oval loaf about 2 1/2 inches high. Bake for 25 minutes or until the top is evenly browned. Loosely cover with aluminum foil and cook for 20 more minutes. Check to make sure that the center is firm; if not, give it a little extra time. (You can also remove the foil and cook for 5 more minutes for a crunchier crust.) Remove from oven and allow to stand for 10 minutes before slicing and serving."
    },
    {
      "@type": "HowToStep",
      "text": "Serving Suggestion: Serve alone or with Mushroom Gravy on the side."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2010/11/thanksgiving-meatless-loaf.html"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-12-02T11:05:41.339Z"
}
