{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-11-28T22:47:38.000Z",
  "datePublished": "2021-03-05T09:05:34+00:00",
  "description": "These vegan sugar cookies are as pretty as they are delicious! Sweet, tender, and topped with tintable glaze, they&#039;re fun to make and perfect for everything from celebrations to snacking.",
  "image": {
    "@type": "ImageObject",
    "height": 1020,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2021/02/vegan-sugar-cookies-12-of-15.jpg",
    "width": 680
  },
  "keywords": "vegan baking, vegan cookies",
  "name": "The Best Vegan Sugar Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "116 kcal",
    "carbohydrateContent": "19.8 g",
    "fatContent": "3.8 g",
    "fiberContent": "0.2 g",
    "proteinContent": "0.9 g",
    "saturatedFatContent": "1.2 g",
    "servingSize": "1 frosted cookie",
    "sodiumContent": "58 mg",
    "sugarContent": "12.7 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 1/2 cups all-purpose flour",
    "1 tablespoon cornstarch",
    "3/4 teaspoon baking powder",
    "1/4 teaspoon salt",
    "3/4 cup vegan butter, (at room temperature)",
    "3/4 cup organic sugar",
    "2 teaspoons vanilla extract",
    "1/4 teaspoon almond extract",
    "5 tablespoons unsweetened and unflavored non-dairy milk",
    "Organic powdered sugar, (for dusting)",
    "2 1/2 cups organic powdered sugar, (plus more as needed)",
    "1 tablespoon maple syrup",
    "2 tablespoons unsweetened and unflavored non-dairy milk, (plus more as needed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Stir the flour, cornstarch, baking powder, and salt together in a large mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate large mixing bowl, beat the butter, sugar, vanilla extract, and almond extract together with an electric mixer at high speed for 2 full minutes, until creamy and fluffy."
    },
    {
      "@type": "HowToStep",
      "text": "Beat in the milk until fully incorporated."
    },
    {
      "@type": "HowToStep",
      "text": "Begin adding the flour mixture to the butter mixture, about a third at a time, beating each addition in at low speed until fully incorporated and a thick dough has formed."
    },
    {
      "@type": "HowToStep",
      "text": "When all of the flour mixture has been added, shape the dough into 2 balls. Wrap each ball in plastic and place them in the fridge to chill until firm but not rock hard, about 60 to 90 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°F and line a couple of baking sheets with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Generously sprinkle a work surface and rolling pin with powdered sugar. Remove one of the dough balls from the fridge, place it on the work surface, then sprinkle it with powdered sugar."
    },
    {
      "@type": "HowToStep",
      "text": "Roll the dough to 1/4 inch thick. Check to make sure it's not sticking to the work surface, and add more powdered sugar if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the dough with cookie cutters, then place the cutouts on the baking sheets, spaced at least an inch apart."
    },
    {
      "@type": "HowToStep",
      "text": "Roll any unused dough back into a ball, wrap it in plastic, and place it back in the fridge to chill while the cookies bake. You can also place it in the freezer if it warms up too much."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the cookies for about 10 minutes, until just set on top. Place the baking sheets on cooling racks to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat the process, rolling any remaining dough, then moving on to the second dough ball. Be sure your cookie sheets are cool before placing new dough cutouts on them. You can place the cookie sheets in the freezer for a few minutes if needed."
    },
    {
      "@type": "HowToStep",
      "text": "While the cookies cool, stir the frosting ingredients together in a medium bowl. Add extra milk if the mixture seems too thick, extra powdered sugar if it seems too thin."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in some food coloring if you'd like. Optionally, divide the frosting up and tint each portion a different color."
    },
    {
      "@type": "HowToStep",
      "text": "Spread or pipe the frosting on your cookies, then decorate them with sprinkles or any other decorations you like."
    },
    {
      "@type": "HowToStep",
      "text": "Allow the frosting to set and serve your cookies or store them for later."
    }
  ],
  "recipeYield": "36",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-sugar-cookies"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-11-28T22:34:12.778Z"
}
