{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-02T12:33:50.256Z",
  "datePublished": "2021-05-14T03:00:00+00:00",
  "description": "A step-by-step guide to making the BEST hash browns every time! Crispy on the outside, tender on the inside, buttery, salty, and just 4 ingredients required. Perfect for breakfast, brunch, and beyond!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2021/03/Best-Hash-Browns-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/03/Best-Hash-Browns-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/03/Best-Hash-Browns-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2021/03/Best-Hash-Browns-SQUARE-480x270.jpg"
  ],
  "keywords": "crispy hash browns, hash browns, homemade hash browns, how to make hash browns",
  "name": "The BEST Crispy Hash Browns (Restaurant-Style!)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "225 kcal",
    "carbohydrateContent": "30.8 g",
    "fatContent": "10.4 g",
    "fiberContent": "2.3 g",
    "proteinContent": "3.7 g",
    "saturatedFatContent": "1.2 g",
    "servingSize": "4 large hash brown patties",
    "sodiumContent": "301 mg",
    "sugarContent": "1.1 g",
    "unsaturatedFatContent": "8.7 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 lbs russet potatoes, scrubbed clean, NOT peeled (~2 large, 3 medium, or 4-5 small potatoes as recipe is written)",
    "1/2 scant tsp sea salt",
    "1/4 tsp black pepper",
    "1/4 tsp onion powder (optional)",
    "3 Tbsp avocado oil (or sub melted vegan butter)",
    "Ketchup",
    "Vegan sausage",
    "Vegan scrambled eggs",
    "Perfect fried eggs",
    "Frittata",
    "Vegan omelet"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Rinse and scrub potatoes (no need to peel yet). For any potatoes that are larger than 2 inches wide or 3 1/2 inches long, cut in half widthwise. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Place a colander in the sink so that it’s ready when time to drain and rinse the potatoes. This is important because small variations in cook time can lead to mushy hash browns or a raw potato taste."
    },
    {
      "@type": "HowToStep",
      "text": "Fill a large pot with ~1/2-inch of water (for us that was ~3 cups or 710 ml). Place a steamer basket over the water and position it so that you can see the water on the sides of the basket. Do not add potatoes yet."
    },
    {
      "@type": "HowToStep",
      "text": "Bring water to a boil over high heat. Once boiling, place the unpeeled potatoes in the steamer basket. It’s okay if the steamer basket fully covers the water at this point."
    },
    {
      "@type": "HowToStep",
      "text": "Cover and steam for 8 minutes. Then immediately transfer to colander. Drain and rinse with cool water and set aside until cool enough to handle (~5 minutes). They should only be partially cooked — the skin should be easy to pierce with a fork, but the center of the potatoes (or potato chunks if cut pieces of larger potatoes) should still feel firm. When cut in half, they should look about halfway cooked (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "The peel usually slides off easily, but if it doesn’t, you can remove it with a vegetable peeler. If using a box grater, the peel will come off when grating and you can discard any large chunks of peel. It’s okay if some small pieces of the peel get grated."
    },
    {
      "@type": "HowToStep",
      "text": "Grate potatoes using a food processor grating attachment (our preferred method — chop into smaller pieces as needed to fit down the feed tube) or the large side of a box grater. Place grated potatoes into a medium mixing bowl. Add sea salt, black pepper, and onion powder (optional) and stir gently with a fork to evenly distribute spices. Stop here and see step 13 if freezing for later use."
    },
    {
      "@type": "HowToStep",
      "text": "For cooking the hash browns, you can either use the stovetop method (steps 9 & 10) OR the oven method (step 11). Both are delicious. We prefer the flavor and texture of the stovetop method but the oven method is ideal for larger batches."
    },
    {
      "@type": "HowToStep",
      "text": "STOVETOP: Heat a large (10-inch or larger) cast-iron skillet over medium to medium-high heat (non-stick will also work but doesn’t get them as crispy). Form potato mixture into 1/4-inch thick patties (recipe as written makes 4 large or 8 small hash brown patties)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the pan is hot, work in batches by adding half of the oil (1 1/2 Tbsp (22 ml) // amount as recipe is written) and as many hash browns as will comfortably fit in the pan. Cook undisturbed for 6-8 minutes or until golden brown on the underside. Reduce heat if browning too quickly. Carefully flip and cook for another 5-7 minutes or until both sides are golden brown and crispy. Remove from the pan and repeat with the remaining half of the oil and hash browns. Skip to step 12 if you cooked your hash browns on the stovetop."
    },
    {
      "@type": "HowToStep",
      "text": "OVEN: Preheat the oven to 425 F (218 C) and line a baking sheet with parchment paper. Form potato mixture into 3-inch wide by 1/4-inch thick patties and brush each side with half of the oil (1 1/2 Tbsp (22 ml) // amount as original recipe is written). Use additional baking sheets if making a larger batch. Bake on the center rack for 13-15 minutes on the first side, flip, and bake 7-10 minutes on the second side, or until both sides are golden brown and crispy."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh. Leftovers will keep in the refrigerator for 3-4 days. Optionally, serve with ketchup, vegan sausage, vegan scrambled eggs, perfect fried eggs, frittata, and/or a vegan omelette."
    },
    {
      "@type": "HowToStep",
      "text": "FREEZE: proceed through step 7, form into 1/4-inch thick patties, and then place in a single layer on a parchment-lined baking sheet and freeze until firm. Transfer to a sealed container, and when ready to cook, proceed with step 9 (stovetop method) or step 11 (oven method)."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/the-best-crispy-hash-browns-restaurant-style"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-02T12:33:50.254Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=fpyWI1GQqXw",
    "description": "A step-by-step guide to making the BEST hash browns every time! Crispy on the outside, tender on the inside, buttery, salty, and just 4 ingredients required. Perfect for breakfast, brunch, and beyond!\n\nFull Recipe: https://minimalistbaker.com/the-best-crispy-hash-browns-restaurant-style/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M2S",
    "embedUrl": "https://www.youtube.com/embed/fpyWI1GQqXw?feature=oembed",
    "name": "The BEST Crispy Hash Browns (Restaurant-Style!) | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/fpyWI1GQqXw/hqdefault.jpg",
    "uploadDate": "2021-05-14T08:00:09+00:00"
  }
}
