{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "869",
    "ratingValue": "4.83"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-02T17:24:13.651Z",
  "datePublished": "2013-09-21T05:00:44+00:00",
  "description": "Easy cinnamon rolls with just 7 ingredients and no complicated steps. Just proof, roll out, and bake! Plus, they're vegan and SO delicious, fluffy, and gooey!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2013/09/7-Ingredient-Cinnamon-Rolls-SQUARE.jpg"
  ],
  "keywords": "easiest cinnamon rolls",
  "name": "The World's Easiest Cinnamon Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "249 kcal",
    "carbohydrateContent": "35 g",
    "fatContent": "9 g",
    "fiberContent": "1.3 g",
    "proteinContent": "4.7 g",
    "saturatedFatContent": "2.4 g",
    "servingSize": "1 roll",
    "sodiumContent": "160 mg",
    "sugarContent": "6.9 g",
    "unsaturatedFatContent": "6.2 g"
  },
  "prepTime": "PT90M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Swedish-Inspired",
  "recipeIngredient": [
    "3 Tbsp vegan butter* (such as Earth Balance)",
    "1 packet instant yeast* (or use rapid-rise yeast // 1 packet yields ~ 2 1/4 tsp)",
    "1 cup unsweetened plain almond milk*",
    "1 Tbsp organic cane sugar*",
    "1/4 tsp salt",
    "3 cups unbleached all-purpose flour*",
    "3 Tbsp vegan butter* (such as Earth balance // melted)",
    "1/4 cup organic cane sugar*",
    "1/2 - 1 Tbsp ground cinnamon (to taste)",
    "2 Tbsp vegan butter* (such as Earth balance // melted)",
    "Simple Powdered Sugar Glaze (see step 8)",
    "Vegan Cream Cheese Frosting"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "DOUGH: In a large sauce pan (or in a bowl in the microwave at 30-second increments), heat the almond milk and vegan butter until warm and melted, never reaching boiling. Remove from heat and let cool to 110 degrees F (43 C) or the temperature of bath water. It should be warm but not too hot or it will kill the yeast."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a large mixing bowl and sprinkle on yeast. Let activate for 10 minutes. Then add 1 Tbsp sugar and the salt and stir."
    },
    {
      "@type": "HowToStep",
      "text": "Next add in flour 1/2 cup (68 g) at a time, stirring as you go (you may not add it all). The dough will be sticky. When it is too thick to stir, transfer to a lightly floured surface and knead for a minute or so until it forms a loose ball (be careful not to overmix). Rinse your mixing bowl out, coat it with avocado or olive oil, and add your dough ball back in. Cover with plastic wrap and set in a warm place to rise for about 1 hour, or until doubled in size (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "FILLING: On a lightly floured surface, roll out the dough into a thin rectangle (the thickness of the dough should be about 1/4-inch). Brush with melted vegan butter and top with sugar and desired amount of cinnamon."
    },
    {
      "@type": "HowToStep",
      "text": "Starting at one end, tightly roll up the dough and situate seam side down. Then with a serrated knife or a string of floss, cut the dough into 1.5 - 2 inch sections and position in a well-buttered 8x8-inch square or comparable sized round pan (you should have about 10 rolls as original recipe is written). If preparing the cinnamon rolls the night before, stop here, cover the pan, and refrigerate overnight, then proceed with the next step in the morning."
    },
    {
      "@type": "HowToStep",
      "text": "TOPPING: Brush with vegan butter (melted) and cover with plastic wrap. Set on top of the oven to let rise again while you preheat oven to 350 degrees F (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the oven is hot, bake rolls for 25-30 minutes or until slightly golden brown. Let cool for a few minutes and then serve immediately."
    },
    {
      "@type": "HowToStep",
      "text": "Optional: Frost with dairy-free cream cheese frosting or a simple mixture of 1 cup (112 g) organic powdered sugar and 1-2 Tbsp (15-30 ml) almond milk."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh, though they will keep covered at room temperature for ~2-3 days."
    },
    {
      "@type": "HowToStep",
      "text": "FREEZING: You can make the rolls up to the point of putting in a baking dish (step 5), and instead, freeze them in a freezer-safe container. Then, thaw the night before in the fridge. Once completely thawed, proof covered with a towel in a greased baking dish as your oven preheats, then bake as instructed."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/the-worlds-easiest-cinnamon-rolls"
  ],
  "totalTime": "PT115M",
  "updatedAt": "2022-12-02T17:24:13.649Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=5Ty1_OLErzI",
    "description": "The world's easiest 7-ingredient cinnamon rolls that happen to be vegan! Fluffy, perfectly sweet and cinnamon-spiced. The perfect indulgent lazy weekend breakfast or dessert.\n\nRecipe: http://minimalistbaker.com/the-worlds-easiest-cinnamon-rolls/\n\nCinnamon rolls are believed to have originated in Sweden in the 1920s. But it wasn’t until the 1950s that they became popular. In Sweden, they’re commonly served for fika, which is a gathering time that includes a cup of coffee or tea. Sweden even has a National Cinnamon Bun Day. \n\nFollow us here:\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT1M15S",
    "embedUrl": "https://www.youtube.com/embed/5Ty1_OLErzI?feature=oembed",
    "name": "The World's Easiest (VEGAN) Cinnamon Rolls | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/5Ty1_OLErzI/hqdefault.jpg",
    "uploadDate": "2016-12-12T22:29:40+00:00"
  }
}
