{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "70",
    "ratingValue": "4.96"
  },
  "author": {
    "@type": "Person",
    "name": "Sam Turnbull • It Doesn't Taste Like Chicken"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-02T09:29:48.278Z",
  "datePublished": "2020-05-13T05:00:50+00:00",
  "description": "Just 10 ingredients to make the best homemade burger patty ever. Juicy, chewy, meaty, and holds up on the grill! Make these ahead of time and store in the fridge or freezer until ready to serve. Then toss them on the grill or in a frying pan when ready to serve.",
  "image": [
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2020/05/the-best-vegan-seitan-burger-recipe-patty-homemade-beyond.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2020/05/the-best-vegan-seitan-burger-recipe-patty-homemade-beyond-500x500.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2020/05/the-best-vegan-seitan-burger-recipe-patty-homemade-beyond-500x375.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2020/05/the-best-vegan-seitan-burger-recipe-patty-homemade-beyond-480x270.jpg"
  ],
  "keywords": "beets, best, burger, lentils, seitan, vegan, veggie burger",
  "name": "The Best Vegan Seitan Burger",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "170 kcal",
    "carbohydrateContent": "13 g",
    "fatContent": "2 g",
    "fiberContent": "3 g",
    "proteinContent": "26 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 burger patty (recipe makes 6 patties)",
    "sodiumContent": "589 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 large raw beet (200g) (about 1 cup), peeled and cut into chunks)",
    "1/2 cup cooked lentils (I used canned brown lentils)",
    "1/4 cup soy sauce",
    "3 tablespoons water",
    "1 tablespoon natural peanut butter (sub any other nut or seed butter)",
    "1 1/2 teaspoon onion powder",
    "1 1/2 teaspoon garlic powder",
    "1/2 teaspoon liquid smoke",
    "1/4 teaspoon black pepper",
    "1 1/2 cups vital wheat gluten"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add all of the ingredients except for the vital wheat gluten to a food processor. Pulse, stopping to scrape the sides until everything is mixed together into a mush. Add the vital wheat gluten and pulse, stopping to scrape the sides as needed until combined into a crumbly dough."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the dough into six and use your hands to form six burger patties. You could alternatively make mini patties for sliders!"
    },
    {
      "@type": "HowToStep",
      "text": "Add several inches of water to a large pot with a steamer basket and bring to a boil. Once boiling, add the burger patties to the steamer basket, cover and steam for 25 minutes.For the best shape: the burgers can become funny shapes if they are piled on top of each other so steam the patties in a single layer without overlapping, working in batches if needed, or you could use layered bamboo steamer baskets if you have them. Once steamed, the burgers will look kind of funny at this stage, but don't worry! Allow the burgers to cool completely, then cover and chill in the fridge overnight before serving. Chilling overnight ensures the best burger texture. They will keep fresh when covered in the fridge for up to 5 days, or they freeze for up to 3 months."
    },
    {
      "@type": "HowToStep",
      "text": "To serve: steaming the seitan is what gives it the perfect texture. Once the patties are steamed and chilled overnight, you can basically treat them as if they were raw burger patties. Pan-fry them or grill them for a couple minutes per side until browned and heated through. Place on a bun and top with your favourite vegan burger toppings."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://itdoesnttastelikechicken.com/the-best-vegan-seitan-burger"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-02T09:29:48.275Z"
}
