{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "4.5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T18:14:36.268Z",
  "datePublished": "2014-02-11T19:54:00+00:00",
  "description": "These Giant Vegan Chocolate Chip Cookies are huge, chewy and made without vegan butter. Make a double batch because they don't last long. Vegan Palm Oil free, soy-free, eggless, dairy-free Recipe",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2014/02/Chocolate-Chip-Cookie-8336-302x453-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2014/02/Chocolate-Chip-Cookie-8336-302x453-1-302x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2014/02/Chocolate-Chip-Cookie-8336-302x453-1-302x270.jpg"
  ],
  "name": "The Ultimate Giant Vegan Chocolate Chip & Chunk Cookies. Giant Vegan Chocolate Chip Cookie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "444 kcal",
    "carbohydrateContent": "59 g",
    "fatContent": "21 g",
    "fiberContent": "6 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "6 g",
    "servingSize": "1 serving",
    "sodiumContent": "140 mg",
    "sugarContent": "34 g"
  },
  "prepTime": "PT60M",
  "recipeCategory": "Cookie",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1.25 cup organic unbleached white flour or Spelt flour (or half of each. use glutenfree all purpose flour to make gluten-free)",
    "1 Tbsp corn starch (or arrowroot starch)",
    "1/4 tsp baking powder",
    "1/8 tsp baking soda",
    "1/4 tsp salt",
    "2 tsp flaxmeal",
    "3 Tbsp almond milk",
    "3 tbsp loaded almond butter (I used Justin's classic almond butter or use other nut butter or seed butter)",
    "3 Tbsp Oil (organic canola or coconut)",
    "1 Tbsp maple syrup",
    "1 Tbsp light molasses (or 1 Tbsp maple syrup if you don't like molasses)",
    "1 tsp vanilla extract",
    "1/2 cup ground raw sugar or brown sugar (any other fine vegan sugar (1/3 cup for less sweet, brown sugar makes the cookies more chewy)",
    "1/2 cup or more dark drinking chocolate chunks (I use Theo's, or Enjoy life chunks or other vegan semi sweet chocolate chunks)",
    "2-3 Tbsp mini chocolate chips or regular size chocolate chips",
    "Variations: Add in a 1/2 tsp cinnamon. Add more nut butter and omit the oil."
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a bowl, whisk all the dry ingredients: In another bowl mix the flaxmeal into the almond milk. Add the almond butter, oil, vanilla, maple, molasses and mix well to combine. It will take a minute or so for the nut butter to mix in. Add the sugar and mix well. Add dry to the wet. Mix to form a dough. Add in the chocolate chips and chunk and mix to combine. Add more or less to chocolate chip density preference :). Cover and chill for an hour (do not skip)."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375 degrees F / 190oc. Take a handful of the dough (1/4-1/3 cup), roll into a ball and then press and shape into a disc of 4-5 inch width on parchment lined sheet.(I just press the ball directly on the parchment with my palm). Make as large or small to preference. Press the chocolate chips that remain the bowl after, into the shaped cookies. Sprinkle a little granulated sugar on top and press lightly on the cookie. Bake for 11-12 minutes. Let cool completely.(5 minutes). The cookies will soft out of the oven, but will firm up. Bake for less time for smaller cookies (till just about starting to get golden on the edges). Store in an airtight container once completely cool."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/2014/02/the-ultimate-chocolate-chip-chunk.html"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-02T18:14:36.267Z"
}
