{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "24",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-28T09:10:29.591Z",
  "datePublished": "2017-11-06T18:45:31+00:00",
  "description": "This is the Best Green Bean Casserole you&#039;ll ever make with fresh green beans and no condensed &quot;cream of&quot; soup. Taste the difference fresh can make!",
  "image": {
    "@type": "ImageObject",
    "height": 600,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2017/11/Creamiest-Green-Bean-Casserole-Close.jpg",
    "width": 800
  },
  "keywords": "From Scratch, Green Bean Casserole, Holiday, Thanksgiving",
  "name": "The Best Green Bean Casserole (no canned soup)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "294.38 kcal",
    "carbohydrateContent": "19.75 g",
    "fatContent": "22.43 g",
    "fiberContent": "3.07 g",
    "proteinContent": "5.5 g",
    "servingSize": "1 Serving",
    "sodiumContent": "677.5 mg"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 Tbsp olive oil ($0.13)",
    "8 oz. button mushrooms ($1.80)",
    "2 cloves garlic ($0.16)",
    "Pinch salt and pepper ($0.05)",
    "3 Tbsp butter ($0.39)",
    "3 Tbsp all-purpose flour ($0.03)",
    "1 cup vegetable broth* ($0.13)",
    "1 cup whole milk ($0.31)",
    "4 oz. cream cheese ($0.60)",
    "20 oz frozen green beans* ($2.50)",
    "3 oz. French fried onions** ($1.75)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash the mushrooms then roughly chop them into small pieces. Mince the garlic. Begin preheating the oven to 350oF."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet over medium, then add the olive oil. Swirl to coat the surface of the skillet, then add the mushrooms, garlic, and a pinch of salt and pepper. Sauté the mushrooms until they release all their moisture, the skillet dries up again, and the edges of the mushrooms begin to brown slightly (7-10 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "Add the butter and flour the skillet with the mushrooms. Continue to sauté for 2-3 minutes, or just until the flour begins to coat the bottom of the skillet and turns golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the vegetable broth into the skillet until all of the flour has dissolved off the bottom of the skillet. Allow the broth to come to a simmer as you whisk, at which point it will thicken."
    },
    {
      "@type": "HowToStep",
      "text": "When the liquid in the skillet has thickened, whisk in the milk. Allow the mixture to return to a simmer after adding the milk, then add the cream cheese (cut into small chunks). Continue to whisk and cook until the cream cheese has fully melted into the sauce. Taste the sauce and add another pinch of salt and pepper if needed. You want the sauce to be slightly over seasoned so the flavor doesn't get too diluted once the green beans are added."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the skillet from the heat and stir in the green beans (no need to thaw). The cold beans will thicken the sauce considerably. Transfer the beans and sauce to a 2-3 quart casserole dish. Top with the fried onions and transfer to the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the Green Bean Casserole for 20-25 minutes, or until heated through and the fried onions on top have browned slightly. Serve warm."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://budgetbytes.com/creamiest-green-bean-casserole"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-28T09:10:29.589Z"
}
