{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "143",
    "ratingValue": "4.77"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T17:44:35.114Z",
  "datePublished": "2015-02-07T05:00:22+00:00",
  "description": "Amazing 1-bowl chocolate cupcakes that are undetectably vegan and gluten-free. Fudgy, moist, insanely chocolaty, and topped with sinful chocolate ganache frosting.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/01/1-Bowl-Vegan-Gluten-Free-Chocolate-Cupcakes-SQUARE.jpg"
  ],
  "keywords": "chocolate cupcakes",
  "name": "The Best Vegan Gluten-Free Chocolate Cupcakes",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "412 kcal",
    "carbohydrateContent": "54.7 g",
    "fatContent": "22.8 g",
    "fiberContent": "5 g",
    "proteinContent": "4.1 g",
    "saturatedFatContent": "11.5 g",
    "servingSize": "1 cupcakes",
    "sodiumContent": "159 mg",
    "sugarContent": "38.7 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 scant cup Almond Breeze Unsweetened Original Almond Milk",
    "3/4 tsp apple cider vinegar",
    "2 Tbsp flaxseed meal (to make flax eggs)",
    "5 Tbsp water (to make flax eggs)",
    "1 1/2 tsp baking soda",
    "1/3 cup cane or granulated sugar",
    "1/3 scant cup maple syrup or agave nectar (sub honey if not vegan)",
    "1 cup beet puree (or sub butternut squash, applesauce, or another hearty fruit puree with varied results)",
    "1/4 cup melted coconut oil or vegan butter (such as Earth Balance)",
    "1/4 tsp sea salt",
    "1/2 cup unsweetened cocoa powder (if clumpy, sift)",
    "1/2 cup almond meal (finely ground)",
    "1/4 cup gluten-free oat flour",
    "3/4 cup gluten-free flour blend*",
    "1/2 cup Almond Breeze Unsweetened Original Almond Milk",
    "1 1/4 cup dairy free dark or semi-sweet chocolate (chopped)",
    "1/2 cup vegan butter (softened and cut into Tablespoon-sized slices)",
    "1 1/4 - 2 cups powdered sugar"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "FOR BEETS: To roast beets, preheat oven to 400 degrees F (204 C), drizzle 2 large beets (amount as original recipe is written // adjust if altering batch size) with oil of choice, and wrap in foil. Bake for 50 minutes – 1 hour or until a knife slides through easily. Peel away skins by rubbing foil around and it should shed off easily. Add beets to a food processor or blender and add 1/4 cup liquid of choice (I like a mix of water and orange juice // amount as original recipe is written // adjust if altering batch size). Blend until creamy, smooth and pourable, scraping down sides as needed. Otherwise, sub another fruit puree, such as applesauce, with varied results."
    },
    {
      "@type": "HowToStep",
      "text": "FOR CUPCAKES: Preheat oven to 375 degrees F (190 C) and line 11 muffins (amount as original recipe is written // adjust if altering batch size) with paper liners, or lightly grease. Also measure out almond milk and add vinegar. Stir and let curdle while moving onto the next step."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare flax eggs in a large mixing bowl by mixing flaxseed meal and water and let rest for 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add baking soda to the almond milk vinegar mixture and stir. It should fizz."
    },
    {
      "@type": "HowToStep",
      "text": "Add the sugar, maple syrup, and almond milk mixture to the flax egg and beat to combine. Then add beet puree, melted coconut oil, and salt and mix."
    },
    {
      "@type": "HowToStep",
      "text": "Add cocoa powder, almond meal, oat flour, and gluten-free flour blend and beat to combine. If the batter appears too thick, add a touch more almond milk, but it should be perfect. If too thin, add a little more gluten-free flour blend + cocoa powder. It should resemble a thin batter that’s pourable."
    },
    {
      "@type": "HowToStep",
      "text": "Divide batter evenly between muffin tins, filling 3/4 full."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 29-34 minutes or until puffy and a toothpick inserted into the center comes out clean."
    },
    {
      "@type": "HowToStep",
      "text": "Let rest in the tin for 10-15 minutes. Then remove and let cool COMPLETELY on a cooling rack. Don’t try to sample early because they need to fully cool or they tend to stick to the wrappers."
    },
    {
      "@type": "HowToStep",
      "text": "FOR FROSTING: Add almond milk to your rinsed out mixing bowl from earlier and microwave for 1 minute. (Alternatively, heat in a saucepan until just simmering and then transfer back to mixing bowl.)"
    },
    {
      "@type": "HowToStep",
      "text": "Immediately add chocolate to warm milk but don’t touch for 2 minutes so it can melt."
    },
    {
      "@type": "HowToStep",
      "text": "Stir with a wooden spoon to incorporate, then add softened butter and cover. Let rest untouched for another 10 minutes to meddle."
    },
    {
      "@type": "HowToStep",
      "text": "Use your mixer to beat the mixture together. Then add 1 cup powdered sugar (amount as original recipe is written // adjust if altering batch size), mix again, and place in fridge to set for 20-30 minutes. You’ll know it’s ready when you tip it and it’s slow to move."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from fridge and beat again. If it’s still too thin, add another 1/4 - 1/2 cup powdered sugar (amount as original recipe is written // adjust if altering batch size) and beat until light and fluffy. I found that chilling for a total of 20 minutes and adding 1 3/4 cups total powdered sugar was perfect (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Frost cupcakes generously. You’ll likely have leftover frosting (unless you’re like me). Sprinkles, mint leaves, or fresh raspberries would make the perfect garnish."
    },
    {
      "@type": "HowToStep",
      "text": "Will keep well-covered at room temperature for several days, though best when fresh."
    }
  ],
  "recipeYield": "11",
  "sameAs": [
    "https://minimalistbaker.com/the-best-vegan-gluten-free-chocolate-cupcakes"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-02T17:44:35.112Z"
}
