{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "286",
    "ratingValue": "4.8"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T14:35:03.173Z",
  "datePublished": "2018-07-27T03:00:10+00:00",
  "description": "Tender, flavorful, 10-ingredient vegan meatballs made with quinoa and black beans! Infused with fresh herbs, tomato paste, and spices for big flavor. The perfect meatless meatball for pasta, sandwiches, and more!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Vegan-Meatballs-Perfect-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Vegan-Meatballs-Perfect-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Vegan-Meatballs-Perfect-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/05/Vegan-Meatballs-Perfect-SQUARE-480x270.jpg"
  ],
  "keywords": "vegan meatballs",
  "name": "The Best Vegan Meatballs",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "67.4 kcal",
    "carbohydrateContent": "10 g",
    "fatContent": "1.9 g",
    "fiberContent": "2.7 g",
    "proteinContent": "3.3 g",
    "saturatedFatContent": "0.3 g",
    "servingSize": "1 Meatballs",
    "sodiumContent": "184.5 mg",
    "sugarContent": "1.1 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup cooked and cooled quinoa* (ensure it's cooked + completely cooled before using)",
    "1 15-ounce can black beans* (rinsed, drained, dried)",
    "2 Tbsp water (or sub olive or avocado oil)",
    "3 cloves garlic (minced)",
    "1/2 cup diced shallot",
    "1/4 tsp sea salt (plus more to taste)",
    "2 1/2 tsp fresh oregano (or sub half the amount in dried)",
    "1/2 tsp red pepper flake (reduce for less heat)",
    "1/2 tsp fennel seeds (optional)",
    "1/2 cup vegan parmesan cheese (plus more for serving)",
    "2 Tbsp tomato paste",
    "3 Tbsp chopped fresh basil or parsley (we mixed both // plus more for serving)",
    "1-2 Tbsp vegan worcestershire sauce (optional // adds depth of flavor // ensure gluten-free for GF eaters)",
    "Marinara sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven’t prepared your quinoa yet, do so now (make sure it’s cooked and cooled completely before use). 1/3 cup uncooked quinoa will yield ~1 cup cooked. *Prep/cook time does not include preparing quinoa."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C). Add rinsed, dried black beans to a parchment-lined baking sheet. Bake for 15 minutes or until beans appear cracked and feel dry to the touch (see beans in food processor photo). Remove beans from the oven and then increase oven heat to 375 degrees F (190C)."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large (oven-safe) skillet over medium heat. Once hot, add water (or oil), garlic, and shallot. Sauté for 2-3 minutes, or until slightly softened, stirring frequently. Remove from heat (and reserve pan for later use)."
    },
    {
      "@type": "HowToStep",
      "text": "Add black beans to a food processor along with garlic, shallot, sea salt, oregano, red pepper flake, and fennel (optional) and pulse into a loose meal (DON'T overmix). Then add cooked/cooled quinoa, vegan parmesan cheese, tomato paste, fresh basil or parsley, and Worcestershire (optional). Pulse to combine until a textured dough forms (you're not looking for a purée, but it should be semi-tacky)."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more salt for saltiness/depth of flavor, red pepper flake for heat, herbs for earthiness, or Worcestershire (optional) for more depth of flavor. If it’s too tacky or wet, add more vegan parmesan cheese and pulse to combine (we added a bit more)."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop out heaping 1 1/2 Tbsp amounts (using this scoop or a Tablespoon) and gently form into small balls using your hands. Add to a plate and refrigerate for 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Heat an oven-safe metal or cast-iron skillet over medium heat. Once hot, add a small amount of oil to prevent sticking, then add the meatballs. Sauté for a few minutes, gently turning the meatballs to get a slight crust on either side. Then transfer to the oven and bake for 20-30 minutes or until golden brown on the edges and slightly dry to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "These meatballs are delicious as is, or you can add some marinara to the pan and heat over medium heat for 5 minutes (or until bubbling / hot) to infuse more flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with marinara and additional vegan parmesan cheese (optional)! These are also delicious atop any pasta. Leftover meatballs keep for 4-5 days in the refrigerator or 1 month in the freezer. Reheat in the microwave or in a 375-degree F (190 C) oven until warmed through."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/the-best-vegan-meatballs"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-02T14:35:03.172Z"
}
