{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "8",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T15:11:51.591Z",
  "datePublished": "2022-08-31T03:00:00+00:00",
  "description": "Undetectably gluten-free bagels that are wholesome yet tender, and perfectly chewy! Perfect for breakfast sandwiches or schmears of cream cheese. Just 9 ingredients required!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2022/05/Gluten-Free-Bagels-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2022/05/Gluten-Free-Bagels-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2022/05/Gluten-Free-Bagels-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2022/05/Gluten-Free-Bagels-SQUARE-480x270.jpg"
  ],
  "keywords": "gluten free bagels",
  "name": "The Ultimate Gluten-Free Bagels (Vegan)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "249 kcal",
    "carbohydrateContent": "52.1 g",
    "fatContent": "2.8 g",
    "fiberContent": "3.7 g",
    "proteinContent": "4.2 g",
    "saturatedFatContent": "0.2 g",
    "servingSize": "1 bagel",
    "sodiumContent": "5 mg",
    "sugarContent": "3.7 g",
    "unsaturatedFatContent": "1.5 g"
  },
  "prepTime": "PT90M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 3/4 cup warm water",
    "2 Tbsp cane sugar (organic for vegan-friendly)",
    "2 tsp active dry yeast",
    "1 1/2 cups sorghum flour*",
    "1 1/2 cups tapioca starch (also called tapioca flour)",
    "2/3 cup brown rice flour (plus more for dusting)",
    "3 Tbsp ground chia seeds*",
    "3 Tbsp flaxseed meal (ground flax seeds*)",
    "2 tsp sea salt",
    "Everything Bagel Seasoning",
    "Cinnamon Sugar (see notes*)",
    "Poppy seeds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large mixing bowl, whisk together the warm water (100-110 degrees F / 38-43 C) and sugar until the sugar is dissolved. Whisk in the yeast and let it bloom on the counter for 10 minutes until frothy. If it doesn’t foam, start over — your water may have been too hot or the packet of yeast was expired."
    },
    {
      "@type": "HowToStep",
      "text": "While your yeast blooms, in a separate mixing bowl, combine the sorghum flour, tapioca starch, brown rice flour, ground chia seeds, ground flax seeds, and salt. Whisk well to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Once the yeast has proofed, make a slight “well” in the middle of the flour mixture, add water/yeast mixture to the “well,” and use a wooden spoon to begin mixing immediately. The mixture will start out quite loose and liquidy, but should start to thicken as you mix. When the mixture has thickened slightly and has no lumps (~1 minute) cover it with a thin kitchen towel and let rise at room temperature for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "When the dough is almost done rising, bring 3 quarts of water to a boil in a Dutch oven or other large pot. Preheat the oven to 400 F (204 C) and line a large baking tray with parchment paper. Set nearby."
    },
    {
      "@type": "HowToStep",
      "text": "While your water is coming to a boil, dust a clean work surface with a little brown rice flour. Turn the dough out onto the surface and divide it into 8 equal pieces (adjust amount if altering default number of servings). Shape each piece into a ball, adding a little flour to your hands if the dough is sticky. Then, shape each ball into a bagel by pressing your pointer finger into the middle of the ball and moving it in a circular motion to widen the hole. The hole of the bagel should be ~1 inch (2 1/2 cm) in diameter, as it will shrink slightly when boiled. Dust your work surface once more so the formed bagels are easy to pick up."
    },
    {
      "@type": "HowToStep",
      "text": "When the water reaches a rolling boil, carefully (we used a spatula) pick up each bagel and place it into the boiling water (we added 3 at a time). Boil each bagel for ~45 seconds per side, using a fork or tongs to flip each bagel. When ready to remove, use a skimmer or large slotted spoon to remove the bagel from the water, ensuring that all excess water drains off (we used a slotted spatula). Place the boiled bagel onto the prepared baking sheet and immediately top the bagel with 2 teaspoons of your preferred topping (if using). Repeat the process with the remaining bagels."
    },
    {
      "@type": "HowToStep",
      "text": "When the bagels are done boiling, place them into the oven and bake for 25-30 minutes, until dry to the touch and just beginning to brown. Let cool on the pan for 10 minutes before slicing, toasting, and enjoying. Delicious with vegan cream cheese, jam, peanut butter, avocado, or hummus."
    },
    {
      "@type": "HowToStep",
      "text": "Store in an airtight container for up to 3-4 days in the refrigerator, or in the freezer for up to 1 month."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/the-ultimate-gluten-free-bagels-vegan"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-12-02T15:11:51.590Z"
}
