{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "90",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-05T09:32:52.556Z",
  "datePublished": "2014-06-28T05:00:48+00:00",
  "description": "Easy, fool-proof sticky buns for the novice baker. 9 basic ingredients, no complicated methods, just straightforward, ooey-gooey sticky buns. And they're vegan!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/06/Sticky-Buns-SQUARE.jpg"
  ],
  "keywords": "sticky buns",
  "name": "The World's Easiest Sticky Buns",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "358 kcal",
    "carbohydrateContent": "40 g",
    "fatContent": "20 g",
    "fiberContent": "1.7 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "5 g",
    "servingSize": "1 buns",
    "sodiumContent": "251 mg",
    "sugarContent": "15 g"
  },
  "prepTime": "PT90M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 cup Unsweetened Original Almond Breeze almond milk",
    "3 Tbsp vegan butter",
    "1 packet rapid-rise (instant) yeast (1 packet yields ~ 2 1/4 tsp)",
    "1 Tbsp sugar",
    "1/4 tsp salt",
    "2 1/2 - 3 cups unbleached all-purpose flour (I mixed all-purpose and whole-wheat pastry 2:1)",
    "1/4 cup vegan butter (melted)",
    "1/2 cup brown sugar OR granulated sugar",
    "1/2-1 Tbsp cinnamon",
    "1/2 cup brown sugar",
    "1/2 cup vegan butter",
    "1/2 cup pecans (chopped)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large sauce pan (or in a bowl in the microwave at 30 sec increments), heat the almond milk and vegan butter until warm and melted, never reaching boiling. Remove from heat and let cool to 110 degrees (43C), or the temperature of bath water. It should be warm but not too hot or it will kill the yeast."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a large mixing bowl and sprinkle on yeast. Let activate for 10 minutes, then add sugar and the salt and stir (you should see some foaming / bubbling if the yeast is fresh and the water temperature is correct)."
    },
    {
      "@type": "HowToStep",
      "text": "Next add in flour 1/2 cup at a time, stirring as you go. The dough will be sticky. When it is too thick to stir, transfer to a lightly floured surface and knead for a minute or so until it forms a loose ball, adding more flour as you go and as it will absorb. Rinse your mixing bowl out, coat it with avocado oil or other neutral oil, and add your dough ball back in. Roll around to coat all sides. Cover with plastic wrap and set in a warm place to rise for about 1 hour, or until doubled in size."
    },
    {
      "@type": "HowToStep",
      "text": "While dough is rising, prepare sticky glaze by mixing butter and brown sugar and spreading it in an even layer on the bottom of an 8x8 baking dish (adjust if altering batch size). Top with pecans and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "On a lightly floured surface, roll out the dough into a thin rectangle. Brush with melted vegan butter and top with brown sugar (or granulated sugar) and cinnamon."
    },
    {
      "@type": "HowToStep",
      "text": "Starting at one end, tightly roll up the dough and situate seam side down. Then with a serrated knife or a string of floss, cut the dough into 1.5 - 2 inch sections and position in your 8x8 dish with the glaze layer on the bottom (you should have about 10 rolls as original recipe is written // adjust if altering batch size). Cover with plastic wrap and set on top of the oven to let it briefly rise again while you preheat oven to 350 degrees (176 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the oven is hot, bake rolls for 25-30 minutes or until slightly golden brown. Let cool for a few minutes, carefully invert, and then serve immediately."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/the-worlds-easiest-sticky-buns"
  ],
  "totalTime": "PT115M",
  "updatedAt": "2022-12-05T09:32:52.555Z"
}
