{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "58",
    "ratingValue": "4.68"
  },
  "author": {
    "@type": "Person",
    "name": "thekitchn.com"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-11-25T13:27:50.112Z",
  "datePublished": "2015-06-20T16:34:30+00:00",
  "description": "This awesomely thin and crispy pizza crust requires only a few ingredients and about 30 minutes to make. Better and FASTER than take out!",
  "image": {
    "@type": "ImageObject",
    "height": 480,
    "mime": "image/jpeg",
    "url": "https://www.budgetbytes.com/wp-content/uploads/2015/06/Thin-and-Crispy-Pizza-Crust-above-1.jpg",
    "width": 640
  },
  "keywords": "Easy Pizza Dough, Homemade Pizza, pizza crust",
  "name": "Thin and Crispy Pizza Crust",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "471.85 kcal",
    "carbohydrateContent": "98.05 g",
    "fatContent": "1.5 g",
    "fiberContent": "4.5 g",
    "proteinContent": "14.5 g",
    "servingSize": "1 Pizza",
    "sodiumContent": "1184.55 mg"
  },
  "prepTime": "PT15M",
  "recipeIngredient": [
    "3/4 cup warm water ($0.00)",
    "1/2 tsp sugar ($0.01)",
    "2 tsp active dry or instant yeast (or one 0.25oz. packet) ($0.19)",
    "2 cups all-purpose flour (plus more for dusting) ($0.34)",
    "1 tsp salt ($0.05)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Adjust the oven rack to its highest position. Preheat the oven to 500 degrees, or its highest setting."
    },
    {
      "@type": "HowToStep",
      "text": "Dissolve the sugar and yeast into the warm water and let it sit until foamy (about 5 minutes)."
    },
    {
      "@type": "HowToStep",
      "text": "While the yeast is soaking, combine 1 cup of the flour and the salt in a separate large bowl. Stir until the salt is evenly mixed into the flour."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the yeast water into the bowl of flour, then stir with a wooden spoon until fairly smooth. Stir in an additional 1/2 cup flour. Turn the dough out onto a floured surface and knead for 5 minutes, slowly adding up to 1/2 cup more flour as you go. Be sure to add the flour slowly as you knead to prevent it from becoming too dry and stiff."
    },
    {
      "@type": "HowToStep",
      "text": "Let the dough rest for 5 minutes. Divide it into two equal portions and form each piece into a ball. If you do not wish to make two pizzas immediately, the second ball of dough can be wrapped in plastic and stored in the refrigerator for up to two days, or frozen for up to 3 months."
    },
    {
      "@type": "HowToStep",
      "text": "Press the dough down into a flattened circular disk, then use a rolling pin to roll it out into a thin circle, about 12 inches in diameter and 1/8 inch thick."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare a pizza pan with either non-stick spray or a combination of spray and cornmeal, then carefully place the dough onto the pan. Spread a thin layer of your favorite sauce over the surface, then bake in the preheated oven for 5 minutes, or just until the edges develop a hint of color."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the crust from the oven, add the rest of your toppings, then bake for an additional 7-10 minutes, or until the cheese is bubbly and the crust is a medium golden brown."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://budgetbytes.com/thin-and-crispy-pizza-crust"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-11-25T13:27:50.110Z"
}
