{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "63",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-02T08:08:05.579Z",
  "datePublished": "2015-12-08T05:00:10+00:00",
  "description": "10-ingredient vegan pot pies infused with white wine and fresh thyme. Flaky pie crust covers a savory, vegetable-white bean filling. A hearty plant-based meal that&#39;s especially comforting in the winter months.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/11/White-Bean-Pot-Pies-SQUARE.jpg"
  ],
  "keywords": "pot pies",
  "name": "Thyme & White Bean Pot Pies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "456 kcal",
    "carbohydrateContent": "45.5 g",
    "fatContent": "24.2 g",
    "fiberContent": "5.5 g",
    "proteinContent": "10.4 g",
    "saturatedFatContent": "6.8 g",
    "servingSize": "1 pot pie",
    "sodiumContent": "804 mg",
    "sugarContent": "5.2 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "2 Tbsp olive oil",
    "1 large white or yellow onion, finely diced",
    "Salt + Pepper (to taste)",
    "1 pound carrots, peeled and finely chopped",
    "1/4 cup unbleached all-purpose flour",
    "1/2 cup dry white wine (optional // or sub more vegetable broth)",
    "3 cups vegetable broth (DIY or store-bought)",
    "2 tsp fresh thyme (chopped // or sub 1 tsp dried per 2 tsp fresh)",
    "1 (15-ounce) can white beans (rinsed and drained)",
    "1 1/2 cups unbleached all-purpose flour",
    "1/4 tsp sea salt",
    "10 Tbsp cold vegan butter (or sub room temperature coconut oil*)",
    "4-7 Tbsp cold water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C) and arrange 6 ramekins on a baking sheet (amount as original recipe is written // adjust if altering default number of servings). Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large pot over medium heat. Once hot, add oil and onion. Season with a pinch each salt and pepper and stir. Sauté until soft and translucent - 4-5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add carrots and season with a pinch more salt and pepper. Cook 2-3 minutes, then add flour and stir well to thoroughly coat."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for 1 minute, then slowly add white wine (optional) followed by vegetable broth, whisking to prevent clumps."
    },
    {
      "@type": "HowToStep",
      "text": "Add thyme and white beans and bring the mixture to a simmer. Then lower heat to low and simmer for a few minutes. Cover and remove from heat while preparing crust."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare pie crust, add flour and salt to a mixing bowl and whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Next add vegan butter (or coconut oil) and use a pastry cutter (or fork) to cut the two together, until it resembles wet sand - about 30-45 seconds."
    },
    {
      "@type": "HowToStep",
      "text": "Add ice cold water 1 Tbsp at a time and use a wooden spoon to gently mix. Add only as much water as needed to help it come together and form a dough - about 4-6 Tbsp (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Use your hands to gently knead/form the dough in the bowl and gather any loose scraps. Then transfer directly to a well-floured surface and form into a disc with your hands."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly flour the top of the dough, as well as a rolling pin, and gently roll out until about 1/8-inch thick. Add more flour as needed to prevent sticking."
    },
    {
      "@type": "HowToStep",
      "text": "Use a pizza cutter or knife to cut into 6 large squares slightly larger than the size of your ramekins (amount as original recipe is written // adjust if altering default number of servings)."
    },
    {
      "@type": "HowToStep",
      "text": "At this time, scoop the white bean filling into the ramekins until almost entirely full (reserve any leftovers to enjoy as soup or future pot pies)."
    },
    {
      "@type": "HowToStep",
      "text": "Use a lightly floured spatula to scoop each pie crust square onto a ramekin. Repeat until all ramekins are covered. Use a knife or toothpick to create small holes in the top of the pie crust to allow steam to escape."
    },
    {
      "@type": "HowToStep",
      "text": "Bake pot pies for 35-40 minutes, or until the filling is bubbly and the pie crust is golden brown. Let cool 10 minutes before serving."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers covered in the refrigerator for 3-4 days, or in the freezer up to 1 month. Reheat in a 350 degree F (176 C) oven until completely warmed through."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/thyme-white-bean-pot-pies"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-12-02T08:08:05.571Z"
}
