{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "40",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-01T23:32:43.876Z",
  "datePublished": "2016-01-23T05:00:46+00:00",
  "description": "Fluffy, 10-ingredient toasted coconut vegan pancakes made with spelt flour, natural sweeteners, and toasted shredded coconut. So delicious you'll think you're dreaming, plus, just 30 minutes required.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/12/Toasted-Coconut-Pancakes-SQUARE.jpg"
  ],
  "keywords": "coconut pancakes",
  "name": "Toasted Coconut Pancakes",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "171 kcal",
    "carbohydrateContent": "15.2 g",
    "fatContent": "11.4 g",
    "fiberContent": "2.7 g",
    "proteinContent": "1.8 g",
    "saturatedFatContent": "8.9 g",
    "servingSize": "1 pancakes",
    "sodiumContent": "44 mg",
    "sugarContent": "8.4 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "3/4 cup shredded unsweetened coconut (plus more for cooking)",
    "2 Tbsp coconut sugar (plus more for cooking)",
    "1/2 heaping cup shredded coconut + coconut sugar mixture (see above)",
    "1 1/2 tsp baking powder",
    "1 pinch sea salt",
    "1 cup spelt flour",
    "2 Tbsp rolled oats or oat flour",
    "1 Tbsp flaxseed meal (to make flax egg)",
    "2 1/2 Tbsp water (to make flax egg)",
    "2 Tbsp melted coconut oil (plus more for cooking)",
    "1 Tbsp maple syrup or agave nectar",
    "1 heaping cup coconut milk beverage (in the carton, not canned // or sub almond milk)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 F (176 C), and arrange shredded coconut on a baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare flax egg in small mixing bowl by mixing flaxseed meal and water and let rest for 5 minutes. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the oven is preheated, add the coconut and bake for 3-5 minutes, stirring once to ensure even baking, until just slightly toasted (see photo), being careful not to burn."
    },
    {
      "@type": "HowToStep",
      "text": "Add toasted coconut to a food processor or blender with coconut sugar. Blend to combine. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a large mixing bowl, add heaping 1/2 cup (amount as original recipe is written // adjust if altering batch size) of your coconut mixture (from above | should be almost all of it), baking powder, sea salt, spelt flour, oats or oat flour. Whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "To the flax egg, add coconut oil, maple syrup, and coconut milk. Whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Add wet ingredients to dry and stir until just combined, being careful not to over-mix. If the batter looks too thick, thin with a little more coconut milk. It should be semi-thick but pourable. Taste and adjust sweetness as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Let batter rest 5 minutes while preheating an electric griddle or skillet to medium heat (or about 325 degrees F). The surface should be hot, but not screaming hot – oil shouldn’t smoke when it makes contact with the surface."
    },
    {
      "@type": "HowToStep",
      "text": "Generously grease griddle with coconut oil and pour 1/4 cup measurements of batter onto griddle and gently spread into a small disc. Sprinkle on a little untoasted coconut and coconut sugar."
    },
    {
      "@type": "HowToStep",
      "text": "Flip when bubbles appear in the middle and the edges appear slightly dry - about 3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for 2-3 minutes more, or until fully cooked through in the middle."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, top with vegan butter and a drizzle of maple syrup or agave nectar, or toasted coconut."
    },
    {
      "@type": "HowToStep",
      "text": "Leftovers will reheat well in the microwave or in a 350 degrees F (176 C) oven. Otherwise, freeze cooked pancakes in single layer on a baking sheet. Once frozen, transfer to a freezer-safe container or plastic bag for up to 2 weeks. Reheat in toaster, oven, or microwave."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/toasted-coconut-pancakes"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T23:32:43.875Z"
}
