{
  "@type": "Recipe",
  "cookTime": "PT15M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-10-27",
  "description": "Wondering how to make sushi? This simple and delicious sushi recipe features tuna, avocado and refreshing cucumber. A perfect starter or meal on the go.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2101-tuna-and-avocado-sushi:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Sushi,Fakeaway,Fish,Rice,Video,Avocado",
  "name": "Tuna & Avocado Sushi Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Mains",
  "recipeCuisine": "Japanese",
  "recipeId": "10996",
  "recipeIngredient": [
    "2.5 cups sushi rice",
    "0.5 cup rice wine vinegar",
    "0.25 cup caster sugar",
    "0.5 tsp salt",
    "425g tuna in olive oil, drained, flaked",
    "0.25 cup Kewpie mayonnaise",
    "6 nori sheets",
    "1 avocado, halved, destoned, peeled, thinly sliced",
    "1 Lebanese cucumber, cut into 1cm-thick batons",
    "soy sauce, wasabi paste and pickled ginger (to serve)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Rinse rice in a sieve under cold running water, to remove any excess starch, until water runs clear. Place rice and 3 3/4 cups cold water in a large saucepan. Cover pan and place over high heat. Bring to the boil. Reduce heat to low and cook, covered, for 12 minutes or until water has been absorbed. Remove pan from heat. Set aside, covered, for 10 minutes to cool slightly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, place vinegar, sugar and salt in a small bowl, then stir until sugar has dissolved. Combine tuna and mayonnaise in a separate small bowl."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Transfer rice to a large glass heatproof bowl. Using a rice paddle or spatula, break up any rice lumps while gradually adding vinegar mixture, folding gently to combine."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place a sushi mat on a clean surface with slats running horizontally. Place 1 nori sheet, shiny-side down, on mat. With damp hands, spread one-sixth of the rice over nori sheet, leaving a 2cm-wide border along edge furthest from you."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place one-sixth of each of the tuna mixture, avocado and cucumber along centre of rice. Hold filling in place while rolling mat over to tightly enclose rice and filling. Repeat with remaining nori, rice, tuna mixture, avocado and cucumber."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Using a sharp knife, slice sushi into 2cm-thick slices. Serve with soy sauce, wasabi and pickled ginger."
    }
  ],
  "recipeNameId": "tuna-and-avocado-sushi",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/tuna-and-avocado-sushi"
  ],
  "totalTime": "PT55M",
  "updatedAt": "2022-11-24T16:49:08.043Z",
  "url": "https://www.woolworths.com.au/shop/recipes/tuna-and-avocado-sushi"
}
