{
  "@type": "Recipe",
  "cookTime": "PT210M",
  "createdAt": "2022-11-29T17:49:48.492Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Turkey with Caramelised Onion Stuffing recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": [
    "https://foodhub.scene7.com/is/image/woolworthsltdprod/0912_turkeywithcaramelisedonionstuffing:Square-1300x1300"
  ],
  "keywords": "Roast turkey,Turkey,Roast,Stuffing",
  "name": "Turkey with Caramelised Onion Stuffing Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Mains",
  "recipeCuisine": "North American",
  "recipeId": "1291",
  "recipeIngredient": [
    "60g butter",
    "cooking twine",
    "4 brown onions",
    "bamboo skewers",
    "1 tbs mixed herbs",
    "2 tsp salt",
    "2 tsp pepper (for seasoning)",
    "1 tbs olive oil",
    "1 egg",
    "1 tbs brown sugar",
    "5 cup gluten free breadcrumbs"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Heat butter and oil in a non-stick frying pan over medium-low heat. Add diced onions and cook, stirring occasionally, for 20-25 minutes or until onion is a rich caramel colour. Add sugar and stir until well combined. Transfer to a bowl. Cool."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 180°C. Check position of shelves and calculate cooking time according to packet instructions and turkey weight."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place a wire rack in a roasting pan. Add water to pan. Rinse turkey cavity and pat dry with paper towel."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add breadcrumbs, herbs, seasoning, and egg to onion and season with black pepper. Stir to combine."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Fill front and back cavities of turkey with stuffing. Use kitchen string to tie the legs together. Use skewers to secure the wings. Pull neck flap tightly underneath and secure with a skewer. Place on wire rack in pan. Brush with extra melted butter. Roast following packet instructions, allowing 45 minutes per kilogram. Baste every 30 minutes with butter and pan juices, until cooked through. Cover wing tips and drumsticks with foil if browning too quickly. Transfer to a chopping board, cover with foil. Stand for 10 minutes and remove skewers before carving. Note: You can use bought breadcrumbs to crumb foods, but if you have a food processor it's easy to make your own. Remove the crusts from day-old white bread slices and cut into cubes. Transfer the cubes to the bowl of a food processor and process until finely chopped."
    }
  ],
  "recipeNameId": "turkey-with-caramelised-onion-stuffing",
  "recipeYield": "10",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/turkey-with-caramelised-onion-stuffing"
  ],
  "totalTime": "PT240M",
  "updatedAt": "2022-11-29T17:49:48.491Z",
  "url": "https://www.woolworths.com.au/shop/recipes/turkey-with-caramelised-onion-stuffing"
}
