{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Licensed by Woolworths - ©️ Octopus Publishing Ltd"
  },
  "cookTime": "PT0M",
  "createdAt": "2022-11-24T22:03:11.000Z",
  "datePublished": "2022-09-26",
  "description": "Try our easy to follow Turkey & Cranberry Meatloaf recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/056_meatloaf_n:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Meatloaf",
  "name": "Turkey & Cranberry Meatloaf Recipe | Woolworths",
  "prepTime": "PT30M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "North American",
  "recipeId": "RGR3596",
  "recipeIngredient": [
    "1.5 tbs sunflower oil (save 1/2 tbs for greasing)",
    "200g bacon slices",
    "115g pack dried orange and cranberry stuffing mix",
    "25g dried cranberries",
    "1 onion, finely chopped",
    "500g skinless turkey breast steaks",
    "1 egg, beaten",
    "1 pinch salt",
    "1 pinch pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat the slow cooker if necessarys. Lightly oil a soufflé dish, 5 1/2 inches in diameter and 3 1/2 inches high, and baseline with nonstick parchment paper, checking first that the dish will fit in the slow cooker pot. Stretch each bacon slice with the flat of a large cook's knife, until half as long again, and use about three-quarters of the slices to line the base and sides of the dish, trimming to fit."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Put the stuffing mix in a bowl, add the cranberries, and mix with boiling water according to the package instructions. Heat the oil in a skillet, add the onion, and fry for 5 minutes, stirring, until softened. Set aside. Finely chop the turkey slices in a food processor or pass through a coarse mincer."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Mix the stuffing with the fried onion, chopped turkey, and egg. Season well with salt and pepper and spoon into the bacon-lined dish. Press flat and cover with the remaining bacon slices. Cover the top of the dish with foil and lower into the slow cooker pot. Pour boiling water into the pot to come halfway up the sides of the dish. Cover with the lid and cook on high for 5-6 hours or until the juices run clear when the center of the meatloaf is pierced with a knife."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Lift the dish out of the slow cooker pot using a dish towel and allow to cool. Transfer to the refrigerator to chill overnight until firm. Loosen the edge of the meatloaf with a knife, turn out onto a plate, and peel off the lining paper. Cut into thick slices and serve with salad and spoonfuls of cranberry sauce or Beet Chutney, if desired."
    }
  ],
  "recipeNameId": "turkey-and-cranberry-meatloaf",
  "recipeYield": "4",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/turkey-and-cranberry-meatloaf"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-24T15:07:54.500Z",
  "url": "https://www.woolworths.com.au/shop/recipes/turkey-and-cranberry-meatloaf"
}
