{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "39",
    "ratingValue": "4.54"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-04T17:19:06.236Z",
  "datePublished": "2015-09-15T05:00:31+00:00",
  "description": "Amazing, 30-minute chickpea fritters infused with fresh herbs, garlic, and turmeric! Healthy, simple, flavorful, and surprisingly hearty.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/08/SIMPLE-30-Minute-TURMERIC-Chickpea-Fritters-Little-falafel-like-pillows-of-bliss-and-SO-healthy-healthy-vegan-recipe-chickpea-turmeric-dinner.jpg"
  ],
  "keywords": "chickpea fritters",
  "name": "Turmeric Chickpea Fritters",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "76 kcal",
    "carbohydrateContent": "7.9 g",
    "fatContent": "4.2 g",
    "fiberContent": "0.6 g",
    "proteinContent": "2.2 g",
    "saturatedFatContent": "0.6 g",
    "servingSize": "1 fritters",
    "sodiumContent": "96 mg",
    "sugarContent": "1.8 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 Tbsp flaxseed meal (to make flax egg)",
    "2 1/2 Tbsp water (to make flax egg)",
    "1-2 Tbsp olive oil (divided // plus more for sautéing)",
    "4 cloves garlic, minced (4 cloves yield ~2 Tbsp or 12 g)",
    "1/2 cup panko bread crumbs (gluten-free for GF eaters)",
    "1/4 cup fresh parsley (finely chopped)",
    "3 Tbsp vegan parmesan cheese",
    "1 Tbsp hulled white sesame seeds or hemp seeds (optional)",
    "2 tsp coconut sugar",
    "1/2 tsp ground turmeric",
    "1 1/2 tsp ground cumin",
    "1 pinch sea salt and black pepper",
    "1/2 lemon, juiced (1/2 lemon yields ~1 Tbsp or 15 ml)",
    "1 15-ounce can chickpeas (drained, rinsed and thoroughly dried)",
    "2 Tbsp vegan parmesan cheese",
    "3 Tbsp panko bread crumbs (gluten-free for GF eaters)",
    "Pita or Lettuce Cups",
    "Onion (sliced)",
    "Tomato (sliced)",
    "Fresh parsley (chopped)",
    "Garlic Dill Sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees (190 C) and add flax egg to a food processor or high speed blender."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large metal or cast iron skillet over medium heat. Once hot, add lesser amount of olive oil (1 Tbsp or 15 ml as original recipe is written // adjust if altering batch size) and minced garlic. Sauté until slightly browned, stirring often - about 3 minutes. Remove from heat and cool slightly, then add to food processor or blender with flax egg."
    },
    {
      "@type": "HowToStep",
      "text": "Next add panko bread crumbs, parsley, vegan parmesan cheese, sesame seeds (optional), coconut sugar, turmeric, cumin, a pinch each salt + pepper, and 1 tsp olive oil (amount as original recipe is written // adjust if altering batch size), and lemon juice. Pulse/blend until small bits remain, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add rinsed/dried chickpeas and blend/pulse until a moldable “dough” is formed, scraping down sides as needed. You don’t want the chickpeas to turn into a paste, but you also don’t want any left whole."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed. I added a bit more vegan parmesan and salt. Add more panko bread crumbs if the mixture feels too wet. You want them to be very flavorful, so season liberally."
    },
    {
      "@type": "HowToStep",
      "text": "To make the coating, mix vegan parmesan cheese and panko bread crumbs in a shallow bowl. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Scoop out heaping 1 Tbsp amounts of dough (I used this 1.5 Tbsp scoop from Amazon) and form/roll into balls - about 15 total (amount as original recipe is written // adjust if altering batch size). They can be fragile, so handle gently."
    },
    {
      "@type": "HowToStep",
      "text": "Roll fritters in the vegan parmesan cheese-panko bread crumb mixture to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the same skillet you used earlier over medium heat. Once hot, add enough oil to form a thin layer on the bottom of the skillet, then add fritters. Depending on the size of your pan, you may need to cook them in two batches as to not crowd the pan. Add more oil as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Brown fritters for 4-5 minutes total, shaking the pan to roll them around and brown all sides. Turn down heat slightly if browning too quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Add sautéed fritters to a bare or foil-lined baking sheet and transfer to the preheated oven and bake for 12-15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "At this time, prepare any vegetables, sides and/or desired sauces, such as the Garlic Dill Sauce (link above)."
    },
    {
      "@type": "HowToStep",
      "text": "Once fritters are golden brown and fairly firm to the touch, remove from oven. Let cool a few minutes before serving. They will firm up the longer they cool."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, top pita or lettuce wraps with desired number of fritters (2-3), fresh tomato, onion, parsley, and sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Leftovers will keep in the refrigerator for 3-4 days, though best when fresh. Reheat in a 350-degree (176 C) F oven until warmed through, or in the microwave."
    },
    {
      "@type": "HowToStep",
      "text": "To freeze, sauté fritters as instructed, then transfer to a baking sheet and freeze until completely firm. Then transfer to a freezer-safe bag or airtight container and store in the freezer for up to 1 month. Reheat in a 375-degree F (190 C) oven until completely warmed through."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://minimalistbaker.com/turmeric-chickpea-fritters"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T17:19:06.235Z"
}
