{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": 1,
    "ratingValue": 5
  },
  "articleSection": "Recipes",
  "brand": {
    "@type": "Thing",
    "name": "The Kitchn"
  },
  "cookTime": "PT5400S",
  "createdAt": "2022-12-03T18:55:32.184Z",
  "creator": {
    "@type": "Person",
    "name": "Ivy Manning"
  },
  "dateCreated": "2022-03-15T07:30:00-04:00",
  "dateModified": "2022-03-15T07:09:40-04:00",
  "datePublished": "2022-03-15T07:30:00-04:00",
  "description": "When it comes to St. Patrick&#x27;s day classics, Ivy Manning&#x27;s twice-baked colcannon potatoes even outshine corned beef. ",
  "headline": "Twice-Baked Colcannon Potatoes",
  "HowtoTip": {
    "text": "Potatoes: Buy long, straight, plump potatoes for the easiest re-stuffing. Wash the potatoes well, scrubbing off any dirt on the skins as you’re meant to eat the skins in this recipe. Bacon twice-baked potatoes: Add 4 strips cooked and crumbled pepper bacon to the mashed potato mixture.Cabbage: You can substitute regular green cabbage for the savoy cabbage in a pinch. Vegan: For vegan potatoes, substitute vegan buttery spread for the butter, unsweetened oat milk for the dairy milk, and vegan cheese for the cheddar. Make ahead: Cool the filled but unbaked stuffed potatoes completely. Refrigerate in an airtight container for up to 4 days. Bake at 375ºF for 40 to 50 minutes. Storage: Leftovers can be refrigerated in an airtight container for up to 4 days."
  },
  "image": [
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_16:9/k%2FPhoto%2FSeries%2F2022-03-irish-potato-package%2FIrish-potatoes_Twice-Baked%20Colcannon%20Potatoes%2F2022-03-01_ATK5870"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FSeries%2F2022-03-irish-potato-package%2FIrish-potatoes_Twice-Baked%20Colcannon%20Potatoes%2F2022-03-01_ATK5870"
    },
    {
      "@type": "ImageObject",
      "url": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FSeries%2F2022-03-irish-potato-package%2FIrish-potatoes_Twice-Baked%20Colcannon%20Potatoes%2F2022-03-01_ATK5870"
    }
  ],
  "keywords": [
    "irish",
    "potatoes",
    "recipe",
    "St Patrick's Day",
    "european",
    "Root Vegetables",
    "vegetables",
    "dairy",
    "cheese",
    "spring",
    "Side Dish",
    "baking",
    "dinner",
    "team:food",
    "platform:social",
    "course:side dish",
    "cuisine:europe",
    "cuisine:irish",
    "timing:extended",
    "occasion:spring",
    "occasion:st. patrick's day",
    "mainingredients:vegetable",
    "mainingredients:potatoes",
    "mainingredients:dairy",
    "mainingredients:butter",
    "mainingredients:cheese",
    "method:baked",
    "meal:dinner"
  ],
  "name": "Twice-Baked Colcannon Potatoes",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "556 cal",
    "carbohydrateContent": "44.3 g",
    "cholesterolContent": "0 mg",
    "fatContent": "37.3 g",
    "fiberContent": "5.4 g",
    "proteinContent": "15.0 g",
    "saturatedFatContent": "21.6 g",
    "servingSize": "Serves 4",
    "sodiumContent": "830.7 mg",
    "sugarContent": "6.3 g",
    "unsaturatedFatContent": "0.0 g"
  },
  "prepTime": "PT1200S",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 46,
      "url": "https://www.thekitchn.com/static/logos/publisher-logo.png",
      "width": 180
    },
    "name": "Apartment Therapy, LLC."
  },
  "recipeCategory": "Dinner",
  "recipeCuisine": "Europe",
  "recipeIngredient": [
    "4 large russet potatoes (8 to 10 ounces each)",
    "2 teaspoons olive oil",
    "1 1/4 teaspoons kosher salt, divided, plus more as needed",
    "1/2 small savoy cabbage (about 12 ounces)",
    "4 medium scallions",
    "4 ounces sharp cheddar cheese, shredded (about 1 cup)",
    "8 tablespoons (1 stick) unsalted butter, divided",
    "1 cup milk",
    "1 teaspoon dried mustard powder",
    "1 bay leaf",
    "Freshly ground black pepper"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Arrange a rack in the middle of the oven and heat the oven to 400oF. Line a rimmed baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Prick 4 large russet potatoes all over with a fork. Rub the potatoes with 2 teaspoons olive oil and then season with 1 teaspoon kosher salt. Place directly on the oven rack (place a baking sheet on a lower rack if desired to catch any drippings). Bake, flipping halfway through, until cooked through and they squish easily when gently squeezed with an oven mitt, 50 to 60 minutes total. Meanwhile, prepare the filling ingredients."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the core from 1/2 small savoy cabbage, then finely chop the leaves (3 cups). Thinly slice 4 medium scallions, keeping the white and light green parts separate from the dark green parts. Grate 4 ounces sharp cheddar cheese on the large holes of a box grater if needed (about 1 cup)."
    },
    {
      "@type": "HowToStep",
      "text": "Cut 4 tablespoons of the unsalted butter into 4 pieces and place in the freezer. Place 2 tablespoons unsalted butter in a medium frying pan, and let the remaining 2 tablespoons unsalted butter sit at room temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Melt the butter in the frying pan over medium heat. Add the cabbage, white and light green parts of the scallions, and 1/4 teaspoon of the kosher salt. Cook, stirring frequently, until the cabbage begins to brown and wilt, 5 to 6 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the dark green scallion parts, 1 cup milk, 1 teaspoon dried mustard powder, and 1 bay leaf. Bring to a simmer. Cover, reduce the heat to low, and cook until the cabbage is fall-apart tender, 20 to 25 minutes (the liquid may look curdled). Remove the pan from the heat and let sit covered to keep warm."
    },
    {
      "@type": "HowToStep",
      "text": "When the potatoes are ready, wear oven mitts to protect your hands or using tongs to hold them, cut off the top quarter of the potatoes with a serrated knife. Scrape out the potato flesh from the tops with a spoon into a medium bowl; set the tops aside. Scoop out the flesh from the bottom portion of the potatoes into the same bowl, leaving a 1/4-inch-thick shell around the bottom and sides. Place the potato shells and tops on the baking sheet skin-side down and put in the oven while finishing the filling."
    },
    {
      "@type": "HowToStep",
      "text": "Pass the potato flesh through a potato ricer or food mill into a large bowl. (Alternatively, mash very well with a potato masher.) Add the 2 tablespoons room temperature unsalted butter and stir to combine. Using a slotted spoon, transfer the cabbage and scallions to the bowl of potatoes and discard the bay leaf. Stir to combine, gradually stirring in enough milk from the saucepan until you have a silky-smooth mash (you may not need all of the milk)."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cheese and stir to combine. Taste and season with kosher salt and black pepper as needed. Remove the potato shells from the oven. Spoon the potato mixture into them, packing it in and mounding it high. (If you have extra filling, mound it into the potato skin tops.) Plunge 1 tablespoon of the frozen butter into the center of each stuffed potato, leaving the top of the butter exposed. Run the tines of a fork lengthwise through the tops of the potato filling to add rough edges."
    },
    {
      "@type": "HowToStep",
      "text": "Bake (switching the oven to convection, if available) until the edges are browned and the filling is hot, 20 to 30 minutes."
    }
  ],
  "recipeYield": 4,
  "sameAs": [
    "https://thekitchn.com/twice-baked-colcannon-potatoes-23296369"
  ],
  "thumbnailUrl": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FSeries%2F2022-03-irish-potato-package%2FIrish-potatoes_Twice-Baked%20Colcannon%20Potatoes%2F2022-03-01_ATK5870",
  "totalTime": "PT6600S",
  "updatedAt": "2022-12-03T18:55:32.183Z",
  "url": "https://www.thekitchn.com/twice-baked-colcannon-potatoes-23296369"
}
