{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "36",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T00:07:11.080Z",
  "datePublished": "2013-02-12T06:00:22+00:00",
  "description": "Flaky vegan Pop Tarts with a berry filling, raw sugar topping, and an optional vanilla glaze. 100% vegan and healthy enough for an indulgent weekend or weekday breakfast.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2013/02/Vegan-Berry-Pop-Tarts-Minimalist-Baker-google.jpeg"
  ],
  "keywords": "vegan pop tarts",
  "name": "Vegan Berry Pop Tarts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "335 kcal",
    "carbohydrateContent": "35 g",
    "fatContent": "18 g",
    "fiberContent": "1.5 g",
    "proteinContent": "4.5 g",
    "saturatedFatContent": "5 g",
    "servingSize": "1 tarts",
    "sodiumContent": "298 mg",
    "sugarContent": "3.5 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "2 cups flour* (I used half whole-wheat pastry, half unbleached all-purpose)",
    "1 pinch salt",
    "2/3 cup cold vegan butter (I used Earth Balance)",
    "2-4 Tbsp ice cold water",
    "1 heaping cup frozen mixed berries",
    "1 Tbsp raw sugar for topping (optional // plus more for sweetening compote filling)",
    "Vanilla glaze"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and line a baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the compote by placing berries in a small saucepan over medium heat. Cook for 5-8 minutes with a lid on, stirring occasionally and smashing down with a spoon. Add a few teaspoons of sugar to sweeten if desired. I added 1 tsp. raw sugar (amount as original recipe is written). Transfer to a bowl to cool."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare crust, mix flour and salt in a large bowl, then cut in butter with a fork or pastry cutter until well combined."
    },
    {
      "@type": "HowToStep",
      "text": "Using a tablespoon, drizzle cold water over the mixture and mix with a wooden spoon until it starts to form a dough. I added 2-3 Tbsp - you may need to add up to 5 Tbsp (as original recipe is written // adjust if altering batch size). It should be moist enough to form into a ball, but not too sticky to knead. Add more flour if it gets too wet."
    },
    {
      "@type": "HowToStep",
      "text": "Turn onto a floured surface, shape into a disc, and then use a rolling pin to roll into a large rectangle. I find it helpful to place a sheet of plastic wrap over the dough while rolling to reduce cracking."
    },
    {
      "@type": "HowToStep",
      "text": "Cut into 12 equal squares (not rectangles) and carefully transfer each to the baking sheet (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Place about 1 Tbsp of filling onto half of the squares (6 as original recipe is written), leaving a 1/4 inch border to seal the edges. Then use your finger to dot water around the edges so the two squares stick together. Top the squares with their matching halves and then seal lightly with a fork."
    },
    {
      "@type": "HowToStep",
      "text": "Poke a few holes in the top of each, rub a tiny bit of vegan butter on top of each, sprinkle with raw sugar, and bake for 20-25 minutes or until golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Let cool for a few minutes. Then top with glaze if desired. Not necessary, but recommended for sweeter Pop-Tarts."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/vegan-berry-pop-tarts"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-03T00:07:11.079Z"
}
