{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "20",
    "ratingValue": "4.91"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT62M",
  "createdAt": "2022-12-03T22:33:00.974Z",
  "datePublished": "2019-11-09T04:10:09+00:00",
  "description": "You have to try My Creamy Vegan Scalloped Potatoes Recipe! No Dairy, No Nuts, No nutritional Yeast! in this Potato Gratin. Can be gluten-free, soy-free, Oil-free . Makes a 8 in pan",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2019/11/vegan-scalloped-potatoes-veganricha-8655.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/11/vegan-scalloped-potatoes-veganricha-8655-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/11/vegan-scalloped-potatoes-veganricha-8655-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/11/vegan-scalloped-potatoes-veganricha-8655-480x270.jpg"
  ],
  "keywords": "scalloped potatoes, vegan potato gratin, vegan potatoes au gratin, vegan scalloped potatoes no nutritional yeast",
  "name": "Vegan Scalloped Potatoes without Nutritional Yeast",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "128.85 kcal",
    "carbohydrateContent": "20.41 g",
    "fatContent": "3.81 g",
    "fiberContent": "3.52 g",
    "proteinContent": "4.4 g",
    "saturatedFatContent": "0.34 g",
    "servingSize": "1 serving",
    "sodiumContent": "382.2 mg",
    "sugarContent": "0.66 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Side",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2-3 tsp olive oil (see note for oil-free)",
    "1/4 cup finely chopped onion",
    "3 cloves of garlic (, finely chopped,)",
    "3 tbsp flour (all purpose), See note for gluten-free)",
    "1/2 to 3/4 tsp salt",
    "1/2 tsp freshly ground black pepper (,divided)",
    "1/4 tsp onion powder",
    "zest of 1/4 or 1/2 a lemon (depends on size of lemon and your preference of flavor)",
    "1 tsp dried herbs (I use rosemary and thyme)",
    "1/2 tsp miso (use chickpea miso for soyfree), optional)",
    "1 tsp stoneground mustard (or 1/2 tsp ground mustard)",
    "2 cups non dairy milk at room temp",
    "2 large or 3 medium yukon gold potaoes"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat a saucepan over medium heat. Add oil and let it heat up a bit. Add onion and garlic and cook for 2 mins. Add the flour and herbs, 1/4 tsp black pepper and salt and mix in. Cook for half a minute, add in the lemon zest, miso and mustard and mix in and cook for another few seconds."
    },
    {
      "@type": "HowToStep",
      "text": "Add in half cup of the milk and mix in, add in the another half cup and mix in so that there are no lumps. Add in the rest of the non dairy milk and mix in and bring to a boil. Cook for 3 mins then take off heat. Carefully taste and adjust salt and flavor. This Bechamel sauce will be not be very thick but will continue to thicken as it cools."
    },
    {
      "@type": "HowToStep",
      "text": "Peel and slice the potatoes into an 1/8th inch thick slices. I do this while or after cooking the cream sauce, so the potatoes don't brown. (If slicing before hand, then store in a bowl of cold water until ready to bake. Then drain, lightly pat with a paper towel and move to the next step.)"
    },
    {
      "@type": "HowToStep",
      "text": "Grease a baking dish or cast iron pan and arrange the slices in an overlapping fashion. You can also place a layer of non-overlapping potatoes, then place over this layer and repeat until finished. You want less than 3 layers for even cooking and crispy topping."
    },
    {
      "@type": "HowToStep",
      "text": "Pour all of the sauce over the potatoes. It will look like a lot."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 1 hour at 350 deg F (176 C). Check in the center with a toothpick, there should not be any resistance. Continue to bake longer if needed. Broil for a minute to brown the top if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Garnish with the remaining black pepper and some fresh herbs such as chives. If you are like me you would also sprinkle some red pepper flakes and maldon sea salt and serve."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/vegan-scalloped-potatoes"
  ],
  "totalTime": "PT72M",
  "updatedAt": "2022-12-03T22:33:00.972Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=tJ_kAUs2jBw&",
    "description": "Creamy Vegan Scalloped Potatoes Recipe! No Dairy, No Nuts, No nutritional Yeast! in this Potato Gratin. Can be gluten-free and Soy-free. Oil-free option \nFULL RECIPE: https://www.veganricha.com/2019/11/vegan-scalloped-potatoes.html\n\nLets make these Classic Scalloped Potatoes to add to the Thanksgiving menu!\n\nThese Scalloped potatoes are Easy, use just a few ingredients, don’t need nutritional yeast for the cheesyness, have no nuts and are creamy, cheesy and all things delicious. Use herbs of choice for variation. Use a combination of veggies such as cauliflower with the potato. Top with a breadcrumb topping. Many options! Oil-free option on the post. \n\n#veganricha #easyveganrecipes #veganscallopedpotatoes #veganthanksgiving\nMusic by Epidemic sound",
    "duration": "PT1M12S",
    "embedUrl": "https://www.youtube.com/embed/tJ_kAUs2jBw?feature=oembed",
    "name": "VEGAN SCALLOPED POTATOES No Nuts, No Nutritional Yeast! | Vegan Richa Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/tJ_kAUs2jBw/hqdefault.jpg",
    "uploadDate": "2019-11-26T17:30:04+00:00"
  }
}
