{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T16:55:15.739Z",
  "datePublished": "2015-05-01T10:05:31+00:00",
  "description": "Vegan Tinga Bowl with Hearts of palm, Vegan tinga de pollo, mexican spiced chickpeas, spanish brown rice, corn, salsa and vegan sour cream. Gluten-free soy-free recipe. Can be made nut-free.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2015/05/vegan-tinga-hearts-of-palm-bowl-8230-300x451.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/05/vegan-tinga-hearts-of-palm-bowl-8230-300x451-300x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/05/vegan-tinga-hearts-of-palm-bowl-8230-300x451-300x270.jpg"
  ],
  "name": "Vegan Tinga bowl with Hearts of Palm, Chickpeas, Spanish Rice",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "883 kcal",
    "carbohydrateContent": "158 g",
    "fatContent": "14 g",
    "fiberContent": "29 g",
    "proteinContent": "35 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "677 mg",
    "sugarContent": "41 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Bowl",
  "recipeCuisine": "Mexican",
  "recipeIngredient": [
    "1 tsp oil",
    "1/2 medium white onion",
    "5 cloves of garlic (divded, 1 clove chopped)",
    "2 ripe tomatoes",
    "2 chipotle chili peppers in adobo sauce",
    "1/4 tsp oregano",
    "1/4 tsp thyme",
    "1/2 tsp ancho chili powder (optional, use paprika instead)",
    "1/3 tsp salt or to taste",
    "14 oz can of hearts of palm (drained, washed and chopped or shredded)",
    "15 oz can chickpeas",
    "1/2 tsp ancho chile or chipotle chili powder",
    "1/2 tsp cumin powder",
    "2 tbsp tinga sauce",
    "1 recipe Spanish rice (I made the recipe with brown rice for this bowl salsa corn, cilantro, spinach or lettuce)",
    "salsa (corn, cilantro, spinach or lettuce)",
    "vegan sour cream (or cashew sour cream, or or nacho cheese sauce or guacamole)",
    "salt (pepper, lemon juice as needed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the tinga sauce: Heat oil in a skillet over medium heat. Add onions and 1 clove of garlic and a pinch of salt. Mix and cook until translucent. About 5 minutes. Stir occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "Blend the tomato, chipotle chili pepper, rest of the garlic, oregano, thyme, ancho chili powder and blend until well pureed. Add the blend to the skillet and cook for 4 to 5 minutes or until it thickens and the garlic smells cooked. Reserve 2 tbsp of the sauce for the chickpeas."
    },
    {
      "@type": "HowToStep",
      "text": "Add shredded hearts of palm, salt and 1/4 cup water to the skillet, mix, cover and cook for 6 to 7 minutes, Stir once in between. Taste and adjust salt and spice."
    },
    {
      "@type": "HowToStep",
      "text": "Make the chickpeas. Add oil to a skillet over medium heat. Add drained chickpeas and toss. Add salt, spices and toss well to coat. Add the 2 tbsp tinga sauce, mix, cover and cook for 4 to 5 minutes until the chickpeas soften and sauce dries out and sticks to the chickpeas. Taste and just salt and spice. Add a dash of lemon juice, toss and add to the serving bowl. Or use re-fried beans instead."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the spanish rice or plain brown rice. Prepare salsa and corn. Toast the corn on a skillet if needed and toss with salt and pepper. (optional)"
    },
    {
      "@type": "HowToStep",
      "text": "Layer the bowl as you like with greens/lettuce, tinga hearts of palm, spiced chickpeas, rice, salsa and corn. Dress with vegan sour cream or guacamole. Serve!"
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://veganricha.com/2015/05/vegan-tinga-bowl-with-hearts-of-palm-chickpeas.html"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-03T16:55:15.738Z"
}
