{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "12",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T21:21:37.449Z",
  "datePublished": "2018-03-29T23:01:08+00:00",
  "description": "Indulge yourself this Easter, with these fruit flecked, fragrant &amp; lightly sweetened Vegan Hot Cross Buns. Perfect warm from the oven, or gently toasted!&nbsp;",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2021/03/Hot-Cross-Buns-2.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/03/Hot-Cross-Buns-2-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/03/Hot-Cross-Buns-2-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/03/Hot-Cross-Buns-2-480x270.jpg"
  ],
  "keywords": "dairy-free hot cross buns, dairy-free hot cross buns recipe, hot cross buns recipe, vegan hot cross buns, vegan hot cross buns recipes",
  "name": "Vegan Hot Cross Buns",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "317 kcal",
    "carbohydrateContent": "62 g",
    "fatContent": "5.3 g",
    "fiberContent": "3 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "1.4 g",
    "servingSize": "1 bun (of 10)",
    "sodiumContent": "525 mg",
    "sugarContent": "20 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "500g / 4 cups all purpose flour or bread flour (, in the UK use strong flour)",
    "1 tablespoon instant or quick yeast (, sometimes labelled fast yeast)",
    "2 teaspoons salt (, finely ground, not crystals)",
    "2 teaspoons ground cinnamon",
    "1/2 teaspoon ground nutmeg",
    "70g / 1/3 cup sugar",
    "4 tablespoons vegan butter (or coconut oil, melted and room temperature. It must NOT be hot. )",
    "1 large orange (, zest and juice)",
    "120mls / 1/2 cup water (, room temperature is fine)",
    "165mls / 1/2 cup & 3 tablespoons milk of choice",
    "100g / 2/3 cup golden raisins",
    "100g / 2/3 cup dried cranberries",
    "60g ⁄ 1/2 cup all purpose flour",
    "enough water to make a thick pipe-able paste",
    "2 tablespoons sugar",
    "2 tablespoons boiling water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put the flour, yeast, salt, cinnamon, nutmeg, sugar and zest into the bowl of a stand mixer and stir to combine them all."
    },
    {
      "@type": "HowToStep",
      "text": "Squeeze the juice of the orange into the measured water and add that along with the milk and butter."
    },
    {
      "@type": "HowToStep",
      "text": "With the dough hook in place, turn on the stand mixer. I use speed 2 with mine. Knead for around 8 minutes in the stand mixer, or about 15 minutes by hand. The dough needs to be completely smooth and elastic. You will notice when you start that if you stretch the dough it will tear. By the time you have finished it should stretch really easily with no tearing.3-4 minutes into kneading, turn the mixer off and give the dough a poke with your finger. It should be tacky but not overly sticky. If it's too sticky add another couple tablespoons of flour, if it's dry, add a tablespoon or two of water. Don't overdo it with adding more flour though. The drier the dough, the dryer the finished buns will be."
    },
    {
      "@type": "HowToStep",
      "text": "Once it’s smooth, add the dried fruit and carry on kneading for a minute or two until it’s incorporated."
    },
    {
      "@type": "HowToStep",
      "text": "Grease a bowl with a drop of oil or some oil spray, and put the dough in it, move it all around on all sides to coat the dough ball in the oil. This stops a skin forming on the dough and means it will rise better. I tend to use the bowl I mixed the dough in to save dirtying another. I just scoop the dough out and hold it in one hand, then pour a little oil into the bowl with the other then put the dough back. Cover with a damp, clean dish towel (just run it under the tap for a few second then wring it out) and leave on the kitchen counter until doubled. The time this takes will vary depending on how warm your kitchen is but bear in mind that the longer it takes to rise, the more flavour there will be so unless you are in a hurry, don’t rush it by cranking up the heating or putting it somewhere very warm. Mine generally takes between 60 - 90 minutes to double and my kitchen is usually between 17-18°C."
    },
    {
      "@type": "HowToStep",
      "text": "Once the dough has doubled scrape it gently onto a clean, lightly floured work surface. Be careful not to tear it as you do this. Shape it loosely into a round, then cut it into 10 even pieces with a sharp knife or dough cutter. Roll into balls. See my video above to watch how I do it. Basically I place my hands on either side of the ball and gently turn the ball of dough while pulling down from the top, stretching it slightly to make the surface taut and gathering it at the bottom. Don't worry too much though. The rustic look is good! Place each finished ball on a baking sheet with about an inch clear around them then cover with the damp dish towel again and leave on the kitchen counter again for 30 minutes. Preheat the oven to 400°F"
    },
    {
      "@type": "HowToStep",
      "text": "Mix the flour and water together into a thick pipe-able paste and put it in a piping bag or piping syringe. Once the buns have had 30 minutes to rest, uncover them and pipe crosses on the top. It's easier if you have lined your buns up well on the baking sheet and can just pipe in one smooth line all the way along."
    },
    {
      "@type": "HowToStep",
      "text": "Once piped place in the pre-heated oven and bake for about 20 minutes, maybe another minute or two. They should be just starting to turn a little golden and if you top on the bottom of one of them it should sound hollow."
    },
    {
      "@type": "HowToStep",
      "text": "While in the oven make the sugar glaze by combining the sugar with the boiling water and stirring until the sugar dissolves."
    },
    {
      "@type": "HowToStep",
      "text": "Once cooked, remove the buns from the oven and immediately brush with the sugar glaze then place on a cooling rack to cool."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://avirtualvegan.com/hot-cross-buns"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T21:21:37.448Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/36QXlZY8.mp4",
    "description": "Indulge yourself this Easter, with these fruit flecked, fragrant & lightly sweetened Hot Cross Buns. Perfect warm from the oven, or gently toasted!",
    "name": "Hot Cross Buns",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/36QXlZY8-720.jpg",
    "uploadDate": "2018-03-30T00:00:00.000Z"
  }
}
