{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-04T11:38:00.703Z",
  "datePublished": "2011-10-26T02:06:00+00:00",
  "description": "Kaju Katli is Cashew Fudge. It is a favorite Indian dessert. There are several ways to make the fudge, but the key to a great fudge is a good sugar syrup and well ground cashews. This recipe takes just minutes! Vegan Gluten-free Soy-free Recipe. Makes a dozen or more pieces depending on the size.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2011/10/katli-2B001-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/10/katli-2B001-1-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/10/katli-2B001-1-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2011/10/katli-2B001-1-480x270.jpg"
  ],
  "keywords": "traditional indian sweet, vegan fudge",
  "name": "Vegan Kaju Katli - Indian Cashew fudge. Glutenfree",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "307 kcal",
    "carbohydrateContent": "30 g",
    "fatContent": "18 g",
    "fiberContent": "1 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 serving",
    "sodiumContent": "6 mg",
    "sugarContent": "19 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "2 cups raw cashews",
    "1 tablespoon cornstarch or other starch (, optional)",
    "1/3 cup water",
    "1/2 cup ground raw sugar",
    "Flavor options: 1/4 teaspoon cardamom powder (6 strands of saffron, or a few drops of kewra or rose essence)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Grind the cashews to a powder in a dry grinder and keep aside. If using a blender, add cornstarch and then blend. Move the buttery cashew powder from the sides of the blender in between to help with even blending. Transfer the mixture to a bowl to break any lumps. Depending on the blender, you might have some pieces of cashews that don’t break down, remove those so you have mostly a meal/powder remaining. I usually use my hands or a spoon to press and mix the cashew mixture to break the buttery lumps and find any pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Make the sugar syrup: In a saucepan over medium heat, combine water and sugar and mix well. Bring to a boil, about 3 minutes. Continue to cook over medium heat, until the syrup is a just about single thread consistency (close to 230°F / 110oc), 3 to 4 minutes. (See note below for how to check single thread consistency.) Stir a few times in between. The syrup will get bubbly while it thickens. Add cardamom or other flavors and mix in."
    },
    {
      "@type": "HowToStep",
      "text": "Reduce heat to low, then add half of the ground cashews. Mix in well. Keep adding the cashew mixture, a few tablespoons at a time, until the mixture gets thick and adds resistance to the movement of the spatula. Mix well each time by dragging and mixing. The mixture will be somewhere between a thick batter and a soft dough. You will use up anywhere from 1 1/2 cups to the entire 2 cups cashews. Cook for another minute or 2 if the mixture is very soft. I like to add a 1/2 teaspoon vegan butter at this point just for a bit of additional flavor(optional). (See notes for troubleshooting)"
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the hot mixture to parchment or a greased flat plate or pan. Carefully pat it down or shape using a spatula or another parchment on top. Flatten to a 1/4 inch thick somewhat rectangle. If the mixture is too sticky or hot, let it cool for a minute before patting it down. You can knead the mixture a bit at this point to make it smoother, before shaping into a rectangle."
    },
    {
      "@type": "HowToStep",
      "text": "Using a knife or pizza cutter, cut the rectangle into a grid. Let cool completely (chill for 15 mins) before separating into pieces and storing. Store in an airtight container for a few days on the counter or several weeks refrigerated."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/kaju-katli-indian-cashew-fudge-vegan"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-04T11:38:00.702Z"
}
