{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T04:39:05.481Z",
  "datePublished": "2021-12-18T08:06:04+00:00",
  "description": "This Vegan Glutenfree Chocolate Cake with vegan chocolate ganache is super moist, rich and packed with flavor. The best vegan layer cake for all your upcoming celebrations. ",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2021/11/Gluten-Free-Chocolate-Cake-2.0-8814.jpg",
    "https://www.veganricha.com/wp-content/uploads/2021/11/Gluten-Free-Chocolate-Cake-2.0-8814-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2021/11/Gluten-Free-Chocolate-Cake-2.0-8814-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2021/11/Gluten-Free-Chocolate-Cake-2.0-8814-480x270.jpg"
  ],
  "keywords": "chocolate cake glutenfree, vegan chocolate layer cake",
  "name": "Vegan Gluten-free Chocolate Layer Cake (grainfree)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "320 kcal",
    "carbohydrateContent": "37 g",
    "fatContent": "20 g",
    "fiberContent": "4 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "7 g",
    "servingSize": "1 serving",
    "sodiumContent": "86 mg",
    "sugarContent": "22 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 1/2 cups almond flour (blanched preferable)",
    "2/3 cup potato starch",
    "6 tablespoons cocoa powder",
    "1/2 cup cane sugar",
    "2 teaspoons baking powder",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon salt",
    "2 tablespoons oil",
    "2 tablespoons non-dairy milk such as almond or oat",
    "1/2 teaspoon vanilla extract",
    "1/2 cup club soda or a neutral flavored carbonated beverage",
    "1 cup full fat coconut milk",
    "1 tablespoon refined coconut oil",
    "1/4 cup sugar",
    "1 teaspoon cornstarch (or arrowroot or tapioca starch )",
    "a few drops of vanilla extract",
    "1 cup Vegan semi sweet chocolate chips",
    "2 tablespoons cheery preserves or raspberry preserves",
    "3 tablespoons water"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the cakes: In large bowl, mix together the almond flour, potato starch, cocoa powder, sugar, baking powder, baking soda, salt until well combined. You want to press and mix so that all lumps of almond flour break down."
    },
    {
      "@type": "HowToStep",
      "text": "Then add the milk, oil, vanilla extract but do not mix."
    },
    {
      "@type": "HowToStep",
      "text": "Open a fresh bottle of club soda or carbonated beverage that you plan to use so that is has the maximum aeration. Measure out 1/2 cup and add it to the bowl and then mix it in."
    },
    {
      "@type": "HowToStep",
      "text": "If the batter is too thick, add 1 tablespoon or so more of the club soda. The batter will convert from thick to a somewhat flowy batter. Let this batter sit for 3-4 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, prep your pans. This cake makes 2 6 inch pans. Put a parchment liner at the bottom and grease the sides of the pan. Then pour the batter into the 2 pans. (You can also use 1 tall 6 inch pan and slice cakes into 2, gf cakes are delicate so refrigerate for an hour and then slice)"
    },
    {
      "@type": "HowToStep",
      "text": "Cover the pans lightly with another parchment and bake at 350 degrees Fahrenheit (180 c) for 22-24 minutes. Check using a toothpick in the center. If it comes out clean then the cakes are baked."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the cakes from the oven. let them cool for 20 minutes covered by a parchment. Then try to tap them out of the container. Let this cakes cool completely (covered with a towel so they don’t dry out) before you frost them."
    },
    {
      "@type": "HowToStep",
      "text": "If they are too domed, then cut off the top using a serated knife. You can use that portion of the cake to make some cake balls."
    },
    {
      "@type": "HowToStep",
      "text": "Make the frosting: Add the coconut milk, coconut oil, sugar and cornstarch to a saucepan and mix well over medium heat. Heat until the coconut milk comes to a boil and the sugar is completely dissolved. Take off heat. Add in the chocolate chips and vanilla and keep whisking. continue to mix until the chocolate completely melted."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a bowl. Let cool completely in the fridge for 30 minutes for a smooth spreadable consistency. You can also put it in the freezer and check after every 5 minutes to see. Mix the frosting after the 5 minutes so that the edges that are setting up can mix in, repeat until frosting consistency is achieved"
    },
    {
      "@type": "HowToStep",
      "text": "Before frosting the cake, moisten the cake with either the preserves or a simple syrup. Mix the cherry preserves and hot water and brush that all over. Or mix 3 tablespoons of hot water with a tablespoon of sugar. Drizzle and brush this water all over the cakes. (Gluten-free cakes can tend to dry out easily, so add as much moisture back at this point. Poke holes using toothpick, and brush and drizzle all of the syrup if possible. )"
    },
    {
      "@type": "HowToStep",
      "text": "frost the cake: Spread the frosting between the two layers and place the one layer on top of the other. Then frost the top and the sides."
    },
    {
      "@type": "HowToStep",
      "text": "You can top the frosting with some chocolate chips, chocolate shavings, raspberries or other toppings of choice. Let the cake sit for 15 minutes before slicing."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://veganricha.com/vegan-gluten-free-chocolate-cake"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-12-02T04:39:05.480Z"
}
