{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-11-28T22:47:38.000Z",
  "datePublished": "2019-12-09T09:45:47+00:00",
  "description": "Cheesy (and totally dairy-free!) potato and onion filling is baked up between layers of flaky puff pastry crust to make this scrumptious vegan spin on classic cheese and onion pie! ",
  "image": {
    "@type": "ImageObject",
    "height": 1020,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2019/11/vegan-cheese-onion-pie-22-of-23.jpg",
    "width": 680
  },
  "keywords": "vegan pie recipe, vegan savory pie",
  "name": "Vegan Cheese & Onion Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "475 kcal",
    "carbohydrateContent": "45.1 g",
    "fatContent": "30.3 g",
    "fiberContent": "6.4 g",
    "proteinContent": "10.9 g",
    "saturatedFatContent": "16.3 g",
    "servingSize": "1 slice (1/8 of pie)",
    "sodiumContent": "530 mg",
    "sugarContent": "5.9 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "English",
  "recipeIngredient": [
    "1 large russet potato, (peeled and cut into 1-inch cubes)",
    "3 tablespoons olive oil, (divided)",
    "1 pound yellow onions, (thinly sliced)",
    "2 garlic cloves, (minced)",
    "3 tablespoons all-purpose flour",
    "1 1/4 cups full fat coconut milk",
    "3 tablespoons nutritional yeast flakes",
    "1 tablespoon prepared whole grain mustard",
    "1 tablespoon mild vinegar-based hot sauce (such as Crystal brand)",
    "2 tablespoons white miso paste",
    "1/2 teaspoon salt, (or to taste)",
    "Black pepper, (to taste)",
    "2 sheets frozen vegan puff pastry (about 1.1 pounds or 490 grams), thawed)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a medium pot of salted water to a boil and add the potato. Boil the potato until fork tender, about 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "When the potatoes have finished cooking, drain them into a colander and return them to the pot."
    },
    {
      "@type": "HowToStep",
      "text": "While the potatoes boil, coat the bottom of a medium skillet with 2 tablespoons of oil and place it over medium low heat. Give the oil a minute to heat up, then add the onions."
    },
    {
      "@type": "HowToStep",
      "text": "Cook the onions for 15 to 20 minutes, stirring occasionally, until they are soft and just beginning to brown."
    },
    {
      "@type": "HowToStep",
      "text": "Raise the heat to medium, add the garlic and continue cooking for about 1 minute, until the garlic becomes very fragrant."
    },
    {
      "@type": "HowToStep",
      "text": "Being to sprinkle in the flour, a bit at a time, stirring to form a paste that coats the onions. Continue cooking and stirring for about a minute after adding the last of the flour."
    },
    {
      "@type": "HowToStep",
      "text": "Begin pouring in the coconut milk, a bit at a time, and whisking it in to blend it with the flour."
    },
    {
      "@type": "HowToStep",
      "text": "After all of the coconut milk has been added, stir in the nutritional yeast, mustard and hot sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon a bit of the sauce out into a small cup and whisk it together with the miso until smooth. Add the mixture to the skillet and whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Let the sauce simmer for 3 to 4 minutes, until very thick."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the skillet from the heat and stir in the potato. Season the mixture with salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375°F."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly oil the bottom of a 9-inch deep dish pie plate*."
    },
    {
      "@type": "HowToStep",
      "text": "Roll one of your puff pastry sheets until it's large enough to cover the bottom and sides of your pie plate. Drape it into the pie plate and use a fork to poke a few holes in the bottom."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon the filing into the pie plate."
    },
    {
      "@type": "HowToStep",
      "text": "Roll the second puff pastry sheet until it's large enough to cover the top of the pie. Drape it over the pie."
    },
    {
      "@type": "HowToStep",
      "text": "Trim any excess pastry around the edges, then firmly pinch the top and bottom sheets together to form a seal."
    },
    {
      "@type": "HowToStep",
      "text": "Use a knife to cut a few slits in the top of the pie, then brush it with about 1 tablespoon of olive oil."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pie into the oven and bake it until the top crust is flaky and beginning to brown, about 30 to 35 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pie from the oven and let it sit for at least 10 minutes before serving. You can slice it hot, in which case it will be a bit sloppy, or let it cool a bit to firm up."
    },
    {
      "@type": "HowToStep",
      "text": "Serve."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-cheese-onion-pie"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-28T15:41:24.206Z"
}
