{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Sam Turnbull • It Doesn't Taste Like Chicken"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T20:22:30.628Z",
  "datePublished": "2019-10-27T05:00:00+00:00",
  "description": "Just 6 ingredients, 15 minutes baking time. Perfect for a spooky dinner appetizer idea, or snack. It&#x27;s a fun activity to make with kids, and they&#x27;re super yummy too!",
  "image": [
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2019/10/vegan-mini-halloween-pizza-dinner-themed-spooky-recipe-feast-food.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2019/10/vegan-mini-halloween-pizza-dinner-themed-spooky-recipe-feast-food-500x500.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2019/10/vegan-mini-halloween-pizza-dinner-themed-spooky-recipe-feast-food-500x375.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2019/10/vegan-mini-halloween-pizza-dinner-themed-spooky-recipe-feast-food-480x270.jpg"
  ],
  "keywords": "dinner, feast, food, Halloween, kids, pizza, spooky, themed",
  "name": "Vegan Mini Halloween Pizza",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "86 kcal",
    "carbohydrateContent": "15 g",
    "fatContent": "2 g",
    "fiberContent": "1 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 mini pizza",
    "sodiumContent": "266 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "4 English muffins, (sliced in half (gluten-free if preferred)",
    "1/2 cup pizza sauce or prepared tomato sauce",
    "vegan mozzarella slices",
    "vegan cheddar slices",
    "green bell pepper",
    "black olives"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "OVEN: Preheat your oven to 425F (220C).AIR FRYER: Preheat your air fryer to 400F (200C)."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the English muffin cut side up on a large baking tray and bake for 4 - 5 minutes without any topping on them. This will toast the bread a little so the English muffins don't get soggy."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and spread 1 tablespoon of tomato sauce per English muffin half, and then decorate as you desire."
    },
    {
      "@type": "HowToStep",
      "text": "For the jack-o-lanterns: use a pumpkin-shaped cookie cutter on a slice of vegan cheddar. Use a small piece of green bell pepper for the pumpkin stem. Cut little pieces of vegan mozzarella to make the jack-o-lantern face.For the skull: use a skull-shaped cookie cutter on a slice of vegan mozzarella. Make the face with pieces of black olive.For the large spider: cut a circle of vegan mozzarella or cheddar for the base (optional). Slice a black olive in half lengthwise for the body, and another olive in half crosswise for the head. Slice olive rings and then cut rings in half to make the legs.For the eyes: use a small round cookie cutter on vegan mozzarella to make the whites of the eyes. Use a smaller circle cutter (I used a piping tip) to cut green bell pepper for the iris. Then use and even smaller circle cutter (I used the point of the piping tip) to cut black olives to make the pupils.For the bugs: slice black olives in half lengthwise for the bodies. Cut olive rings, then slice them in half or in quarters to make the legs.For the ghost: use a ghost-shaped cookie cutter on vegan mozzarella. Use a knife or small circle cutter (I used the point of a piping tip) on black olives to make the eyes and mouth.For the mummy: cut strips of vegan mozzarella for the wrap. Use black olive rings for the eyes."
    },
    {
      "@type": "HowToStep",
      "text": "OVEN: Bake 8 - 12 minutes until the cheese is melty and the edges of the English muffin are golden. Different varieties of vegan cheese melt more or less so results may vary. Serve hot.AIR FRYER: Place the pizzas in a single layer in the air fryer basket, working in batches if neededs. Fry 6 - 10 minutes until the cheese is melty and the edges of the English muffin are golden. Different varieties of vegan cheese melt more or less so results may vary. Serve hot."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://itdoesnttastelikechicken.com/vegan-mini-halloween-pizza"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T20:22:30.627Z"
}
