{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "81",
    "ratingValue": "4.56"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-04T11:52:12.475Z",
  "datePublished": "2017-12-15T03:00:14+00:00",
  "description": "Amazing fluffy and tender vegan, gluten-free cinnamon rolls! Just 10 ingredients and simple methods required for these insanely flavorful and delicious rolls!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/06/V-GF-Cinny-Rolls-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/06/V-GF-Cinny-Rolls-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/06/V-GF-Cinny-Rolls-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/06/V-GF-Cinny-Rolls-SQUARE-480x270.jpg"
  ],
  "keywords": "gluten-free cinnamon rolls",
  "name": "Vegan Gluten-Free Cinnamon Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "406 kcal",
    "carbohydrateContent": "57 g",
    "fatContent": "19 g",
    "fiberContent": "5 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 Rolls without glaze",
    "sodiumContent": "361 mg",
    "sugarContent": "28 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 scant cup unsweetened plain almond milk",
    "2 Tbsp organic cane sugar",
    "1 Tbsp vegan butter (We like Myoko's brand or Earth Balance)",
    "1 packet active dry yeast (~2 1/4 tsp as recipe is written // I like Fleischmann’s active dry original)",
    "2 cups DIY gluten-free flour blend*",
    "3/4 cup almond flour",
    "2 Tbsp cane sugar",
    "2 1/2 tsp baking powder",
    "1/2 tsp sea salt",
    "4 Tbsp cold vegan butter",
    "3 Tbsp melted vegan butter",
    "2/3 cup organic brown sugar (light or dark)",
    "1 Tbsp ground cinnamon",
    "Vegan Cream Cheese Frosting",
    "Simple Powdered Sugar Glaze (see notes)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350 degrees F (176 C) and use vegan butter oil to lightly coat a standard pie plate or round baking dish. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat dairy-free milk in the microwave or on the stovetop to the temperature of warm bath water - approximately 110 degrees F (43 C). Be careful not to exceed that temperature or it can kill the yeast."
    },
    {
      "@type": "HowToStep",
      "text": "To the dairy-free milk, add the vegan butter and sugar and stir melt. Then add yeast and stir once more. Set aside (uncovered) to proof for 10 minutes, or until it appears puffy on the surface (this indicates the yeast is activating. If it hasn’t activated at this point, either your yeast was expired or the liquid was too hot or not hot enough)."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile in a medium mixing bowl whisk together gluten free flour blend (including xanthan gum), almond flour, cane sugar, baking powder, and sea salt. Then add cold vegan butter and use a fork or pastry cutter to mix or “cut” into the dry mixture. It should resemble the texture of wet sand (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "To the dry ingredients, add the almond milk-yeast mixture a little at a time and stir. A dough that resembles moist (not crumbly) cookie dough should form (see photo). Add more of the wet mixture as needed. If it gets too wet and tacky (you should be able to form it into a ball when rolled), add more almond flour or GF flour blend. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Get a large cutting board and wrap with plastic wrap (tuck the wrap down around the edges so it stays in place). Then dust the surface of the plastic wrap generously with gluten-free flour."
    },
    {
      "@type": "HowToStep",
      "text": "Add the dough in the center of the board and sprinkle with more gluten-free flour. Then top with another sheet of plastic wrap and tuck down around the edges of the cutting board (so it stays in place). Use a rolling pin to roll the dough out into a large, thin rectangle. The dough should be about 1/8th-inch thick."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully remove the top layer of plastic wrap and brush on the vegan butter. Then sprinkle with brown sugar and cinnamon and spread gently with fingers to evenly distribute. Then, untuck the bottom layer of plastic wrap from the cutting board and use it to tightly roll the dough lengthwise into a cylinder (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Use a serrated knife or floss (my preferred method) to cut into even rolls (as the recipe is written, 7-8). Then carefully transfer to the prepared pie dish or cake pan (they can be fragile to transfer)."
    },
    {
      "@type": "HowToStep",
      "text": "Cover with plastic wrap and a towel and set on top of the warm oven and let rise for about 30 minutes, or until the rolls have risen slightly and are touching (or close to touching) - they won’t get as voluminous as gluten-containing rolls, but they will puff up a bit!"
    },
    {
      "@type": "HowToStep",
      "text": "Remove towel and plastic wrap and place rolls on the center rack of your oven and bake for 30-35 minutes, or until tops are golden brown and the rolls have risen/expanded quite a bit. While the rolls bake, you can prepare a frosting / glaze (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Let the rolls cool at least 20 minutes before frosting (optional), then enjoy! Store leftover cinnamon rolls covered at room temperature up to 3-4 days or in the freezer up to 1 month. See notes for make-ahead cinnamon rolls to store in the freezer (unbaked)."
    }
  ],
  "recipeYield": "7",
  "sameAs": [
    "https://minimalistbaker.com/vegan-gluten-free-cinnamon-rolls"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-04T11:52:12.474Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=47b6CtELQQw",
    "description": "Amazing fluffy and tender vegan, gluten-free cinnamon rolls! Just 10 ingredients and simple methods required for these insanely flavorful and delicious rolls!\n\nFull Recipe: https://minimalistbaker.com/vegan-gluten-free-cinnamon-rolls/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT59S",
    "embedUrl": "https://www.youtube.com/embed/47b6CtELQQw?feature=oembed",
    "name": "Vegan Gluten-Free Cinnamon Rolls | Minimalist Baker",
    "thumbnailUrl": "https://i.ytimg.com/vi/47b6CtELQQw/hqdefault.jpg",
    "uploadDate": "2018-10-07T10:30:00+00:00"
  }
}
