{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-11-29T00:03:43.000Z",
  "datePublished": "2022-11-07T09:13:52+00:00",
  "description": "This vegan pumpkin lasagna will satisfy all your comfort food cravings! Made with layers of tender noodles, dairy-free spinach ricotta, and rich pumpkin cream sauce, it&#39;s perfect for special dinners.",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2022/10/vegan-pumpkin-lasagna-sq.jpg",
    "width": 1200
  },
  "keywords": "pasta, pumpkin, ricotta, spinach",
  "name": "Vegan Pumpkin Lasagna with Spinach Ricotta",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "447 kcal",
    "carbohydrateContent": "38 g",
    "fatContent": "29.4 g",
    "fiberContent": "4.9 g",
    "proteinContent": "12.4 g",
    "saturatedFatContent": "14.7 g",
    "servingSize": "1 square (1/8 of recipe)",
    "sodiumContent": "669 mg",
    "sugarContent": "5.7 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "9 lasagna noodles (about 8 ounces or half of a one pound box)",
    "Dash olive oil",
    "1 1/2 cups raw cashews, (soaked in water 4 to 8 hours, drained and rinsed)",
    "1/2 cup unflavored and unsweetened non-dairy milk",
    "1 garlic clove",
    "2 tablespoons lemon juice",
    "1 teaspoon salt, (or to taste)",
    "7 ounces firm tofu, (drained and broken into 4 to 5 chunks)",
    "10 ounces frozen spinach, (thawed and squeezed to remove excess water)",
    "Black pepper, (to taste)",
    "2 tablespoons vegan butter",
    "1 medium onion, (diced)",
    "1 (14 ounce or 400 ml) can full-fat coconut milk",
    "1 (15 ounce or 425 g) can pumpkin puree (not pumpkin pie filling)",
    "1 teaspoon salt, (plus more to taste)",
    "1/4 teaspoon ground nutmeg",
    "Finely chopped fresh sage, (for serving (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of salted water to a boil and cook the noodles according to the package directions, until al dente."
    },
    {
      "@type": "HowToStep",
      "text": "Drain the noodles into a colander. Rub each one with a bit of olive oil and arrange them flat on a baking sheet or another flat surface."
    },
    {
      "@type": "HowToStep",
      "text": "Make the ricotta while the noodles cook. Place the cashews, milk, garlic, lemon juice and salt into the bowl of a food processor fitted with an s-blade. Blend until relatively smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Add the tofu and spinach, then pulse the machine until the ingredients are well combined but the mixture is still chunky."
    },
    {
      "@type": "HowToStep",
      "text": "Season the mixture with additional salt and pepper to taste, if desired."
    },
    {
      "@type": "HowToStep",
      "text": "To make the sauce, first melt the butter in a medium skillet over medium heat. Add the diced onion."
    },
    {
      "@type": "HowToStep",
      "text": "Sweat the onion for about 5 minutes, until the pieces soften and being to brown a bit."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the coconut milk, pumpkin, salt and nutmeg. Raise the heat and bring the sauce to a boil, then lower the heat and allow it to simmer for 5 minutes, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400°F."
    },
    {
      "@type": "HowToStep",
      "text": "Ladle about a third of the sauce into the bottom of a 9 x 13 inch baking pan. Top the sauce with a layer of three noodles, followed by half of the ricotta, followed by another three noodles, followed by another third of the sauce, followed by the remaining ricotta, followed by the remaining three noodles, then the last third of the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the lasagna, covered, for 30 minutes. Uncover and continue baking it for another 10 minutes, until the sauce begins to bubble and darken at the edges."
    },
    {
      "@type": "HowToStep",
      "text": "Take the lasagna out of the oven and let it sit for 10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the lasagna into squares and serve. Optionally, garnish each piece with a sprinkle of fresh sage."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-pumpkin-lasagna"
  ],
  "totalTime": "PT325M",
  "updatedAt": "2022-11-28T23:04:18.859Z"
}
