{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Lindsey Johnson"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-01T12:58:08.867Z",
  "datePublished": "2022-06-13T08:00:00+00:00",
  "description": "A plant-based take on the favorite Mexican salad, made with fresh corn, jalapenos, and a creamy cashew-based sauce. Recipe adapted from The Kitchn's Esquites (Mexican Corn Salad).",
  "image": [
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Mexican-Corn-Salad-44.jpg",
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Mexican-Corn-Salad-44-500x500.jpg",
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Mexican-Corn-Salad-44-500x375.jpg",
    "https://helloglow.co/wp-content/uploads/2022/02/Vegan-Mexican-Corn-Salad-44-480x270.jpg"
  ],
  "name": "Vegan Mexican Corn Salad",
  "prepTime": "PT20M",
  "recipeCategory": "Side Dish",
  "recipeIngredient": [
    "6 ears yellow or white corn (husked)",
    "Olive oil (for cooking)",
    "1 bunch fresh cilantro (chopped, plus more for garnish)",
    "1/2 cup diced red onion",
    "2 medium jalapeño peppers (ribs and seeds removed, finely chopped)",
    "2 cloves garlic (minced)",
    "4 tablespoons vegan sour cream mayo or cashew cream (recipe below)",
    "2-3 tablespoons freshly squeezed lime juice (to taste)",
    "1 1/2 teaspoons chili powder",
    "1 teaspoon ground cumin",
    "1/4 teaspoon smoked paprika (optional)",
    "Pinch cayenne pepper (to taste)",
    "Salt (to taste)",
    "Lime wedges (for garnish)",
    "Sliced or diced avocado (for garnish (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Select desired cooking method - boiling, broiling, roasting, grilling, or sautéing. Husk corn and remove as much of the silk as possible, unless cooking corn on a grill."
    },
    {
      "@type": "HowToStep",
      "text": "To boil, fill a stock pot with water, 2 teaspoons salt and 1 teaspoon sugar. Bring to a rolling boil. Add corn cobs and boil for 2-3 minutes, or until bright yellow in color. (If corn is white, the kernels will look plump and more translucent.) Remove from water and allow to cool slightly. Remove corn from cob."
    },
    {
      "@type": "HowToStep",
      "text": "To broil, adjust oven rack so it is about 4 inches away from the heating element. Preheat broiler to high heat. Remove corn from cobs and place in an even layer on a rimmed baking sheet. Drizzle with a little olive oil and season with a little salt and pepper. Broil for 2-3 minutes, stir corn, then broil for another 2-3 minutes or until corn is golden and starting to blacken around the edges."
    },
    {
      "@type": "HowToStep",
      "text": "To roast, preheat oven to 425°F. Rub corn with a little bit of olive oil and place cobs on a baking sheet or directly on oven rack. Roast for 10-15 minutes, or until corn is just cooked. The kernels will be plump and translucent. Remove corn from cob."
    },
    {
      "@type": "HowToStep",
      "text": "To grill, fill a large bucket with water and soak corn, husks and silk still intact, for 1-2 hours. Preheat grill for direct heat. Remove cobs from water and allow to drain, then place directly on the grill grates. Cover with lid and grill for 15-20 minutes, or until husks are blackened. Remove from heat using tongs or heat-safe gloves. Allow to cook slightly. Pull back the husks - the corn should easily come away from the silk and husk. Remove corn from cob."
    },
    {
      "@type": "HowToStep",
      "text": "To sauté, remove corn from cobs. Heat a large skillet over medium-high heat. Add a small amount of olive oil to the pan and allow it to heat for 20-30 seconds. Add the corn, working in two batches, if needed, so it's not too crowded. Cook, stirring occasionally, for 5-6 minutes, or until corn is tender-crisp and starting to brown around the edges. Transfer corn to a mixing bowl and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare salad: heat a skillet over medium-high heat and add a little olive oil. Add red onion, jalapeño, and garlic. Sauté for a few minutes just to cook out some of the rawness. remove from heat and transfer to the bowl with the corn."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining ingredients and stir until well combined. Taste and add more salt or lime juice, if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a serving bowl or platter. Cover and refrigerate until ready to serve. Garnish as desired just before serving."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://helloveggie.co/vegan-mexican-corn-salad"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-01T12:58:08.864Z"
}
