{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Yup, it's Vegan"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-02T01:43:44.343Z",
  "datePublished": "2018-07-27T07:13:58+00:00",
  "description": "Vegan fried green tomatoes are nestled into sourdough bread with tofu bacon, crisp lettuce, and chipotle cashew mayo for an unforgettable vegan summer sandwich!",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2018/07/vegan-fried-green-tomatoes-square.jpg",
    "https://yupitsvegan.com/wp-content/uploads/2018/07/vegan-fried-green-tomatoes-square-500x500.jpg",
    "https://yupitsvegan.com/wp-content/uploads/2018/07/vegan-fried-green-tomatoes-square-500x375.jpg",
    "https://yupitsvegan.com/wp-content/uploads/2018/07/vegan-fried-green-tomatoes-square-480x270.jpg"
  ],
  "keywords": "fried green tomato blt, vegan fried green tomatoes",
  "name": "Vegan Fried Green Tomato BLTs",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "426 kcal",
    "carbohydrateContent": "60 g",
    "fatContent": "16 g",
    "fiberContent": "8 g",
    "proteinContent": "13 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 sandwich",
    "sugarContent": "5 g",
    "unsaturatedFatContent": "12 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "sandwiches",
  "recipeCuisine": "dairy-free",
  "recipeIngredient": [
    "4 large green (unripe) tomatoes (cut into 1/4-inch-to-1/8-inch slices, depending on preference)",
    "1 cup all-purpose flour (gluten-free if needed, see note)",
    "1/4 tsp salt",
    "1/4 tsp paprika",
    "1/4 tsp garlic powder",
    "1/2 cup aquafaba (see note)",
    "2 tbsp plain, unsweetened non-dairy milk",
    "1/2 cup panko-style breadcrumbs (check ingredients for milk; gluten-free if needed, see note)",
    "1/2 cup cornmeal",
    "2 tsp salt",
    "1/4 tsp ground black pepper",
    "1 quart vegetable oil (for frying)",
    "12 slices your preferred light sandwich bread (gluten-free if needed, see notes)",
    "12 pieces tofu bacon",
    "cashew mayo (or other vegan mayo of choice)",
    "chipotle hot sauce (or other hot sauce of choice)",
    "lettuce",
    "sliced fresh tomato"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Scoop the flour onto a plate and stir in the salt, paprika, and garlic powder. In a medium bowl, mix together the aquafaba and the non-dairy milk. On a second plate, mix together the breadcrumbs, cornmeal, salt, and ground black pepper. Also set aside an empty plate or baking sheet for battered tomatoes, and a metal cooling rack or plate lined with paper towels for cooked tomatoes."
    },
    {
      "@type": "HowToStep",
      "text": "Add enough oil in a large pan to be between about 1/2 inch deep. Heat over medium heat. (If you have a thermometer, aim for 360 degrees Fahrenheit). It's really important that the oil is heated up all the way before you put any tomatoes in it."
    },
    {
      "@type": "HowToStep",
      "text": "With one green tomato slice at a time, lightly dip the tomato into flour mixture and shake off any excess. Next dip it into the aquafaba mixture and let any excess drip off. Finally, dip it into the breadcrumb mixture and press gently to adhere the coating. Let any excess crumbs fall off and place the battered tomato on a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Place the tomatoes into the frying pan a few at a time (I can fit 4 in my pan) without crowding them. Make sure to allow space between them in the pan. When the tomatoes are browned on one side, flip them over and fry them on the other side - I find this is about 2-3 minutes per side."
    },
    {
      "@type": "HowToStep",
      "text": "Once browned on both sides, remove them from the pan with a wooden slotted spoon, and place them on the prepared cooling rack or lined plate. Sprinkle with a little bit of additional salt right when they come out of the fryer. Let the oil heat back up for a moment and then repeat until all of the vegan fried green tomatoes are done. Serve immediately."
    },
    {
      "@type": "HowToStep",
      "text": "These fried green tomatoes are far and away best served immediately, but leftovers can be cooled completely to room temperature, stored in a container in the fridge, and reheated in the oven to get somewhat crispy again."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://yupitsvegan.com/vegan-fried-green-tomatoes"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T01:43:44.342Z"
}
