{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "256",
    "ratingValue": "4.7"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T04:57:22.923Z",
  "datePublished": "2014-07-26T05:00:49+00:00",
  "description": "10-ingredient roasted red pepper pasta with a creamy, savory-sweet red pepper sauce and fresh parsley. Light, healthy, and simple, yet incredibly satisfying.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/07/Red-Pepper-Pasta-SQUARE.jpg"
  ],
  "keywords": "roasted pepper pasta",
  "name": "Vegan Roasted Red Pepper Pasta (GF)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "487 kcal",
    "carbohydrateContent": "75 g",
    "fatContent": "14 g",
    "fiberContent": "10 g",
    "proteinContent": "14 g",
    "saturatedFatContent": "2.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "365 mg",
    "sugarContent": "4 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 (~119 g each) red bell peppers",
    "2-3 Tbsp olive oil",
    "2 medium shallots* (finely chopped)",
    "4 cloves garlic* (finely chopped)",
    "Sea salt and ground black pepper (to taste)",
    "1 1/2 cups Unsweetened Original Almond Breeze Almond Milk",
    "2 Tbsp nutritional yeast",
    "1 1/2 Tbsp cornstarch or arrowroot powder (or other thickener of choice)",
    "1 pinch red pepper flake (optional // for heat)",
    "12 ounces gluten-free linguini or spaghetti noodles (or other noodle of choice)",
    "Vegan parmesan cheese",
    "Finely chopped fresh parsley or basil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat oven to 500 degrees F (260 C) and roast red peppers on a baking sheet until charred - about 25-30 minutes. Cover in foil for 10 minutes to steam, then remove (peel away) charred skin, seeds and stems. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Cook pasta according to package instructions; drain, toss in a touch of olive oil, cover with a towel and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "While the red peppers are roasting, bring a large skillet over medium heat and sauté shallot and garlic in olive oil until golden brown and soft - about 4-5 minutes. Season with a generous pinch of salt and pepper and stir. Remove from heat and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer sautéed shallot and garlic to blender with roasted peppers, almond milk, red pepper flake, nutritional yeast and cornstarch. Season with desired amount of salt, pepper, and red pepper flake."
    },
    {
      "@type": "HowToStep",
      "text": "Blend until creamy and smooth, taste and adjust seasonings as needed, adding more salt and pepper or nutritional yeast for flavor. You want the flavor to be pretty robust and strong since the noodles don't have much flavor - so be generous with your seasonings."
    },
    {
      "@type": "HowToStep",
      "text": "Once blended, place sauce back in the skillet over medium heat to thicken. Once it reaches a simmer, reduce heat to low and continue simmering."
    },
    {
      "@type": "HowToStep",
      "text": "Once sauce is thickened to desired consistency (see photo), add noodles. However, before tossing add a touch more olive oil, salt and pepper to the un-tossed noodles for added flavor. Then, toss to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with (generous amounts of) vegan parmesan, red pepper flake, and fresh chopped parsley or basil."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/vegan-roasted-red-pepper-pasta-gf"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-02T04:57:22.922Z"
}
