{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T08:42:31.390Z",
  "datePublished": "2011-06-07T08:56:12+00:00",
  "description": "Black salt or kala namak, which is actually pink in color, can be found in Indian grocery stores for a very reasonable price. Just a little bit gives tofu a very eggy flavor and aroma, so use it if you really want to mimic the flavor of a frittata. If you don&#x27;t have it (or don&#x27;t like the flavor of eggs) just leave it out.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2011/06/zucchini-frittata-fb.jpg"
  ],
  "keywords": "vegan frittata, vegan quiche",
  "name": "Vegan Zucchini Frittata",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "115 kcal",
    "carbohydrateContent": "10 g",
    "fatContent": "4 g",
    "fiberContent": "1.7 g",
    "proteinContent": "11.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "468 mg"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Gluten-free",
  "recipeIngredient": [
    "2 shallots (minced)",
    "1/2 14-ounce package extra-firm tofu (not silken, coarsely crumbled)",
    "1 pinch black salt (kala namak) (optional)",
    "sprinkle of salt and pepper",
    "1 tablespoon minced fresh oregano (packed, or 1 tsp. dried)",
    "1 medium zucchini (about 10-12 ounces, shredded)",
    "1 12.3-ounce package lite firm or extra-firm silken tofu (drained)",
    "1/4 cup water or non-dairy milk",
    "3 tablespoons nutritional yeast",
    "4 teaspoons cornstarch",
    "1 teaspoon tahini",
    "1 clove garlic",
    "1/4 teaspoon turmeric",
    "3/4 teaspoon salt",
    "generous grating of black pepper",
    "1 pinch black salt (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cut a circle of parchment paper to fit an 8- or 9-inch pie pan. Spray pan with non-stick spray and place parchment in bottom. (Spray helps keep sides from sticking; skip this step at your own risk.)"
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a non-stick skillet. Add the shallots and cook, stirring, until they begin to soften but not brown. Add the crumbled tofu, black salt, and a sprinkle of salt and freshly ground pepper. Cook, stirring occasionally, until tofu begins to brown in places. Add oregano and zucchini and continue to cook until zucchini softens, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the zucchini cooks, blend all remaining ingredients well in a blender. When zucchini has softened, remove the skillet from the heat and pour in the contents of the blender. Quickly stir well and pour into the prepared pie pan. Be sure to scrape out any tofu that becomes stuck to the skillet. Smooth the top and place in the preheated oven. Bake for 25 to 30 minutes, or until center is set and top is not yet browned."
    },
    {
      "@type": "HowToStep",
      "text": "Loosen the frittata around the edges. Place a serving plate on top of the pie pan, and using pot holders, carefully invert the pan so that the frittata falls onto the plate. Slowly peel off the parchment paper from the top. (Use a knife to scrape off any tofu the clings to the paper as you pull it away.) Serve hot, cold, or at room temperature."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2011/06/vegan-zucchini-frittata.html"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-02T08:42:31.389Z"
}
