{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT90M",
  "createdAt": "2022-11-29T10:48:11.405Z",
  "datePublished": "2017-11-29T09:40:58+00:00",
  "description": "Caramelized onions simmered with herbs and red wine go into this savory vegan French onion soup that's served with toasty croutons topped with gooey cashew cheese.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2017/11/vegan-french-onion-soup-5-of-6.jpg"
  ],
  "keywords": "cashew cheese, onions",
  "name": "Vegan French Onion Soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "488 kcal",
    "carbohydrateContent": "56 g",
    "fatContent": "22 g",
    "fiberContent": "6.8 g",
    "proteinContent": "10.7 g",
    "saturatedFatContent": "3.6 g",
    "servingSize": "1 serving",
    "sodiumContent": "1591 mg",
    "sugarContent": "13.1 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Soup",
  "recipeCuisine": "French",
  "recipeIngredient": [
    "1/4 cup olive oil or vegan butter",
    "2 pounds yellow onions, (thinly sliced)",
    "1 teaspoon organic granulated sugar",
    "2 garlic cloves, (minced)",
    "1 cup dry red wine",
    "2 tablespoons fresh thyme leaves (or 2 teaspoons dried)",
    "2 bay leaves",
    "1 tablespoon all-purpose flour",
    "6 cups low sodium vegetable broth",
    "2 tablespoon low sodium soy sauce",
    "Salt and pepper to taste",
    "1 1/4 cup water",
    "1/2 cup raw cashews, (soaked in water 4-8 hours and drained)",
    "1 1/2 tablespoons tapioca starch",
    "1 tablespoon white miso paste",
    "1 1/2 teaspoons lemon juice",
    "1/4 teaspoon salt",
    "4-8 slices French bread or baguette"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Begin making the soup by placing the onions, olive oil, and sugar into a large skillet or pot and setting it over medium-low heat. Toss the onions to coat them with oil and allow them to cook until they become very soft and caramelized, about 1 hour, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "Add the garlic to the pot and raise the heat to medium. Sauté for about 1 minute, until very fragrant."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the wine, thyme, and bay leaves. Raise the heat and bring the mixture to a simmer. Lower the heat and allow it to cook until the wine is reduced by about half, about 3 minutes. Stir in the flour and allow the mixture to continue cooking until most of the wine has cooked off, about 3 minutes more, stirring frequently."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the broth and soy sauce. Raise the heat and bring everything to a simmer. Allow it to cook for 20 minutes, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "While the soup simmers, make the cheese. Place the water, cashews, tapioca starch, miso paste, lemon juice, and salt into a food processor and blend until smooth. Transfer the mixture to a small saucepan and place it over medium heat. Bring to a simmer, whisking constantly. Allow the mixture to cook at a low simmer until it become thick and stretchy and begins to pull away from the sides of the pot, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "When the soup has finished simmering, remove it from the heat. Remove the bay leaves and season the soup with salt and pepper to taste. Preheat the broiler."
    },
    {
      "@type": "HowToStep",
      "text": "Place the bread slices under the broiler and broil on each side until toasted, watching them closely to avoid burning. Remove the bread slices but leave the broiler on."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the soup it among oven-safe bowls or crocks. Slather the bread slices with a thick layer of the cashew cheese and set them on top of each soup bowl. You can dollop some extra cheese on top if you have it. Lightly brush or spray the cheese with a bit of olive oil, then place the bowls under the broiler until the cheese begins to brown, watching closely to avoid burning."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-french-onion-soup"
  ],
  "totalTime": "PT110M",
  "updatedAt": "2022-11-29T10:48:11.404Z"
}
