{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "36",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-05T12:30:49.338Z",
  "datePublished": "2016-03-12T05:00:26+00:00",
  "description": "Rich, 10-ingredient vegan cheesecake infused with the flavors of a Snickers bar: caramel, peanuts, and chocolate.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/02/Vegan-Snickers-Cheesecake-SQUARE.jpg"
  ],
  "keywords": "snickers cheesecake",
  "name": "Vegan Snickers Cheesecake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "366 kcal",
    "carbohydrateContent": "39.8 g",
    "fatContent": "22.4 g",
    "fiberContent": "4.3 g",
    "proteinContent": "7.3 g",
    "saturatedFatContent": "6.4 g",
    "servingSize": "1 bars",
    "sodiumContent": "91 mg",
    "sugarContent": "29.3 g"
  },
  "prepTime": "PT360M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup packed pitted dates",
    "1 1/2 cups raw walnuts",
    "1/4 tsp sea salt",
    "1 1/2 cups raw cashews",
    "1 tsp vanilla extract (optional)",
    "1/3 cup maple syrup",
    "1/2 cup full-fat coconut milk (or sub another dairy-free milk, such as almond or rice)",
    "3 Tbsp grape seed or olive oil (or use coconut, but it will impart more coconut flavor)",
    "2 Tbsp lemon juice (1 small lemon yields ~2 Tbsp // plus more to taste)",
    "3/4 cup packed pitted dates (plus water to blend)",
    "3/4 cup roasted salted peanuts (I like the roasted lightly salted peanuts from Trader Joe’s)",
    "3/4 cup chopped vegan dark chocolate (I like the 72% dark chocolate from Trader Joe’s)",
    "1 Tbsp coconut oil (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add cashews to a bowl and cover with boiling hot water. Let set, uncovered, for 1 hour. Then drain thoroughly. Also line an 8x8-inch baking dish* with parchment paper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, make crust by adding dates to a food processor. Blend/mix until small bits remain or it forms into a ball. Remove and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add walnuts and sea salt to the food processor and process into a meal. Then add dates back in and blend until a loose dough forms - it should stick together when you squeeze a bit between your fingers. If it's too dry, add a few more dates through the spout while processing. If too wet, add more walnuts."
    },
    {
      "@type": "HowToStep",
      "text": "Press the crust into the parchment-lined dish (see photo), until uniformly flat. I like to lay parchment paper on top and then press down with something flat - like a liquid measuring cup - and press down so it's firmly packed. Set crust in freezer to set."
    },
    {
      "@type": "HowToStep",
      "text": "Next make date caramel by adding 3/4 cup dates (amount as original recipe is written // adjust if altering batch size) to the food processor. Blend until a paste forms, then add hot water a little at a time until it forms a nice caramel-like paste that's spreadable. Try not to add more than 3-4 Tbsp (45-60 ml // amount as original recipe is written // adjust if altering batch size), which will depend on the freshness of your dates. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add your drained, soaked cashews to a high speed blender, along with vanilla (optional), maple syrup, coconut milk, sea salt, oil, and lemon juice. Blend on high until creamy and smooth, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more lemon for brightness, salt for flavor balance, or maple syrup for sweetness."
    },
    {
      "@type": "HowToStep",
      "text": "Pour filling over the crust and tap on the counter to release any air bubbles. Then add half of the date caramel in small spoonfuls and swirl with a toothpick or chopstick (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the peanuts on top and tap once again so they gently sink in. Cover lightly with plastic wrap, and then seal the top with foil. Freeze for 4-6 hours, or until completely set and firm."
    },
    {
      "@type": "HowToStep",
      "text": "When ready to serve, set out cheesecake (to thaw briefly) and top with remaining date paste and a few more roasted peanuts (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, prepare chocolate sauce. Add chocolate and coconut oil (optional) to a ceramic bowl and set over a small saucepan with 1 inch simmering water (over medium heat). Stir occasionally over the simmering water until melted (alternatively, melt in the microwave in 30 second increments)."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle the chocolate over the cheesecake, slice into 9 to 12 bars (amount as original recipe is written // adjust if altering batch size) and serve."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately. Store leftovers in the freezer up to 3 weeks (best in the first week)."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/vegan-snickers-cheesecake"
  ],
  "totalTime": "PT360M",
  "updatedAt": "2022-12-05T12:30:49.336Z"
}
