{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-28T12:45:27.000Z",
  "datePublished": "2022-04-19T17:07:19+00:00",
  "description": "These vegan pop tarts are fun to make and absolutely delicious! Made with your choice of fillings sandwiched between flaky pastry and topped with sweet, gooey glaze, these delicious little pastries are even better than store bought pop tarts. Perfect for an indulgent breakfast or a sweet snack!",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2022/04/vegan-pop-tarts-sq.jpg",
    "width": 1200
  },
  "keywords": "vegan pastry",
  "name": "Vegan Pop Tarts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "465 kcal",
    "carbohydrateContent": "60.1 g",
    "fatContent": "23.5 g",
    "fiberContent": "0.8 g",
    "proteinContent": "3.2 g",
    "saturatedFatContent": "7.2 g",
    "servingSize": "1 pop tart",
    "sodiumContent": "327 mg",
    "sugarContent": "14 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 1/4 cups all-purpose flour",
    "2 teaspoons organic granulated sugar",
    "1 teaspoon salt",
    "3/4 cup vegetable shortening, (chilled)",
    "1/4 cup vegan butter, (chilled)",
    "Cold water",
    "2/3 cup fruit jam (any flavor)",
    "1 cup vegan chocolate chips",
    "1/4 cup full-fat coconut milk",
    "1/2 cup organic brown sugar",
    "1 tablespoon all-purpose flour",
    "1 teaspoon ground cinnamon",
    "1 tablespoon vegan butter, (melted)",
    "1 cup organic powdered sugar",
    "1 1/2 tablespoons non-dairy milk",
    "1 teaspoon vanilla extract",
    "1 tablespoon cocoa powder (recommended for use with chocolate filling)",
    "1 teaspoon ground cinnamon (recommended for use with brown sugar-cinnamon filling)",
    "Vegan food coloring (recommended for use with fruit filling)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Note: It's a good idea to read through the entire recipe before getting started. Also note that you will choose one filling (don't make all three, or you'll have way too much!)."
    },
    {
      "@type": "HowToStep",
      "text": "To make the pastry, first stir the flour, sugar, and salt together in a large mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the shortening and butter into the flour mixture using a pastry cutter. Continue until the mixture resembles coarse crumbs."
    },
    {
      "@type": "HowToStep",
      "text": "Begin adding cold water to the flour mixture, stirring in a tablespoon or two at a time using a fork, until the mixture just holds together. You can add up to 1/2 cup of water."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the dough into two halves. Roll each half into a ball, wrap it in plastic, and place it into the refrigerator to chill for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "When the dough has only a few minutes left to chill, prepare your filling of choice. If making fruit filled pop tarts, measure your jam. For chocolate filled pop tarts, melt the chocolate chips by microwaving in 30 second increments and stirring in between, then stirring coconut milk into the melted chocolate. For brown sugar cinnnamon pop tarts, stir the filling ingredients together in a small bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°F and line a couple of baking sheets with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Remove one of your dough balls from the fridge and unwrap it."
    },
    {
      "@type": "HowToStep",
      "text": "On a lightly floured surface, use a rolling pin to roll the dough to 1/8 inch thick."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the dough into 3 inch by 4 inch rectangles (you should get about 9) and arrange them on the baking sheets."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the other dough ball from the fridge and roll it to 1/8 inch thick in the same manner. Cut into 3 inch by 4 inch rectangles."
    },
    {
      "@type": "HowToStep",
      "text": "Use a bit of water to moisten the edges of the 9 rectangles that you've placed on the baking sheet, then spoon a 1 to 2 tablespoons of filling into the centers of the rectangles. Be careful not to use too much filling or it will spill out during baking."
    },
    {
      "@type": "HowToStep",
      "text": "Place another rectangle over each of the filling topped rectangles, press the edges to seal, then crimp them with a fork. Poke a few holes in the tops with a toothpick."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the vegan pop tarts until golden, about 25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Brush them with melted butter once they come out of the oven, then carefully remove them from the baking sheets and place them on a cooling rack."
    },
    {
      "@type": "HowToStep",
      "text": "When the pop tarts are cool, stir the glaze ingredients together in a small bowl, along with add-ins of choice."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon the glaze over the pop tarts and serve."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-pop-tarts"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-11-28T07:32:57.287Z"
}
