{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "121",
    "ratingValue": "4.74"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-30T02:18:12.514Z",
  "datePublished": "2016-07-30T05:00:52+00:00",
  "description": "Easy, 10-ingredient vegan pepperoni made with tofu and a blend of spices! Perfect for pizza, calzones, and more!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/07/Vegan-Pepperoni-SQUARE.jpg"
  ],
  "keywords": "vegan pepperoni",
  "name": "Vegan Pepperoni",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "14 kcal",
    "carbohydrateContent": "0.8 g",
    "fatContent": "0.9 g",
    "proteinContent": "1 g",
    "servingSize": "1 slices pepperoni",
    "sodiumContent": "60 mg"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "10 ounces extra-firm tofu (organic when possible)",
    "1 - 1 1/2 tsp each sea salt and ground black pepper",
    "2-3 tsp crushed red pepper flakes (depending on preferred heat level)",
    "2 tsp ground mustard seeds",
    "1 tsp fennel seeds (lightly crushed)",
    "2 tsp smoked paprika",
    "2 tsp garlic powder",
    "2 tsp coconut sugar",
    "1/4 tsp ground anise",
    "1 tsp A1 sauce or liquid smoke (optional)",
    "Cooking spray or olive oil for baking"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wrap tofu in a clean towel and set something heavy on top - like a cast-iron skillet - to press out liquid for 10-15 minutes. Also preheat oven to 400 degrees F (204 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Once pressed, cube tofu and add to a food processor along with sea salt, black pepper, red pepper flake, ground mustard, fennel seeds, smoked paprika, garlic powder, coconut sugar, ground anise, and A1 sauce/liquid smoke (optional). Mix/pulse to combine, scraping down sides as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Sample and adjust seasonings as needed, adding more salt for saltiness, red pepper flake for heat, paprika for smokiness, or coconut sugar for sweetness."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to a parchment-lined baking sheet (or more baking sheets, as needed, if increasing batch size). Lay a sheet of plastic wrap or parchment paper on top and use your hands to spread into a uniformly thin layer about 1/4th - 1/8th inch thick (see photo). The more even the layer is, the more evenly it will bake. Spritz with a little nonstick spray or gently brush with a bit of oil to help it crisp up."
    },
    {
      "@type": "HowToStep",
      "text": "Bake at 400 degrees for 25 minutes, or until golden brown and slightly dried out. Then use a small or medium circular cookie cutter to cut out “pepperonis” (see photo). Feel free to keep the scrap pieces as well! They're just not as pretty."
    },
    {
      "@type": "HowToStep",
      "text": "At this point, the pepperonis are ready to add to a pizza, where they should bake at least another 10-15 minutes. Time accordingly based on how long your crust takes to bake. You'll know they're ready when they're deep red in color and slightly crisp to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "If you don't want to add them to a pizza right away, simply let them cool, cover, and refrigerate (up to 4 days) or freeze (up to 1 month) for later use. If frozen, let thaw slightly before adding to the pizza to bake."
    }
  ],
  "recipeYield": "30",
  "sameAs": [
    "https://minimalistbaker.com/vegan-pepperoni"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-05T17:31:19.033Z"
}
