{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "5",
    "reviewCount": "2"
  },
  "author": {
    "@type": "Person",
    "name": "https://mayihavethatrecipe.com"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-04T10:11:54.376Z",
  "datePublished": "2014-02-10",
  "description": "Decadent, vegan salted caramel chocolate tarts. Perfect for a date night or any other day. No excuse needed to eat these tarts. Check Out more of our chocolate recipes",
  "image": [
    "https://mayihavethatrecipe.com/wp-content/uploads/2014/02/Vegan-chocolate-salted-caramel-tarts-4--225x225.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2014/02/Vegan-chocolate-salted-caramel-tarts-4--260x195.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2014/02/Vegan-chocolate-salted-caramel-tarts-4--320x180.jpg",
    "https://mayihavethatrecipe.com/wp-content/uploads/2014/02/Vegan-chocolate-salted-caramel-tarts-4--scaled.jpg"
  ],
  "name": "Vegan Chocolate Salted Caramel Tarts",
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Kosher / Vegan",
  "recipeIngredient": [
    "Crust",
    "1 1/4 cups unbleached all purpose flour",
    "5 tbsp coconut oil",
    "3 tbs vegan cream cheese or regular if not vegan",
    "1 1/2 tbsp granulated sugar",
    "Pinch of salt",
    "6 tbsp ice water",
    "Caramel",
    "2 tbsp coconut oil",
    "1/4 cup full fat coconut milk (not beverage) plus 2 tbsp",
    "1/2 cup light brown sugar",
    "1/8 tsp Himalayan Pink Salt (you can also use regular sea salt)",
    "Chocolate filling",
    "7oz vegan chocolate chunks (about 3/4 cup)",
    "1/3 cup full fat coconut milk (not beverage)",
    "1/2 cup plus 2 tbsp vegan cream cheese or regular if not vegan",
    "2-3 tbsp unsweetened cocoa powder (use 3 for a stronger cocoa taste)",
    "1 tsp scotch or bourbon (you can use more, to taste)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Combine flour, coconut oil, vegan cream cheese, sugar and salt in a food processor. Pulse a few times it has the consistency of coarse corn meal"
    },
    {
      "@type": "HowToStep",
      "text": "Add water and keep pulsing until it forms a dough (Note: if the crumbs don’t come together in the food processor, but they do when you pinch them with your fingers, place them on a floured surface and knead with your hands until it forms a soft dough)"
    },
    {
      "@type": "HowToStep",
      "text": "Divide the dough in 6 pieces. Roll out each piece on a floured surface into a round disk big enough to fit into a tartellette mold, about 1/8 inch thick (trim the excess if necessary). Prick the dough with a fork and refrigerate for 20 minutes"
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, preheat oven to 350F. Bake chilled dough for about 25 minutes, until golden brown. Set aside to cool"
    },
    {
      "@type": "HowToStep",
      "text": "Combine all ingredients (except 2 tablespoons of coconut milk) in a medium sauce pan. Cook at medium heat for about 9-10 minutes, whisking constantly, until it thickens and turns a golden color. Add the remaining 2 tablespoons of coconut milk and continue cooking for 2 more minute, whisking constantly. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Place chocolate chunks in a heat proof bowl. Bring coconut milk to a simmer and poor over chocolate, stirring constantly until it's completely melted. Set aside to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, whip vegan cream cheese with an electric mixer at medium speed. Reduce speed, add cocoa powder and melted chocolate and mix until well incorporated. Fold in scotch or bourbon (if using)"
    },
    {
      "@type": "HowToStep",
      "text": "Spoon chocolate filling onto the tarts. Pour caramel over and sprinkle with salt. Drizzle melted chocolate for decoration"
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://mayihavethatrecipe.com/2014/02/10/vegan-salted-caramel-chocolate-tartelettes"
  ],
  "totalTime": "PT1H20M",
  "updatedAt": "2022-12-04T10:11:54.374Z",
  "url": "https://mayihavethatrecipe.com/vegan-salted-caramel-chocolate-tartelettes/"
}
