{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "39",
    "ratingValue": "4.9"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-01T12:45:30.432Z",
  "datePublished": "2020-10-22T14:22:58+00:00",
  "description": "The best vegan ricotta with an authentic ricotta taste and texture and made with just four simple ingredients. It&#39;s light, fluffy, mild, creamy and milky and can be enjoyed as it is or used as a non-dairy substitute for ricotta cheese in any recipe.",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2021/10/vegan-ricotta-cheese-hero-A-Virtual-Vegan.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/10/vegan-ricotta-cheese-hero-A-Virtual-Vegan-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/10/vegan-ricotta-cheese-hero-A-Virtual-Vegan-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/10/vegan-ricotta-cheese-hero-A-Virtual-Vegan-480x270.jpg"
  ],
  "keywords": "dairy-free cheese, vegan cheese, vegan ricotta",
  "name": "Vegan Ricotta",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "126 kcal",
    "carbohydrateContent": "6 g",
    "fatContent": "10 g",
    "fiberContent": "2 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving of ¼ cup / 4 tablespoons",
    "sodiumContent": "507 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1 1/2 cups (168 grams) almond flour (, it MUST be almond flour not almond meal)",
    "3 cups + 2 tablespoons (750 mls / 25 fl ozs) water",
    "1 tablespoon white or cane sugar",
    "1 1/2 teaspoons fine sea salt",
    "1/4 cup (60 mls) apple cider vinegar"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To a blender add the almond flour, water, sugar and salt. Blend for at last a minute until white, completely smooth and milk-like."
    },
    {
      "@type": "HowToStep",
      "text": "Place a sieve over a large saucepan. Line the sieve with cheesecloth, nut milk bag or very clean lint free dish towel, and strain the milk from the blender through it and into the pan. Give it a good squeeze to get the last of it out. Discard/compost the pulp or see the FAQ's for ways to use it in another recipe."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the blended milk in the pan over medium heat until just starting to boil. Wait until you see some vigorous boiling bubbles form then turn off the heat right away."
    },
    {
      "@type": "HowToStep",
      "text": "Immediately add the vinegar to the hot milk and stir. Cover with a lid and leave at room temperature until completely cool. This will take several hours. You can easily leave it up to 6 to 7 hours if you need to go out. Don't be tempted to put it in the fridge to hurry it up. It needs to stay at room temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Once it is completely cool, set a sieve over a mixing bowl and line it with some fresh cheesecloth (or a very clean non fluffy dish towel). Carefully pour the curdled milk mixture into the cheesecloth, then bundle it up tightly at the top and tie with string or an elastic band."
    },
    {
      "@type": "HowToStep",
      "text": "A lot of clear liquid will come out quite quickly. Pour it down the sink before putting the whole thing (bowl, sieve, and cheese sitting inside it) in the fridge overnight to drain. Don't be tempted to squeeze it to hurry it up because you will affect the texture of the ricotta. Just let gravity do its thing."
    },
    {
      "@type": "HowToStep",
      "text": "In the morning it's ready. You can open the cheesecloth and use the ricotta immediately or you can transfer the ricotta curds to a cheese mold or ricotta basket to get a more traditional ricotta shape. You can also leave it for a few more days in the cheesecloth over the sieve and bowl to become drier and firmer if you want to."
    },
    {
      "@type": "HowToStep",
      "text": "If using a ricotta basket or cheese mold, simply spoon the ricotta curds into it and press down to compact it gently. Fold up a few pieces of kitchen paper or a clean cloth and lay it on a plate, then sit the basket of ricotta on top. Cover with an upturned bowl and put in the fridge for a couple of hours (or longer) before carefully turning out of the basket to reveal your perfect little ricotta."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://avirtualvegan.com/vegan-ricotta"
  ],
  "totalTime": "PT860M",
  "updatedAt": "2022-12-01T12:45:30.423Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/FhFmyxhS.mp4",
    "description": "The best vegan ricotta with an authentic ricotta taste and texture and made with just four simple ingredients. It's light, fluffy, mild, creamy and milky and can be enjoyed as it is or used as a substitute for ricotta cheese in any recipe.",
    "name": "Vegan Ricotta",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/FhFmyxhS-720.jpg",
    "uploadDate": "2020-12-21T00:00:00.000Z"
  }
}
