{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT80M",
  "createdAt": "2022-11-29T10:48:11.405Z",
  "datePublished": "2022-11-14T04:22:00+00:00",
  "description": "Learn how to make Vegan French Onion Soup in the Instant Pot. The easiest and most hands-off way of making this French Bistro Classic without compromising one the flavor! No standing around sautéing for hours! Stove top option in notes.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/10/French-Onion-Soup-6286.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/French-Onion-Soup-6286-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/French-Onion-Soup-6286-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/10/French-Onion-Soup-6286-480x270.jpg"
  ],
  "keywords": "vegan french onion soup",
  "name": "Vegan French Onion Soup",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "48 kcal",
    "carbohydrateContent": "5 g",
    "fatContent": "3 g",
    "fiberContent": "1 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "456 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "dinner",
  "recipeCuisine": "european",
  "recipeIngredient": [
    "1 large yellow onion, (thinly sliced)",
    "2 cloves of garlic (thinly sliced)",
    "1/4 teaspoon salt",
    "1/2 teaspoon sugar",
    "1/2 teaspoon dried thyme",
    "2 bay leaves",
    "1/4 teaspoon black pepper",
    "1 tablespoon melted vegan butter",
    "1.5 teaspoon balsamic vinegar or use 1 tablespoon wine",
    "3 cups broth",
    "2 teaspoons flour",
    "2 teaspoons vegan Worcestershire sauce or 2-3 tablespoons of red wine",
    "1/4 teaspoon salt (if your broth isn’t salty enough)",
    "Slices sourdough",
    "vegan mozzarella (as needed )",
    "herbs as needed"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add 3.5 cups(for 6 qt) to 4 cups(for 8 qt) of water to your inner pot. Add the yellow onion to a large flat inset pan (steel, see pictures). Use a size so that the onion isn’t more than 2-3 layers thick otherwise the onions won’t caramelize well."
    },
    {
      "@type": "HowToStep",
      "text": "Add the rest of the ingredients and toss to coat the onions really well. If some onions are still dry add a teaspoon more vegan melted butter or oil. Close the inner pan with either foil or the lid that comes with it."
    },
    {
      "@type": "HowToStep",
      "text": "Then use a long handle trivet and lower it into the inner pot. The water should touch the bottom of the pan. This will ensure better heat transfer. Close the instant pot lid and pressure cook on bean mode (preferred) or pressure cook mode for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Let the pressure release naturally for 10 minutes then quick release. Open the lid and check on the onions. They should be cooked and somewhat caramelized( for more caramelization, pressure cook another 10 mins or sauté for a few mins on a skillet). Remove the pan and the trivet and empty the instant pot."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the flour into 1/2 cup of the broth and then add it to the instant pot. Add rest of the broth and the rest of the ingredients as well as the caramelized onions.(you can also use saucepan for the soup at this point)"
    },
    {
      "@type": "HowToStep",
      "text": "Start saute mode and bring to a good boil. Taste and adjust salt and flavor and continue to cook for at least 5-8 minutes to slightly thicken the sauce and for the flavors to meld. Switch off saute mode."
    },
    {
      "@type": "HowToStep",
      "text": "You can serve the soup with some garlic bread on the side or make some cheesy sourdough or baguette. Or make individual bowls with the slices if you are serving the soup immediately.For individual bowls: add the soup to oven-proof soup bowls or dishes and then place the sourdough bread (toast it lightly if you like) on top of the soup, top the bread with some vegan mozzarella. Broil it for 3-5 minutes or until the mozzarella is melty and slightly browned. Serve immediately.Only do this if you are planning to serve the soup immediately because the bread will get soggy if it sits too long in the soups."
    },
    {
      "@type": "HowToStep",
      "text": "To serve with cheese topped sourdough on the side, Place the sliced sourdough or baguette in a baking dish, brush some oil or melted vegan butter on it, top it with some vegan mozzarella cheese and herbs such as thyme or oregano, and then broil it for 3-4 minutes or until the mozzarella is melty and slightly browned. Then serve them on the side with the French onion soup."
    },
    {
      "@type": "HowToStep",
      "text": "Store the soup without the bread refrigerated in a closed container for upto 3 days. Reheat in a saucepan and serve with sides of choice"
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/vegan-french-onion-soup"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-12-02T09:35:34.009Z"
}
