{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T04:03:49.948Z",
  "datePublished": "2022-08-11T04:44:44+00:00",
  "description": "Like Samosa? you need to make this Samosa pie! It&#39;s like a giant veggie samosa and has everything we love about Samosas…but comes in giant pie form! This is a great savory pie perfect for the holidays but also makes for great party food. Gluten-free and nut-free option.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/07/Samosa-Potato-Pie-4619.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/07/Samosa-Potato-Pie-4619-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/07/Samosa-Potato-Pie-4619-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/07/Samosa-Potato-Pie-4619-480x270.jpg"
  ],
  "keywords": "samosa pie, samosa potatoes, savory potato pie",
  "name": "Vegan Samosa Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "270 kcal",
    "carbohydrateContent": "22 g",
    "fatContent": "18 g",
    "fiberContent": "1 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "5 g",
    "servingSize": "1 serving",
    "sodiumContent": "250 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 teaspoon oil",
    "1/4 teaspoon cumin seeds",
    "1/4 teaspoon coriander seeds",
    "1/4 cup chopped red onion",
    "2 tablespoons cashews",
    "1/2 of green chili (such as Serrano finely chopped)",
    "3/4 teaspoon ground turmeric",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon ground coriander",
    "1/4 teaspoon cayenne, less or more for taste",
    "2 teaspoon minced ginger",
    "1/2 teaspoon garlic powder",
    "2 cups cubed potatoes, 3/4 inch cubes (loaded cups )",
    "1/2 teaspoon salt",
    "1/2 teaspoon chaat masala or dried mango powder (amchoor)or add more lemon later",
    "1/3 cup of water",
    "1/4 cup fresh or thawed frozen peas",
    "2 tablespoons chopped cilantro",
    "2 tablespoons chopped fresh mint",
    "1 teaspoon lemon juice",
    "One 9x9 inch sheet of vegan puff pastry",
    "some baby greens of choice. This is optional"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the samosa potatoes in the instant pot: Start the instant pot on sauté setting then add oil. (See notes for stove top instructions)"
    },
    {
      "@type": "HowToStep",
      "text": "Once oil is hot, add in the cumin seeds, coriander seeds and cook for about 30 seconds. You can also crush the seeds if you don’t like the whole coriander seeds in your mouth."
    },
    {
      "@type": "HowToStep",
      "text": "Once the seeds significantly darken in color, add in the onion, green chili, cashews and a good pinch of salt and mix in. Cook for 2 minutes, stirring occasionally, then add the turmeric, cumin, coriander, ginger, garlic powder and chaat masala and mix in. then add potatoes, salt, water and give it a good mix to pick up any stuck bits."
    },
    {
      "@type": "HowToStep",
      "text": "Select the cancel setting. Lock the lid into place, set pressure knob to sealing, and select pressure cook on manual setting at high pressure and set the cook time to 5 minutes, 6 minutes if the potato cubes are larger"
    },
    {
      "@type": "HowToStep",
      "text": "Once the cooking cycle is done, let the pressure release naturally for 5 minutes then carefully set the pressure release knob from sealing to venting to release any remaining pressure. Open the lid then mash some of the potatoes, then add the peas, cilantro, mint and lemon juice and mix really well."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust salt and heat and flavor then remove the pot from instant pot to keep potatoes from continuing to cook because the plate continues to stay hot. Let them cook for 10 mins"
    },
    {
      "@type": "HowToStep",
      "text": "Make the pie: Thaw the puff pastry sheet on a counter for 15-20 minutes if you haven’t already. I usually take it out just before cooking the potatoes and it thaws to the right extent for the 20 ish minutes it takes the potatoes to get done."
    },
    {
      "@type": "HowToStep",
      "text": "Using a little bit of flour, roll it out on parchment, to at least double the size. Transfer to a baking sheet. Then spread the potato mixture onto the one half of the puff pastry sheet and spread well. Keep a 1/2 inch of border around the potatoes so that it can stick puff pastry edges."
    },
    {
      "@type": "HowToStep",
      "text": "Top it with some greens of choice, you can also add a drizzle of chutneys of choice here and then fold over. Brush a little bit of water between the sheets, then press to seal with a fork."
    },
    {
      "@type": "HowToStep",
      "text": "Snip a few vents on top of the puff pastry sheet and put it in the oven at 400F (205C) for 18-22 minutes, depends on your oven and the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Once the puff pastry is nicely golden, take it out, let it cool for 5 minutes then slice using a sharp knife into whatever size pieces you like and serve with Chutneys of choice,Such as tamarind date chutney, mango chutney or other dips such as barbecue sauce"
    },
    {
      "@type": "HowToStep",
      "text": "Store refrigerated for upto 4 days and freeze of upto a month."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://veganricha.com/vegan-samosa-pie"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-02T04:03:49.947Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=PWJ0DVOlTr8",
    "description": "VEGAN SAMOSA PIE\n\n🔸Get the WRITTEN RECIPE here - https://www.veganricha.com/vegan-samosa-pie/\n\n🔸SUBSCRIBE HERE: https://www.youtube.com/veganricharecipes?sub_confirmation=1\n\n🔸My New Instant pot cookbook: https://www.amazon.com/Vegan-Richas-Instant-PotTM-Cookbook/dp/0306875039/\n\nLike Samosa? you need to make this Samosa pie! It’s like a giant veggie samosa and has everything we love about Samosas…but comes in giant pie form! This is a great savory pie perfect for the holidays but also makes for great party food, lunchbox or snack.\n\nSamosa lovers need to make this giant vegan samosa pie! It has everything you love about Samosas…but comes in giant pie form! It’s great for parties, lunch boxes and the holiday table!\n\nI used store bought puff pastry – you’d be surprised that most brands are actually vegan! This is a free-form pie, so we do not bake it in a pie dish but on a sheet pan. It’s like a giant baked samosa that we cut into single servings after baking!\n\n******MORE SAVORY PIE RECIPES FROM THE BLOG******\n\nVEGAN LENTIL SAMBUSA PIE: https://www.veganricha.com/vegan-lentil-sambusa-pie/\n\nVEGAN POT PIE WITH BLACK PEPPER BISCUITS: https://www.veganricha.com/vegan-pot-pie/\n\nCHICKPEA SPINACH PIE WITH BERBERE SPICE: https://www.veganricha.com/chickpea-spinach-pie-berbere-spice/\n\nCOOKBOOKS BY RICHA HINGLE (VEGAN RICHA): https://www.veganricha.com/mybooks/\n\nConnect with me on Social Media:\n\nFACEBOOK: https://www.facebook.com/VeganRicha\n\nINSTAGRAM: https://instagram.com/veganricha\n\nPINTEREST: https://www.pinterest.com/veganricha/\n\nTWITTER: https://twitter.com/veganricha\n\nMusic: Epidemic Sound \n\n#veganpie #samosapie #holidaysnacks #vegansnacks",
    "duration": "PT1M38S",
    "embedUrl": "https://www.youtube.com/embed/PWJ0DVOlTr8?feature=oembed",
    "name": "VEGAN SAMOSA PIE | Vegan Richa Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/PWJ0DVOlTr8/hqdefault.jpg",
    "uploadDate": "2022-08-23T01:51:23+00:00"
  }
}
