{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Sarah McMinn"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-02T08:41:26.357Z",
  "datePublished": "2020-12-04T06:36:44+00:00",
  "description": "You&#39;re going to love these vegan sugar cookies! They are soft, buttery, fluffy, and topped with the perfect royal frosting.  This easy cookie recipe makes a delicious holiday treat that you can enjoy year &#39;round!",
  "image": [
    "https://www.mydarlingvegan.com/wp-content/uploads/2020/11/Vegan-Sugar-Cookies4.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/2020/11/Vegan-Sugar-Cookies4-500x500.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/2020/11/Vegan-Sugar-Cookies4-500x375.jpg",
    "https://www.mydarlingvegan.com/wp-content/uploads/2020/11/Vegan-Sugar-Cookies4-480x270.jpg"
  ],
  "keywords": "Vegan Sugar Cookies",
  "name": "Vegan Sugar Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "181 kcal",
    "carbohydrateContent": "28 g",
    "fatContent": "7 g",
    "fiberContent": "1 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "114 mg",
    "sugarContent": "16 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "3 cups all-purpose flour",
    "1 tablespoon cornstarch",
    "1 teaspoon baking powder",
    "1/2 teaspoon salt",
    "1 cup vegan butter",
    "1 cup granulated sugar",
    "1/4 cup applesauce",
    "2 teaspoon vanilla extract",
    "1 1/2 cup powdered sugar",
    "1 tbsp. vegan butter, (melted)",
    "1-2 tablespoons non-dairy milk"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a bowl sift together the flour, cornstarch, baking powder and salt. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In a stand-up mixer, beat the vegan butter for one minute until it is light and fluffy. Turn off the mixer and scrape down the side. Slowly add the granulated sugar. Whip together for aother minutes, scraping down the sides as necessary. Add the applesauce and vanilla extra and mix until it is well incorporated. The dough may look a little curdled at this point. That’s okay! It will sort itself out once the rest of the ingredients are added."
    },
    {
      "@type": "HowToStep",
      "text": "With the mixer on low, slowly add the dry ingredients. Mix until the dough comes together. Do not over mix that dough. Once you add the flour, mix it until it just starts coming together. At that point, turn it out onto a floured work surface and bring it together with your hands. Transfer the dough to a piece of parchment paper, lightly dust with powdered sugar and top with another piece of parchment paper. Roll out to about 1/4\" thick. Refrigerate for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "Once your dough is chilled, cut out shapes with your cookie cutters. Avoid rolling out the dough many times. Each time the dough is rolled, it will get more cracked and dense. Keep the shapes as close together as possible. Return to the refrigerator for 30 minutes to let the dough reharden. Otherwise, your cookies will spread out too much in the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 degrees F. Bake the cookies for 10-12 minutes, until they are slightly golden around the edges. Allow the cookies to cool for 5 minutes on baking sheets before transferring to a wire rack to cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "While the cookies are cooling, whisk together the ingredients for the frosting. Feel free to add any colors you choose. Once your cookies are completely cool, frost the cookies. Check out this helpful tutorial for sugar cookie decorating tips."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://mydarlingvegan.com/vegan-sugar-cookies"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-12-02T08:41:26.356Z"
}
