{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "33",
    "ratingValue": "4.97"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-02T01:58:45.134Z",
  "datePublished": "2019-09-17T04:28:24+00:00",
  "description": "Homemade Vegan Margherita Pizza Recipe. 20 Minute Pizza crust, 5 minute Pizza sauce and a creamy cashew mozzarella cheese sauce. Vegan Soy-free Recipe. Gluten-free and nut-free options.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2019/09/Vegan-Margherita-Pizza-veganricha-9522-001.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/09/Vegan-Margherita-Pizza-veganricha-9522-001-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/09/Vegan-Margherita-Pizza-veganricha-9522-001-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/09/Vegan-Margherita-Pizza-veganricha-9522-001-480x270.jpg"
  ],
  "keywords": "cashew mozzarella margherita pizza, from scratch margherita pizza, margherita pizza, vegan margherita",
  "name": "Vegan Margherita Pizza with Cashew Mozzarella",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "158 kcal",
    "carbohydrateContent": "20 g",
    "fatContent": "7 g",
    "fiberContent": "1 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "371 mg",
    "sugarContent": "2 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Main",
  "recipeCuisine": "Italian",
  "recipeIngredient": [
    "1 tsp active yeast",
    "1/2 cup + 1 tbsp warm water",
    "1 1/4 cup flour (, divided, (unbleached all purpose or half of all purpose and half whole wheat pastry flour/spelt)",
    "1 tbsp semolina flour (or use wheat flour)",
    "1/3 tsp salt",
    "2 tsp olive oil",
    "1/4 cup unsalted tomato paste",
    "1/3 cup water",
    "1 tsp extra virgin olive oil",
    "1 clove of garlic minced or 1/2 tsp garlic powder",
    "1 tsp each dried oregano (dried basil)",
    "1/4 tsp dried thyme or rosemary",
    "1/8 tsp onion powder",
    "1/8 tsp salt",
    "dash of black pepper",
    "1/2 cup cashews (soaked in hot water for 15 mins)",
    "1 cup water",
    "2 tsp extra virgin olive oil",
    "1 tsp flour (, use rice flour or 2 tsp cornstarch for glutenfree)",
    "1/2 tsp garlic powder",
    "3/4 tsp salt",
    "1 tsp lemon juice",
    "1/4 tsp onion powder",
    "1/2 tsp miso (, use chickpea miso for soy-free, or use 1-2 tsp nutritional yeast)",
    "Fresh basil (extra virgim olive oil and pepper flakes for garnish)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 435 deg F (225 C). Soak the cashews in hot boiling water if you havent already."
    },
    {
      "@type": "HowToStep",
      "text": "Pizza Base: Mix the warm water with yeast and 1 tbsp flour. Mix well and let sit for 2 mins."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the salt and semolina into the rest of the flour. Add the flour and oil to the yeast mixture and mix. Mix till just about combined. Let it sit for a minute."
    },
    {
      "@type": "HowToStep",
      "text": "Oil your hands and bring the dough together till just about smooth. Use a tsp or so more flour(or water if you used wheat flours), if needed. Don't knead it longer than a few seconds. Cover with a towel and let it sit near the preheating oven for 15 mins."
    },
    {
      "@type": "HowToStep",
      "text": "Cashew Mozzarella Cream: Drain the cashews. Add to a blender with the rest of the ingredient. Blend until smooth. Add to a skillet over medium heat. Cook to thicken evenly. 4 to 6 mins. Stir occasionally to avoid sticking at the bottom and lumping."
    },
    {
      "@type": "HowToStep",
      "text": "Prep the pizza sauce: Mix all the ingredients in a bowl. Taste and adjust salt and flavor. Add a pinch of sweetener if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Oil your hands and transfer Pizza dough to a parchment lined baking sheet. Using some flour shape the dough into a flat ball, then spread using your hands. Keep spreading to make a large pizza or make 2 small pizzas (see video). You want to spread the dough thin, as it will rise quite a bit during baking and make a bready crust if it was too thick to begin with."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the pizza sauce all over. Add some fresh basil and place tomato slices over the basil. Sprinkle a pinch of salt. (you can also add other thinly sliced veggies at this point). Add spoonfuls of the mozzarella cream on the pizza."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle a tsp of extra virgin olive oil. Then Bake for 13 to 14 mins. (Broil for a minute if needed), Remove from the oven and add fresh basil and pepper flakes. Slice and serve, See Storage and Freezing instructions in notes."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://veganricha.com/vegan-margherita-pizza-recipe"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-02T01:58:45.133Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=4ffPq2KeYMI",
    "description": "Homemade Vegan Margherita Pizza Recipe. 20 Minute Pizza crust, 5 minute Pizza sauce and a creamy cashew mozzarella cheese sauce. All from scratch!\nFULL RECIPE: https://www.veganricha.com/2019/09/vegan-margherita-pizza-recipe.html\n\nVegan Soy-free Recipe. Gluten-free and nut-free options.\n\nSometimes you just want a ridiculously good pizza and the pizza restaurants are too far away, have shut down, or offer sub par vegan experience. Then you just go to the kitchen and whip up a super fresh delicious margherita pizza with gooey cashew cheese, all made from scratch.\n\nYou can speed up the process by either making the components ahead of time or using store bought options. With a store bought pizza sauce, this pizza comes together in 20-30 mins and then you have to wait and fight over the fresh slices. The recipe is easily doubled!\n\nThe pizza dough (its my easy 20 minute pizza dough) doesn’t need much kneading. Just bring the dough together and let it rise for 15 mins, then shape it using some flour. This dough is shaped easily as it does not have much gluten development (which develops with longer kneading) and hence is not the stretchy traditional pizza dough, so no struggling to roll it out!\n\nThe cashew mozzarella cheese sauce is a few ingredients. Just blend, and simmer to thicken, and use. No chill time to let it set. The final result we want is a cheesy melty topping, So keep the state as thick saucy to begin with! problem solved.\n\nLets make this!\n\n#easyveganrecipes #veganricha #margheritapizza #veganmargherita #veganmozzarella\n\nMY BOOKS:\nINDIAN KITCHEN:  https://veganricha.com/vegan-richas-indian-kitchen-cookbook\nEVERYDAY KITCHEN: https://veganricha.com/vegan-richas-everyday-kitchen\nBoth have about 150 Recipes each. With many gluten-free, nut-free, soy-free recipes and options listed with recipes. Available everywhere Internationally as well.\n\nFollow: \nMy blog: https://veganricha.com\nFacebook: https://www.facebook.com/VeganRicha\nInstagram: https://instagram.com/veganricha\nTwitter: https://www.twitter.com/veganricha\nPinterest: https://www.pinterest.com/veganricha",
    "duration": "PT1M7S",
    "embedUrl": "https://www.youtube.com/embed/4ffPq2KeYMI?feature=oembed",
    "name": "VEGAN MARGHERITA PIZZA With Cashew Mozzarella | Vegan Richa Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/4ffPq2KeYMI/hqdefault.jpg",
    "uploadDate": "2019-11-02T17:00:00+00:00"
  }
}
