{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "183",
    "ratingValue": "4.64"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-01T12:34:28.212Z",
  "datePublished": "2018-11-15T03:00:31+00:00",
  "description": "Incredible vegan lentil \"meatloaf\" with wholesome, whole-food ingredients like lentils, nuts, sweet potato, and mushrooms! Just 10 ingredients required for this flavorful, comforting entrée.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2018/09/Lentil-MeatLoaf-SQUARE.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/09/Lentil-MeatLoaf-SQUARE-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/09/Lentil-MeatLoaf-SQUARE-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2018/09/Lentil-MeatLoaf-SQUARE-480x270.jpg"
  ],
  "keywords": "vegan meatloaf",
  "name": "Vegan Lentil Nut “Meat” Loaf",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "337 kcal",
    "carbohydrateContent": "31.6 g",
    "fatContent": "20.5 g",
    "fiberContent": "7.3 g",
    "proteinContent": "9.5 g",
    "saturatedFatContent": "1.9 g",
    "servingSize": "1 Slice",
    "sodiumContent": "622 mg",
    "sugarContent": "5.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 tsp coconut or avocado oil (if avoiding oil, sub water)",
    "3 heaping cups thinly sliced shiitake or cremini mushrooms",
    "1 healthy pinch each sea salt and black pepper",
    "1 1/2 Tbsp coconut aminos or vegan Worcestershire sauce (ensure vegan and gluten-free friendly)",
    "1 Tbsp coconut or avocado oil",
    "2 cups sliced and peeled sweet potato (1/4-inch rounds)",
    "2 cups raw nuts or seeds",
    "2 Tbsp fresh thyme (or sub dried)",
    "2 cups cooked brown or green lentils (rinsed and well drained // we used canned to save time)",
    "1/2 tsp each sea salt and black pepper (plus more to taste)",
    "4 Tbsp tomato paste",
    "2 Tbsp coconut aminos or vegan Worcestershire sauce (ensure vegan and gluten-free friendly as needed)",
    "1/2 cup gluten-free bread crumbs (we like Ian’s gluten-free panko* // If not gluten-free, use regular breadcrumbs)",
    "1/2 cup ketchup (or skip and serve with Vegan Gravy*)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat the oven to 350 degrees F (176 C) and line a standard loaf pan (or 8x8-inch baking pan) with parchment paper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large cast-iron or metal skillet over medium heat. Once hot, add the oil and mushrooms and season with a pinch each salt and pepper and the coconut aminos or vegan Worcestershire. Sauté, stirring frequently, for 5-8 minutes or until caramelized. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, heat another large cast-iron or metal skillet (or use the same one as you cooked the mushrooms in) over medium heat. Once hot, add oil and arrange sweet potatoes in as even of a layer as possible. Then cover and cook for 4 minutes or until golden brown on the underside. Flip, add 3 Tbsp (45 ml) water, and cover. Cook for another 3-4 minutes or until tender and browned (but not mushy). Set aside uncovered to cool slightly."
    },
    {
      "@type": "HowToStep",
      "text": "To a large (at least 7-cup) food processor, add nuts and pulse a few times into a loose meal. Then add sweet potatoes, mushrooms, and thyme, and pulse to combine. Lastly, add lentils, salt, and pepper and pulse to loosely combine but be careful not to purée."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer mixture to a large mixing bowl and add tomato paste and coconut aminos or vegan Worcestershire and stir until a loose dough forms. Then add bread crumbs (we like Ian's gluten-free panko) a little at a time (we used all of the recommended amount) until a thick dough forms. If for some reason it’s crumbly (which may happen depending on the texture of your lentils), scoop half of the mixture back into the food processor and pulse until it’s more finely puréed and then return back to the bowl and stir with the remaining mixture. If for some reason it’s too wet, add more bread crumbs as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more tomato paste for added moisture / tomato flavor, coconut aminos or vegan Worcestershire for depth of flavor, salt for saltiness, or thyme to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to the parchment-lined loaf pan, spread, and press into an even layer (to avoid a crumbly loaf, tap pan on counter to settle the mixture and place parchment paper on top and press down firmly with a drinking glass or flat bottomed object to pack it well). Then add ketchup glaze (optional but adds plenty of flavor) and spread into an even layer. If not using the glaze, brush the top with a little oil to help the loaf retain moisture."
    },
    {
      "@type": "HowToStep",
      "text": "Bake uncovered for 45 minutes or until golden brown on the edges and slightly dry to the touch. Remove from oven and let rest for 10-15 minutes in the pan. Then gently remove and carefully slice and serve."
    },
    {
      "@type": "HowToStep",
      "text": "Leftovers keep for 4-5 days in the refrigerator or 1 month in the freezer. Reheat in the microwave or in a 350-F (176 C) oven until warmed through."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/vegan-lentil-nut-meatloaf"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-12-01T12:34:28.210Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=CsJCdCZ1NFg",
    "description": "Incredible vegan lentil \"meatloaf\" with wholesome, whole-food ingredients like lentils, nuts, sweet potato, and mushrooms! Just 10 ingredients required for this flavorful, comforting entrée.\n\nFull Recipe: https://minimalistbaker.com/vegan-lentil-nut-meatloaf/\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT56S",
    "embedUrl": "https://www.youtube.com/embed/CsJCdCZ1NFg?feature=oembed",
    "name": "Vegan Lentil Nut “Meatloaf” | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/CsJCdCZ1NFg/hqdefault.jpg",
    "uploadDate": "2018-11-15T11:30:01+00:00"
  }
}
