{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-02T10:47:29.470Z",
  "datePublished": "2015-08-12T14:29:47+00:00",
  "description": "This spicy, tangy sauce is also delicious on baked potatoes and other vegetables. I like the nutty flavor and Omega 3’s that hemp seeds give it, but if you don’t have them, pine nuts are a close substitute.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2015/08/vegan-mexican-corn-small.jpg"
  ],
  "keywords": "street corn",
  "name": "Vegan Elote or Mexican-Inspired Corn on the Cob with Hemp-Lime Sauce",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "190 kcal",
    "carbohydrateContent": "33.6 g",
    "fatContent": "4.6 g",
    "fiberContent": "4.7 g",
    "proteinContent": "9.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "187.6 mg",
    "sugarContent": "5.8 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Sauce",
  "recipeCuisine": "Mexican",
  "recipeIngredient": [
    "4 ears corn (shucked and rinsed)",
    "1/2 cup plain unsweetened almond milk (or other non-dairy milk)",
    "2 tablespoons hemp hearts (may substitute pine nuts sesame seeds, or sunflower seeds if necessary)",
    "2 tablespoons nutritional yeast",
    "1 tablespoon brown rice flour (I haven’t tested with other flours)",
    "1 small clove garlic (peeled)",
    "1/4 teaspoon cayenne pepper (or to taste)",
    "1/4 teaspoon salt (or to taste)",
    "1 tablespoon fresh lime juice",
    "Minced cilantro or parsley, chopped jalapeno or other hot peppers, lime wedges, and/or chipotle powder/smoked paprika"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cook the corn in any way you want. Grilled tastes best, but I save time by using my Instant Pot or pressure cooker. Just put a rack or steaming basket in the pot, place the shucked corn on the rack, and add about 1 1/2 cups water–enough to cover the bottom by a good 1/2 inch but not rise above the bottom of the rack. Cook at high pressure for 4 minutes. Quick-release pressure manually."
    },
    {
      "@type": "HowToStep",
      "text": "While the corn is cooking, make the sauce. Combine “milk” and all remaining ingredients EXCEPT lime juice and garnishes in a blender and blend until smooth. Pour into a saucepan and cook over medium-high heat, stirring constantly, until it boils and thickens. Add the lime juice and continue to cook for another minute. If the sauce is too thick to drizzle or pour, add more non-dairy milk by the tablespoon to thin it out. Taste and add extra salt, cayenne, and lime juice, if you like, and remove from heat."
    },
    {
      "@type": "HowToStep",
      "text": "Serve the corn drizzled with the hot sauce and sprinkled with your choice of garnishes."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2015/08/vegan-elote-or-mexican-inspired-corn-on-the-cob-with-hemp-lime-sauce.html"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T10:47:29.462Z"
}
