{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT18M",
  "createdAt": "2022-12-01T10:21:24.353Z",
  "datePublished": "2019-09-04T03:00:49+00:00",
  "description": "Vegan Banana Scones with just the right amount of density, flake and fluff, a delicious crust, super yum banana bread taste, toasty nuts, and an over-the-top splatter of maple glaze. ",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/09/Vegan-Banana-Scones-A-Virtual-Vegan-24.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/09/Vegan-Banana-Scones-A-Virtual-Vegan-24-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/09/Vegan-Banana-Scones-A-Virtual-Vegan-24-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/09/Vegan-Banana-Scones-A-Virtual-Vegan-24-480x270.jpg"
  ],
  "keywords": "banana scones, dairy-free scones, scones, vegan scones",
  "name": "Vegan Banana Scones",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "435 kcal",
    "carbohydrateContent": "65 g",
    "fatContent": "17 g",
    "fiberContent": "3 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "5 g",
    "servingSize": "1 serving",
    "sodiumContent": "249 mg",
    "sugarContent": "26 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Brunch",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "2 medium bananas (, they should be about 8 inches in length and once peeled the total of the 2 bananas should weigh 250g / 9 oz.)",
    "1/4 cup / 50 g cane sugar (, or white granulated sugar)",
    "1/4 cup / 60 mls canned coconut milk (, light or full fat - plus some extra for brushing the scones before baking)",
    "1 teaspoon vanilla extract",
    "1 teaspoon apple cider vinegar (*)",
    "2 3/4 cups / 345 g all purpose flour (, (plain flour in the UK)",
    "scant 1/2 cup / 80 g vegan butter",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/2 teaspoon fine salt",
    "1 tablespoon and 1 teaspoon baking powder",
    "1/4 teaspoon baking soda (, (bicarbonate of soda in the UK)",
    "1 cup / 100 g chopped walnuts",
    "1 cup / 100 g powdered sugar",
    "2 tablespoons maple syrup",
    "1 tablespoon canned coconut milk",
    "1 tiny pinch fine salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Line a large baking tray with parchment paper and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Peel the bananas and put them in a medium sized bowl. Mash them with a fork until they are wet and mostly lump free. A few small lumps are fine."
    },
    {
      "@type": "HowToStep",
      "text": "Add the sugar, coconut milk, vanilla and vinegar to the banana. Stir well to combine, then pop it in the fridge while you get on with the next step."
    },
    {
      "@type": "HowToStep",
      "text": "To a large bowl add the flour. Cut the butter into little pieces and drop them into the flour. Either cut the butter into the flour with a pastry cutter, or use your fingers to rub it in. To use your fingers, put both hands into the bowl and use the tips of your fingers to rub the flour and lumps of butter together until the lumps disappear into the flour and the whole thing looks like fine breadcrumbs."
    },
    {
      "@type": "HowToStep",
      "text": "To the flour mixture, add the cinnamon, nutmeg, salt, baking powder baking soda and nuts. Stir it all up really well to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the wet ingredients from the fridge and pour into the dry ingredients. With a spoon or spatula, mix them together until everything is moistened. If you have trouble getting it to come together, use a hand to get in there and knead it gently together. Try not to overwork it though."
    },
    {
      "@type": "HowToStep",
      "text": "Generously flour your work surface and your hands and turn out the scone dough onto the floured surface. It will feel pretty sticky. Sprinkle some flour on the top of the dough and pat it into a disc shape about 8 inches wide. Dust your hands with a little more flour if things get sticky."
    },
    {
      "@type": "HowToStep",
      "text": "With a large sharp knife or dough cutter, cut the disc into 8 wedges. I find that a wet knife works best. I keep a pint glass of cold water next to me and dip the knife in, then give it a quick shake to get any excess off, between cuts."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 420°F (215 °C)"
    },
    {
      "@type": "HowToStep",
      "text": "Transfer each wedge carefully to the lined baking tray, leaving at least an inch free around each one. I use a spatula to move them with as it's easier to pick them up. Once on the tray, brush with a generous amount of coconut milk, then put the whole tray carefully in the fridge for 15 minutes. This step is important so don't skip it."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 420°F (215 °C) while the scones chill in the fridge."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the fridge after 15 minutes and place in the hot oven on the middle shelf. Bake for 18 to 20 minutes. They should be puffed up and lightly golden."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and leave to cool for a few minutes on the tray. You can then either glaze them while still warm or let them cool completely before glazing. For a stickier effect do it while warm. If you want the glaze to set, wait until they are cold."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/vegan-banana-scones"
  ],
  "totalTime": "PT48M",
  "updatedAt": "2022-12-01T10:21:24.351Z"
}
