{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-11-30T14:26:00.109Z",
  "datePublished": "2014-04-09T10:46:00+00:00",
  "description": "This vegan cream cheese and veggie sushi is stuffed with asparagus, cucumber, scallions and cashew cream cheese.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2014/04/single-detail2-pub.jpg"
  ],
  "keywords": "sushi",
  "name": "Vegan Cream Cheese and Veggie Sushi",
  "prepTime": "PT10M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2/3 cup sushi rice",
    "3/4 cup + 2 tbsp. water",
    "3/4 tsp. salt",
    "1 tbsp. rice vinegar",
    "4 asparagus spears (trimmed)",
    "1/2 cucumber (seeded and sliced into matchstick strips)",
    "2 scallions",
    "1/4 cup cashew cream cheese",
    "2 sheets of nori",
    "sesame seeds",
    "wasabi (soy sauce and pickled ginger for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Rinse rice under cold running water for 1-2 minutes. Place in a small saucepan with other rice ingredients and heat to a simmer. Cover and allow to simmer over low heat for about 20 minutes, or until liquid is absorbed."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from heat and allow to sit for another 10 minutes, covered."
    },
    {
      "@type": "HowToStep",
      "text": "While your rice cooks and sits, get your filling ingredients ready. Boil some water in large saucepan. Remove from heat and blanch asparagus spears for about two minutes, or until bright green. Transfer to an ice water bath."
    },
    {
      "@type": "HowToStep",
      "text": "Wrap a bamboo mat in plastic wrap and place nori over top."
    },
    {
      "@type": "HowToStep",
      "text": "Keep a small bowl of water nearby and wet your fingertips. Distribute half of your rice in an even layer over nori. Sprinkle with sesame seeds."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully invert your rice covered nori, so that the rice layer sits on the plastic wrap and nori is face up. Arrange half of your veggies in a single strip across the width of your nori, about an inch away from you."
    },
    {
      "@type": "HowToStep",
      "text": "Using a spoon, pastry bag or even your fingers, distribute a single line of cream cheese right on top of your veggie strip."
    },
    {
      "@type": "HowToStep",
      "text": "Now carefully roll the end of the nori closest to you over your veggie strip, tucking and squeezing to get it nice and tight. Continue rolling until you reach the end."
    },
    {
      "@type": "HowToStep",
      "text": "Take your roll and place it seam side down on a cutting board. Using a big, sharp knife, cut into eight pieces."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat using remaining ingredients."
    },
    {
      "@type": "HowToStep",
      "text": "Serve with wasabi, soy sauce and pickled ginger."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-cream-cheese-and-veggie-sushi"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-11-30T14:26:00.108Z"
}
