{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T10:08:54.772Z",
  "datePublished": "2019-12-13T15:28:10+00:00",
  "description": "This creamy curry is delicious served over rice and vegetables, but it can easily be made into a soup with the addition of a little extra broth or plant milk.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2019/12/vegan-butternut-squash-curry-500h.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2019/12/vegan-butternut-squash-curry-500h-500x500.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2019/12/vegan-butternut-squash-curry-500h-500x375.jpg",
    "https://blog.fatfreevegan.com/wp-content/uploads/2019/12/vegan-butternut-squash-curry-500h-480x270.jpg"
  ],
  "keywords": "butternut squash, curry",
  "name": "Vegan Butternut Squash Curry",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "223 kcal",
    "carbohydrateContent": "44 g",
    "fatContent": "2 g",
    "fiberContent": "10 g",
    "proteinContent": "9 g",
    "servingSize": "1 serving",
    "sodiumContent": "210 mg",
    "sugarContent": "8.5 g",
    "unsaturatedFatContent": "1 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "2 pounds butternut squash (approximate weight after cooking)",
    "1 large onions (chopped)",
    "4 cloves garlic (minced or pressed)",
    "1 tablespoon ginger root (minced)",
    "2 teaspoons cumin seeds",
    "1 teaspoon black mustard seeds",
    "6 cups water or vegetable broth (or water plus 2 teaspoons Better Than Bouillon No-Chicken)",
    "2 16-ounce cans chickpeas (drained)",
    "2 teaspoons curry powder (or to taste)",
    "1/4 teaspoon red pepper flakes (or to taste)",
    "salt (to taste)",
    "1/2 tablespoon lemon juice (or to taste)",
    "6 servings your choice of steamed vegetables (broccoli, broccolini, and green beans are good)",
    "cooked brown rice (for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Start with a large squash that is just over 2 pounds. To make it easy to peel and chop, precook it in the Instant Pot or pressure cooker: Place a trivet in the bottom of the cooker, add 1 cup water, and place the squash on the trivet (if it won't fit, cut it in half and arrange halves on trivet.) Set pressure cooker to 8 minutes at high pressure. When cooking time is over, allow pressure to come down naturally, remove the squash, and allow it to cool until comfortable to handle. (If you do not have a pressure cooker, you may steam the squash for 15 minutes or skip this step and peel and chop it raw. You may also use pre-chopped fresh or frozen squash.)"
    },
    {
      "@type": "HowToStep",
      "text": "Peel the squash, cut it in half, and remove the seeds. Cut the squash into large chunks (about 1-inch). Set aside"
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large Dutch oven or soup pot. Add the onions and cook until they begin to brown. Then add the garlic, ginger, cumin seeds, and mustard seeds and cook for another minute (be careful not to let the spices burn.) Add the water or broth (or water plus 2 teaspoons bouillon) and the chopped squash. Bring to a boil, reduce the heat to simmer, and cover. Cook until the squash is tender, around 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the squash is tender, use a slotted spoon to remove 4 cups of the squash and onions and place it in a blender. Use a ladle to remove 3 cups of the liquid and add it to the blender. Carefully start the blender on its lowest setting to avoid splashing hot liquid. Increase the speed gradually to blend the squash into a smooth puree."
    },
    {
      "@type": "HowToStep",
      "text": "Add the pureed squash back to the soup pan along with the drained chickpeas, curry powder, and red pepper flakes. Bring to a simmer, uncovered, and cook for at least 15 minutes for flavors to blend and curry to thicken. Add salt to taste. Just before serving, add lemon juice."
    },
    {
      "@type": "HowToStep",
      "text": "Serve over rice with steamed vegetables."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2019/12/vegan-butternut-squash-curry.html"
  ],
  "updatedAt": "2022-12-02T10:08:54.771Z"
}
