{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-29T06:29:31.144Z",
  "datePublished": "2017-04-08T11:03:58+00:00",
  "description": "Three layers of rich coffee infused vegan chocolate cake are stacked with rich chocolate coconut cream frosting to create this decadent vegan chocolate mocha cake.",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2017/04/vegan-mocha-cake-2.jpg"
  ],
  "keywords": "cake, chocolate, coffee",
  "name": "Vegan Mocha Layer Cake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "718 kcal",
    "carbohydrateContent": "106.4 g",
    "fatContent": "33.7 g",
    "fiberContent": "2.7 g",
    "proteinContent": "7.3 g",
    "saturatedFatContent": "19.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "3.5 mg",
    "sugarContent": "81 g"
  },
  "prepTime": "PT70M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 1/2 cups unflavored soy or almond milk",
    "1 teaspoon white vinegar",
    "1 cup all-purpose flour",
    "1 cup whole wheat pastry flour",
    "1 1/2 cups vegan granulated sugar, (I used turbinado, but use whatever variety you've got on hand)",
    "2/3 cup cocoa powder",
    "1 tablespoon instant coffee powder",
    "2 teaspoons ground cinnamon",
    "2 teaspoons baking powder",
    "1 1/2 teaspoons baking soda",
    "1/2 teaspoon salt",
    "2/3 cup vegetable oil",
    "2 teaspoons vanilla extract",
    "3 cups vegan dark chocolate chips",
    "2 tablespoons instant coffee powder",
    "1 teaspoon ground cinnamon",
    "2 14 ounce cans coconut cream, chilled overnight until it separates",
    "Up to 1/2 cup unflavored soy or almond milk"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°. Lightly oil 3 round 9-inch cake pans, and line the bottom of each with a round of parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Stir the milk and vinegar together in a small bowl or liquid measuring cup. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Stir the flours, sugar, cocoa powder, coffee powder, cinnamon, baking powder, baking soda, and salt together in a large mixing bowl. Make a well in the center and pour in the milk mixture, oil, and vanilla extract. Beat the mixture with an electric mixer on high speed for two minutes, scraping the sides of the bowl with a rubber scraper."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the batter among the prepared cake pans. Place them into the oven and bake until a toothpick inserted into the center of each comes out clean, about 22 to 24 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pans from the oven, transfer to a cooling rack, and allow to cool completely before removing the layers from the pans."
    },
    {
      "@type": "HowToStep",
      "text": "While the cake bakes, make the frosting. Place the chocolate chips, coffee powder, and cinnamon into a medium saucepan set over low heat. Heat while stirring constantly, just until the chips melt, being careful not to let the chocolate burn. Open up the cans of coconut cream and add just the solids. Stir until fully blended with the chocolate. You can put the pan back over low heat briefly if needed to help this along."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the mixture to a bowl and place it into the refrigerator. Chill for 1 to 2 hours, until the mixture is firm (like ganache). Scrape the mixture into a mixing bowl and beat it on high speed with an electric mixer until very light and fluffy. If the mixture is very dense you can add some non-dairy milk as you whip it, but just add a bit at a time, as it will get runny very quickly if you add too much."
    },
    {
      "@type": "HowToStep",
      "text": "Once the cake layers are cool, remove them from the pans. Set a layer on a dish and spread the top with about 1 cup of the frosting. Top with a second layer, inverted, and spread the top of that layer with another cup of frosting. Top with the third layer, also inverted, and use the remaining frosting to coat the top and outsides of the cake."
    },
    {
      "@type": "HowToStep",
      "text": "Slice and serve."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-chocolate-mocha-layer-cake"
  ],
  "totalTime": "PT95M",
  "updatedAt": "2022-11-29T06:29:31.142Z"
}
