{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "createdAt": "2022-12-02T02:58:36.583Z",
  "datePublished": "2021-11-23T06:00:00+00:00",
  "description": "The BEST Vegan Chocolate Cheesecake featuring crunchy, buttery, cookie crust with rich, creamy, velvety smooth and super chocolatey cheesecake filling. This easy no bake vegan cheesecake is quick to make and keeps for ages so you can prepare it well ahead. Directions for a scaled down smaller version also included for those not feeding a crowd.",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Chocolate-Cheesecake-A-Virtual-Vegan-16.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Chocolate-Cheesecake-A-Virtual-Vegan-16-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Chocolate-Cheesecake-A-Virtual-Vegan-16-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Chocolate-Cheesecake-A-Virtual-Vegan-16-480x270.jpg"
  ],
  "keywords": "cheesecake, chocolate cheesecake, no bake cheesecake, vegan cheesecake",
  "name": "Vegan Chocolate Cheesecake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "472 kcal",
    "carbohydrateContent": "50 g",
    "fatContent": "32 g",
    "fiberContent": "5 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "13 g",
    "servingSize": "1 of 16 slices",
    "sodiumContent": "571 mg",
    "sugarContent": "34 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "6 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "36 (15 oz / 414 grams) chocolate sandwich cookies (, such as Oreos or Newman O's (use gluten-free Oreos to make the recipe GF)",
    "9 tablespoons (135 mls) melted vegan butter",
    "1 cup (240 mls) canned coconut milk (, must be full fat not light)",
    "13 oz (360 grams) dairy-free chocolate (, bars or chips)",
    "1 1/2 cup (180 grams) powdered sugar (, icing sugar in the UK)",
    "3 tablespoons (22 grams) cocoa powder",
    "1 1/2 teaspoons fine sea salt (, not table salt)",
    "1 tablespoon (15 mls) apple cider vinegar",
    "1 tablespoon (15 mls) vanilla extract",
    "(OPTIONAL) 2 teaspoons finely ground espresso (, or any other finely ground coffee beans)",
    "3 x 8 oz (227 grams) vegan cream cheese (, Tofutti works best)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Grease the base of a 9-inch springform pan with a little vegan butter, then lay a large square of parchment paper over it. (To scale the recipe down to fit a 6-inch pan see the recipe notes). Press it with your hands to stick it down onto the butter. Then clip the sides onto the pan over the paper so the excess paper sticks out around the edges. There is a picture of this in the post above. By doing this, when the cheesecake is set, you can easily pull it off the base of the pan and slide it onto a plate or cake stand, then pull the paper out from under it once it's in place. If you don't have a springform pan and are using a loose bottomed push up pan, line the bottom with a circle of paper."
    },
    {
      "@type": "HowToStep",
      "text": "In a food processor fitted with a metal blade, blend the chocolate sandwich cookies (with the cream filling) until very fine crumbs form. If you don't have a food processor put the cookies in a ziplock bag, seal it making sure to squeeze out the air, then bash them with a rolling pin."
    },
    {
      "@type": "HowToStep",
      "text": "Pour in the melted butter and pulse until all crumbs are completely coated and moist. If you crushed the cookies in a bag, transfer the crumbs to a bowl and stir through the butter."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon the buttery cookie crumbs into the pan and press down all over so they are flat, even and compact. The bottom of a measuring cup or jar works well. Then put it in the fridge while you make the filling."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the coconut milk until hot but not boiling. If you have a microwave pour it into a bowl and heat it on full power for a minute or two. If you don't, put it in a small pan on the stove and warm until hot but not boiling."
    },
    {
      "@type": "HowToStep",
      "text": "Break the chocolate up into small pieces and add it to a large bowl (or your stand mixer bowl if you have one), then pour over the hot coconut milk. Stir until the chocolate is melted and combined with the milk. Once it's done set aside and let it come back to room temperature."
    },
    {
      "@type": "HowToStep",
      "text": "Once the chocolate mixture has cooled, add the powdered sugar, cocoa powder, salt, apple cider vinegar, vanilla and optional espresso powder. Stir briefly. Don't worry about mixing it in properly, you just want the powdered ingredients to be wet so they don't fly everywhere when you beat the cream cheese in."
    },
    {
      "@type": "HowToStep",
      "text": "Add the cream cheese, and using an electric mixer beat on low until everything is combined, then turn up the speed to high and keep beating for another 3 to 4 minutes to trap lots of air in the mixture and make your filling lighter."
    },
    {
      "@type": "HowToStep",
      "text": "Take the crust out of the fridge and spoon over the cheesecake filling. Level the top with a spatula, make some nice swirly patterns, then place in the fridge to set for at least 4 hours. TIP: Place a dinner plate or some cling wrap over the top of the pan just in case someone drops something on it. (I ended up with a brussels sprout embedded in the top of mine the first time I made it 🤣)"
    },
    {
      "@type": "HowToStep",
      "text": "Once it's set, remove the sides of the pan and using the parchment paper, slide it onto your serving plate or cake stand. Using a spatula carefully lift one side and slide the paper out."
    },
    {
      "@type": "HowToStep",
      "text": "Before serving I recommend allowing it to sit out at room temperature for at least 30 minutes for the very best flavour and texture."
    },
    {
      "@type": "HowToStep",
      "text": "For the best cleanly cut slices, run a large sharp knife under hot water, dry with a towel, then cut. Repeat for each slice."
    }
  ],
  "recipeYield": "16",
  "sameAs": [
    "https://avirtualvegan.com/vegan-chocolate-cheesecake"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-12-02T02:58:36.581Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/xD6Td3Ik.mp4",
    "description": "The BEST Vegan Chocolate Cheesecake featuring crunchy, buttery, cookie crust with rich, creamy, velvety smooth and super chocolatey cheesecake filling. This easy no bake vegan cheesecake is quick to make and keeps for ages so you can prepare it well ahead when entertaining. Directions for a scaled down smaller version also included for those not feeding a crowd. No-one will have a clue this is vegan!",
    "name": "Vegan Chocolate Cheesecake",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/xD6Td3Ik-720.jpg",
    "uploadDate": "2022-03-21T19:52:25.000Z"
  }
}
