{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "4.27"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT3M",
  "createdAt": "2022-12-04T12:49:00.150Z",
  "datePublished": "2016-07-16T05:00:10+00:00",
  "description": "Decadent vegan Milky Way made with date-coconut-almond nougat, date caramel, and a dark chocolate shell! 6 ingredients, 30 minutes, so delicious!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/06/Vegan-Milky-Ways-SQUARE.jpg"
  ],
  "keywords": "milky way",
  "name": "Vegan Milky Way",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "343 kcal",
    "carbohydrateContent": "42.5 g",
    "fatContent": "18.9 g",
    "fiberContent": "5.7 g",
    "proteinContent": "5.1 g",
    "saturatedFatContent": "11.4 g",
    "servingSize": "1 bars",
    "sodiumContent": "179 mg",
    "sugarContent": "34.1 g"
  },
  "prepTime": "PT27M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "15 whole pitted medjool dates (weight measured after pitting)",
    "1/2 cup almond flour*",
    "1/2 cup coconut flour",
    "1/4 tsp sea salt",
    "30 whole pitted medjool dates (weight measured after pitting)",
    "3-8 Tbsp water",
    "1 1/4 cup chopped vegan dark chocolate (I like Trader Joe's 72% cacao Pound Plus bars)",
    "1 Tbsp coconut oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make nougat by adding dates to a food processor and blending until small bits remain or it forms a ball. Then add almond and coconut flour and sea salt. Mix/pulse to combine, scraping down sides as needed. You're looking for a semi-firm dough that isn't sticky. If too sticky, add in 1 Tbsp each almond flour and coconut flour at a time until you reach the right consistency."
    },
    {
      "@type": "HowToStep",
      "text": "Once your dough is formed, add to a parchment-lined standard loaf pan (or more pans, as needed, if increasing batch size) and press down to form a uniform layer. Use something flat - such as a liquid measuring cup or glass - to help flatten. Then lift out of loaf pan and use your hands to shape any areas that are lumpy and compress it slightly until you have a rectangular nougat that is roughly 1/2-inch thick."
    },
    {
      "@type": "HowToStep",
      "text": "Slice nougat into 6 even bars (amount as original recipe is written // adjust if altering batch size) and set on a parchment-lined plate or baking sheet and pop in freezer to set."
    },
    {
      "@type": "HowToStep",
      "text": "To make date caramel add dates to a food processor or high speed blender and mix until small bits remain or it forms a ball. Then begin adding warm water 1 Tbsp at a time while blending, scraping down sides as needed. You're looking for a spreadable consistency that isn't watery, but also isn't dough-like. Add salt and mix once more. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Remove nougat from freezer and spread with a generous amount (~2 Tbsp) of date caramel (see photo). You will likely have leftover date caramel*, which you can store in the refrigerator to use for things like ice cream, oatmeal, or other candy bars!"
    },
    {
      "@type": "HowToStep",
      "text": "Set nougat back in freezer while you prepare chocolate. To melt chocolate and coconut oil, either heat in the microwave in 30-second increments until creamy and smooth, or over a double boiler on the stove top. Transfer to a shallow dish and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Remove nougat from freezer and quickly add one at a time to the melted chocolate. Use a fork to gently flip/roll the bar until completely coated. Then pick it up (nougat side down - caramel side up) and tap off any excess chocolate. Set back on parchment and repeat until all bars are dipped."
    },
    {
      "@type": "HowToStep",
      "text": "Either let set at room temperature, or pop in the refrigerator or freezer for 5-10 minutes until the chocolate is firm."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy at room temperature, or straight from the freezer or refrigerator. Will keep in the refrigerator for 2 weeks, or in the freezer up to 1 month (sometimes longer)."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://minimalistbaker.com/vegan-milky-way"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-04T12:49:00.148Z"
}
