{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "13",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-12-02T11:03:49.503Z",
  "datePublished": "2022-01-22T04:55:45+00:00",
  "description": "Restaurant-Style Masoor Dal Tadka (Indian split Red lentil Dal tempered with whole spices) is easy and to make, super comforting, creamy, and oh so flavorful! Glutenfree Soyfree nutfree coconutfree",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/01/Masoor-Dal-Tadka-9109.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/01/Masoor-Dal-Tadka-9109-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/01/Masoor-Dal-Tadka-9109-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/01/Masoor-Dal-Tadka-9109-480x270.jpg"
  ],
  "keywords": "masoor dal",
  "name": "Vegan Masoor Dal Tadka Indian Split Red Lentil Dal",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "222 kcal",
    "carbohydrateContent": "32 g",
    "fatContent": "5 g",
    "fiberContent": "15 g",
    "proteinContent": "13 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "452 mg",
    "sugarContent": "3 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "1 cup split red lentils (, masoor dal)",
    "3 cups water",
    "1/2 teaspoon salt",
    "1/4 teaspoon turmeric",
    "1 teaspoons oil",
    "1 medium-size red onion (thinly sliced)",
    "2 garlic cloves (minced)",
    "1 teaspoon minced ginger",
    "1 teaspoon ground coriander",
    "1/2 teaspoon ground cumin",
    "1 medium tomato (chopped)",
    "1/4 teaspoon salt",
    "1 tablespoon yogurt or 2 tablespoon coconut cream",
    "2 teaspoons oil",
    "1/2 teaspoon cumin seeds",
    "2 bay leaves",
    "2 hot indian green chilies or serrano pepper (slit or sliced or use 2 dried red chili instead or use mild chilies of choice )",
    "1/2 teaspoon dried fenugreek leaves (kasuri methi)",
    "1 garlic clove (julienned)",
    "1/2 inch ginger (thinly sliced or julienned)",
    "1/4 teaspoon paprika",
    "a good pinch of ground cloves",
    "cilantro and lemon juice for garnish"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make your dal: Wash the lentils really well then soak in water for 10 minutes. Drain then add to a saucepan with the water, salt, and turmeric and cook over medium heat until the lentils are cooked to preference. Partially cover and cook so that the water doesn't completely evaporate. You can add more water after 15 minutes if the lentils are too thick. Depending on your stove and saucepan, you'll need 15-20 minutes for the lentils to cook.Instant Pot: To cook the lentils in an instant pot, pressure cook for 3 minutes, then quick release after 10 mins."
    },
    {
      "@type": "HowToStep",
      "text": "Make the first tempering: In a medium skillet, add the oil, add the onion and garlic and a good pinch of salt and cook until the onion is golden brown. You can add few drops of water in between to deglaze if the onion is starting to scorch too much or sticking to the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Once the onion is golden brown, transfer half of the mixture to another bowl to use as garnish later. Add in the ginger, coriander, cumin and mix well."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for a minute then add your tomato and 2 tablespoons water and 1/4 teaspoon salt. Mix well and cook until the tomato is tender."
    },
    {
      "@type": "HowToStep",
      "text": "Mash the large pieces and add in 1 tablespoon yogurt or 2 tablespoons of non-dairy cream such as cashew cream or coconut cream and mix in."
    },
    {
      "@type": "HowToStep",
      "text": "Then mix the cooked dal in this tempering and bring to a boil. Taste and adjust salt and flavor. (Adjust consistency at this point to preference. Add more water for thinner dal and bring to just about a boil ) Transfer the masoor dal to your serving dish."
    },
    {
      "@type": "HowToStep",
      "text": "Now make the second tempering: heat the oil in a small skillet. Once the oil is hot, add the cumin seeds and wait for the cumin seeds to change color and get fragrant. You should smell toasty cumin seeds far and wide!"
    },
    {
      "@type": "HowToStep",
      "text": "Add the bay leaves, green chilies, kasuri methi, ginger, garlic, and mix well and cook until the green chilies and garlic are somewhat golden."
    },
    {
      "@type": "HowToStep",
      "text": "Add in the paprika, ground cloves, mix in and take off heat."
    },
    {
      "@type": "HowToStep",
      "text": "Add the reserved caramelized onion as well and swirl it in. Drizzle the tempering all over the dal in the serving dish."
    },
    {
      "@type": "HowToStep",
      "text": "Garnish with some cilantro and some lemon juice if needed. Serve with some Gobi aloo (cauliflower potatoes), bhindi masala (okra), cabbage, or poriyal (spiced green bean carrot ). Serve with Naan or Glutenfree flatbread or basmati rice."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/masoor-dal-tadka-indian-red-lentil-dal"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-02T11:03:49.502Z"
}
