{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "62",
    "ratingValue": "4.94"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T07:32:00.837Z",
  "datePublished": "2019-12-01T04:18:47+00:00",
  "description": "Vegan Omelet with Delicious Breakfast Potatoes. Mung Bean egg mixture makes a great soy-free egg substitute. Easy Moong Dal Batter for omelets or savory pancakes. No Chickpea flour! Vegan Gluten-free Grain-free soy-free Recipe Nut-free option.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2019/11/Vegan-Omelet-with-Moong-Dal-Stuffed-with-Breakfast-Potatoes-veganricha-4322.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/11/Vegan-Omelet-with-Moong-Dal-Stuffed-with-Breakfast-Potatoes-veganricha-4322-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/11/Vegan-Omelet-with-Moong-Dal-Stuffed-with-Breakfast-Potatoes-veganricha-4322-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2019/11/Vegan-Omelet-with-Moong-Dal-Stuffed-with-Breakfast-Potatoes-veganricha-4322-480x270.jpg"
  ],
  "keywords": "mung bean egg substitute, mung bean eggs, vegan egg omelet, vegan mung omelet",
  "name": "Vegan Omelet with Mung Bean Egg Substitute",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "201.69 kcal",
    "carbohydrateContent": "30.73 g",
    "fatContent": "2.46 g",
    "fiberContent": "5.23 g",
    "proteinContent": "13.45 g",
    "saturatedFatContent": "0.08 g",
    "servingSize": "1 serving",
    "sodiumContent": "332.58 mg",
    "sugarContent": "1.11 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 cup moong dal (split Mung beans)",
    "1/2 tsp salt",
    "3/4 tsp kala namak (Indian sulphur salt)",
    "1/4 tsp each garlic powder, onion powder",
    "1/8 tsp black pepper",
    "1/4 tsp turmeric (for color. too much will add flavor)",
    "1 tsp oil",
    "1 to 1 1/4 cup non dairy milk such as",
    "2 potatoes (, cubed to a 1/4 inch )",
    "1/2 onion (, finely chopped)",
    "3 cloves garlic (, finely chopped)",
    "1 cup bell pepper (, finely chopped, red or green or both)",
    "1/2 tsp thyme + rosemary",
    "1/4 tsp cayenne",
    "a good dash of black pepper",
    "2 tsp oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Wash and then soak the Moong Dal/split Mung Beans in 3 cups water overnight or atleast 8 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Drain and add to a blender. Add the rest of the ingredients and 1 cup non dairy milk. Blend for a minute, then let it rest and blend again for another minute. The mixture should be smooth and fluffy. Depending on the thickness of the omelet you prefer, you can add 2-4 tbsp more non dairy milk. For extra fluffy omelet, add 1 tsp baking powder and blend again."
    },
    {
      "@type": "HowToStep",
      "text": "I like to use this mix fresh as its fluffy without needing the baking powder and the kala namak flavor is stronger."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a cast iron or non stick thick bottom skillet over medium heat. When hot, drizzle a few drops of oil and spread using a paper towel."
    },
    {
      "@type": "HowToStep",
      "text": "For plain omelet, add a ladleful (1/3 cup or more) of the batter and spread using the ladle or by moving the skillet. Cover the skillet with a lid and cook for 1-3 mins. Time will depend on the stove, pan and thickness of the batter. Once the edges are dry and the center just about getting dry, loosen from the skillet and flip. Continue to cook for another minute and serve stuffed with breakfast potatoes or roasted veggies."
    },
    {
      "@type": "HowToStep",
      "text": "For a veggie omelet: Add the veggies such as thinly sliced onion, red bell pepper etc to the skillet. Add a few drop of oil and cook for a minute. Add greens such as finely chopped spinach or fresh herbs and mix in. Drizzle enough batter on the skillet to cover the veggies. Cover the skillet with a lid and cook for 1-3 minutes. then flip and cook for another 1-2 minutes. You can add some vegan cheese on top and fold over(optional). Serve immediately with dressings of choice and toast."
    },
    {
      "@type": "HowToStep",
      "text": "Make the Breakfast Potatoes: Add all of the ingredients except oil to a baking dish. Drizzle oil and mix well so coat evenly. Bake at 400 deg F (205 C) for 25 tot 35 minutes or until the potatoes are tender. Broil for a minute."
    },
    {
      "@type": "HowToStep",
      "text": "Store: You can refrigerate the batter as well as the cooked omelet for upto 2 days. Refrigerate the cooked omelets in a closed container. The batter might separate slightly, just blend and use."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganricha.com/vegan-omelet-with-mung-bean-egg"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-03T07:32:00.834Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=Vra0MKrjSYs",
    "description": "Vegan Omelet with Delicious Breakfast Potatoes. Mung Bean egg mixture makes a great soy-free egg substitute. Easy Moong Dal Batter for omelets or savory pancakes. No Chickpea flour! \nFULL RECIPE: https://www.veganricha.com/2019/12/vegan-omelet-with-mung-bean-egg.html\n\nMung bean is used in Indian cuisine to make pancakes, crepes format snack or breakfast. Moong Dal, which is split and skinned green Mung bean, has a nutty flavor (milder than chickpea flour) and makes for a great option to use to make egg-free omelets.\r\n\nI posted a moong dal omelet way back in 2013. At that time Moong dal was available in Indian stores and some other stores, hence the recipe didn’t get as many remakes. Mung bean dal is much more easily available now in many regular grocery stores and amazon and is used in many of my recipes.\r\n\r\nAs with any vegani-zed version of dishes, they are dependent on personal preference. Everyone prefers various textures and format of the egg and omelet. This moong dal batter is very flexible to flavor and texture. Play around with additional flavors and adjusting the consistency and cooking time for your preferred vegan omelet.\nVegan Gluten-free Grain-free soy-free Recipe Nut-free option.\n\n#veganricha #veganomelet #mungomelet #easyveganrecipes #veganbreakfast \nMusic: Epidemic sound",
    "duration": "PT1M16S",
    "embedUrl": "https://www.youtube.com/embed/Vra0MKrjSYs?feature=oembed",
    "name": "VEGAN OMELET WITH MUNG BEAN “EGG” | Vegan Richa Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/Vra0MKrjSYs/hqdefault.jpg",
    "uploadDate": "2019-12-11T20:02:17+00:00"
  }
}
