{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "55",
    "ratingValue": "4.39"
  },
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT73M",
  "createdAt": "2022-12-02T13:59:37.660Z",
  "datePublished": "2015-09-10T12:45:43+00:00",
  "description": "Savory mushrooms and carrots in a rich wine sauce, the perfect cozy and romantic winter dish. This will please everyone at your table.&nbsp;",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2015/09/Mushroom-Bourguignonne-6-1.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/09/Mushroom-Bourguignonne-6-1-500x500.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/09/Mushroom-Bourguignonne-6-1-500x375.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/09/Mushroom-Bourguignonne-6-1-480x270.jpg"
  ],
  "keywords": "vegan mushroom bourguignon",
  "name": "Vegan Mushroom Bourguignon",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "608 kcal",
    "carbohydrateContent": "93 g",
    "cholesterolContent": "66 mg",
    "fatContent": "13 g",
    "fiberContent": "13 g",
    "proteinContent": "18 g",
    "saturatedFatContent": "2 g",
    "servingSize": "0.5 cup",
    "sodiumContent": "1297 mg",
    "sugarContent": "14 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "8 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "French",
  "recipeIngredient": [
    "2 tablespoon olive oil (divided)",
    "2 lb mushroom caps (we prefer baby Portobellos, stems off and sliced thick)",
    "6 large carrots peeled and sliced into 1 inch (2.5 cm circles)",
    "1 large yellow onion peeled and diced",
    "1 large shallot peeled and sliced thin",
    "2 garlic cloves peeled and minced",
    "2 cups vegetable broth",
    "1 1/2 cups red wine",
    "1 tablespoon tomato paste",
    "2 teaspoon ground sea salt (or to taste)",
    "2 tablespoon fresh thyme leaves (plus extra for garnishing)",
    "2 teaspoon dried Italian seasoning",
    "Black pepper to taste",
    "1 tablespoon + 1 tsp all-purpose flour (use cornstarch to make it gluten free)",
    "1/3 cup water",
    "1 1 lb package of fettucine"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Fill a pasta pot with water and heat on medium to warm the water."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large skillet on medium heat and add 1 tbsp (15 ml) of olive oil. When the oil is hot, add the mushrooms and a pinch of salt, sauté for approximately ten minutes or until browned. Remove from the pan and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining olive oil and the carrots. Sauté until they begin to brown then add the onions. Cook the onions until they become translucent then add the shallots. Cook until they are browned and caramelized, approximately 5 to 7 minutes. Add the garlic and cook for one minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add the vegetable broth and wine to deglaze the pan. Stir and loosen the pieces of onion and shallot that may have stuck to the pan. Add the tomato paste and stir until it liquefies. Add the salt, thyme, Italian seasoning, and pepper, stir to combine and reduce the heat to a low simmer. Cover and cook for twenty minutes. Add more seasoning if you prefer a stronger flavor."
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, mix the flour (or corn starch if you want to make it gluten free) and water together until the flour breaks down and the mixture resembles a thick milky substance. There shouldn’t be any dry flour or lumps in the mixture. Add it to the wine sauce and stir well to combine. Add the mushrooms and stir to incorporate within the sauce. Cover and simmer on the lowest temperature for twenty minutes. The sauce will thicken into a stew. Be sure to lift the lid and check to make sure it’s not sticking to the pan or evaporating. That shouldn’t happen if the temperature is low enough, but if it does add a small amount of broth or water and stir."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the heat for the pasta water to high and bring to a boil."
    },
    {
      "@type": "HowToStep",
      "text": "Twelve minutes before the sauce is done, salt the pasta water (approximately 1 tbsp (15 g) and add the fettucine to the water. Cook according to the directions on the package."
    },
    {
      "@type": "HowToStep",
      "text": "Divide the fettucine by four and make a nest in the center of each plate. Spoon the mushroom Bourguignon on top of the fettucine. Garnish with a sprinkle of fresh thyme leaves."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganosity.com/vegan-mushroom-bourguignonne"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet"
  ],
  "totalTime": "PT88M",
  "updatedAt": "2022-12-02T13:59:37.659Z"
}
