{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "4.79"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT80M",
  "createdAt": "2022-12-05T04:48:27.474Z",
  "datePublished": "2016-11-22T05:00:08+00:00",
  "description": "Savory, flavorful, tender cornbread stuffing with roasted cranberries, sautéed leeks and onions, and pecans. A healthier plant-based side for any occasion.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/11/INCREDIBLE-Vegan-Gluten-Free-CORNBREAD-STUFFING-10-ingredients-tender-flavorful-savory-vegan-glutenfree-stuffing-cornbread-recipe-thanksgiving.jpg"
  ],
  "keywords": "cornbread stuffing",
  "name": "Vegan Cornbread Stuffing (GF Optional)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "384 kcal",
    "carbohydrateContent": "50.5 g",
    "fatContent": "18.3 g",
    "fiberContent": "4.4 g",
    "proteinContent": "5.4 g",
    "saturatedFatContent": "7.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "484 mg",
    "sugarContent": "19 g"
  },
  "prepTime": "PT1560M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free (optional)",
  "recipeIngredient": [
    "2 batches of my Perfect Vegan Cornbread or my Best Vegan Gluten-Free Cornbread",
    "12 ounces fresh cranberries, rinsed",
    "1/4 cup water (or sub orange juice for more flavor!)",
    "1/4 cup maple syrup (to taste)",
    "Double batch cornbread",
    "2 Tbsp olive oil or vegan butter",
    "1 medium white or yellow onion (diced)",
    "2 medium leeks (thinly sliced // ~2 cups as original recipe is written)",
    "1 healthy pinch each salt and black pepper (plus more to taste)",
    "1 tsp dried thyme",
    "2/3 cup chopped raw pecans or walnuts (optional)",
    "2 cups vegetable broth"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make your double batch (amount as original recipe is written // adjust if altering batch size) cornbread at least 1 day in advance so it can be cooled, cubed, and then left to dry at room temperature uncovered for 24 hours. This keeps the stuffing from becoming mushy, and allows the cornbread to absorb more of the vegetable broth."
    },
    {
      "@type": "HowToStep",
      "text": "Once your cornbread has been dried, begin by preheating oven to 400 degrees F (204 C) and adding cranberries to a small baking dish. Top with water (or orange juice) and maple syrup. Toss to combine, then bake for 20 minutes, or until bubbly and soft. Set aside and reduce oven heat to 375 F (190 C)."
    },
    {
      "@type": "HowToStep",
      "text": "While cranberries are baking, heat a large skillet over medium heat. Once hot, add olive oil, onion, leeks and a healthy pinch of salt and black pepper. Sauté, stirring frequently, until soft and fragrant. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add the dried cornbread to a large mixing bowl along with leeks, thyme, and pecans or walnuts (optional). Then add another healthy pinch each salt and black pepper and the vegetable broth, starting with half (1 cup or 240 ml as original recipe is written // adjust if altering batch size) and working your way up to 2, stirring gently as you go. You aren't looking to make a purée out of the mixture, but rather gently toss and incorporate the flavors. I found 2 cups (480 ml) to be the perfect amount (amount as original recipe is written // adjust if altering batch size). You want the cornbread to be moistened but not saturated."
    },
    {
      "@type": "HowToStep",
      "text": "Add cranberries and gently stir once more (In the photos I added them at the very end, but after more testing found they get better incorporated when stirred in at this point)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer a greased 9x13-inch (or similar size // adjust number or amount if altering batch size) baking dish (like this one), and use a spoon or spatula to spread into an even layer. Cover with foil and bake 25 minutes, then uncover and bake another 30-40 minutes, or until golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Let rest 5-10 minutes before serving. Leftovers store well in the refrigerator up to 5 days, though best when fresh."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://minimalistbaker.com/vegan-cornbread-stuffing"
  ],
  "totalTime": "PT1640M",
  "updatedAt": "2022-12-05T04:48:27.473Z"
}
