{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "16",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-11-29T03:53:39.329Z",
  "datePublished": "2017-12-03T10:50:56+00:00",
  "description": "A savory mix of sauteed cremini mushrooms, fresh herbs and luscious cashew cream is tossed with noodles to create this hearty and comforting vegan mushroom stroganoff.",
  "image": {
    "@type": "ImageObject",
    "height": 1050,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2016/12/vegan-mushroom-stroganoff-3-of-5.jpg",
    "width": 700
  },
  "keywords": "creamy vegan pasta, vegan dinner recipes, vegan pasta recipe",
  "name": "Vegan Mushroom Stroganoff",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "387 kcal",
    "carbohydrateContent": "39.8 g",
    "fatContent": "19.7 g",
    "fiberContent": "2.5 g",
    "proteinContent": "11.4 g",
    "saturatedFatContent": "3.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "912 mg",
    "sugarContent": "4.6 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "6 ounces dried rotini pasta (or your favorite type of pasta)",
    "1/2 cup raw cashews, (soaked 4 to 8 hours and drained)",
    "3/4 cup vegetable broth (divided)",
    "3 tablespoons olive oil, (divided)",
    "1 pound cremini mushrooms, (cleaned and coarsely chopped)",
    "1 large onion, (diced)",
    "1/4 cup dry sherry",
    "1 tablespoon finely chopped fresh rosemary",
    "1 tablespoon all-purpose flour",
    "2 tablespoons soy sauce",
    "1 1/2 teaspoons red wine vinegar",
    "Salt and pepper to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Bring a medium pot of water to a boil and add the pasta. Cook the according to package directions, then drain it into a colander. Return the pasta to the pot and toss with a dash of olive oil."
    },
    {
      "@type": "HowToStep",
      "text": "While the pasta cooks, place the cashews and 1/2 cup of vegetable broth into a blender and blend until smooth. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large pot with 2 tablespoons of olive oil and place it over medium heat. Add the mushrooms in an even layer. Cook until they're browned on the bottoms, about 5 minutes, then flip and cook about 5 minutes more on the opposite sides. Transfer the mushrooms to a plate."
    },
    {
      "@type": "HowToStep",
      "text": "Add the remaining tablespoon of oil to the pot. When oil is hot, add the onion, and sauté until soft and translucent, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Return the mushrooms to the pot, and add the sherry and rosemary. Bring everything to a simmer and allow it to cook until most of the liquid has cooked off, about 4 minutes. Add the flour to the pot and stir to form a paste that coats the mushrooms. Add the remaining 1/4 cup of broth, soy sauce and red wine vinegar to the pot. Bring the mixture to a simmer and allow it to cook for 5 minutes, stirring occasionally. Stir in the cashew mixture and pasta, and cook just a minute or two longer, until heated throughout."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pot from the heat and season with salt and pepper to taste. Garnish with some fresh parsley if you like. Serve."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-mushroom-stroganoff"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-29T03:53:39.326Z"
}
