{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "createdAt": "2022-12-04T04:37:20.181Z",
  "datePublished": "2015-03-18T10:20:00+00:00",
  "description": "Creamy, bite-sized banana cream pies - made vegan! This recipe requires a couple of do-ahead steps (namely, soaking the cashews and chilling the coconut milk for the whipped cream), so be sure to plan for that.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2015/03/vegan-banana-cream-pie-mini-tarts4.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2015/03/vegan-banana-cream-pie-mini-tarts4-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2015/03/vegan-banana-cream-pie-mini-tarts4-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2015/03/vegan-banana-cream-pie-mini-tarts4-480x270.jpg"
  ],
  "keywords": "banana cream pie dessert, tart recipe, vegan banana cream pie, Vegan Banana Cream Pie Mini Tarts",
  "name": "Vegan Banana Cream Pie Mini Tarts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "65 kcal",
    "carbohydrateContent": "8 g",
    "fatContent": "4 g",
    "fiberContent": "1 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "8 mg",
    "sugarContent": "3 g",
    "unsaturatedFatContent": "2 g"
  },
  "prepTime": "PT380M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 cup raw cashews",
    "3 medium bananas (divided*)",
    "3 tablespoons fresh lime juice (from 1-2 medium limes, divided)",
    "2 tablespoons coconut milk or almond milk",
    "1 tablespoon coconut oil",
    "1 tablespoon maple syrup",
    "Pinch of salt",
    "24 frozen baked phyllo tart shells (thawed (I used Athens brand)",
    "1 batch coconut whipped cream"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Several hours before making the tarts, place the cashews in a medium bowl and cover with 3 cups water. Soak the cashews for 4-6 hours, then drain and rinse. You'll also want to put the coconut milk (for the coconut whipped cream) into the refrigerator to chill."
    },
    {
      "@type": "HowToStep",
      "text": "To make the banana cream filling, place the soaked cashews into the pitcher of a blender or a food processor fitted with an S-blade. Add 2 bananas, 2 tablespoons lime juice, coconut milk or almond milk, coconut oil, syrup and salt. Puree until completely smooth, about 1 minute. Spoon the filling into a medium container with an airtight lid. Cover the top of the pudding with plastic wrap, taking care to expel any air bubbles - the less the filling is exposed to the air, the less brown it will turn. Cover with the lid and refrigerate until chilled, 1-2 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Set the tart shells out. Spoon the filling into a pastry bag affixed with the tip of your choice or a zipper bag with the corner snipped off. Pipe the filling into the tart shells, dividing evenly between each shell (depending on your shells, you should be able to fill them almost to the top)."
    },
    {
      "@type": "HowToStep",
      "text": "Make the coconut whipped cream by following this tutorial for how to make coconut milk whipped cream."
    },
    {
      "@type": "HowToStep",
      "text": "Place the coconut whipped cream into another pastry bag or zipper bag and pipe over the top of the banana filling. If you'd like to avoid the pudding turning brown on the top, take care to cover the filling entirely with the whipped cream, so that it's not exposed to the air."
    },
    {
      "@type": "HowToStep",
      "text": "Thinly slice the remaining banana and place it on a plate or in a bowl. Drizzle remaining 1 tablespoon lime juice over the tops of the bananas and toss gently. Top each tart with a banana slice."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://ohmyveggies.com/vegan-banana-cream-pie-tart"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet",
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT380M",
  "updatedAt": "2022-12-04T04:37:20.178Z"
}
