{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-29T05:49:04.220Z",
  "datePublished": "2017-09-17T12:01:59+00:00",
  "description": "Fluffy dairy-free biscuits are topped with savory mushroom and chickpea gravy to make this hearty comfort food breakfast. This vegan biscuits and gravy will knock your socks off!",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2017/09/vegan-biscuits-and-gravy-1-of-1.jpg"
  ],
  "keywords": "chickpeas, dairy-free biscuits, mushrooms",
  "name": "Vegan Biscuits & Gravy",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "653 kcal",
    "carbohydrateContent": "90.4 g",
    "fatContent": "26.5 g",
    "fiberContent": "8.6 g",
    "proteinContent": "15.6 g",
    "saturatedFatContent": "3.8 g",
    "servingSize": "1 serving",
    "sodiumContent": "1884 mg",
    "sugarContent": "6.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 cups all-purpose flour",
    "1 1/2 tablespoons baking powder",
    "1 teaspoon granulated sugar (use organic to ensure it's vegan)",
    "1 teaspoon salt",
    "1/3 cup vegan butter (chilled)",
    "3/4 cup unflavored (unsweetend soy or almond milk, chilled)",
    "1 14 ounce can chickpeas, drained and rinsed",
    "6 ounces cremini mushrooms",
    "2 tablespoons olive oil",
    "1 medium onion (diced)",
    "2 garlic cloves (minced)",
    "1 teaspoon rubbed sage",
    "1 teaspoon dried thyme",
    "1/2 teaspoon black pepper",
    "1/4 teaspoon ground nutmeg",
    "1/4 cup all-purpose flour",
    "3 cups unflavored (unsweetend soy or almond milk)",
    "3 tablespoons soy sauce",
    "1 tablespoon maple syrup",
    "1 teaspoon liquid smoke"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 425° and line a baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium mixing bowl, stir together the flour, baking powder, sugar, and salt. Add the butter and cut it in with a pastry cutter or fork, unti the mixture resembles fine crumbs. Pour in the milk and stir to form a soft dough."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the dough to a lightly floured work surface. Press or roll into a 9 x 9 inch square. Fold the dough over itself and press or roll again until it's about the same size. Repeat 3 or 4 times, then use a 3-inch biscuit cutter or drinking glass to cut the dough into circles. Transfer them to the baking sheet and bake until the biscuits are fluffy and lightly browned, 12-14 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the biscuits bake, place the chickpeas and mushrooms into a food processor bowl and pulse until finely chopped, but be careful not to overblend them."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly coat the bottom of a medium pot with oil and place it over medium heat. When the oil is hot, add the onion and sauté for about 5 minutes, until soft and translucent. Add the garlic and sauté one minute more, until very fragrant. Add the chickpea mixture and continue to sauté for about 4 minutes more, until the mushrooms begin to release their juices. Add the sage, thyme, black pepper, nutmeg, and flour, and stir a few times until everything is evenly mixed and coated in flour. Stir in the milk, soy sauce, maple syrup and liquid smoke. Raise heat and bring to a boil. Lower heat and allow the mixture to simmer for about 20 minutes, until nicely thickened up, stirring occasionally."
    },
    {
      "@type": "HowToStep",
      "text": "Split the biscuits open and divide them onto plates. Top with gravy and serve."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-biscuits-gravy"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-11-29T05:49:04.219Z"
}
