{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "4.43"
  },
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-12-02T12:50:38.278Z",
  "datePublished": "2019-11-07T17:19:36+00:00",
  "description": "A savory, moist lentil loaf with seared vegetables and a wonderful umami taste. This will satisfy everyone at the table.",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2019/11/Lentil-Loaf-11.jpg",
    "https://www.veganosity.com/wp-content/uploads/2019/11/Lentil-Loaf-11-500x500.jpg",
    "https://www.veganosity.com/wp-content/uploads/2019/11/Lentil-Loaf-11-500x375.jpg",
    "https://www.veganosity.com/wp-content/uploads/2019/11/Lentil-Loaf-11-480x270.jpg"
  ],
  "keywords": "lentil loaf, meatloaf, vegan",
  "name": "VEGAN LENTIL AND VEGETABLE LOAF",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "213 kcal",
    "carbohydrateContent": "36 g",
    "cholesterolContent": "1 mg",
    "fatContent": "4 g",
    "fiberContent": "7 g",
    "proteinContent": "9 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 slice",
    "sodiumContent": "248 mg",
    "sugarContent": "8 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 tablespoon ground flax seed plus 5 tbsp water (whisked until combined)",
    "1 1/2 cups of uncooked or 3 cups cooked green lentils (SEE NOTE)",
    "1 cup rolled oats",
    "1 tablespoon extra-virgin olive oil",
    "1 cup carrots (finely chopped)",
    "1 cup red bell pepper (stem, core, and seed removed and finely chopped)",
    "1 cup celery (finely chopped)",
    "1 large red onion (finely chopped)",
    "6 large Portobello mushroom caps (stems and gills removed and finely chopped)",
    "2 garlic cloves (minced)",
    "2 tablespoon Italian seasoning",
    "1 1/2 cups bread crumbs (use gluten-free if desired)",
    "2 teaspoon liquid smoke",
    "1 tablespoon vegan Worcestershire sauce (use Wizard’s brand for a Gluten-Free version)",
    "2 cups fire roasted tomatoes (divided)",
    "Salt and pepper to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 375°F (190°C) and line a 9x5x3 inch (23x13x8 cm) loaf pan with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "In a small bowl, combine the 2 tbsp ground flax seed and the 5 tbsp water until creamy. Let sit for at least 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium sauce pan cover the 1 1/2 cups of lentils with water and bring to a boil. Reduce the heat to simmer and cook for approximately 30 minutes, or until soft. Add more water if needed. Drain the lentils in a fine mesh colander, push down on the lentils to get all of the excess water out. Put the lentils and 1 cup oats in a food processor and pulse until they’re mostly creamy, you should see bits of pieces of the lentils. Put them in a large mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "While the lentils are cooking, in a large skillet, heat the 1 tbsp olive oil on medium-high heat. When the oil is hot, add the 1 cup of carrots, 1 cup of celery and the onion and sauté for five minutes, stirring once or twice to avoid scorching. Add the mushrooms and stir to combine. Cook for 5 minutes and then add the garlic and 2 tbsp of Italian seasoning. Stir and cook for 2 minutes. Remove from heat and let cool."
    },
    {
      "@type": "HowToStep",
      "text": "Put the vegetables in the mixing bowl with the lentils. Add the 1 1/2 cups of bread crumbs, the flax egg, 2 tsp of liquid smoke, 1 tbsp of vegan Worcestershire sauce, 1 cup of fire roasted tomatoes and salt and pepper to taste. Stir until well combined or use your hands to mix it. It should be firm and sticky. IMPORTANT: Taste the mixture and add more salt and pepper if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Put the lentil loaf mixture in the pan and firmly press it into the pan, make sure it reaches all four corners."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 1 hour, or until the loaf begins to pull away from the sides of the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the loaf from the oven and cut three surface slices (approximately 1/4 of an inch deep) slices into the loaf and evenly pour the remaining cup of tomatoes on top. Don’t drench it, it should just cover the loaf. Bake for 10 minutes, or until the tomato firms up."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and let it set for ten minutes before removing from the pan. Let sit another 5 minutes before slicing so it doesn’t fall apart."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://veganosity.com/vegan-lentil-loaf-made-with-roasted-carrots-onion-portobellos"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-12-02T12:50:38.275Z"
}
