{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Kathy Patalsky"
  },
  "createdAt": "2022-12-02T17:09:13.618Z",
  "datePublished": "2015-04-24T11:50:39+00:00",
  "description": "This was a recipe I made in my first few months of blogging. I changed up the traditional red sauce ingredients in lasagna and used an all green sauce, a vegan pesto. I added some creamy cashew ricotta cheese and savory slices of tofu. A touch of jalapeño adds a hint of spiciness. This verde lasagna is a family-style entrée worth gathering at the table for!",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2015/04/lasagnaverde-001-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/04/lasagnaverde-001-1-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/04/lasagnaverde-001-1-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/04/lasagnaverde-001-1-480x270.jpg"
  ],
  "name": "Vegan Lasagna Verde",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "374 kcal",
    "carbohydrateContent": "29 g",
    "fatContent": "25 g",
    "fiberContent": "4 g",
    "proteinContent": "10 g",
    "saturatedFatContent": "6 g",
    "servingSize": "147 g",
    "sodiumContent": "271 mg",
    "sugarContent": "3 g"
  },
  "recipeCategory": "Main Course",
  "recipeCuisine": "Italian",
  "recipeIngredient": [
    "1 tablespoon extra-virgin olive oil",
    "12 to 14 lasagna noodles",
    "2 cups fresh basil leaves",
    "2 cups fresh spinach",
    "1/2 cup fresh lemon juice",
    "1/2 cup walnuts",
    "1/4 cup raw pumpkin seeds",
    "1/4 cup extra-virgin olive oil",
    "1 jalapeño (seeded)",
    "1 to 3 cloves garlic",
    "14 ounces firm or silken tofu (thinly sliced)",
    "1/2 teaspoon extra-virgin olive oil",
    "Few pinches of sea salt and freshly ground black pepper",
    "1 tablespoon nutritional yeast (optional)",
    "2 1/2 cups Cashew Ricotta",
    "1/2 cup vegan mozzarella cheese shreds",
    "1/2 cup chopped fresh basil (for garnish)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350°F / 180oc. Grease a lasagna baking dish with the oil."
    },
    {
      "@type": "HowToStep",
      "text": "Bring a large pot of salted water to a boil. As soon as the water comes to a boil, drop in 4 of the lasagna noodles and cook until tender, 10 to 12 minutes. Remove the cooked noodles and line them up to cover the bottom of the prepared baking dish. Repeat until all the noodles are cooked, transferring the cooked noodles to a side plate once you have covered the bottom of the baking dish. (If you are able to cook more than 4 noodles at a time without having them stick together, you can do that too.) Reserve 1/2 cup of the pasta cooking water."
    },
    {
      "@type": "HowToStep",
      "text": "For the Spicy Jalapeno Pesto: In a high-speed blender, combine all the pesto ingredients with 1/3 cup of the pasta cooking water and blend, increasing the speed from low to high, until smooth. The pesto should be thick, yet easy to pour and drizzle, a tad thicker than the consistency of tomato sauce for pizza. Add more of the pasta cooking water, a spoonful at a time, if desired to thin out the texture of the pesto a bit. Pour the pesto into a bowl and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "For the Tofu: In a sauté pan, heat the oil over medium-high heat. Add the tofu slices and season with salt, pepper, and nutritional yeast (if using). Cook, stirring occasionally, until the tofu edges brown, 3 to 4 minutes. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add the tofu over the bottom layer of noodles in the baking dish. atop with a generous layer of the cashew ricotta, followed by a layer of pesto, a sprinkle of vegan cheese, and a layer of noodles. Add the remaining cashew ricotta and pesto and any remaining tofu. Top with another layer of noodles. You can layer the lasagna however you’d like, really, just be sure to finish off with a top generous layer of pesto sauce and a sprinkle of vegan cheese."
    },
    {
      "@type": "HowToStep",
      "text": "Cover tightly with foil and bake for about 40 minutes. The top of the lasagna will be rippled and drier in texture, and the layers will be moist and tender. The edges should be lightly browned but not overcooked or crispy. Remove the foil, turn the oven to broil, and broil for 1 to 2 minutes. Let cool for at least 20 to 30 minutes in the baking dish before slicing and serving. This cooling time before serving is important. Do not serve too hot or the layers will fall apart too easily. Top with fresh basil to serve. Serve warm."
    },
    {
      "@type": "HowToStep",
      "text": "Note: The amount of water you add will create either a loose, pourable pesto sauce or a thick, spreadable sauce. Both options are delicious—it all depends on your tastes. Season the sauce to taste based on the water content."
    },
    {
      "@type": "HowToStep",
      "text": "Tip: If you think you may have undercooked the noodles a bit, add a few splashes of vegetable broth to the dish before cooking."
    },
    {
      "@type": "HowToStep",
      "text": "Tip: For a silkier-textured lasagna, blend these mixtures with enough water so that they are at a pourable consistency. For a nuttier, thicker-textured lasagna, use minimal water and spread them when applying to lasagna layers."
    }
  ],
  "recipeYield": "12",
  "sameAs": [
    "https://veganricha.com/vegan-lasagna-verde"
  ],
  "updatedAt": "2022-12-02T17:09:13.617Z"
}
