{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT7M",
  "createdAt": "2022-12-03T04:41:16.911Z",
  "datePublished": "2015-02-17T13:53:38+00:00",
  "description": "Grand Marnier, rum, brown sugar, coconut oil, vegan ice cream, and bananas, what more could your taste buds ask for?",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2015/02/2015-02-16-001-2015-02-16-022-1024x596-1.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/02/2015-02-16-001-2015-02-16-022-1024x596-1-500x500.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/02/2015-02-16-001-2015-02-16-022-1024x596-1-500x375.jpg",
    "https://www.veganosity.com/wp-content/uploads/2015/02/2015-02-16-001-2015-02-16-022-1024x596-1-480x270.jpg"
  ],
  "name": "Vegan Bananas Foster",
  "prepTime": "PT10M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "French",
  "recipeIngredient": [
    "1/2 teaspoon coconut oil",
    "1/2 cup 120 ml almond milk creamer",
    "1/2 cup 112 g brown sugar",
    "2 tablespoon Grand Marnier",
    "Juice from 1/2 of an orange",
    "2 bananas cut in half lengthwise (cut them in the skin so they don’t break apart and then peel)",
    "1/4 cup 60 ml of rum",
    "1- pint 473 g vegan vanilla ice cream, we use So Delicious",
    "1/4 cup 31 g crushed pecans (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Read the disclaimer and safety precautions before making this recipe."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large shallow pan on medium heat. Add the oil and creamer and then add the sugar when the oil is melted. With a metal fork, whisk the sugar with the bottom of the fork (tines flat to the pan) in a circular motion. Wear an oven mitt if the fork gets hot. Whisk until the sugar spreads out and begins to foam and bubble. Approximately 4 minutes. Add the Grand Marnier and the juice from the orange, whisk for 1 minute. Put the banana slices in, cut side down and cook for 1 minute. Flip the bananas and cook for another minute."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pan from the heat source and add the rum. Using a long match or lighter, light the alcohol by placing the flame just inside the outer edge of the pan. Stand as far back from the pan as possible, keeping your face and hands away from the pan. The flame will be a faint blue but will be very hot. It should extinguish in 5 to 10 seconds. Once the flame is out, hold the pan handle with an oven mitt, and gently shake the pan from side to side to coat the bananas with the sauce."
    },
    {
      "@type": "HowToStep",
      "text": "Place the bananas on a platter or in individual bowls, scoop the ice cream on top and spoon the sauce over the ice cream and bananas. Add crushed pecans for garnish if you like."
    },
    {
      "@type": "HowToStep",
      "text": "*Disclaimer and Safety Precautions: When igniting alcohol, use extreme caution. Remove the pan from the heat source before adding the alcohol, and make sure that there is plenty of space around the entire pan. Remove any towels, fabric, or combustible materials. Pour the alcohol into the pan and using a long match or lighter, light the alcohol by placing the flame just inside the outer edge of the pan. Stand as far back from the pan as possible, keeping your face and hands away from the pan. The flame will be a faint blue but will be very hot. It should extinguish in 5 to 10 seconds. Once the flame is out, hold the pan handle with an oven mitt, and gently shake the pan from side to side to coat the bananas with the sauce. Veganosity and its editors are not responsible for any injuries or damage that may occur while making this dessert. Make at your own risk."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://veganosity.com/vegan-bananas-foster"
  ],
  "totalTime": "PT17M",
  "updatedAt": "2022-12-03T04:41:16.909Z"
}
