{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "6",
    "ratingValue": "4.84"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-12-02T11:32:00.343Z",
  "datePublished": "2015-03-26T12:29:14+00:00",
  "description": "Be sure you have your lentils cooked before beginning this recipe. I like to make both the barley and lentils at least a day or two ahead of time or use canned lentils to save time. 3/4 cup of dried lentils will equal about 1 1/2 cups after they are cooked.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2015/03/chou-farci-fb.jpg"
  ],
  "keywords": "French stuffed cabbage, stuffed cabbage recipe",
  "name": "Vegan Chou Farci (Cabbage Stuffed with Barley and Lentils)",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "251 kcal",
    "carbohydrateContent": "51.5 g",
    "fatContent": "1.1 g",
    "fiberContent": "15.2 g",
    "proteinContent": "12.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "388.3 mg",
    "sugarContent": "9.8 g"
  },
  "prepTime": "PT40M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "French",
  "recipeIngredient": [
    "1/2 cup pearl barley, uncooked (other large grains, such as farro, may be used)",
    "1 1/2 cups water (or vegetable broth)",
    "1 teaspoon vegetable bouillon (or 1 bouillon cube if water is used)",
    "1 medium onion (chopped)",
    "2 carrots (diced)",
    "1 1/2 cup cooked lentils (green, brown, or black) (or 1 15-ounce can, drained well)",
    "4 cloves garlic (thinly sliced)",
    "1 teaspoon dried thyme",
    "1 bay leaf",
    "1 teaspoon sweet smoked paprika",
    "1 teaspoon ground cumin",
    "1/2 teaspoon ground ginger",
    "1/4 teaspoon allspice",
    "1/4 teaspoon cayenne pepper (or to taste)",
    "1/2 cup tomato sauce",
    "salt and freshly ground black pepper to taste",
    "1 large cabbage"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "First cook the barley (you may do this several days in advance): In the pressure cooker, add the barley, water (or vegetable broth), and bouillon, if needed. Lock the lid and cook at high pressure for 20 minutes. Release the pressure and allow barley to stand covered until all water is absorbed. For regular, non-pressure cooking, bring the water or broth to boil. Add the barley, reduce heat, and simmer for 50 to 60 minutes. If not using right away, place in a storage container and refrigerate."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a large, deep skillet. Add the onions and carrots and cook, stirring, until the onions soften, about 4 minutes. Add water by the tablespoon if needed to prevent sticking. Add the barley, cooked lentils, garlic, thyme, bay leaf, and all spices. Cook, stirring, for two minutes. Add the tomato sauce, reduce the heat to low, and cook until the liquid is absorbed, about 5 minutes. Season to taste with salt and pepper. Set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Discard the tough outer leaves of the cabbage. Cut around the core and carefully remove about 10 of the largest leaves. If the stem ends of the leaves seem thick, use a vegetable peeler to slice away some of the thickness (see image here). Bring a large pot of water to boil and add the leaves. Boil for 8 minutes. Remove each leaf carefully and allow to drain and cool in a colander."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350F. Oil a deep 7-inch soufflé or baking dish. Place the largest of the cabbage leaves bowl-side up the the dish, positioned so that it covers the bottom and part of the sides. Repeat with 2 to 4 more leaves until the bottom and sides are covered. Place a layer of barley-lentil filling in the bowl created by the cabbage, using 1/3 of the filling. Smooth it evenly so that it spreads to all sides. Top it with a cabbage leaf. Repeat with two more layers of filling alternating with a cabbage leaf. Top with a cabbage leaf, bowl side down, and tuck it in around the sides. Using a large spoon or your hand, press down on the leaf, packing in the filling and making sure there are no air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Bake uncovered for 30-40 minutes. Remove. Carefully insert a table knife against the edge of the dish and run it around to make sure there are no stuck-on edges. Place an upside-down serving plate on top, and invert the casserole onto the plate. Serve hot."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://blog.fatfreevegan.com/2015/03/vegan-chou-farci-cabbage-stuffed-with-barley-and-lentils.html"
  ],
  "totalTime": "PT110M",
  "updatedAt": "2022-12-02T11:32:00.341Z"
}
