{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "81",
    "ratingValue": "4.96"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-12-02T11:00:35.549Z",
  "datePublished": "2019-10-12T00:48:45+00:00",
  "description": "A simple, easy, rustic and hearty Vegan Roast that&#x27;s sliceable, ultra tender and full of flavour. Just perfect for serving with copious amounts of gravy, roast potatoes and all the trimmings. Leftovers are great in sandwiches too!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/10/Vegan-Roast-A-Virtual-Vegan-1200-copy.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/10/Vegan-Roast-A-Virtual-Vegan-1200-copy-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/10/Vegan-Roast-A-Virtual-Vegan-1200-copy-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/10/Vegan-Roast-A-Virtual-Vegan-1200-copy-480x270.jpg"
  ],
  "keywords": "seitan, seitan recipe, seitan roast, vegan chicken recipe, vegan christmas dinner recipe, vegan roast, vegan thanksgiving recipe, vegan turkey, vegan turkey recipe",
  "name": "Vegan Roast",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "205 kcal",
    "carbohydrateContent": "15 g",
    "fatContent": "3 g",
    "fiberContent": "3 g",
    "proteinContent": "29 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "391 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Entree",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1 1/2 cups / 270 g canned white beans (, drained and rinsed *)",
    "1 cup / 200 g artichoke hearts",
    "4 cloves garlic",
    "1/4 cup / 28 g nutritional yeast",
    "2 tablespoons / 30 ml Tamari or soy sauce (**)",
    "1/2 teaspoon ground black pepper",
    "3/4 teaspoon rubbed sage (, if using ground sage use half the amount)",
    "3/4 teaspoon fresh or dried rosemary",
    "3/4 teaspoon dried thyme",
    "2 tablespoons Better Than Bouillon No Chicken Base (*** see notes if you can't get this )",
    "1/2 cup / 120 mls water",
    "2 cups / 256 g Vital wheat gluten (****)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400°F (200 °C)."
    },
    {
      "@type": "HowToStep",
      "text": "To a food processor add the beans, artichoke hearts, garlic, nutritional yeast, tamari or soy sauce, black pepper, sage, rosemary, thyme, Better Than Bouillon No Chicken Base and water. As it's a paste you don't need to dissolve it in the water. Just throw it all in. See notes for alternatives to the Better Than Bouillon."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the food processor on and process until well combined and smoothish. It doesn't have to be super smooth. Very small lumps are ok. (see my pictures in the post above to see exactly how it should look)."
    },
    {
      "@type": "HowToStep",
      "text": "Add the vital wheat gluten to the food processor and pulse until a dough is starting to form then tip out onto a clean surface. Bring it together with your hands and knead for 7 minutes. You can knead in a stand mixer if you prefer not doing it by hand, but don't use your food processor to knead. By the time you have finished kneading, the dough should be starting to look fibrous. See my picture in the post above as a guide. If it isn't, knead for a few minutes more."
    },
    {
      "@type": "HowToStep",
      "text": "Shape the dough into a log shape roughly 8 1/2 inches long and 4 inches wide."
    },
    {
      "@type": "HowToStep",
      "text": "Get a long piece of foil (around 20 inches long) and place the roast right at the end of it, long side of the roast along the shortest side of the foil. Roll it up in the foil. Keep rolling it until you reach the end, so that the roast is surrounded by a few layers of foil. Then twist each end tightly shut so it looks like a Christmas cracker."
    },
    {
      "@type": "HowToStep",
      "text": "Place the foil wrapped roast onto a baking tray and place on the middle shelf of the oven and bake for 35 minutes. Turn it over and bake for another 35 minutes. Remove from the oven. Do not be tempted to open the foil. Leave it to rest in the foil for at least 30 minutes before opening and slicing, but it will stay warm for a few hours if you don't unwrap it. For a much firmer roast, cool then refrigerate before slicing."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/vegan-roast"
  ],
  "totalTime": "PT85M",
  "updatedAt": "2022-12-02T11:00:35.548Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/4t2YJMr3.mp4",
    "description": "A simple, easy, rustic and hearty Vegan Roast that’s sliceable, ultra tender and full of flavour. Just perfect for serving with copious amounts of gravy, roast potatoes and all the trimmings. Leftovers are great in sandwiches too!",
    "name": "Vegan Roast",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/4t2YJMr3-720.jpg",
    "uploadDate": "2019-11-25T00:00:00.000Z"
  }
}
