{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Sam Turnbull • It Doesn't Taste Like Chicken"
  },
  "createdAt": "2022-12-02T12:47:37.126Z",
  "datePublished": "2021-10-27T05:00:41+00:00",
  "description": "This vegan pie crust recipe is flavourful, flaky, and made with vegan butter. When baked it has the most beautiful golden color. It&#039;s perfect for making sweet and savory pies. It&#039;s quick and easy to make (especially when using a food processor), requires only 4 ingredients, and it can also be made ahead of time and stored in the fridge, or freezer!",
  "image": [
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2021/10/vegan-all-butter-flaky-pie-crust-no-shortening-recipe.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2021/10/vegan-all-butter-flaky-pie-crust-no-shortening-recipe-500x500.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2021/10/vegan-all-butter-flaky-pie-crust-no-shortening-recipe-500x375.jpg",
    "https://itdoesnttastelikechicken.com/wp-content/uploads/2021/10/vegan-all-butter-flaky-pie-crust-no-shortening-recipe-480x270.jpg"
  ],
  "keywords": "all-butter, flaky, pie crust, vegan",
  "name": "Vegan All-Butter Flaky Pie Crust",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "173 kcal",
    "carbohydrateContent": "19 g",
    "fatContent": "10 g",
    "fiberContent": "1 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving (1/8th of a single layer pie crust)",
    "sodiumContent": "95 mg",
    "sugarContent": "1 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "7 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 1/2 cup all-purpose flour (plus more for rolling)",
    "1 teaspoon white sugar (plus more for sprinkling)",
    "1/2 cup cold vegan butter",
    "1/4 cup cold plant-based milk (such as oat or soy)",
    "1 - 2 tablespoons aquafaba (the liquid in a can of chickpeas) (optional, for making a double pie crust)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Food processor method: Add the flour and sugar into the food processor and pulse a few times to mix. Scatter the vegan butter cubes over the flour and pulse several more times until the mixture is a crumbly sandy texture. Pour over the plant-based milk and pulse a few more times until you reach a shaggy dough but there is still some unmixed flour (don't over mix or the dough will become tough). Turn the dough onto a clean work surface and use your hands to gather everything into a ball of dough. Wrap in plastic wrap and chill in the fridge for at least 20 minutes before continuing.Bowl method: Add the flour and sugar into a large bowl and whisk to combine. Scatter the vegan butter cubes over the flour and use a fork or pastry cutter to cute the butter into the flour until you reach a crumbly sandy texture. Drizzle the plant-based milk across the flour mixture and use the fork to combine, until you reach a shaggy dough but there is still some unmixed flour (don't over mix or the dough will become tough). Turn the dough onto a clean work surface and use your hands to gather everything into a ball of dough. Wrap in plastic wrap and chill in the fridge for at least 20 minutes before continuing."
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://itdoesnttastelikechicken.com/vegan-all-butter-flaky-pie-crust"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-12-02T12:47:37.125Z"
}
