{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "20",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-05T04:19:59.821Z",
  "datePublished": "2017-09-04T03:00:16+00:00",
  "description": "Amazing, 10-ingredient vegan matcha swirl cheesecake that's raw, naturally sweetened, and insanely delicious! The perfect vegan, gluten-free dessert with health perks!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/09/Matcha-Cheesecake-SQUARE-min.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2017/09/Matcha-Cheesecake-SQUARE-min-500x500.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2017/09/Matcha-Cheesecake-SQUARE-min-500x375.jpg",
    "https://minimalistbaker.com/wp-content/uploads/2017/09/Matcha-Cheesecake-SQUARE-min-480x270.jpg"
  ],
  "keywords": "matcha cheesecake",
  "name": "Vegan Matcha Swirl Cheesecake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "340 kcal",
    "carbohydrateContent": "31.3 g",
    "fatContent": "23.5 g",
    "fiberContent": "3.5 g",
    "proteinContent": "7.3 g",
    "saturatedFatContent": "7.3 g",
    "servingSize": "1 slices",
    "sodiumContent": "55 mg",
    "sugarContent": "20.2 g"
  },
  "prepTime": "PT270M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 1/2 cups raw cashews (soaked overnight in cool water or in very hot water for 1 hour)",
    "1 tsp vanilla extract (optional)",
    "1 medium lemon, juiced (~3 Tbsp or 45 ml as original recipe is written)",
    "1/4 cup light coconut milk (or sub full-fat coconut milk)",
    "1/4 scant cup melted coconut oil",
    "1/2 cup maple syrup (or sub agave // use less for a more tart cheesecake)",
    "1/4 cup coconut yogurt* (DIY or store-bought vegan yogurt - I like Coyo!)",
    "1/4 tsp sea salt",
    "1 1/2 - 2 tsp matcha green tea powder",
    "1 cup packed medjool dates (pitted // as original recipe is written, about 22 dates or 275 g pitted before measuring)",
    "1 1/2 cups raw walnuts (or sub raw almonds)",
    "1 pinch sea salt"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add cashews to a bowl, cover with very hot water, and let soak 1 hour. Or cover with cool water and let soak for 6-8 hours or overnight. Drain well and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Add dates to a food processor and blend until small bits remain and it forms into a ball. Remove and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add nuts and salt and process into a meal. Then add dates back in and blend until a loose dough forms - it should stick together when you squeeze a bit between your fingers. If it's too dry, add a few more dates through the spout while processing. If too wet, add more chopped walnuts."
    },
    {
      "@type": "HowToStep",
      "text": "Line a standard pie, round cake dish, or 7-inch springform pan (I like this one!) with parchment paper (adjust number/size of pans if altering batch size). Then add crust mixture and carefully press with fingers to distribute."
    },
    {
      "@type": "HowToStep",
      "text": "To pack it down, use a flat-edged drinking glass lined with parchment paper and really press it down, pushing some crust up the sides. Place in the freezer to firm up."
    },
    {
      "@type": "HowToStep",
      "text": "Add all filling ingredients except matcha to a high-speed blender and blend until creamy and smooth, scraping down sides as needed. If it has trouble blending, add a bit more coconut milk."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor/sweetness as needed, adding more coconut yogurt or lemon juice for tang, maple syrup for sweetness, or vanilla for vanilla flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Pour 2/3 filling into the crust (see photo) and tap a few times to release any air bubbles. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To the remaining filling, add the matcha powder, starting with the lesser end of the range (1 1/2 tsp as original recipe is written). Blend until creamy and smooth. Then taste and see if it needs more matcha. I found 1 1/2 to be the perfect amount, as too much can taste bitter. Add to the filling in a swirling motion. Then swirl a few times with a spoon or a chopstick to create more of a swirl. Tap on the counter to release any air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "Cover loosely with plastic wrap and freeze until set - about 3-4 hours depending on size of dish. When set, it will be firm to the touch."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, set out of the freezer until slightly soft to the touch - about 15-20 minutes. Then slice with a hot knife for easier slicing. Top with a touch of coconut whipped cream and fresh berries, or enjoy as is!"
    },
    {
      "@type": "HowToStep",
      "text": "Once this cheesecake has been frozen, it can be stored in the refrigerator up to 3 days, but it will become quite soft. For this reason, I recommend storing it in the freezer and setting out for 15-20 minutes before slicing/serving to enjoy the best texture. Store leftovers in the freezer up to 1 month or the refrigerator up to 3 days."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/vegan-matcha-swirl-cheesecake"
  ],
  "totalTime": "PT270M",
  "updatedAt": "2022-12-05T04:19:59.820Z"
}
