{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "11",
    "ratingValue": "4.64"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-01T08:44:51.269Z",
  "datePublished": "2021-09-14T06:00:00+00:00",
  "description": "Learn how to make your own amazing Vegan Graham Crackers. These iconic crackers are sweet but not too sweet, super crunchy with toasty, nutty, cinnamon flavour and they are so easy to make! Enjoy as they are, make S&#039;mores or Nanaimo Bars, or grind into crumbs to make vegan graham cracker crust for pies or cheesecakes.",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2021/08/Vegan-Graham-Crackers-A-Virtual-Vegan-11.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/08/Vegan-Graham-Crackers-A-Virtual-Vegan-11-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/08/Vegan-Graham-Crackers-A-Virtual-Vegan-11-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/08/Vegan-Graham-Crackers-A-Virtual-Vegan-11-480x270.jpg"
  ],
  "keywords": "crackers, graham crackers, vegan graham crackers",
  "name": "Vegan Graham Crackers",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "94 kcal",
    "carbohydrateContent": "12 g",
    "fatContent": "5 g",
    "fiberContent": "1 g",
    "proteinContent": "2 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 cracker",
    "sodiumContent": "164 mg",
    "sugarContent": "2 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "3 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Baked Goods",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "3/4 cup (165 grams) vegan butter",
    "1/4 cup (50 grams) cane or white sugar",
    "very packed 1/4 cup (50 grams) dark brown sugar",
    "1 1/2 cups (188 grams) wholewheat flour",
    "1 cup (125 grams) all purpose flour (, (plain flour in the UK)",
    "1 teaspoon ground cinnamon",
    "1 teaspoon baking soda (, (bicarbonate of soda in the UK)",
    "3/4 teaspoon fine sea salt (, (not table salt)",
    "about 2 tablespoons plant milk (, unsweetened & unflavoured)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Get 2 large baking trays and cut 3 pieces of parchment paper to fit on the trays. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To a food processor add the vegan butter, brown sugar and white sugar. Process to combine. If you don't have a food processor cream it together with a fork then give it a quick beat with a wooden spoon."
    },
    {
      "@type": "HowToStep",
      "text": "Add the wholewheat flour, all-purpose flour, cinnamon, baking soda and salt. Process (or mix) again to combine, stopping to scrape the sides down with a spatula as needed. You should end up with a damp sandy looking mixture."
    },
    {
      "@type": "HowToStep",
      "text": "Add a few drops of milk at a time, pulsing in between until the dough starts coming together. You won't need any more than 2 tablespoons. Use your hand (carefully avoiding the blade) to check you can squeeze it together. It should be soft, pliable and slightly sticky."
    },
    {
      "@type": "HowToStep",
      "text": "Place one parchment paper sheet on your counter. Remove the blade from the processor and tip the dough out onto the paper. Bring it together into a smooth ball then cut the ball in half. Pat the 2 lumps of dough into smooth balls and flatten their tops a bit."
    },
    {
      "@type": "HowToStep",
      "text": "Set one ball of dough aside, and place the other in the middle of the parchment paper. Cover it with another sheet of paper and roll out into as close to a rectangular shape as you can, about 1/8 inch thick making sure you roll within the confines of the paper. Remove the piece of paper from the top and lift the bottom piece of paper with the rolled out dough on it carefully onto one of your baking trays."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat the process with the 2nd ball of dough, reusing the same top piece of parchment paper when you roll the dough out."
    },
    {
      "@type": "HowToStep",
      "text": "Get a sharp knife or pizza cutter and cut the dough into either squares or rectangles. You can make them whatever size you like. (Mine were about 2 x 1 1/2 inches). I leave the excess dough around the edges. I like the rustic look and don't like to waste it. If you prefer you can remove it."
    },
    {
      "@type": "HowToStep",
      "text": "Prick the crackers all over with a fork, then sprinkle a handful of coarse sugar across the top."
    },
    {
      "@type": "HowToStep",
      "text": "Put both trays in the fridge for at least 30 minutes. This step is important. Don't skip it. They are ok in the fridge for up to 2 days but if leaving them longer than an hour cover them with some cling wrap to stop them from drying out."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 °F (175° C) while the dough is chilling and reposition the shelves to the 2 lowest positions."
    },
    {
      "@type": "HowToStep",
      "text": "Place the baking trays in the oven on the lowest 2 shelves and bake for 20 minutes then turn the oven off."
    },
    {
      "@type": "HowToStep",
      "text": "Immediately remove the trays from the oven and carefully recut the crackers along the original lines with a sharp knife or pizza cutter then return both trays to the oven. Close the door and leave them in there for at least 30 minutes but a few hours or overnight is fine (don't turn the oven back on). This step helps them dry out thoroughly and become really crunchy and snappy."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer the cooled crackers to an airtight container. They will keep well for a few weeks."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://avirtualvegan.com/vegan-graham-crackers"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-01T08:44:51.264Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/Vx1bStZe.mp4",
    "description": "Learn how to make your own amazing Vegan Graham Crackers. These iconic crackers are sweet but not too sweet, super crunchy with toasty, nutty, cinnamon flavour and they are so easy to make! Enjoy as they are, make S'mores or Nanaimo Bars, or grind into crumbs to make vegan graham cracker crust for pies or cheesecakes.",
    "name": "Vegan Graham Crackers",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/Vx1bStZe-720.jpg",
    "uploadDate": "2021-12-11T23:59:19.000Z"
  }
}
