{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-12-01T08:59:13.880Z",
  "datePublished": "2022-11-20T17:24:06+00:00",
  "description": "Learn how to make the most amazing Vegan Pecan Pie with crispy, flaky crust and toasty, pecan packed, perfectly gooey filling. Pile on the dollops of whipped vegan cream and dig right in!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2022/11/Vegan-Pecan-Pie-A-Virtual-Vegan-8.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2022/11/Vegan-Pecan-Pie-A-Virtual-Vegan-8-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2022/11/Vegan-Pecan-Pie-A-Virtual-Vegan-8-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2022/11/Vegan-Pecan-Pie-A-Virtual-Vegan-8-480x270.jpg"
  ],
  "keywords": "dairy-free pecan pie, egg-free pecan pie, vegan pecan pie",
  "name": "Vegan Pecan Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "555 kcal",
    "carbohydrateContent": "48 g",
    "fatContent": "39 g",
    "fiberContent": "4 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "10 g",
    "servingSize": "1 serving",
    "sodiumContent": "375 mg",
    "sugarContent": "22 g",
    "transFatContent": "0.1 g",
    "unsaturatedFatContent": "27 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 cups (250 grams) all purpose flour (, (plain flour in the UK)",
    "1/2 teaspoon fine sea salt",
    "1/2 cup + 1 tablespoon (120 grams) cold, hard, vegan butter",
    "about 1/2 cup (120 mls) iced water",
    "2 cups (200 grams) chopped pecan nuts",
    "3/4 cup (75 grams) whole pecan nuts",
    "1/2 packed cup (100 grams) dark brown sugar (, (plus a little more for sprinkling)",
    "6 tablespoons (32 grams) cornstarch (, or arrowroot)",
    "1 cup (240 mls) full fat canned coconut milk (, give it a good stir before measuring)",
    "1/2 cup (120 mls) maple syrup (, real maple syrup not pancake syrup)",
    "6 tablespoons (90 mls) melted vegan butter",
    "1 tablespoon vanilla extract",
    "1 tablespoon (15 mls) apple cider vinegar (, or lemon juice)",
    "OPTIONAL 2 tablespoons bourbon",
    "3 tablespoons plant milk",
    "1 tablespoon maple syrup",
    "2 tablespoons any neutral liquid oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make the pie crust - To a food processor or mixing bowl add the flour and salt. Pulse/mix to combine. Cut the butter into small chunks and add to the flour. Pulse a few times (or cut in with a pastry cutter) until like coarse breadcrumbs with small chunks of butter still visible. Gradually add icy water a little at a time, pulsing or mixing with a knife after each addition. When it will just squeeze together in your hand it's done. Bring together into a ball, wrap in cling-wrap and refrigerate for 10 to 15 minutes (or up to 3 days)."
    },
    {
      "@type": "HowToStep",
      "text": "Toast the chopped nuts. (not the whole ones). Put the chopped pecans on a baking tray and bake at 350°F (175°C) for 5 to 6 minutes. They should smell nutty & toasty. Remove from the oven, tip onto a plate and allow to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Leave the oven on. Move a shelf to the lowest level and place a large metal baking tray on it to get hot."
    },
    {
      "@type": "HowToStep",
      "text": "Roll out the pastry dough on a well floured surface into a circle big enough to fit a 9 inch wide x 2 inch deep pie dish with some overhang."
    },
    {
      "@type": "HowToStep",
      "text": "Lift over the rolling pin and drape into the pie dish. Let it gently fall into place then tuck in with your fingers. Trim the edge so it's even all the way around but still overhanging, by about 1 inch."
    },
    {
      "@type": "HowToStep",
      "text": "Turn the overhang edges up and under to double up the thickness, then crimp with a fork or use your fingers to flute. Refrigerate uncovered while you prepare the filling."
    },
    {
      "@type": "HowToStep",
      "text": "Mix the filling. To a mixing bowl add the brown sugar and cornstarch. Mix together, then add the coconut milk. Stir well to combine before adding the maple syrup, melted vegan butter, vanilla, apple cider vinegar, salt & optional bourbon. Whisk together well. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Make the \"egg\"wash. Mix up the plant milk and maple syrup to make \"egg\"wash. Also have the 2 tablespoons of oil and a pastry brush nearby."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the pie. Brush a little oil gently over the bottom of the pie crust and a little up the sides. This acts as a waterproof seal so you don't get a soggy bottom. Then, brush the \"egg\"wash over the top parts of the crust."
    },
    {
      "@type": "HowToStep",
      "text": "Put the cooled pecan pieces into the crust, pour in the filling, and arrange the whole pecans on the top. Sprinkle a generous handful of brown sugar all over."
    },
    {
      "@type": "HowToStep",
      "text": "Place carefully on the hot baking tray in the oven. Bake for 55 to 58 mins, or until the crust is golden and the filling is glistening and slightly crusty looking. If you slightly tilt the pie you should still some movement in the middle but it will be a little more stable around the edges. Cool on a wire rack, then refrigerate for at least 3 hours to set."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/vegan-pecan-pie"
  ],
  "suitableForDiet": [
    "https://schema.org/VeganDiet"
  ],
  "totalTime": "PT255M",
  "updatedAt": "2022-12-01T08:59:13.872Z"
}
