{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT5M",
  "createdAt": "2022-12-02T22:23:21.151Z",
  "datePublished": "2016-02-08T05:30:01+00:00",
  "description": "Rich &amp; gooey homemade vegan chocolate caramels. So decadent &amp; delicious and surprisingly easy to make. Perfect as an indulgent treat or as a gift for someone special.",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2016/02/Vegan-Chocolate-Salted-Caramels-5-copy-1.jpg"
  ],
  "keywords": "vegan caramels, vegan chocolate caramels",
  "name": "Vegan Chocolate Caramels",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "73 kcal",
    "carbohydrateContent": "7 g",
    "cholesterolContent": "1 mg",
    "fatContent": "5 g",
    "fiberContent": "1 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 chocolate caramel",
    "sodiumContent": "24 mg",
    "sugarContent": "4 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1 chocolate mold",
    "1/2 cup / 100 g coconut sugar",
    "2 tablespoons water",
    "2 tablespoons tahini (, or any other nut butter)",
    "2 tablespoons coconut oil (refined or unrefined is fine)",
    "1/4 teaspoon fine salt",
    "1/2 teaspoon vanilla extract",
    "2 cups / 300 g vegan dark chocolate"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add the coconut sugar and the water to a pan. Place over a medium heat and cook until the sugar has completely dissolved and it is just starting to bubble. DO NOT STIR! If you need to, just swirl the pan a bit. It will take 2- 3 minutes max. Do not leave it unattended as it will burn very easily if left too long."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the heat and add the coconut oil, tahini, salt and vanilla. Stir very well until it is all well combined. It is normal to see a few light flecks through it. If you have trouble getting it to come together put it over a very low heat again for 30 seconds or so."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the heat and leave to cool. It will be very runny at first but will thicken up nicely as it cools."
    },
    {
      "@type": "HowToStep",
      "text": "When the caramel is cool melt your chocolate. I melt mine in a bowl over a pan of gently simmering water."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon some melted chocolate into the bottom of each mold. I used a spoon and a knife to just push the melted chocolate gently off the edge of it into the molds. You need a depth of about 3-4 mms. No need to be too exact. Just eyeball it. Remember though if it's too thin the will be very hard to remove from the mold intact."
    },
    {
      "@type": "HowToStep",
      "text": "Once you have chocolate in each mold use the end of a knife to just push the chocolate pooled in the bottom up the sides of each mold to coat it. Make sure it's quite thick so that they don't end up too fragile once set."
    },
    {
      "@type": "HowToStep",
      "text": "Now spoon some caramel into each mold. You need to leave room for about 2-3mm of chocolate to be poured on the top. Don't be tempted to overdo it as you'll end up with a gooey mess. The caramel will level itself out as you pour it in."
    },
    {
      "@type": "HowToStep",
      "text": "Now cover the caramel with some more chocolate and use a pallet knife or the back of a regular knife to run along the top and level everything off nicely."
    },
    {
      "@type": "HowToStep",
      "text": "Pop the mold into the freezer. Make sure it is kept flat. Within 20-30 minutes they will be hard enough to turn out of the mold."
    },
    {
      "@type": "HowToStep",
      "text": "If you only have one mold you will need to repeat the process. Your chocolate should still be melted enough to continue but if it isn't just warm it slightly again."
    }
  ],
  "recipeYield": "35",
  "sameAs": [
    "https://avirtualvegan.com/vegan-chocolate-salted-caramels"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-02T22:23:21.150Z"
}
