{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "13",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-01T12:35:35.395Z",
  "datePublished": "2019-08-07T12:25:35+00:00",
  "description": "A super thick and fluffy, giant, no flip, giant Vegan Blueberry Pancake that is melt in your mouth golden and bursting with juicy blueberries. Perfect for feeding a family without having to stand over the stove for ages! ",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/08/Giant-Blueberry-Vegan-Pancake-A-Virtual-Vegan-PIN-1-copy.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/08/Giant-Blueberry-Vegan-Pancake-A-Virtual-Vegan-PIN-1-copy-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/08/Giant-Blueberry-Vegan-Pancake-A-Virtual-Vegan-PIN-1-copy-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/08/Giant-Blueberry-Vegan-Pancake-A-Virtual-Vegan-PIN-1-copy-480x270.jpg"
  ],
  "keywords": "egg-free pancake recipe, eggless pancake recipe, giant pancake, pancakes, vegan pancake recipe, vegan pancakes",
  "name": "Vegan Blueberry Pancake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "258 kcal",
    "carbohydrateContent": "42 g",
    "fatContent": "7 g",
    "fiberContent": "2 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "498 mg",
    "sugarContent": "7 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "2 cups / 250 g all purpose flour (, (use plain flour in the UK) )",
    "2 tablespoons baking powder",
    "2 tablespoons sugar",
    "3/4 teaspoon fine salt",
    "1 1/2 cups / 360 mls milk of choice (, unsweetened)",
    "2 teaspoons apple cider vinegar",
    "4 teaspoons vanilla extract",
    "1/4 cup / 60 mls melted vegan butter",
    "1 heaping cup / 150 g blueberries (, fresh or frozen (if frozen do not defrost - see note)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To a large mixing bowl, add the flour, baking powder, sugar and salt. Whisk them together to combine."
    },
    {
      "@type": "HowToStep",
      "text": "In another smaller bowl, add the milk, vinegar, vanilla and melted butter. Whisk them together to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Pour the wet ingredients into the dry ingredients and stir them together. Do not over mix or beat it really hard. Stir gently until you can no longer see any dried flour. A few small lumps are ok."
    },
    {
      "@type": "HowToStep",
      "text": "Pour in the blueberries and fold them through the batter gently. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 °F (190 °C)."
    },
    {
      "@type": "HowToStep",
      "text": "Warm an oven proof non-stick approximately 9 inch diameter frying pan (at least 1.5 inch deep) or well seasoned skillet (it must be a pan that you know will not stick) over a medium heat and add enough vegan butter (or oil) to coat the bottom and sides. Swish it all around and up the sides of the pan. See the recipe notes below for sheet pan and cake pan instructions and for tips regarding skillets of other sizes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the pan is nice and hot pour in the pancake batter and flatten out the top with a spatula. Set a timer for 5 minutes. The aim is to get the bottom really nicely golden and caramelized. By the end of the 5 minutes it will be starting to set up around the edges. In the last 2 minutes, use a spatula to gently loosen it around the edges and shake the pan gently back and forth a little to loosen the pancake on the bottom."
    },
    {
      "@type": "HowToStep",
      "text": "Once it has cooked for 5 minutes, turn off the burner and place the pan in the oven. Cook for 10 to 12 minutes until the pancake is completely set on top and a tooth pick inserted comes out clean (except for maybe a little blueberry juice)."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and very carefully turn the pancake out onto a large plate. To do this use oven gloves or a dish towel to protect your hands and place a plate over the top of the pan, carefully invert the pan over the plate and the pancake should slip out easily."
    },
    {
      "@type": "HowToStep",
      "text": "Slice into portions and top with vegan butter and maple syrup or other toppings of choice."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://avirtualvegan.com/giant-blueberry-vegan-pancake"
  ],
  "totalTime": "PT25M",
  "updatedAt": "2022-12-01T12:35:35.393Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://content.jwplatform.com/videos/2eEQXuOv.mp4",
    "description": "A super thick and fluffy, giant, no flip Vegan Pancake that is melt in your mouth golden and bursting with juicy blueberries. Perfect for feeding a family without having to stand over the stove for ages!",
    "name": "Giant Blueberry Vegan Pancake",
    "thumbnailUrl": "https://content.jwplatform.com/thumbs/2eEQXuOv-720.jpg",
    "uploadDate": "2019-09-30T00:00:00.000Z"
  }
}
