{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "17",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT165M",
  "createdAt": "2022-12-02T11:49:40.317Z",
  "datePublished": "2021-12-03T06:00:00+00:00",
  "description": "The ultimate Vegan Christmas Cake! This classic rich, dark vegan fruit cake is jam-packed with dried fruit and booze (although still delicious made alcohol-free) and can be made the day before, or up to 1 year ahead. Keep the decorations simple and rustic, or cover it in marzipan and fondant icing. Perfect for enjoying at Christmas but also makes a fantastic vegan wedding cake!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Christmas-Cake-A-Virtual-Vegan-14.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Christmas-Cake-A-Virtual-Vegan-14-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Christmas-Cake-A-Virtual-Vegan-14-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2021/11/Vegan-Christmas-Cake-A-Virtual-Vegan-14-480x270.jpg"
  ],
  "keywords": "raw christmas cake, vegan christmas cake, vegan fruit cake",
  "name": "Vegan Christmas Cake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "485 kcal",
    "carbohydrateContent": "66 g",
    "fatContent": "20 g",
    "fiberContent": "8 g",
    "proteinContent": "6 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 serving",
    "sodiumContent": "131 mg",
    "sugarContent": "40 g",
    "transFatContent": "1 g",
    "unsaturatedFatContent": "13 g"
  },
  "prepTime": "PT90M",
  "recipeCategory": "Baked Goods",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1 kg (36 oz or 2.2 lbs) dried fruit",
    "190 grams (1 cup or 7oz) glace cherries",
    "360 mls (1.5 cup) brandy or other spirit of 35-40% ABV",
    "1 medium lemon zest & juice (, (should equal approx 2 tablespoons (30ml) of juice - a few mls either side is fine though)",
    "1 large orange zest & juice (, (should equal approx 5 tablespoons (70ml) of juice - a few mls either side is fine though)",
    "293 grams (1 cup + 6 tablespoons) vegan butter",
    "200 grams (1 packed cup) dark brown sugar",
    "3 tablespoons molasses or black treacle",
    "1 teaspoon almond extract",
    "312 grams (2 1/2 cups) all-purpose flour",
    "144 grams (1.5 cups) almond flour or ground almonds (, or fine almond meal)",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda (, bicarbonate of soda in the UK)",
    "2 teaspoons ground cinnamon",
    "1 teaspoon ground ginger",
    "1/2 teaspoon ground cloves",
    "1/2 teaspoon ground nutmeg",
    "175 grams (1 1/2 cups) chopped pecans (, or walnuts)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add all of the dried fruit and the glacé cherries to a large microwaveable bowl and pour over the brandy (or suggested alternative). Stir really well to coat then microwave on full power for about 2 minutes, or until the liquid is hot. The time will vary depending on the wattage of your microwave. Keep an eye on it through the door so it doesn't bubble up and overflow. Remove from the microwave, stir well once more than cover with a plate or cling-wrap and set aside to cool. It shouldn't be any more than lukewarm when you use it in the batter. Don't leave it longer than 2 1/2 hours or it will absorb too much liquid and you will struggle to mix your batter. If you don't have a microwave, tip the fruit and glacé cherries into a saucepan, pour over the brandy (or suggested alternative), stir, then heat until the liquid is just coming to a simmer. Turn off the heat, stir once more then cover with a lid and set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Grease a 9-inch cake pan that is at least 3 inches deep with vegan butter. Or you can use a 10 x 10 inch, 2-inch deep square pan"
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 300 ° F (150 °C) and place a shelf in the middle of the oven ready for the cake. Make sure there is lots of free height above it. Then place a large pan (something like a roaster) of tap water on the shelf below. If you have a fan/convection oven and you have the option to turn the fan/convection off and use it as a regular oven do that. If you don't then check your manual to see what adjustment you should make to the temperature. Generally it's recommended to bake about 68° F / 20°C cooler than the stated temperature, but this does vary by oven brand/model."
    },
    {
      "@type": "HowToStep",
      "text": "Roll out your parchment paper, place the cake pan on top and draw around it with a pen or pencil. Cut out the circle. Repeat so you have 2 circles. It's important to double line your pan with this recipe. Place both circles in the bottom of the pan."
    },
    {
      "@type": "HowToStep",
      "text": "Then unroll more paper. You need a length that is enough to reach around the outside of the pan. Cut it off the roll, then fold the paper in half lengthways so it's doubled up. Use this double layer to line the inside of your cake pan. It doesn't matter which way up you put it in. The butter will help you slide it in and stick it in place. If it's a little too long trim it to fit so there is about an inch overlap, but don't trim anything off the height. This piece needs to be taller than the top of the pan by at least 3 inches. The extra height helps to deflect heat and stop your cake catching during the long bake time. Once done set the pan aside."
    },
    {
      "@type": "HowToStep",
      "text": "As soon as the fruit mixture is lukewarm or cool you can make the cake batter."
    },
    {
      "@type": "HowToStep",
      "text": "Zest and juice the lemon and the orange and add them to the soaked fruit mixture. Give it a quick stir."
    },
    {
      "@type": "HowToStep",
      "text": "In a very large bowl (or stand mixer) add the vegan butter and the sugar. Beat them together until light and fluffy. There will be a lot of batter and it's heavy with fruit so give yourself plenty of room for stirring. I recommend a 5 or 6 quart bowl. If you don't have one that big use a big Dutch oven or soup pot."
    },
    {
      "@type": "HowToStep",
      "text": "Add the molasses and almond extract to the butter mixture and mix them together."
    },
    {
      "@type": "HowToStep",
      "text": "In another medium bowl add the flour, almond flour, baking powder, baking soda, cinnamon, ginger, cloves and nutmeg. Whisk them together to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Now it's time to add the dry ingredients and the fruit to the butter mixture. Add them alternately in two or three additions, beginning and ending with the dry ingredients. Stir after each addition, but only until just combined. Doing it this way helps to ensure you don't over-mix the batter while also making sure the ingredients are combined well."
    },
    {
      "@type": "HowToStep",
      "text": "Finally add the chopped nuts and fold them through gently."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon the batter into the prepared cake pan. Level the top with a spatula and place in the oven on the middle shelf. Bake for 2 3/4 to 3 hours, or until a skewer, toothpick or thin sharp knife inserted into the middle comes out clean. This length of time is not a mistake. That's how long a fruit cake of this size takes. If using a 10 x 10 inch, 2-inch deep square pan it will probably be ready 10 to 15 minutes earlier."
    },
    {
      "@type": "HowToStep",
      "text": "When the cake is nearly ready have a small bowl with 3 tablespoons of brandy (or whatever liquid you used in the cake batter) and a pastry brush handy along with a roll of parchment paper and foil."
    },
    {
      "@type": "HowToStep",
      "text": "Once done, remove the cake from the oven. Immediately brush the top all over with the brandy/ other liquid. Keep brushing until it's all used up. Then very carefully using oven mitts because it's very hot, wrap the whole thing, pan and all in at least a double layer of foil. Scrunch or fold it so there are no gaps for steam to escape. Leave the cake on a cooling rack, trivet or your stove top to cool absolutely completely. This will take approximately 9 hours. By doing this you trap all of the moisture inside the cake, making it beautifully moist. There's nothing worse than a dry fruit cake!"
    },
    {
      "@type": "HowToStep",
      "text": "Once it's completely cool, you can unwrap the cake, carefully remove it from the cake pan, then either eat it, or rewrap for storage and feeding. I recommend first wrapping it in parchment paper, then at least a double layer of foil. There needs to be no gaps. Be generous and don't skimp and don't just use foil as it can react with the fruit in the cake. That's why it's important to wrap in the paper first. Once thoroughly wrapped you can place the cake in a tin or other storage container and store it somewhere cool like the back of the pantry, a cool cupboard or closet or a cool basement."
    },
    {
      "@type": "HowToStep",
      "text": "If you used 35-40 % ABV alcohol in the cake and feed it regularly it can be kept like this for up to 4 months. It will mature, the flavours will develop and it will get better and better. OR you can pop it in a large freezer bag or airtight container and freeze it right away for up to 1 year. OR you can feed it for a few months to develop the amazing flavour, then freeze it for up to 1 year. If you used weaker alcohol like port or sherry I wouldn't store it for longer than 2 months, but you can still freeze it for up to 1 year either before or after feeding. If you made the cake alcohol-free then you can store it like this for up to 1 month as long as you feed it twice to keep it nice and moist. It will also freeze well for up to 1 year."
    },
    {
      "@type": "HowToStep",
      "text": "To feed:For cakes made with alcohol: Carefully unwrap the cake, and the first time, use a skewer or thin sharp knife to prick a few deep (about 1 inch) holes in the surface of the cake. Then either brush or slowly drizzle 2 tablespoons (30 ml) of whatever alcohol you used in the batter all over the top of the cake. Give it a minute or two to absorb, then rewrap the cake and stash it away again. Repeat this either weekly or 2 weekly (depending on how strong you want the alcohol flavour) until you want to cut and eat the cake, up to a maximum of 5 times. If at any time you open it and it looks wet on top then stop feeding it for a few weeks. If you plan on icing the cake don't feed it for a week before icing so the surface dries out nicely. For alcohol-free cakes: Follow the feeding instructions above, but use whatever liquid you used in the batter (or a complimentary one) but only feed it 2 tablespoons (30 ml) a maximum of 2 times over the 4 week storage period. This will be sufficient to keep it moist. If you plan on icing the cake don't feed it for a week before icing so the surface dries out nicely."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://avirtualvegan.com/vegan-christmas-cake"
  ],
  "totalTime": "PT795M",
  "updatedAt": "2022-12-02T11:49:40.315Z"
}
