{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "45",
    "ratingValue": "4.96"
  },
  "author": {
    "@type": "Person",
    "name": "Yup, it's Vegan"
  },
  "cookTime": "PT35M",
  "createdAt": "2022-12-02T12:18:16.199Z",
  "datePublished": "2017-05-02T18:50:57+00:00",
  "description": "Decadent vegan tres leches cake, made up of a vanilla sponge cake soaked in sweet caramel syrup.",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2017/05/vegan-tres-leches-cake-square.jpg"
  ],
  "keywords": "dairy-free tres leches, vegan tres leches cake",
  "name": "Vegan Tres Leches Cake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "221 kcal",
    "carbohydrateContent": "30 g",
    "fatContent": "10 g",
    "fiberContent": "1 g",
    "proteinContent": "3 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 slice",
    "sodiumContent": "259 mg",
    "sugarContent": "15 g",
    "unsaturatedFatContent": "8 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "dairy-free",
  "recipeIngredient": [
    "1 cup plain, unsweetened soy milk",
    "2 tsp apple cider vinegar (or other vinegar)",
    "170 g all-purpose flour (1 and 1/2 cups)",
    "1 tsp baking soda",
    "1/2 tsp baking powder",
    "1/2 tsp kosher salt",
    "1/3 cup vegetable oil (coconut oil is not recommended)",
    "2/3 cup cane sugar (or use coconut sugar, cake will have a darker color)",
    "1 tbsp vanilla extract",
    "1/2 tsp almond extract",
    "1 cup vegan sweetened condensed milk",
    "1 14- oz. can full-fat coconut milk (, refrigerated overnight)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a mixing bowl, stir together the soy milk and apple cider vinegar."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 350 degrees Fahrenheit, and lightly grease an 8-by-8 or 7-by-11 inch baking dish."
    },
    {
      "@type": "HowToStep",
      "text": "In a separate bowl, whisk together the flour, baking soda, baking powder, and salt."
    },
    {
      "@type": "HowToStep",
      "text": "To the bowl with the soy milk, add the oil, sugar, vanilla extract, and almond extract. Whisk well to combine. Stir in the dry mixture and mix until no lumps remain."
    },
    {
      "@type": "HowToStep",
      "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean. (Wait until at least 20 minutes have passed before opening the oven door at all). The 7-by-11 cake size takes around 30 minutes to bake, and the 8-by-8 size takes around 35 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Let the cake cool for at least an hour. (You could potentially prepare the sweetened condensed milk while the cake bakes and cools). Using a chopstick, skewer, or a toothpick in a pinch, poke holes throughout the cake, spaced about 1/2 inch apart. The distance isn't very important, just make to poke lots of holes all over."
    },
    {
      "@type": "HowToStep",
      "text": "Retrieve the coconut milk from the refrigerator and gently scoop out the cream on top. Either turn this into coconut whip to top the cake if you like, or reserve it for another use (curry, etc.). Take the rest of the liquid from the can and mix it together with the sweetened condensed milk. Pour this milk mixture over the top of the cake. You'll need to do it in several stages, waiting in between for the cake to soak up the milk. When the cake is pretty much saturated with the milk, you're done - you may or may not need all of it."
    },
    {
      "@type": "HowToStep",
      "text": "This cake is best served cold, so if you have time, refrigerate it. However, it still tastes pretty darn good if you eat it right away :) leftovers will keep for up to 3 days in the fridge."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://yupitsvegan.com/vegan-tres-leches-cake"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-02T12:18:16.197Z"
}
