{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT40M",
  "createdAt": "2022-11-28T22:47:38.000Z",
  "datePublished": "2019-09-30T09:30:54+00:00",
  "description": "This hearty butternut squash pasta is made with a light white wine sauce, tender kale, and chunks of sweet, caramelized roasted butternut squash. It&#x27;s easy to make and perfect for everything from special occasions to weeknight dinners!",
  "image": {
    "@type": "ImageObject",
    "height": 1020,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2019/09/butternut-squash-pasta-8-of-8.jpg",
    "width": 680
  },
  "keywords": "butternut squash recipe, pasta dinner, vegan pasta recipe",
  "name": "Vegan Roasted Butternut Squash Pasta with Kale & Walnuts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "510 kcal",
    "carbohydrateContent": "75.8 g",
    "fatContent": "17 g",
    "fiberContent": "8.1 g",
    "proteinContent": "14.9 g",
    "saturatedFatContent": "1.9 g",
    "servingSize": "1 serving",
    "sodiumContent": "280 mg",
    "sugarContent": "6.4 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "2 pounds butternut squash, (cut into 1/2-inch cubes (about 5-6 cups of squash)",
    "3 tablespoons olive oil, (plus a few dashes, divided)",
    "1/2 teaspoon salt, (plus more as needed)",
    "10 ounces dried fettuccine pasta (or pasta of choice)",
    "1 medium bunch kale, (stems removed and torn into bite-sized pieces (about 6 cups of kale)",
    "1/2 cup finely diced onion",
    "2 garlic cloves, (minced)",
    "1/2 cup dry white wine",
    "2 tablespoons finely chopped fresh sage",
    "1/4 teaspoon ground nutmeg",
    "1/2 cup chopped walnuts"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400°F and line a large baking sheet (or a couple of small ones) with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Place the squash into a medium bowl and drizzle it with 1 tablespoon of olive oil. Use your hands to rub the olive oil all over the squash."
    },
    {
      "@type": "HowToStep",
      "text": "Distribute the squash in an even layer on the baking sheet and sprinkle it with a few dashes of salt."
    },
    {
      "@type": "HowToStep",
      "text": "Place the squash in the oven and bake it until the pieces are tender and just starting to brown around the edges, about 25 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the squash roasts, bring a large pot of salted water to a boil. Set the timer to cook the pasta to al dente (refer to the package instructions)."
    },
    {
      "@type": "HowToStep",
      "text": "When the timer has about 30 seconds left on it, add the kale to the water. Stir in the kale to make sure it all gets submerged."
    },
    {
      "@type": "HowToStep",
      "text": "When the timer goes off, drain the kale and the pasta together into a colander. Return them to the pot and toss with a dash of olive oil to prevent sticking."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large skillet with 2 tablespoons of olive oil and place it over medium-high heat."
    },
    {
      "@type": "HowToStep",
      "text": "Give the oil a minute to heat up, and then add the onion. Cook the onion for about 5 minutes, until it softens up and just begins to brown."
    },
    {
      "@type": "HowToStep",
      "text": "Add the garlic and cook for about 1 minute, until very fragrant."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the wine. Bring the wine to a boil, lower the heat and allow it to cook at a low simmer until reduced by about half, about 4 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the sage and nutmeg, followed by the pasta and kale."
    },
    {
      "@type": "HowToStep",
      "text": "Cook everything for a minute or two, just until heated throughout, then gently stir in the squash."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the skillet from the heat and season the pasta with 1/2 teaspoon of salt, plus more to taste. Sprinkle with walnuts."
    },
    {
      "@type": "HowToStep",
      "text": "Divide onto plates and serve."
    }
  ],
  "recipeYield": "5",
  "sameAs": [
    "https://connoisseurusveg.com/butternut-squash-pasta"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-11-28T16:12:06.756Z"
}
