{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Yup, it's Vegan"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-03T05:04:12.981Z",
  "datePublished": "2014-06-27T07:00:35+00:00",
  "description": "Delectable vegan strawberry sweet rolls, made from lemon scented dough stuffed with a fresh strawberry filling, and topped off with caramel glaze.",
  "image": [
    "https://yupitsvegan.com/wp-content/uploads/2014/06/vegan_strawberry_sweet_rolls_lemon_caramel_glaze_1.jpg"
  ],
  "keywords": "strawberry sweet rolls",
  "name": "Vegan Strawberry Sweet Rolls with Lemon Caramel Glaze",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "237 kcal",
    "carbohydrateContent": "47 g",
    "fatContent": "4 g",
    "fiberContent": "5 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 strawberry sweet roll",
    "sodiumContent": "71 mg",
    "sugarContent": "12 g",
    "unsaturatedFatContent": "3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "dairy-free",
  "recipeIngredient": [
    "1/2 cup coconut milk (warmed (the kind from a can; or use another non-dairy milk and add 1 tsp extra oil)",
    "1/3 cup coconut sugar (or brown sugar)",
    "1 packet active dry yeast (2 and 1/4 tsp)",
    "1 and 1/4 cups whole wheat pastry flour",
    "1 cup all-purpose flour (plus more for working with the dough)",
    "1/4 tsp salt",
    "2 tbsp grapeseed oil (substitute coconut oil, organic canola oil, or another neutral oil)",
    "1 ripe banana (mashed well)",
    "1 tbsp lemon juice",
    "1 tsp lemon zest",
    "1 cup chopped fresh strawberries",
    "3 tbsp brown rice syrup (or use 2 tbsp of agave nectar)",
    "1/4 tsp vanilla extract",
    "1/2 tbsp ground flaxseed (or use ground chia seed or coconut flour)",
    "1 tbsp cornstarch",
    "pinch salt",
    "1/4 cup brown rice syrup",
    "2 tbsp nondairy milk"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Stir the coconut sugar and yeast into the warm coconut milk to proof it. Watch for it to get frothy to be sure that the yeast is working."
    },
    {
      "@type": "HowToStep",
      "text": "In a mixing bowl, combine the flours and salt. Make a well in the center and pour in the proofed yeast mixture, then add the grapeseed oil, mashed banana, and lemon juice and zest."
    },
    {
      "@type": "HowToStep",
      "text": "Stir with a fork until everything is combined into a smooth dough. Transfer to a floured surface (or get out your Kitchenaid mixer), and knead the dough for 8-10 minutes, incorporating more flour as needed, until the dough is smooth and the gluten is fully formed. It should be well-shaped and springy to the touch, but still a little tacky (moist)."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the dough with a damp towel and place somewhere warm for 60-90 minutes, or until approximately doubled in size. (You can also cover it with plastic wrap and let it rise in the refrigerator for several hours)."
    },
    {
      "@type": "HowToStep",
      "text": "Punch down the dough and transfer it back onto a large, floured piece of parchment paper, and roll it out into a rectangular shape, approximately 10 by 12 inches. Keep it covered with the damp towel while you prepare the filling. You don't need to do the parchment paper in this step, but it will help to contain the mess. Up to you."
    }
  ],
  "recipeYield": "9",
  "sameAs": [
    "https://yupitsvegan.com/2014/06/27/strawberry-sweet-rolls-lemon-caramel-glaze"
  ],
  "totalTime": "PT180M",
  "updatedAt": "2022-12-03T05:04:12.979Z"
}
