{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "316",
    "ratingValue": "4.89"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-11-29T09:04:31.000Z",
  "datePublished": "2016-04-07T05:00:57+00:00",
  "description": "Hearty, flavorful Vegan Sloppy Joes made with fresh, simple ingredients, naturally sweetened, and they require just 30 minutes! Savory, smoky, perfectly sweet — a delicious plant-based meal!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/03/Vegan-Sloppy-Joes-SQUARE.jpg"
  ],
  "keywords": "vegan sloppy joes",
  "name": "Vegan Sloppy Joes",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "298 kcal",
    "carbohydrateContent": "44.6 g",
    "fatContent": "8 g",
    "fiberContent": "17.1 g",
    "proteinContent": "14.4 g",
    "saturatedFatContent": "1.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "614 mg",
    "sugarContent": "13.5 g"
  },
  "prepTime": "PT5M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "2 cups water",
    "1 cup green or red lentils, well rinsed (red lentils for quicker/more tender result or green lentils for more bite/texture)",
    "2 Tbsp olive or grape seed oil",
    "1/2 medium white or yellow onion, minced (plus more for serving)",
    "2 cloves garlic, minced (2 cloves yield ~1 Tbsp)",
    "1/2 medium red or green bell pepper, diced",
    "Sea salt and black pepper (to taste)",
    "1 15-ounce can tomato sauce*",
    "1-2 Tbsp coconut sugar (plus more to taste)",
    "1-2 Tbsp vegan-friendly Worcestershire sauce*",
    "1-2 tsp chili powder (plus more to taste)",
    "1 tsp ground cumin (plus more to taste)",
    "1 pinch smoked or regular paprika (optional)",
    "Gluten-free or whole-wheat hamburger buns*"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If using green lentils: To a small saucepan, add liquid (I used 1 cup water, 1 cup vegetable broth for added flavor // amount as original recipe is written // adjust if altering batch size) and rinsed green lentils and heat over medium-high heat. Bring to a low boil, then reduce heat to a simmer and cook covered for about 18-22 minutes, or until tender. The water should have a constant simmer (not boil). Drain off any excess liquid and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "If using red lentils: To a small saucepan, add liquid (water and/or vegetable broth) and bring to a boil over high heat. Once boiling, add rinsed red lentils and bring back to a gentle boil. Reduce heat to a simmer and cook uncovered, stirring occasionally, for 7-10 minutes, or until just tender. You want them to be cooked through but not mushy. Drain well and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, heat a large skillet over medium heat. Once hot, add oil, onion, garlic, and bell pepper. Season with a pinch each salt and pepper and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Sautè for 4-5 minutes, stirring frequently, or until the peppers and onions are tender and slightly browned."
    },
    {
      "@type": "HowToStep",
      "text": "Next add tomato sauce, coconut sugar, vegan worcestershire sauce, chili powder, cumin, and paprika (optional). Stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Once the lentils are cooked, add them to the skillet as well, and stir to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Continue cooking the mixture over medium-low heat until completely warmed through and thick, stirring occasionally - about 5-10 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more chili powder and/or cumin for smokiness, salt for saltiness, coconut sugar for sweetness, or worcestershire for depth of flavor."
    },
    {
      "@type": "HowToStep",
      "text": "Serve the mixture on toasted buns with sliced onion. Best when fresh, though leftover sloppy joe mixture will keep in the refrigerator up to 4-5 days, or in the freezer for 1 month. Reheat in the microwave, or on the stovetop, adding water or vegetable broth if the mixture has dried out."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/vegan-sloppy-joes"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-05T20:15:30.459Z",
  "video": {
    "@type": "VideoObject",
    "contentUrl": "https://www.youtube.com/watch?v=Bta_gtw7PMg",
    "description": "Hearty, flavorful Vegan Sloppy Joes made with fresh, simple ingredients, naturally sweetened, and they require just 30 minutes! Savory, smoky, perfectly sweet - a delicious plant-based meal!\n\nFull Recipe: https://minimalistbaker.com/vegan-sloppy-joes/\n\nYou may think of Sloppy Joes as an American classic (and that may be true), but the origin story isn’t crystal clear! One theory is that the dish was created in the 1930s by a Sioux City, Iowa chef named Joe. But another popular story is that it may have actually originated in Havana, Cuba. It’s thought that a bar owner named José García created it as a handheld modification of a Cuban dish called ropa vieja. The concept may have then been introduced by Ernest Hemmingway to a bar in Florida.\n \nFOLLOW US!\nBlog: http://minimalistbaker.com/\nInstagram: https://instagram.com/minimalistbaker/\nTwitter: https://twitter.com/minimalistbaker\nFacebook: https://www.facebook.com/MinimalistBaker",
    "duration": "PT55S",
    "embedUrl": "https://www.youtube.com/embed/Bta_gtw7PMg?feature=oembed",
    "name": "Vegan Sloppy Joes | Minimalist Baker Recipes",
    "thumbnailUrl": "https://i.ytimg.com/vi/Bta_gtw7PMg/hqdefault.jpg",
    "uploadDate": "2018-11-23T11:30:00+00:00"
  }
}
