{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "10",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T00:04:10.350Z",
  "datePublished": "2014-06-07T05:00:13+00:00",
  "description": "7-ingredient vegan pop tarts made with whole grain pastry and strawberry-rhubarb compote. Simple, fast, and perfect for using up spring and summer fruit.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/05/Rhubarb-Pop-Tarts-SQUARE.jpg"
  ],
  "keywords": "vegan pop tarts",
  "name": "Vegan Strawberry Rhubarb Pop-Tarts",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "237 kcal",
    "carbohydrateContent": "27 g",
    "fatContent": "12 g",
    "fiberContent": "3.5 g",
    "proteinContent": "3.2 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 pop tarts",
    "sodiumContent": "193 mg",
    "sugarContent": "4.3 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Breakfast",
  "recipeCuisine": "Vegan",
  "recipeIngredient": [
    "1 cup rhubarb (ends and leaves removed // chopped)",
    "1/2 cup strawberries (chopped)",
    "1/4 cup orange juice (optional)",
    "2 Tbsp raw sugar or maple syrup (or honey if not vegan)",
    "2 cups flour (I used half whole-wheat pastry + half unbleached all-purpose // plus more for rolling)",
    "1/4 tsp sea salt",
    "2/3 cup cold vegan butter (such as Earth Balance // more for topping)",
    "1 cup powdered sugar",
    "1/2 Tbsp melted vegan butter",
    "2-3 tsp pomegranate juice (or other similar juice)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and line a baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Prepare the compote by placing rhubarb, strawberries, raw sugar, and orange juice in a small saucepan over medium heat. Cover and cook for 10 minutes, stirring occasionally and smashing down with a spoon to muddle the fruit together. If it bubbles too much, turn down to low heat. Transfer to a bowl to cool."
    },
    {
      "@type": "HowToStep",
      "text": "In a large bowl, mix flour and salt, then cut in butter with a fork or pastry cutter until well combined."
    },
    {
      "@type": "HowToStep",
      "text": "Drizzle ice cold water over the mixture in 1 Tablespoon amounts and mix with a wooden spoon until it starts to form a dough. It usually takes about 2-3 Tbsp, but you may need to add up to 5 Tbsp (amounts as original recipe is written // adjust if altering batch size). It should be moist enough to form into a ball, but not too sticky to handle. Add more flour if it gets too wet."
    },
    {
      "@type": "HowToStep",
      "text": "Turn onto a floured surface, gently shape into a disc, and then use a floured rolling pin to roll into a large rectangle. I find it helpful to place a sheet of plastic wrap over the dough while rolling to reduce cracking."
    },
    {
      "@type": "HowToStep",
      "text": "Cut into 16 equal squares (amount as original recipe is written // adjust if altering batch size) and carefully transfer to a baking sheet. My first attempt, I got 12 squares. Then I rolled out my scraps and got four more!"
    },
    {
      "@type": "HowToStep",
      "text": "Place about 1 Tbsp of the fruit filling onto half of the squares, leaving a 1/4 inch border to seal the edges. Then use your finger to run water around the edges so the two squares stick together. Top the squares with their matching halves and then seal lightly with a fork."
    },
    {
      "@type": "HowToStep",
      "text": "Poke a few holes in the top of each pop tart, brush with a bit of melted vegan butter, sprinkle with raw sugar (optional), and bake for 20-25 minutes or until golden brown."
    },
    {
      "@type": "HowToStep",
      "text": "Let cool and then top with glaze if desired. To prepare glaze, simply whisk together melted vegan butter, powdered sugar and add juice 1 teaspoon at a time until desired consistency is reached. The glaze is not necessary, but recommended for sweeter pop tarts."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers in a covered container at room temp for up to a few days."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/vegan-strawberry-rhubarb-pop-tarts"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-03T00:04:10.349Z"
}
