{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "26",
    "ratingValue": "4.7"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-04T18:50:39.836Z",
  "datePublished": "2015-09-03T05:00:04+00:00",
  "description": "Fluffy, amazing vegan whoopie pies made in just 1 bowl with simple methods! Almost 100% naturally sweetened, gluten-free, and so delicious.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/08/Whoope-Pie-SQUARE.jpg"
  ],
  "keywords": "whoopie pie",
  "name": "Vegan Whoopie Pies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "170 kcal",
    "carbohydrateContent": "16.9 g",
    "fatContent": "11.8 g",
    "fiberContent": "2.7 g",
    "proteinContent": "2.4 g",
    "saturatedFatContent": "7.6 g",
    "servingSize": "1 whoopie pies",
    "sodiumContent": "109 mg",
    "sugarContent": "9.1 g"
  },
  "prepTime": "PT90M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1/2 cup unsweetened plain almond milk",
    "3/4 tsp apple cider vinegar or lemon juice",
    "1 1/2 tsp baking soda",
    "2 Tbsp flaxseed meal (to make flax eggs)",
    "5 Tbsp water (to make flax eggs)",
    "1/4 cup avocado oil",
    "1/3 cup coconut sugar (or sub organic cane sugar)",
    "1/3 cup maple syrup or agave nectar",
    "3/4 cups unsweetened applesauce",
    "1/2 tsp pure vanilla extract",
    "1/4 tsp sea salt",
    "1/2 tsp baking powder",
    "1/2 heaping cup unsweetened cocoa powder",
    "1/2 cup almond meal (finely ground from raw almonds)",
    "1/4 cup gluten-free oat flour (finely ground from raw oats)",
    "3/4 heaping cups gluten-free flour blend*",
    "2 batches coconut whipped cream"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large mixing bowl, prepare your coconut whipped cream with your chilled coconut cream. Follow these instructions to make a double batch, sweetened to taste (I found 6-8 Tbsp (42-56 g) to be the right amount // amounts as original recipe is written // adjust if altering batch size). Transfer whipped cream to a large freezer bag (for piping) and set in the refrigerator to chill completely. Rinse out the mixing bowl to use for the batter."
    },
    {
      "@type": "HowToStep",
      "text": "Measure out almond milk in a liquid measuring cup and add apple cider vinegar (or lemon juice) and baking soda and stir. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "In your large mixing bowl, prepare flax eggs by combining water and flaxseed meal. Let rest for 5 minutes while you prepare your other ingredients."
    },
    {
      "@type": "HowToStep",
      "text": "Add the oil, coconut sugar, and maple syrup and whisk to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Next add applesauce, vanilla, and salt, and whisk to combine. Then add almond milk mixture and whisk again until everything is thoroughly incorporated - about 30 seconds."
    },
    {
      "@type": "HowToStep",
      "text": "Lastly, add baking powder, cocoa powder, almond meal, oat flour, and gluten-free flour, and whisk to combine, making sure no large clumps remain."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer batter to the refrigerator to chill/thicken for 20 minutes, and preheat oven to 350 degrees F (176 C). Grease two large baking sheets with non-stick spray (if you don’t have two baking sheets, just use one and bake the cakes in 4 batches // use fewer or more baking sheets, as needed, if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the oven is preheated, scoop out 1 heaping Tbsp amount of batter onto the prepared baking sheets, leaving at least 1-inch of room for spreading. Use your tablespoon to slightly spread them into a small disc. One standard baking sheet should fit 12 cakes. Repeat on second baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Bake for 10-14 minutes, or until the edges appear dry. (I found 12 minutes to be the perfect time.) Remove from oven and let rest on baking sheet for 5 minutes, then carefully transfer to cooling racks to cool completely."
    },
    {
      "@type": "HowToStep",
      "text": "Repeat this process, baking the mini cakes until all batter is used - you should have about 48 total cakes (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the cakes are completely cooled to the touch, clip a small corner of the coconut whipped cream bag off and pipe a generous amount (see photo) of coconut whipped cream onto the under-side of half the cakes (24 as original recipe is written // adjust if altering batch size). Carefully top with another cake of similar size and shape and press down slightly."
    },
    {
      "@type": "HowToStep",
      "text": "Arrange on large serving plates or a cooled baking sheet and cover loosely with plastic wrap. You can enjoy these immediately; however, I found them to hold up better after 1 hour of refrigeration (and even better after 6 hours or overnight)."
    },
    {
      "@type": "HowToStep",
      "text": "Leftovers will keep covered with plastic wrap in the refrigerator for 3-4 days."
    }
  ],
  "recipeYield": "24",
  "sameAs": [
    "https://minimalistbaker.com/vegan-whoopie-pies"
  ],
  "totalTime": "PT120M",
  "updatedAt": "2022-12-04T18:50:39.835Z"
}
