{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "3",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-02T01:05:20.576Z",
  "datePublished": "2016-01-07T05:00:15+00:00",
  "description": "A 30-minute INSANELY flavorful Thai Papaya Salad with fresh vegetables and a zingy garlic-peanut sauce! Just as good as takeout and entirely plant-based.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/12/Papaya-Salad-SQUARE.jpg"
  ],
  "keywords": "papaya salad",
  "name": "Vegan Papaya Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "152 kcal",
    "carbohydrateContent": "29.6 g",
    "fatContent": "3.5 g",
    "fiberContent": "5.1 g",
    "proteinContent": "4 g",
    "servingSize": "1 side salads",
    "sodiumContent": "618 mg",
    "sugarContent": "19.6 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Salad",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 small underripe (green) papaya*",
    "3 large whole carrots (peeled)",
    "1 cup green cabbage (chopped into bite-size pieces)",
    "2 medium plum tomatoes (halved and cut into bite-size pieces)",
    "2 leaves romaine lettuce (optional // loosely chopped // for garnish/serving)",
    "2 cloves garlic (peeled and chopped)",
    "2 Tbsp dry-roasted salted peanuts (plus more for serving)",
    "2 medium fresh or dried bird's eye chilies",
    "1 heaping Tbsp coconut sugar",
    "1/4 heaping tsp salt",
    "1/4 cup lime juice (~2 small limes as original recipe is written)",
    "3-4 Tbsp vegan fish sauce"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "If you haven't already, prepare vegan fish sauce and set aside (find link above)."
    },
    {
      "@type": "HowToStep",
      "text": "See notes for tips on finding a green papaya (mine wasn't quite green, but it still worked!). Then move onto prepping the vegetables."
    },
    {
      "@type": "HowToStep",
      "text": "Once you've peeled your carrots, cut in half crosswise, and then cut those pieces in half lengthwise. Then use a mandolin* with a fine-tooth blade (or julienne peeler) to carefully shred the carrots into small strips (see photo). Continue until all carrots are shredded. Add to a mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare papaya, peel off the skin using a vegetable peeler, then halve lengthwise and scoop out seeds."
    },
    {
      "@type": "HowToStep",
      "text": "Cut into small segments and shred into small strips using your mandoline or julienne peeler. Add to mixing bowl."
    },
    {
      "@type": "HowToStep",
      "text": "Chop cabbage and tomatoes and add to mixing bowl as well. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "To prepare sauce, add garlic, peanuts, chilies, coconut sugar, and salt to a mortar or small food processor and mash or pulse until it's a fine paste."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a small mixing bowl and add lime juice and vegan fish sauce. Whisk to combine, then sample and adjust seasonings as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Add sauce to vegetables and toss to combine. To serve, lay down romaine lettuce on serving dish(es) (optional), and top with papaya salad. Garnish with additional crushed peanuts and lime wedges."
    },
    {
      "@type": "HowToStep",
      "text": "Best when fresh, though leftovers keep covered in the refrigerator for 2-3 days. Papaya salad would make an excellent side dish to spring rolls and Pad Thai!"
    }
  ],
  "recipeYield": "3",
  "sameAs": [
    "https://minimalistbaker.com/vegan-papaya-salad"
  ],
  "totalTime": "PT30M",
  "updatedAt": "2022-12-02T01:05:20.574Z"
}
