{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "16",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Melanie McDonald"
  },
  "cookTime": "PT18M",
  "createdAt": "2022-12-01T11:41:23.068Z",
  "datePublished": "2019-12-20T21:06:46+00:00",
  "description": "Soft, sweet and buttery homemade Vegan Sweet Potato Biscuits. Quick and easy to make and perfectly tall, flaky and tender. Comfort food at it’s best!",
  "image": [
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Vegan-Sweet-Potato-Biscuits-HERO-A-Virtual-Vegan-1.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Vegan-Sweet-Potato-Biscuits-HERO-A-Virtual-Vegan-1-500x500.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Vegan-Sweet-Potato-Biscuits-HERO-A-Virtual-Vegan-1-500x375.jpg",
    "https://avirtualvegan.com/wp-content/uploads/2019/12/Vegan-Sweet-Potato-Biscuits-HERO-A-Virtual-Vegan-1-480x270.jpg"
  ],
  "keywords": "sweet potato biscuit recipe, sweet potato biscuits, vegan biscuit recipe",
  "name": "Vegan Sweet Potato Biscuits",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "280 kcal",
    "carbohydrateContent": "41 g",
    "fatContent": "11 g",
    "fiberContent": "2 g",
    "proteinContent": "5 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 serving",
    "sodiumContent": "412 mg",
    "sugarContent": "5 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Side",
  "recipeCuisine": "vegan",
  "recipeIngredient": [
    "1/2 cup + 1 tablespoon + 1 teaspoon / 137 mls unsweetened plant-based milk (, cold straight from the fridge)",
    "1 cup / 218 g mashed sweet potato or yam (, use orange fleshed sweet potato not white (see notes for how to cook a sweet potato)",
    "2 1/2 cups / 312 g all purpose flour (plain flour in the UK) plus some extra for dusting your surface )",
    "2 tablespoons baking powder (, aluminum free is recommended)",
    "1 teaspoon fine salt",
    "1/2 a slightly heaping cup / 125 g vegan butter (, straight from the fridge (plus some extra for greasing the skillet)",
    "2 - 3 tablespoons maple syrup (real maple syrup, not pancake syrup), see notes for alternatives)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make sure to keep everything as cold as possible when making this recipe. If you have space, it's good to put the flour in the freezer for 20-30 minutes before you start, but longer is fine. Flour doesn't freeze solid and will stay useable no matter how long you leave it there. Keep the butter, sweet potato and milk in the fridge until the last possible moment too."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 425°F (218 °C) and have a shelf ready about 3/4 way up the oven. Grease a 9-10 inch cast iron skillet really well with vegan butter, or line a baking tray with parchment paper if you don't have a cast iron skillet. Keep the skillet/tray away from the preheating oven so it doesn't get warm."
    },
    {
      "@type": "HowToStep",
      "text": "Whisk the mashed sweet potato with half a cup (120 mls) of the milk and put it in the fridge so it stays nice and cold. Set aside the remaining small amount of milk. you might need it later."
    },
    {
      "@type": "HowToStep",
      "text": "To a food processor or a large bowl, add the flour, baking powder and salt. Pulse or whisk a couple of times to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Add the butter to the flour mixture. Pulse the food processor a few times, or cut the butter in with a pastry cutter or a fork, or by rubbing with the tips of your fingers. Keep going until it looks like breadcrumbs with tiny chunks of butter throughout. See my picture in the post above for a guide. In a food processor it will likely only need 3 or 4 pulses. Don't over process it. It's the little butter chunks that make the biscuits flaky."
    },
    {
      "@type": "HowToStep",
      "text": "Take the milky sweet potato mixture out of the fridge and pour it into the food processor/bowl. Pulse a few times to combine or mix gently. If it's a little too dry, add the remaining milk that you set aside earlier very gradually. Pulsing in between until when you touch the dough it feels like it will come together easily. Remove the blade, ball up the dough and wrap in cling wrap. Place in the fridge for 10 minutes while you clean up the mess you made so far and clean your work surface."
    },
    {
      "@type": "HowToStep",
      "text": "Dust the work surface with a generous sprinkle of flour. Remove the dough from the fridge. Unwrap it and roll it out gently into rough rectangle-like shape about 1/2 an inch thick. Dust the top with a little flour as needed to stop the rolling pin sticking and don't be too fussy about the shape. Gently fold one half of the rectangle into the centre, and then the other side too, a bit like an envelope. Check my pictures in the post for a visual guide. Then roll it back out and fold in the same way again. Do this a total of 4 times. It's important not to skip this as it is what creates the layers in the biscuits. Work as quickly as you can and touch the dough as minimally as you can with your hands to help keep it cool."
    },
    {
      "@type": "HowToStep",
      "text": "Once you're done with the folding, use your hands to pat it out to an even 1 inch thick and use a metal 3 inch cutter or a glass to cut the biscuit shapes. Do not twist the cutter. Use a straight up down motion and keep the cuts close to get as many as you can out of the dough. The first rolled batch is always the best so we want to limit how much dough is left."
    },
    {
      "@type": "HowToStep",
      "text": "Gently transfer the cut biscuits to the greased skillet/lined baking tray, then gather up the remaining dough into a ball and gently pat out to 1 inch thick again. Cut as many biscuits as you can out of it, probably only another 1 or 2, or until you have 8 biscuits."
    },
    {
      "@type": "HowToStep",
      "text": "I don't like to waste anything, so pat the remaining scrap of dough into a rough round shape and get it ready on a separate baking tray to put in the oven when the rest go in. That one's for you. Eat it as soon as it comes out of the oven. You earned it;O)"
    },
    {
      "@type": "HowToStep",
      "text": "Brush the top of each biscuit generously with maple syrup and put them in the oven. Cook for 18 to 20 minutes or until well risen and golden. Be sure not to open the door while they are baking as it will affect the rise."
    },
    {
      "@type": "HowToStep",
      "text": "Remove from the oven and enjoy warm. Store leftovers in an airtight container."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://avirtualvegan.com/vegan-sweet-potato-biscuits"
  ],
  "totalTime": "PT48M",
  "updatedAt": "2022-12-01T11:41:23.066Z"
}
