{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "128",
    "ratingValue": "4.72"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT15M",
  "createdAt": "2022-12-04T01:05:54.291Z",
  "datePublished": "2014-05-10T05:00:15+00:00",
  "description": "Vegan peanut butter cup no-bake pie with a graham cracker crust and chocolate ganache top! 8 ingredients, simple to prepare, and SO delicious you won't be able to have just 1 slice.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/04/PB-CUP-PIE-SQUARE.jpg"
  ],
  "keywords": "peanut butter pie",
  "name": "Vegan Peanut Butter Cup Pie",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "421 kcal",
    "carbohydrateContent": "38 g",
    "fatContent": "27 g",
    "fiberContent": "3.4 g",
    "proteinContent": "7 g",
    "saturatedFatContent": "13 g",
    "servingSize": "1 slices",
    "sodiumContent": "206 mg",
    "sugarContent": "25 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 sleeve graham crackers (or sub similar gluten-free cracker/cookie)",
    "4 1/2 Tbsp melted vegan butter or coconut oil",
    "12 ounces firm silken tofu (slightly drained and patted dry)",
    "1/2 cup creamy salted natural peanut butter (I like Trader Joe’s brand)",
    "1/4 cup agave nectar or maple syrup (or sub honey if not vegan)",
    "1 14-ounce can full-fat coconut milk OR coconut cream",
    "1 cup semisweet dairy-free chocolate chips",
    "1/3 cup non-dairy milk (I used full-fat coconut, but almond milk is fine, too)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 375 degrees F (190 C) and lightly oil a standard glass pie pan (8 inches x 1 1/4 inches // as original recipe is written)."
    },
    {
      "@type": "HowToStep",
      "text": "Add graham crackers to a food processor and process until you achieve a semi-fine meal. A little texture is OK, just remove any large pieces that didn't get ground. Add melted butter and pulse to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Add to greased pie pan and press down with your fingers to flatten. You can lay a piece of plastic wrap over the top when pressing down to ensure a more uniform layer. Bake for 10 minutes or until golden brown. Remove and set aside to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Add tofu, peanut butter, maple syrup or agave to a blender or food processor and blend until smooth, scraping down sides as needed. Taste and adjust seasonings as needed, adding more agave for added sweetness or a pinch of salt if your peanut butter wasn't very salted."
    },
    {
      "@type": "HowToStep",
      "text": "Next, scoop out the cream of your coconut milk or cream and whip into whipped cream in a large, chilled mixing bowl. Find trouble-shooting tips here. Optional: sweeten with a little powdered sugar and vanilla."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the peanut butter-tofu mixture into the whipped cream."
    },
    {
      "@type": "HowToStep",
      "text": "Pour filling over crust and pop in the freezer to chill. Once it's fairly chilled and slighty firm (about 1 hour), prepare your ganache."
    },
    {
      "@type": "HowToStep",
      "text": "Add chocolate chips to a bowl and heat your non-dairy milk to a low simmer. Then pour over chocolate chips and don't touch for 5 minutes to allow it to melt. Then stir gently with a spoon or rubber spatula until a smooth ganache forms. If it doesn't quite melt, you can also heat it in the microwave in 10 second increments until smooth and melted."
    },
    {
      "@type": "HowToStep",
      "text": "Spoon over the top of the pie and spread in an even layer with a knife or spatula, working quickly as the ganache will get clumpy if it sets too long."
    },
    {
      "@type": "HowToStep",
      "text": "Top with crushed, salted roasted peanuts (optional) and pop back in the freezer to set. 20-30 minutes before serving, remove from freezer and serve. Alternatively, you can chill this in the fridge, but it is much more delicate to slice and serve, but just as delicious."
    },
    {
      "@type": "HowToStep",
      "text": "After the initial chill, make sure you cover the pie with plastic wrap to keep it fresh."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://minimalistbaker.com/vegan-peanut-butter-cup-pie"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-04T01:05:54.290Z"
}
