{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Linda & Alex"
  },
  "cookTime": "PT20M",
  "createdAt": "2022-12-03T05:44:04.355Z",
  "datePublished": "2017-06-21T10:39:25+00:00",
  "description": "A vegan frittata made with fresh herbs that tastes like it was made with real eggs and cheese, only it's cruelty-free!",
  "image": [
    "https://cdn.veganosity.com/wp-content/uploads/2017/06/Vegan-Veggie-and-Herb-Frittata.jpg"
  ],
  "name": "Vegan Veggie and Herb Frittata",
  "prepTime": "PT15M",
  "recipeIngredient": [
    "• Two slices of bread",
    "• Six vegan eggs",
    "• Extra-virgin olive oil",
    "• 1/2 cup of almond milk",
    "• 1 medium sweet onion",
    "• One cup of fresh sliced mushrooms - white (baby Bella or your favorite)",
    "• One cup of fresh spinach",
    "• Two tablespoons total of freshly-chopped basil",
    "• Sea salt",
    "• Black pepper",
    "• Red pepper flakes",
    "• 3/4 cup of calamata olives - drained and halved",
    "• 1/2 cup vegan mozzarella shreds",
    "• 1/2 cup vegan cheddar shreds",
    "• One tomato"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Pre-heat your oven to 375 degrees."
    },
    {
      "@type": "HowToStep",
      "text": "Cut the bread into 1/2 inch cubes, toss with a drizzle of olive oil and a dash of sea salt and toast in the oven, shaking occasionally, until crisp."
    },
    {
      "@type": "HowToStep",
      "text": "While the bread is toasting, prepare six vegan eggs according to instructions. (I like to use ice-water.) Whisk 1/2 cup of almond milk into the eggs, along with 1/2 teaspoon of sea salt, the herb mixture, a dash of black pepper and a shake or two of red pepper flakes. (Feel free to adjust the seasoning level to suit your tastes.)"
    },
    {
      "@type": "HowToStep",
      "text": "Sauté the mushroom slices and onion over medium heat until the mushrooms are bronzed. Set the onion and mushroom aside on a plate, add the spinach to the hot pan and toss until the leaves are wilted. Coarsely chop the wilted spinach."
    },
    {
      "@type": "HowToStep",
      "text": "Fold the spinach and cheeses into the egg mixture, reserving half of the cheddar to sprinkle on top. Fold in the bread cubes, mushroom, onion and olives. Coat the inside of a 9-inch pie plate with olive oil and fill with the egg and vegetable mixture."
    },
    {
      "@type": "HowToStep",
      "text": "Garnish the top of the frittata with five thin slices of tomato and sprinkle with the remaining cheese. Bake at 375 for 20 minutes or until firm and slightly browned on top. Allow to rest for five or ten minutes prior to serving."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy!"
    }
  ],
  "recipeYield": "1",
  "sameAs": [
    "https://veganosity.com/vegan-veggie-and-herb-frittata"
  ],
  "totalTime": "PT35M",
  "updatedAt": "2022-12-03T05:44:04.353Z"
}
