{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "4.87"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa Saenz"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-11-28T12:45:27.000Z",
  "datePublished": "2022-11-18T09:43:56+00:00",
  "description": "Flaky puff pastry is stuffed with a sweet and savory mixture of mushrooms, butternut squash, pecans and rice to make this mouth-watering vegan vegetable Wellington. This stunning holiday main dish will please vegans, vegetarians, and omnivores alike!",
  "image": {
    "@type": "ImageObject",
    "height": 1200,
    "mime": "image/jpeg",
    "url": "https://www.connoisseurusveg.com/wp-content/uploads/2022/11/vegetable-wellington-22-sq-2.jpg",
    "width": 1200
  },
  "keywords": "butternut squash, mushrooms, pecans, puff pastry, thanksgiving",
  "name": "Vegan Vegetable Wellington",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "368 kcal",
    "carbohydrateContent": "44.6 g",
    "fatContent": "16.3 g",
    "fiberContent": "4.2 g",
    "proteinContent": "7.9 g",
    "saturatedFatContent": "6.1 g",
    "servingSize": "1 slice (1/6 of recipe)",
    "sodiumContent": "294 mg",
    "sugarContent": "4.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1/2 cup uncooked brown rice",
    "1 cup vegetable broth",
    "1 teaspoon dried thyme",
    "1/2 teaspoon dried rosemary",
    "1 teaspoon rubbed sage",
    "2 tablespoons olive oil, (divided)",
    "3 cups diced (1/2-inch) butternut squash (Note 1)",
    "8 ounces diced 1/2-inch) cremini mushrooms (about 3 cups of mushrooms)",
    "1 medium onion, (diced)",
    "2 garlic cloves, (minced)",
    "1/4 cup whiskey (Note 2)",
    "1 cup chopped pecans",
    "Salt & pepper, (to taste)",
    "1/4 cup all-purpose flour",
    "1 sheet (about 9 ounces) frozen puff pastry, thawed (Note 3)",
    "1 tablespoon vegan butter, (melted)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place the rice, broth, thyme, sage and rosemary into a small saucepan and set it over high heat."
    },
    {
      "@type": "HowToStep",
      "text": "Bring the liquid to a boil, lower the heat and cover. Allow the rice to simmer for about 40 minutes, until the liquid is fully absorbed."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the pot from heat and allow it to sit with the lid on for at least 5 minutes before uncovering."
    },
    {
      "@type": "HowToStep",
      "text": "While the rice cooks, preheat the oven to 400°."
    },
    {
      "@type": "HowToStep",
      "text": "Toss the squash with 1 teaspoon of olive oil and and toss the mushrooms with 2 teaspoons of oil. Arrange them separately on the baking sheets."
    },
    {
      "@type": "HowToStep",
      "text": "Place the baking sheets into the oven and bake until the squash and mushrooms are tender, about 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the baking sheets from the oven but leave the oven on."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large skillet with the remaining tablespoon of olive oil and place it over medium heat."
    },
    {
      "@type": "HowToStep",
      "text": "When the oil is hot, add the onion. Sweat the onion until soft and translucent, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add the garlic and sauté another minute, until very fragrant."
    },
    {
      "@type": "HowToStep",
      "text": "Lower the heat and carefully add the whiskey (Note 4). Raise the heat back to medium, bring the whiskey to a simmer it simmer for about 2 minutes, until most of the liquid has cooked off."
    },
    {
      "@type": "HowToStep",
      "text": "Add 1 cup of the cooked rice (Note 5), squash, mushrooms and pecans to the skillet. Stir a few times to mix everything up."
    },
    {
      "@type": "HowToStep",
      "text": "Taste-test the mixture at this point (careful, as it will be hot) and season it with salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "text": "Sprinkle the flour over the mixture and stir to incorporate. Remove the skillet from the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Line a baking sheet with parchment paper."
    },
    {
      "@type": "HowToStep",
      "text": "Place the puff pastry on a lightly floured surface and roll it to about a 12-inch square. Transfer it to the baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "Pile the filling on the puff pastry, forming a long rectangle extending down the center of the puff pastry sheet. Shape the filling with your hands and pack it in. It should seem like a lot, but you can remove some if it's way too much."
    },
    {
      "@type": "HowToStep",
      "text": "Option 1: Braid the dough. Use a knife to cut approximately 1-inch strips down either side of the rectangle, stopping about a half in from the strip of filling. Starting at the bottom, fold the strips inward at a slight diagonal, over the filling, pinching opposite strips together."
    },
    {
      "@type": "HowToStep",
      "text": "Option 2: Simply fold the top and bottom ends of the puff pastry over the filling, then wrap the sides overtop to form a log shape, pinching tightly at the seams to form a seal. Poke a few holes in the dough to allow steam to escape."
    },
    {
      "@type": "HowToStep",
      "text": "Brush the pastry with the melted butter."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the log until golden and puffy, 30-35 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Allow the vegetable Wellington to cool just for a couple minutes, then slice and serve."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/vegetable-wellington"
  ],
  "totalTime": "PT100M",
  "updatedAt": "2022-11-28T05:39:11.921Z"
}
