{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "31",
    "ratingValue": "4.97"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT55M",
  "createdAt": "2022-12-03T22:22:21.343Z",
  "datePublished": "2018-12-20T10:11:13+00:00",
  "description": "This Vegan Meatloaf is flavorful, decadent, nutty and great for anyone wanting a no bean/lentil loaf. Use nuts of choice in this Nut Roast. Vegan Recipe. Can be Glutenfree Soyfree",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2018/12/vegan-meatloaf-nut-roast-veganricha-5671-2-e1545121495510.jpg",
    "https://www.veganricha.com/wp-content/uploads/2018/12/vegan-meatloaf-nut-roast-veganricha-5671-2-e1545121495510-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2018/12/vegan-meatloaf-nut-roast-veganricha-5671-2-e1545121495510-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2018/12/vegan-meatloaf-nut-roast-veganricha-5671-2-e1545121495510-480x270.jpg"
  ],
  "keywords": "nut loaf, nut roast, vegan nut roast, vegetarian meatloaf",
  "name": "Vegan Meatloaf - Nut Loaf Recipe",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "317 kcal",
    "carbohydrateContent": "34 g",
    "fatContent": "17 g",
    "fiberContent": "5 g",
    "proteinContent": "9.5 g",
    "saturatedFatContent": "2 g",
    "servingSize": "1 serving",
    "sodiumContent": "556 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 1/4 cups nuts (I use a combination of raw or roasted cashews, raw walnuts, raw pecans)",
    "1/4 cup sunflower seeds",
    "2 tsp oil (or use 1/4 cup broth)",
    "1 cup chopped onion",
    "4 cloves of garlic (chopped)",
    "1 cup chopped mushrooms (cremini or white or a mix)",
    "1 cup cubed butternut squash (, heaping cup)",
    "2 tsp italian herbs (1/2 tsp each thyme, ground sage, rosemary, oregano)",
    "1 tsp smoked paprika",
    "3/4 tsp poultry seasoning (poultry seasoning is just herbs). or use more sage and thyme)",
    "1/2 tsp black pepper",
    "1/4 tsp each cinnamon and nutmeg",
    "1/2 tsp onion powder",
    "1/2 to 3/4 tsp salt (less or more depending on if the breadcrumbs are already salty, if using regular or low sodium soy sauce etc)",
    "2 tbsp soy sauce ( or tamari for gf ( or use a combination of balsamic vinegar and coconut aminos for soyfree)",
    "2 flax eggs (mix 2 tbsp flaxseed meal mixed with 5 tbsp water)",
    "2/3 cup breadcrumbs (use glutenfree breadcrumbs or coarsely ground oats for glutenfree)",
    "1/4 cup ketchup",
    "1.5 tbsp soy sauce/tamari (, or use 1/4 tsp salt + 1 tbsp broth for soyfree)",
    "1 tbsp maple syrup",
    "2 tsp apple cider vinegar",
    "1/2 tsp garlic powder",
    "1 tsp sriracha (, optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Toast the raw cashews and sunflower seeds in the oven at 325 deg F (160 C) for 5 mins. Or toast on a skillet over medium heat until golden. (optional if using pre-roasted nuts). Preheat the oven to 350 degrees F for the loaf"
    },
    {
      "@type": "HowToStep",
      "text": "Add the cashews and sunflower seeds to a food processor with the rest of the nuts and pulse to a somewhat coarse meal with a few chopped size pieces visible."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a skillet over medium heat. Add oil or broth. Add onion, garlic and a pinch of salt and cook for 2 mins. Then add mushrooms and a pinch of salt and cook until some golden edges. 3-4 mins."
    },
    {
      "@type": "HowToStep",
      "text": "Add butternut squash and mix in. Add a splash of water, cover and cook until the squash is tender. Mash and transfer to a bowl. Add in the spices, salt and mix in. Add the chopped nuts and seeds, soy sauce, flax egg mix, breadcrumbs and mix well."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust salt, herbs and flavor. ** The flavor will get more pronounced on baking. If the mixture is too wet, add a tbsp or so flour. You want it to be just slightly sticky. If too dry or crumbly, add a splash of broth. If you like sweeter, profile, add a tbsp of tomato paste or some chopped dried fruit such as dried cranberries or apricots. (this mixture can be used to make burger patties, pan fried or baked. Or can be stuffed into puff pastry for a puff pastry loaf or small hand pies)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to a parchment lined pan. Lightly press to shape and even it out. Do not pack too much. Bake for 25 to 30 mins."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, mix everything under the glaze. Taste and adjust if needed."
    },
    {
      "@type": "HowToStep",
      "text": "Take the loaf out of the oven. Spread the glaze over the loaf and then bake again for 20 to 30 mins. Let cool for 15 mins before removing from the pan. Then cool completely before slicing. Serve with gravy. or cranberry sauce."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://veganricha.com/vegan-meatloaf-nut-loaf"
  ],
  "totalTime": "PT65M",
  "updatedAt": "2022-12-03T22:22:21.342Z"
}
