{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "20",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-02T12:42:27.365Z",
  "datePublished": "2022-04-08T04:26:28+00:00",
  "description": "Gluten free Almond Flour Naan - a delicious Indian flatbread that uses low carb almond flour and pairs perfectly with all Indian food, also a great side to soup or salad. Grainfree Yeast-free Soyfree vegan Indian bread recipe. 14g carbs per naan . No rolling out and kneading the dough needed",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2022/04/Gluten-Free-Vegan-Almond-Flour-Naan-3714.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/04/Gluten-Free-Vegan-Almond-Flour-Naan-3714-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/04/Gluten-Free-Vegan-Almond-Flour-Naan-3714-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2022/04/Gluten-Free-Vegan-Almond-Flour-Naan-3714-480x270.jpg"
  ],
  "keywords": "glutenfree naan, low carb naan, yeast free naan",
  "name": "Vegan Gluten-free Naan Almond flour flatbread",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "178 kcal",
    "carbohydrateContent": "14 g",
    "fatContent": "13 g",
    "fiberContent": "2 g",
    "proteinContent": "4 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "136 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Side",
  "recipeCuisine": "Indian",
  "recipeIngredient": [
    "1 cup almond flour (blanched super fine almond flour)",
    "1/2 cup tapioca starch",
    "1 teaspoon baking powder",
    "1/4 teaspoon salt",
    "1/8 teaspoon garlic powder",
    "1/8 teaspoon black pepper",
    "3 tablespoons non-dairy yogurt (or use coconut cream or cashew cream or thick oat milk )",
    "1 tablespoon oil",
    "1/2 cup non-dairy milk (such as almond milk, oat or light coconut )",
    "2 teaspoons vegan butter (melted )",
    "2 tablespoons chopped cilantro (or minced garlic clove or both )"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a bowl, mix all dry ingredients really well. Press and mix to break all almond flour lumps."
    },
    {
      "@type": "HowToStep",
      "text": "Add in non-dairy yogurt, oil and 1/3 cup non dairy milk and mix well. If the batter is really thick, you can add in milk. 1-2 teaspoons at a time"
    },
    {
      "@type": "HowToStep",
      "text": "Depending on your preference of the naan you can keep the batter slightly thicker than the pancake batter or keep it as thin as the pancake batter."
    },
    {
      "@type": "HowToStep",
      "text": "With a thicker batter you’ll get a fat, bready and fluffy naan. With the pancake consistency batter, you’ll get a thinner bread which will be more pliable and thinner. The batter will be easier to spread on skillet. But it wont be as bready. To begin with, you can keep the batter thick and try small naan and decide by adding more non-dairy milk and try out all the different consistencies before deciding what works for you for the next naan."
    },
    {
      "@type": "HowToStep",
      "text": "Let this batter sit for 10-15 minutes in a warm place."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile heat up a skillet over medium-high heat, if using non stick you don’t really need to use oil. Use a thick bottom skillet. (**If your stove tends to heat too high or your skillet is thin, cook over medium heat). I add a few drops of oil just so that the naan crisps up a little."
    },
    {
      "@type": "HowToStep",
      "text": "Once skillet is hot, reduce heat to medium, then pour about 1/3 cup or more of the batter and spread a little (using a spatula or spoon) in a naan shape, or circle."
    },
    {
      "@type": "HowToStep",
      "text": "Then cover this skillet with a lid and cook for 1-3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Once the top is not that liquid anymore, (it can be slightly liquid in the middle. In general on the edges you want it to be starting to set, just like a pancake), Open the lid and flip. Then increase heat to medium high and cover with the lid and cook for another 1-3 minutes, depending on your skillet."
    },
    {
      "@type": "HowToStep",
      "text": "Once done, remove the lid and take naan off the skillet. Repeat for all batter."
    },
    {
      "@type": "HowToStep",
      "text": "Once naans are done, melt butter and add cilantro to the butter and then brush that melted butter on the naans. You can also add minced small garlic clove to the butter and then brush that over the naans if you’d like."
    },
    {
      "@type": "HowToStep",
      "text": "Bake the Naan: baking makes these flatbreads less pancakes. Make the batter, adjust until it is like pancake batter, spread it on parchment lined baking sheet into ovals or other shapes. Preheat the oven to 425 deg f( 220c). Cover the naans with another parchment. It is ok if the top parchment sticks to the batter. Bake for 7 to 11 mins or until the top is set. Remove the pan. Let the naan cool for a few mins then remove from the parchments. You can sear these naan over a gas flame for a few brown spots and then serve. See my almond flour pizza crust for step pics"
    },
    {
      "@type": "HowToStep",
      "text": "These are best served hot off the skillet.Storage: refrigerate in a closed container for upto 5 days. Reheat in the skillet or toaster"
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://veganricha.com/gluten-free-almond-flour-naan"
  ],
  "totalTime": "PT40M",
  "updatedAt": "2022-12-02T12:42:27.363Z"
}
