{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "7",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT60M",
  "createdAt": "2022-12-01T07:21:09.840Z",
  "datePublished": "2013-11-20T13:46:32+00:00",
  "description": "Use the crispiest French bread you can find or try substituting a whole-grain baguette. Make sure that the bread you use weighs 16 ounces--you may need more than one loaf if your bread is airy. The sauce really adds a lot of \"New Orleans flavor\" to this dessert, but if you can't use alcohol, just leave it out.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2013/11/pumpkin-bread-pudding-fb.jpg"
  ],
  "keywords": "vegan bread pudding",
  "name": "Vegan Pumpkin Bread Pudding",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "315 kcal",
    "carbohydrateContent": "61 g",
    "fatContent": "4 g",
    "fiberContent": "3.6 g",
    "proteinContent": "8.3 g",
    "servingSize": "1 serving",
    "sodiumContent": "405 mg",
    "sugarContent": "24.6 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Louisiana",
  "recipeIngredient": [
    "1 16 ounce loaf French bread",
    "1/2 cup raisins",
    "1 1/2 cup soymilk or other non-dairy milk (vanilla or plain)",
    "1 cup pumpkin (canned or cooked and pureed)",
    "1/4 cup maple syrup",
    "1/4 cup dark brown sugar",
    "1 tablespoon Ener-G Egg Replacer (may substitute 2 1/2 tsp. starch (tapioca, potato, or corn starch) plus 1/2 tsp. baking powder)",
    "2 teaspoons vanilla extract",
    "1 1/2 teaspoon cinnamon",
    "1/2 teaspoon ginger powder",
    "1/2 teaspoon nutmeg",
    "1/4 teaspoon allspice",
    "1/8 teaspoon ground cloves",
    "1/4 teaspoon salt (optional)",
    "1/2 cup apple cider or juice",
    "1 teaspoon cornstarch mixed with 1 tablespoon apple juice",
    "1 1/2 tablespoons brandy, rum, or bourbon (add to taste up to 1/4 cup)",
    "1/4 cup chopped pecans or walnuts (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Cut or tear the bread into bite-sized pieces. If the bread seems moist or dense, spread it out on a cookie sheet and toast it for a few minutes in the oven. Place it in a large bowl and add the raisins."
    },
    {
      "@type": "HowToStep",
      "text": "Put the non-dairy milk into the blender along with the pumpkin, maple syrup, sugar, Ener-G, vanilla, spices, and salt. Blend until smooth. Pour it over the bread, using a silicone spatula to get out every drop. Stir well to completely coat all of the bread. Set aside to soak for a few minutes while you ready the pan and preheat the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 350F. Line an 8x8-inch baking dish with parchment paper or oil lightly. Pour the bread pudding into the pan in an even layer. Bake for about 45 minutes or until top is set and beginning to brown. Remove from oven and allow to cool for at least 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "While the pudding is cooling make the sauce. Place the apple cider and maple syrup in a small saucepan over medium heat, and bring to a simmer, stirring often, until reduced to about half."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully add the cornstarch mixture, bring to a boil, and cook for another couple of minutes, stirring constantly, until mixture is no longer cloudy and thickens slightly. Remove from heat and add the brandy or other spirits a little at a time, to taste. Stir in the nuts. Poke a few holes in the top of the bread pudding with a toothpick, and pour the sauce over the top, distributing nuts evenly. Cut into squares and serve warm."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://blog.fatfreevegan.com/2013/11/vegan-pumpkin-bread-pudding.html"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-12-01T07:21:09.838Z"
}
