{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "113",
    "ratingValue": "4.95"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T10:17:07.165Z",
  "datePublished": "2014-03-18T05:00:56+00:00",
  "description": "10-ingredient vegan, gluten-free gratin loaded with zucchini, asparagus, and onion. So easy, quick, and delicious.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2014/02/Vegan-Zucchini-Gratin-SQUARE.jpg"
  ],
  "keywords": "vegan zucchini gratin",
  "name": "Vegan Zucchini Gratin",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "381 kcal",
    "carbohydrateContent": "22.9 g",
    "fatContent": "27.8 g",
    "fiberContent": "5.9 g",
    "proteinContent": "15.3 g",
    "saturatedFatContent": "4.6 g",
    "servingSize": "1 serving",
    "sodiumContent": "561 mg",
    "sugarContent": "6 g"
  },
  "prepTime": "PT20M",
  "recipeCategory": "Side",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3/4 cup raw cashews",
    "3 Tbsp nutritional yeast",
    "3/4 tsp salt",
    "1/4 tsp garlic powder",
    "2 medium zucchini squash (sliced in thin rounds // I used 1 zucchini, 1 yellow)",
    "1 small bundle asparagus",
    "1/2 medium yellow or white onion (cut into thin rings)",
    "1 pinch each sea salt and black pepper",
    "3/4-1 cup vegan Parmesan cheese",
    "2 1/2 Tbsp olive oil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Prepare vegan parmesan cheese by whirling all ingredients together in a food processor or blender until a fine meal or powder is formed. Don’t over-process or it will begin to get clumpy. Set aside. Will keep covered in the fridge for about a month."
    },
    {
      "@type": "HowToStep",
      "text": "In a 10-inch cast iron or oven safe skillet, sauté onion in 1/2 Tbsp olive oil (as original recipe is written // adjust if altering batch size) over medium-low heat until soft – about 10 minutes – seasoning with a pinch of sea salt and black pepper. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 400 degrees F (204 C)."
    },
    {
      "@type": "HowToStep",
      "text": "Slice squash into very thin slices, about 1/8th-inch thick (see photo). Use mandolin if you have one, or just a sharp knife."
    },
    {
      "@type": "HowToStep",
      "text": "Cup off the top 2-3 inches of the asparagus. That’s the only part you’ll be using. Save the rest for another dish. Carefully split the top portion in half so it nestles into the gratin better (optional)."
    },
    {
      "@type": "HowToStep",
      "text": "Add asparagus and squash to a mixing bowl and top with remaining 2 Tbsp olive oil, 3/4 tsp salt, pinch of black pepper, 1/4 tsp garlic powder (optional), and 2 Tbsp of the vegan parmesan cheese (amounts as original recipe is written // adjust if altering batch size). Toss to coat."
    },
    {
      "@type": "HowToStep",
      "text": "Spread the slightly cooled onions around in the bottom of the skillet to create an even base. Top with squash, layering green and yellow as you go (if you did two colors). It doesn’t have to be perfect. Just start on the outside and work your way in, keeping them in line as much as possible. Once the squash is arranged, tuck pieces of the asparagus into the layers in a circular motion (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Top with an even layer of the vegan parmesan cheese (~3/4 cup // as original recipe is written // adjust if altering batch size) and bake at 400 degrees F (204 C) for 30 minutes. Then broil on high for the last 1-2 minutes to toast up the top (optional, but recommended). Watch closely as it can burn quickly. Let rest for a few minutes before serving."
    },
    {
      "@type": "HowToStep",
      "text": "This makes an excellent side dish, brunch item, or light lunch or dinner when accompanied with a protein, such as hummus, chickpea salad, or scrambled or fried eggs if not vegan. Reheats well in the microwave or the oven."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/vegan-zucchini-gratin"
  ],
  "totalTime": "PT50M",
  "updatedAt": "2022-12-01T10:17:07.164Z"
}
