{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "9",
    "ratingValue": "4.78"
  },
  "author": {
    "@type": "Person",
    "name": "Alissa"
  },
  "cookTime": "PT70M",
  "createdAt": "2022-11-29T11:09:09.027Z",
  "datePublished": "2015-11-02T10:19:43+00:00",
  "description": "This 100% plant-based and junk food free vegan broccoli cheese casserole will knock your socks off! Serve it in place of your favorite traditionally non-vegan side this year. Nobody will know it's vegan!",
  "image": [
    "https://www.connoisseurusveg.com/wp-content/uploads/2015/11/vegan-broccoli-cheese-casserole-featured.jpg"
  ],
  "keywords": "broccoli, rice",
  "name": "Vegan Broccoli Cheese Casserole",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "282 kcal",
    "carbohydrateContent": "42.3 g",
    "fatContent": "7.8 g",
    "fiberContent": "8.9 g",
    "proteinContent": "15.1 g",
    "saturatedFatContent": "1.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "460 mg",
    "sugarContent": "4.7 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Side",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 large baking potato, (about 1 lb, peeled and diced)",
    "1/2 cup chopped carrots, (1 large or 2 small)",
    "2 tbsp. olive oil",
    "1 large onion, (diced)",
    "2 garlic cloves, (minced)",
    "12 oz. button mushrooms, (cleaned, stemmed and coarsely chopped)",
    "2 cups vegetable broth",
    "1/2 cup short or medium grain brown rice",
    "1 large broccoli crown, (broken into small florets (about 4 cups)",
    "1/2 cup nutritional yeast flakes",
    "1 tablespoon lemon juice, (plus more to taste)",
    "2-3 tsp. white miso paste, (optional, but highly recommended)",
    "about 2 cups unflavored soy or almond milk",
    "salt and pepper to taste"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Place potato and carrots into a medium saucepan and cover with water. Bring to a boil. Lower heat and allow to cook at a low boil until tender, about 15 to 20 minutes. Remove from heat and drain into a colander. Transfer to a food processor and blend until completely smooth, stopping to scrape down sides of bowl as needed."
    },
    {
      "@type": "HowToStep",
      "text": "Coat the bottom of a large pot with oil and place over medium heat. Add onion and sauté until softened, about 5 minutes. Add garlic and cook 1 minute more. Add mushrooms, in as even a layer as possible, and allow to cook until slightly browned, about 5 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Add broth and rice to pot. Stir to incorporate. Raise heat and bring to a simmer. Cover and allow to simmer until rice is fully cooked, about 45 minutes. There should be some liquid remaining in the pot when rice is finished cooking."
    },
    {
      "@type": "HowToStep",
      "text": "Uncover pot and stir in potato mixture, broccoli, nutritional yeast, lemon juice and miso, if using. Thin with about 2 cups of milk, using a bit less if mixture seems too thin, more if it seems too thick. Stir and bring to a low simmer. Cook just until broccoli is tender and bright green, about 3 minutes. Season with salt and pepper. Serve."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://connoisseurusveg.com/vegan-broccoli-cheese-casserole"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-11-29T11:09:09.025Z"
}
