{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "26",
    "ratingValue": "4.93"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT10M",
  "createdAt": "2022-12-01T11:43:59.524Z",
  "datePublished": "2015-11-03T05:00:14+00:00",
  "description": "Creamy, flavorful Vegan Queso infused with green chilis for a subtle spice! The perfect plant-based dip for Mexican meals.",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2015/10/Vegan-Green-Chili-Queso-SQUARE.jpg"
  ],
  "keywords": "queso",
  "name": "Vegan Green Chili Queso",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "78 kcal",
    "carbohydrateContent": "7 g",
    "fatContent": "5 g",
    "fiberContent": "0.8 g",
    "proteinContent": "1.5 g",
    "saturatedFatContent": "1.4 g",
    "servingSize": "1 serving",
    "sodiumContent": "231 mg",
    "sugarContent": "1.6 g"
  },
  "prepTime": "PT10M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "3 Tbsp vegan butter (or sub avocado oil)",
    "4 cloves garlic, minced (4 cloves yield ~2 Tbsp or 12 g)",
    "1 serrano pepper (seeds removed and finely chopped)",
    "4 Tbsp unbleached all-purpose flour*",
    "1 3/4 - 2 cups unsweetened plain almond or rice milk",
    "5 Tbsp nutritional yeast (plus more to taste)",
    "1/2 tsp sea salt",
    "1/4 tsp ground cumin",
    "4 Tbsp mild green chilis (divided)",
    "1/2 Tbsp maple syrup or organic cane sugar (or sub other sweetener of choice)",
    "1/4 tsp hot sauce (optional)",
    "Cilantro (chopped)",
    "Red pepper flakes",
    "Tortilla chips"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Heat large skillet or saucepan over medium heat. Once hot, add butter and let it melt and start to sizzle - about 1 minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add minced garlic and serrano pepper and stir. Cook for 1-2 minutes, stirring frequently, then turn down heat if garlic starts to brown too quickly."
    },
    {
      "@type": "HowToStep",
      "text": "Add flour 1 Tbsp at a time and whisk (see notes for flour-free version)."
    },
    {
      "@type": "HowToStep",
      "text": "Cook for 1 minute, then whisk in almond milk 1/2 cup (120 ml) at a time until it no longer looks thick and gloppy - about 1 3/4 cups total (amount as original recipe is written // adjust if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Cook in skillet for 2 minutes, whisking frequently. Then transfer to high speed blender. Add nutritional yeast, salt, cumin, half of the green chilis (2 Tbsp as original recipe is written // adjust if altering batch size), sweetener of choice, and hot sauce (optional). Blend on high until creamy and smooth."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust seasonings as needed, adding more nutritional yeast for extra cheesiness, salt for savoriness, or sweetener for flavor balance."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer back to skillet or saucepan and simmer on low for 5 minutes, whisking or stirring often, to thicken."
    },
    {
      "@type": "HowToStep",
      "text": "Turn off heat and add remaining green chilis (2 Tbsp as original recipe is written // adjust if altering batch size). Stir to combine. Garnish with red pepper flakes and fresh cilantro (optional). Enjoy with chips, or atop Mexican dishes, such as nachos, enchiladas, or tacos!"
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers in a glass jar or container in the refrigerator up to 4-5 days. Reheat in the microwave or in a small saucepan over medium heat. Best when fresh."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/vegan-green-chili-queso"
  ],
  "totalTime": "PT20M",
  "updatedAt": "2022-12-01T11:43:59.522Z"
}
