{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "5",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Vegan Richa"
  },
  "cookTime": "PT16M",
  "createdAt": "2022-12-02T05:00:50.328Z",
  "datePublished": "2021-08-21T04:39:42+00:00",
  "description": "These easy vegan pistachio cookies are  spiced with cardamom and saffron, then topped with slivered almonds! Vegan Nankhatai (Indian shortbread cookies)  ideal for cookie swaps and the holidays.",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2021/07/Pistachio-Cookies-5816.jpg",
    "https://www.veganricha.com/wp-content/uploads/2021/07/Pistachio-Cookies-5816-500x500.jpg",
    "https://www.veganricha.com/wp-content/uploads/2021/07/Pistachio-Cookies-5816-500x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2021/07/Pistachio-Cookies-5816-480x270.jpg"
  ],
  "keywords": "cookies with pistachios, vegan almond flour cookies, vegan pistachio cookies recipe",
  "name": "Vegan Pistachio Cookies",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "83 kcal",
    "carbohydrateContent": "11 g",
    "fatContent": "4 g",
    "fiberContent": "1 g",
    "proteinContent": "1 g",
    "saturatedFatContent": "1 g",
    "servingSize": "1 serving",
    "sodiumContent": "30 mg",
    "sugarContent": "5 g"
  },
  "prepTime": "PT25M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "1 cup flour (I use all purpose)",
    "1/3 cup almond flour",
    "1/8 teaspoon salt",
    "1/4 teaspoon baking soda",
    "1/3 cup raw pistachios",
    "1/2 cup sugar",
    "seeds of 1 or 2 green cardamom pods",
    "4 saffron strands ( or you can use 2 teaspoons of lemon zest)",
    "3 tablespoons neutral oil",
    "2-3 tablespoons non-dairy milk such as almond milk (coconut milk, cashew milk, or soy milk)",
    "almond slivers (or pistachios)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a bowl, add flour, almond flour, salt, and baking soda and mix well."
    },
    {
      "@type": "HowToStep",
      "text": "In a blender with a grinder blade or spice grinder or food processor which can grind the nuts, add the pistachios, sugar, seeds of the cardamom pods, and saffron strands and grind until the mixture is powdery. If using a blender, grind by pulsing it for 10 seconds at a time so that it doesn't become too nut buttery."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer this ground mixture to the bowl and mix well. Then add in the oil and mix in. Add in 2 tablespoons of non dairy milk and mix and then add in milk 1 teaspoon at a time to make a soft dough. A bit sticky is ok."
    },
    {
      "@type": "HowToStep",
      "text": "Bring the mixture together and knead for 5 seconds so that it's homogenous then put this dough in the fridge to chill for at least 15 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 335 degrees Fahrenheit(170c). Remove the dough from the fridge. Using a cookie scoop or a spoon, take about 1 1/2 inch ball worth of dough and make a flat disc, and press it on a parchment-lined baking sheet."
    },
    {
      "@type": "HowToStep",
      "text": "I like to make these cookies just about 1/4 inch thick. Press either a raw pistachio or some almond silvers on top."
    },
    {
      "@type": "HowToStep",
      "text": "The dough is going to be soft and will have more moisture. If it's too sticky, chill it some more. Also the cookies will spread a lot so keep them at least 2 inches apart from each other."
    },
    {
      "@type": "HowToStep",
      "text": "Put the baking sheet in the oven and bake for 15-18 minutes. This will depend on your oven, the tray, and other factors."
    },
    {
      "@type": "HowToStep",
      "text": "As soon as the cookies are getting a bit golden on the edges, they are done. They might be soft to touch but they will continue to harden outside the oven."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the baking sheet from the oven and let it cool for 10 minutes. Then transfer the cookies to a cooling rack and let them cool completely."
    }
  ],
  "recipeYield": "20",
  "sameAs": [
    "https://veganricha.com/pistachio-cookie-recipe"
  ],
  "totalTime": "PT41M",
  "updatedAt": "2022-12-02T05:00:50.327Z"
}
