{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "32",
    "ratingValue": "4.88"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-12-01T07:20:39.740Z",
  "datePublished": "2011-11-28T17:08:00+00:00",
  "description": "These homemade vegetable egg rolls are stuffed full of cabbage, mushrooms, carrots, and more.",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2011/11/Vegetarian2BEgg2BRolls2Bside.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2011/11/Vegetarian2BEgg2BRolls2Bside-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2011/11/Vegetarian2BEgg2BRolls2Bside-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2011/11/Vegetarian2BEgg2BRolls2Bside-480x270.jpg"
  ],
  "name": "Vegetable Egg Rolls",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "238.24 kcal",
    "carbohydrateContent": "44.22 g",
    "fatContent": "3.26 g",
    "fiberContent": "3.6 g",
    "proteinContent": "8.28 g",
    "servingSize": "1 Serving",
    "sodiumContent": "739.13 mg"
  },
  "prepTime": "PT30M",
  "recipeIngredient": [
    "1 Tbsp vegetable oil ($0.08)",
    "1/2 tsp minced garlic ($0.04)",
    "1 inch fresh ginger ($0.12)",
    "4 oz. mushrooms ($0.99)",
    "2 medium carrots ($0.25)",
    "3 medium green onions ($0.23)",
    "1 small head green cabbage ($1.70)",
    "1/4 cup soy sauce ($0.24)",
    "1/2 Tbsp cornstarch ($0.03)",
    "1 tsp sesame oil ($0.12)",
    "1 pkg 20 ea egg roll wrappers ($2.00)",
    "as needed non-stick spray ($0.10)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "First prepare the vegetables. Peel the ginger and grate with a small holed cheese grater. Peel and grate the carrots on a large holed cheese grater. Mince the garlic (if using fresh rather than pre-minced). Clean and slice the green onions and mushrooms. Peel the outer leaves from the cabbage, cut into quarters, remove the core, and then slice thinly into shreds."
    },
    {
      "@type": "HowToStep",
      "text": "In a very large skillet or wok, heat the vegetable oil over medium heat and saute the green onion, garlic, and ginger until slightly softened (1-2 minutes). Add the mushrooms and continue to saute until softened (about 5 minutes). Add the carrot, saute for one minute more, then add the cabbage. Continue to cook and stir until the cabbage has reduced in volume by half (increase the heat to medium-high if necessary)."
    },
    {
      "@type": "HowToStep",
      "text": "Dissolve the cornstarch in the soy sauce. Add that to the skillet and stir to coat the vegetables. The heat will cause the mixture to thicken and create a soy sauce glaze. Drizzle the sesame oil over top and stir in. Turn the heat off. Give the mixture a taste and adjust the soy sauce and sesame oil to your liking. Transfer the mixture to a bowl to cool."
    },
    {
      "@type": "HowToStep",
      "text": "Begin to fill and roll the egg rolls. Place one wrapper at a time on a clean surface and place about 1/4 cup of the cabbage mixture just off center, close to one of the corners on the square. Roll the corner up and over the filling, fold each side in, and then roll the rest of the way up. Keep a small bowl of water near by and use it as “glue” to hold the corners of the egg roll wrapper in place. (See step-by-step photos below)"
    },
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 425 degrees. Prepare a baking sheet by covering with foil. Place the egg rolls on the baking sheet and coat with non-stick spray. Roll them over and coat the other side (you can brush with vegetable oil if you’re opposed to non-stick spray). Bake in the fully preheated oven for about 20 minutes or until golden brown and crispy. Turn the egg rolls over half way through cooking and rotate your baking sheet if you have hot spots in your oven."
    }
  ],
  "recipeYield": "10",
  "sameAs": [
    "https://budgetbytes.com/vegetable-egg-rolls"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-01T07:20:39.738Z"
}
