{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "2",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Oh My Veggies"
  },
  "cookTime": "PT12M",
  "createdAt": "2022-12-03T06:52:17.231Z",
  "datePublished": "2019-04-19T06:00:10+00:00",
  "description": "You&#39;re going to become obsessed with these Vegetarian Mediterranean Calzones! They&#39;re meat-free, easy to make, and absolutely delicious.",
  "image": [
    "https://ohmyveggies.com/wp-content/uploads/2014/04/mediterranean_calzones_5.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2014/04/mediterranean_calzones_5-500x400.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2014/04/mediterranean_calzones_5-500x375.jpg",
    "https://ohmyveggies.com/wp-content/uploads/2014/04/mediterranean_calzones_5-480x270.jpg"
  ],
  "keywords": "how to make Calzones, Vegetarian Calzones, Vegetarian Mediterranean Calzones",
  "name": "Vegetarian Mediterranean Calzones",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "579 kcal",
    "carbohydrateContent": "71 g",
    "cholesterolContent": "68 mg",
    "fatContent": "24 g",
    "fiberContent": "7 g",
    "proteinContent": "27 g",
    "saturatedFatContent": "11 g",
    "servingSize": "1 calzone",
    "sodiumContent": "1508 mg",
    "sugarContent": "2 g",
    "unsaturatedFatContent": "7 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Appetizer",
  "recipeCuisine": "American",
  "recipeIngredient": [
    "32 oz whole wheat pizza dough (split into two balls; I like Trader Joe's refrigerated pizza dough)",
    "2 cups ricotta cheese (whole milk or low-fat works)",
    "1 cup mozzarella cheese (shredded)",
    "1/2 cup feta cheese (crumbled)",
    "1/2 cup artichoke hearts (canned in water; drained and roughly chopped)",
    "1/2 cup roasted red peppers (chopped)",
    "1/3 cup kalamata olives (halved)",
    "1/2 cup pizza sauce (plus more for serving, if desired)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat oven to 450°F. Lightly oil two large rimmed baking sheets and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Cut each ball of pizza dough into equal thirds. Let the dough rest for a few minutes while you prepare your fillings."
    },
    {
      "@type": "HowToStep",
      "text": "In a medium bowl, mix together the ricotta, mozzarella, and feta cheeses until combined. Make sure the rest of your ingredients are ready. (If you still have some chopping to do, now is the time!)"
    },
    {
      "@type": "HowToStep",
      "text": "It's time to assemble the calzones! Place a ball of dough onto a lightly floured board or pastry map and sprinkle the top with a pinch or two of additional flour. Use your fingers to first stretch the dough, and then roll with a rolling pin until you have an 8-inch circle. If the dough shrinks back after rolling, let it rest for 5 minutes and try again."
    },
    {
      "@type": "HowToStep",
      "text": "Now fill your 'zone! Sprinkle a few artichoke pieces, roasted red peppers, and olives on the bottom half of your dough circle, leaving about a 1-inch border between the fillings and the edge. Remember, your fillings need to go into six calzones, so plan accordingly! Now plop about 1/3 cup of the ricotta filling on top of the veggies, and then spoon a line of pizza sauce along the top of the ricotta (it works out to about 1 1/2 tablespoons of sauce per calzone)."
    },
    {
      "@type": "HowToStep",
      "text": "Now it's time to seal this bad boy! Dip your fingers in a bowl of water and wet the edges of the bottom half of the calzone. Fold the top half over the fillings to form a sideways half moon shape and press the edges firmly with your fingers to seal. At this point, you can roll the edges to help form a better seal, or I like to use the tines of a fork to press the edges."
    },
    {
      "@type": "HowToStep",
      "text": "Carefully transfer the calzone to a baking sheet and repeat steps to assemble the remaining calzones."
    },
    {
      "@type": "HowToStep",
      "text": "Once the calzones are lined up on the baking sheets (I can fit 3 calzones per sheet), use a sharp knife to slice a 2-inch slit into the tops of each one. This allows the steam to escape the calzone and helps prevent seeping."
    },
    {
      "@type": "HowToStep",
      "text": "Bake until the dough is golden brown, about 10–12 minutes. Allow to cool for about 5 minutes before serving and serve with additional pizza sauce if using."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://ohmyveggies.com/vegetarian-mediterranean-calzones"
  ],
  "suitableForDiet": [
    "https://schema.org/VegetarianDiet"
  ],
  "totalTime": "PT42M",
  "updatedAt": "2022-12-03T06:52:17.229Z"
}
