{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer  brightside"
  },
  "cookTime": "PT30M",
  "createdAt": "2022-11-22T12:23:57.000Z",
  "datePublished": "2022-08-03",
  "description": "500g of vegetables hidden in the fabulous sauce thanks to Woolworths sample. Sorry I forgot photos til the end but it's pretty self explanatory.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/fpp6epcs8zr3xv75o2gw:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Bolognese",
  "name": "Vegetable Loaded Bolognese Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Lunch,Dinner",
  "recipeCuisine": "Italian",
  "recipeId": "a0K2y0000012fFuEAI",
  "recipeIngredient": [
    "2 onions, diced",
    "2 tbs tomato paste",
    "1 tsp sugar",
    "1 pinch salt",
    "500g mince beef",
    "200g mince pork",
    "1 pack Woolworths simmer vegetables",
    "2 tins tomatoes (i use annalisa)",
    "4 tbs olive oil",
    "24 cups red wine"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add oil to a very large pan, add diced onion and Woolworths Simmer vegetables. Stir for a few minutes, turn heat down to low and put a lid on.Sweat the vegetables gently for about 10 minutes making sure they don't stick or overbrown."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Get another pan, put it on very high heat  DO NOT add any oil.Add 1/2 the pork mince and brown well, set aside, add the rest of the pork and brown, set aside. Do the same for the beef mince in batches."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add tomato paste, anchovies and sugar to the vegetable pan. Stir through and cook off for a couple of minutes.Add tinned tomatoes, chop and stir throughNOTE  I only use Annalisa tinned tomatoes as I think they are far better than any other brands (no they are not Australian) and I always use whole tomatoes and chop them up myself as the quality of whole tinned tomatoes is much better than the diced versions."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Add meat, stir through. Add half the wine/beef stock. Pop a lid on and cook on a low simmer for at least 2 hours (preferably 3).Check liquid levels after an hour and add the rest of the wine/beef stock.Stir again and replace the lid for the rest of the cooking time."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "This makes quite a lot of Bolognese so I separated it into 4 containers and put it in the freezer to use at a later date when I wanted a super quick delicious pasta dinner and voila out of the freezer and onto the spaghetti for a quick delicious dinner"
    }
  ],
  "recipeNameId": "vegetable-loaded-bolognese",
  "recipeYield": "8",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/vegetable-loaded-bolognese"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-11-22T06:42:45.066Z",
  "url": "https://www.woolworths.com.au/shop/recipes/vegetable-loaded-bolognese"
}
