{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "15",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "cookTime": "PT25M",
  "createdAt": "2022-12-03T19:48:22.930Z",
  "datePublished": "2016-05-07T05:00:53+00:00",
  "description": "Easy, 10-ingredient sushi with sticky brown rice and vegetables. Hearty, healthy, and delicious. Methods provided for with and without a sushi mat!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/04/Brown-Rice-Sushi-SQUARE.jpg"
  ],
  "keywords": "brown rice sushi",
  "name": "Veggie Brown Rice Sushi",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "241 kcal",
    "carbohydrateContent": "53 g",
    "fatContent": "2.3 g",
    "fiberContent": "11 g",
    "proteinContent": "10.1 g",
    "servingSize": "1 serving",
    "sodiumContent": "402 mg",
    "sugarContent": "9.3 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Entree",
  "recipeCuisine": "Chinese-Inspired",
  "recipeIngredient": [
    "1 2/3 cups water",
    "1 cup short grain brown rice, rinsed",
    "3 Tbsp rice wine vinegar",
    "2 Tbsp organic cane sugar",
    "1/2 tsp sea salt",
    "4 sheets nori (dried seaweed)",
    "1 roasted or fresh red bell pepper* (sliced)",
    "1 cup thinly sliced carrots",
    "1 cup thinly sliced cucumber",
    "1 cup sprouts (Alfalfa is best)",
    "Tamari (or soy sauce if not gluten-free)",
    "Pickled ginger",
    "Wasabi",
    "Sesame seeds"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a medium saucepan, bring water to a boil then add rice, swirl to coat, and lower heat to low and cover. Simmer until water is completely absorbed and rice is tender – about 18-25 minutes. Drain off any excess water if there is any."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add vinegar, sugar and salt to a small saucepan and heat over medium heat stirring occasionally until sugar and salt are dissolved. Place in a jar or dish and cool in the fridge until rice is ready."
    },
    {
      "@type": "HowToStep",
      "text": "Once the rice is done, kill the heat and add the cooled vinegar mixture and stir with a rubber spatula or fork as to not overmix. It will appear wet but will dry up as you lightly stir to release heat. It should be sticky and completely dry once it’s ready."
    },
    {
      "@type": "HowToStep",
      "text": "While the rice finishes cooking, prep your veggies by chopping them into thin pieces. If they’re too bulky they won’t allow the sushi to roll well."
    },
    {
      "@type": "HowToStep",
      "text": "Now it’s time to roll: Grab your sushi mat and top with a sheet of nori. Using your hands dipped in water (to avoid sticking), pat a very thin layer of rice all over the nori, making sure it’s not too thick or your roll will be all rice and no filling (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Then, arrange a generous serving of your veggies or preferred filling in a line at the bottom 3/4 of the rice closest to you (see photo)."
    },
    {
      "@type": "HowToStep",
      "text": "Start to roll the nori and rice over with your fingers, and once the veggies are covered, roll the mat over to mold and compress the roll. Continue until it’s all the way rolled up. I find slicing with a very sharp serrated knife yields the best results. Repeat until all rice and fillings are used up - about 4 total rolls (amount as original recipe is written // will vary if altering batch size)."
    },
    {
      "@type": "HowToStep",
      "text": "Serve immediately with pickled ginger, tamari or soy sauce, and wasabi. Best when fresh, though leftovers keep covered in the refrigerator up to 2 days."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://minimalistbaker.com/veggie-brown-rice-sushi"
  ],
  "totalTime": "PT55M",
  "updatedAt": "2022-12-03T19:48:22.929Z"
}
