{
  "@type": "Recipe",
  "cookTime": "PT30M",
  "createdAt": "2022-11-22T03:25:48.899Z",
  "datePublished": "2021-05-18",
  "description": "Try our easy to follow Velvety Chocolate Tarts recipe. Absolutely delicious with the best ingredients from Woolworths.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/2103-velvety-chocolate-tarts:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Chocolate pie & tart,Chocolate",
  "name": "Velvety Chocolate Tarts Recipe | Woolworths",
  "prepTime": "PT40M",
  "recipeCategory": "Snacks,Desserts",
  "recipeCuisine": "Australian",
  "recipeId": "11219",
  "recipeIngredient": [
    "1 cup plain flour (plus extra for dusting)",
    "0.25 cup pure icing sugar",
    "0.25 cup cocoa powder",
    "1 pinch salt",
    "100g Western Star Chef’s Choice Butter, chilled, chopped",
    "mini speckled chocolate eggs (to decorate)",
    "175g Cadbury Dark Chocolate Melts",
    "175g Cadbury Milk Chocolate Melts",
    "300ml tub thickened cream",
    "50g Western Star Chef’s Choice Butter, chopped"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place flour, sugar, cocoa, salt and butter in a food processor. Process until mixture resembles fine breadcrumbs. Gradually add 1 tbs iced water and process until mixture just comes together. Turn dough out onto a lightly floured surface. Knead until just smooth. Divide into 6 portions and shape into discs. Wrap in baking paper and refrigerate for 15 minutes to rest."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Meanwhile, to make the chocolate filling, place melts in a heatproof bowl. Heat cream and butter in a small saucepan over medium heat for 4 minutes or until cream just starts to simmer and butter has melted. Pour butter mixture over chocolate and stir until smooth and combined. Refrigerate for 1 hour 15 minutes or until ganache thickens."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 200°C/180°C fanforced. Grease 6 x 10.5cm (2cm deep) loose-based fluted tart pans. Roll out 1 portion of dough between 2 sheets of baking paper until large enough to line base and side of 1 pan. Line pan with pastry, then trim dough. Repeat using remaining dough to line 6 pans. Prick bases several times with a fork. Refrigerate for 30 minutes."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place pans on a large baking tray. Line pastry cases with baking paper. Fill with ceramic pie weights or uncooked rice. Bake for 15 minutes. Remove weights and paper. Bake for a further 10 minutes or until pastry is cooked through. Set aside in pans to cool completely."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {
        "tipText": "For a smoother top, pour warm ganache into cooked pastry cases, then refrigerate until slightly firm. For a sweeter tart, replace dark chocolate melts with milk chocolate melts. Using only dark chocolate will give a more bitter chocolate flavour.\n"
      },
      "text": "Stir ganache until smooth. Spoon ganache into pastry cases creating a swirled effect. Refrigerate for 1 hour or until set. Remove tarts from pans. Top with chocolate eggs. Serve."
    }
  ],
  "recipeNameId": "velvety-chocolate-tarts",
  "recipeYield": "6",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/velvety-chocolate-tarts"
  ],
  "totalTime": "PT70M",
  "updatedAt": "2022-11-22T03:25:48.898Z",
  "url": "https://www.woolworths.com.au/shop/recipes/velvety-chocolate-tarts"
}
