{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "1",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Kiersten"
  },
  "createdAt": "2022-12-01T05:54:26.488Z",
  "datePublished": "2017-03-18T13:00:00+00:00",
  "description": "Reprinted from The First Mess Cookbook by arrangement with Avery Books, a member of Penguin Group (USA) LLC, A Penguin Random House Company. Copyright © 2017, Laura Wright",
  "image": [
    "https://helloveggie.co/wp-content/uploads/2017/03/Weeknight-Root-Vegetable-Dal.jpg"
  ],
  "name": "Weeknight Root Vegetable Dal",
  "recipeIngredient": [
    "1 cup 250 mL red split lentils, rinsed",
    "1 cup 250 mL finely diced root vegetables of your choice, such as carrots, celery root, and beets",
    "1 small yellow onion (finely diced)",
    "1 cup 250 mL cherry or grape tomatoes, halved",
    "4 cloves garlic (minced)",
    "2- inch 5 cm piece of fresh ginger, peeled and minced",
    "1 teaspoon 5 mL ground turmeric",
    "pinch of dried chili flakes",
    "3 1/2 cups 875 mL filtered water",
    "salt and pepper (to taste)",
    "2 tablespoons 30 mL virgin coconut oil",
    "1/2 teaspoon 2 mL cumin seeds",
    "1/2 teaspoon 2 mL coriander seeds",
    "1/2 teaspoon 2 mL mustard seeds",
    "1/3 cup 75 mL chopped fresh cilantro leaves, for garnish",
    "lemon wedges (for serving)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "To a medium soup pot, add the rinsed lentils, diced root vegetables, diced onion, tomatoes, garlic, ginger, turmeric, and chili flakes. Pour the water into the pot and give everything a little stir."
    },
    {
      "@type": "HowToStep",
      "text": "Place the pot on the stove over medium heat. Bring to a boil and then simmer for about 40 minutes, whisking the dal often. Toward the end, the lentils should be completely broken down. In the last 10 minutes of cooking, whisk the dal vigorously to encourage the breaking down of the lentils. It should appear quite soupy. Season the dal generously with salt and pepper. Keep warm."
    },
    {
      "@type": "HowToStep",
      "text": "Heat the coconut oil in a small sauté pan over medium-high heat. Add the cumin seeds, coriander seeds, and mustard seeds. Once the seeds are fragrant and popping, remove from the heat."
    },
    {
      "@type": "HowToStep",
      "text": "Gently spoon the toasted spice oil (with the whole spices) on top of the dal. You can lightly stir it in if you like. You can also portion the dal out first and then spoon the spice oil on top if you like. Garnish the dal with the chopped cilantro. Serve the dal hot with lemon wedges."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://helloveggie.co/weeknight-root-vegetable-dal"
  ],
  "updatedAt": "2022-12-01T05:54:26.487Z"
}
