{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "4",
    "ratingValue": "5"
  },
  "author": {
    "@type": "Person",
    "name": "Susan Voisin"
  },
  "cookTime": "PT50M",
  "createdAt": "2022-12-02T01:12:27.935Z",
  "datePublished": "2013-10-22T13:21:55+00:00",
  "description": "The time it takes to cook beans is affected by the type and age of the beans and possibly the hardness of your water and your elevation. I made this in the Fagor Multi-Cooker pressure cooker using yellow-eye beans, so the times below reflect that. You may need to add a few more minutes to get the beans fully cooked. If you’re not using a pressure cooker, see the instructions in bold.",
  "image": [
    "https://blog.fatfreevegan.com/wp-content/uploads/2013/10/white-beans-butternut-kale-stew-fb.jpg"
  ],
  "keywords": "instant pot, porotos granados, white bean stew",
  "name": "White Bean Stew with Winter Squash and Kale",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "383 kcal",
    "carbohydrateContent": "74.3 g",
    "fatContent": "2.3 g",
    "fiberContent": "24.3 g",
    "proteinContent": "25 g",
    "servingSize": "1 serving",
    "sodiumContent": "589.7 mg",
    "sugarContent": "9.9 g"
  },
  "prepTime": "PT30M",
  "recipeCategory": "Main Course",
  "recipeCuisine": "South American",
  "recipeIngredient": [
    "1 pound dried yellow-eye or navy beans (soaked overnight or quick soaked)",
    "1 large onion (chopped)",
    "4 cloves garlic (minced)",
    "5 cups water",
    "4 teaspoons smoked paprika (divided)",
    "2 teaspoons dried oregano (divided)",
    "1 1/2 teaspoon ground cumin (divided)",
    "1 teaspoon dried basil",
    "1 pound winter squash or pumpkin (peeled and cut into 3/4-inch dice (I used butternut)",
    "1 large red bell pepper (chopped)",
    "1 jalapeño pepper (optional, seeded and finely chopped)",
    "1 15-ounce can diced tomatoes (fire-roasted preferred)",
    "1 teaspoon salt (or to taste)",
    "1 bunch kale (removed from stems and sliced (about 12 ounces,)",
    "1 cup fresh or frozen corn (optional)",
    "1/2 cup chopped fresh basil"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Make sure to rinse your beans first and check for rocks and then soak overnight in cold water. Or do a quick soak by boiling the beans in enough water to cover by an inch for one minute, and then cover and allow to stand for at least an hour. Drain before proceeding with the recipe."
    },
    {
      "@type": "HowToStep",
      "text": "Heat a pressure cooker or large Dutch oven. (In an electric pressure cooker like the Instant Pot, use the Sauté or Brown setting.) Add the onions and a pinch of baking soda (optional but speeds up the browning). Cook until onion is soft and beginning to brown. Add the garlic and cook for another minute."
    },
    {
      "@type": "HowToStep",
      "text": "Add the beans, water, 2 teaspoons paprika, 1 teaspoon oregano, 1 teaspoon cumin, and dried basil to the pot. If pressure cooking, seal your cooker and bring to high pressure. Cook at high pressure for 8 minutes; then perform a quick release. (Choose the Pressure Cooker or Manual setting on your electric pressure cooker and set the time to 8 minutes; release the steam when the time is up.) If cooking in a regular pot, bring to a boil, reduce heat to a simmer, cover and cook until beans are just barely cooked all the way through, 30 minutes to 1 1/2 hours. Check pot occasionally and add more water to cover the beans if it seems low."
    },
    {
      "@type": "HowToStep",
      "text": "Add the squash along with the remaining seasonings, peppers, tomatoes, and salt, if using. Seal the cooker and cook at high pressure for 8 more minutes. Let pressure come down naturally; after 15 minutes, quick release pressure if necessary. For stovetop cooking, add more water if necessary to cover all ingredients. Cover and simmer until beans and squash are very tender."
    },
    {
      "@type": "HowToStep",
      "text": "Check the seasoning and add more cumin, oregano, or salt to taste. Add the kale and corn and simmer, covered, until the kale is tender. Stir in the basil and cook for another minute before serving."
    }
  ],
  "recipeYield": "6",
  "sameAs": [
    "https://blog.fatfreevegan.com/2013/10/white-bean-stew-with-winter-squash-and-kale.html"
  ],
  "totalTime": "PT80M",
  "updatedAt": "2022-12-02T01:12:27.934Z"
}
