{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "10",
    "ratingValue": "4.8"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-05T20:36:39.870Z",
  "datePublished": "2017-04-13T05:00:05+00:00",
  "description": "Easy, vegan peanut butter eggs coated in a white chocolate shell! 7 ingredients, naturally sweetened, perfect for Easter and beyond!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2017/02/Peanut-Butter-Eggs-White-Chocolate-SQUARE.jpg"
  ],
  "keywords": "peanut butter eggs",
  "name": "White Chocolate Peanut Butter Eggs",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "243 kcal",
    "carbohydrateContent": "10.4 g",
    "fatContent": "21.2 g",
    "fiberContent": "2.8 g",
    "proteinContent": "6.2 g",
    "saturatedFatContent": "7.4 g",
    "servingSize": "1 \"eggs\"",
    "sodiumContent": "86 mg",
    "sugarContent": "6.1 g"
  },
  "prepTime": "PT45M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup creamy salted peanut butter* (just peanuts + salt)",
    "2-4 Tbsp maple syrup (or other sweetener to taste, i.e. stevia or organic powdered sugar)",
    "2/3 - 1 cup almond meal or flour*",
    "1/2 cup raw macadamia nuts",
    "1 1/2 cups desiccated unsweetened coconut",
    "1/4 cup chopped cocoa butter",
    "1-3 Tbsp maple syrup (or other sweetener to taste, i.e. stevia or powdered sugar)",
    "1/2 tsp vanilla extract",
    "1 pinch sea salt (optional)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Add peanut butter to a medium mixing bowl along with maple syrup and stir to combine. This should thicken the peanut butter, depending on the quality/brand of peanut butter you're using."
    },
    {
      "@type": "HowToStep",
      "text": "Add almond meal according to how thick the mixture is. If still runny, you may need to add 1 cup (or slightly more). If thick, start with 2/3 cup (amounts as original recipe is written // adjust if altering batch size). You're going for a thick, moldable dough that's still moist."
    },
    {
      "@type": "HowToStep",
      "text": "Use a cookie scoop or Tablespoon (I like this scoop) to scoop out rounded Tablespoon amounts (see photo) and gently form into a disc/egg shape. Set on a parchment-lined dish or baking sheet and continue until all dough is formed - about 14-15 eggs (amount as original recipe is written)."
    },
    {
      "@type": "HowToStep",
      "text": "Transfer to the freezer to chill while making the white chocolate shell."
    },
    {
      "@type": "HowToStep",
      "text": "Add macadamia nuts and desiccated coconut to a food processor and blend/mix on high until a smooth paste forms, scraping down sides as needed. Then add melted cocoa butter, maple syrup (or powdered sugar), vanilla, and sea salt (optional). Mix once more to combine."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor as needed, adding more maple syrup (or powdered sugar) for sweetness, vanilla for vanilla flavor, or salt for saltiness. Set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Once the peanut butter eggs are slightly firm to the touch, remove from freezer and use a spoon or a fork to gently dip the eggs in white chocolate, making sure all sides are coated. Then tap off excess and return to parchment-lined dish or baking sheet. Repeat until all eggs are dipped. Then place the eggs back in the freezer to set."
    },
    {
      "@type": "HowToStep",
      "text": "Once the shell is firm to the touch, remove from freezer and dip the eggs once more (repeating the process above). This makes the shell more opaque and thick, which makes the eggs easier to handle and package. Then place back in the freezer to set once more."
    },
    {
      "@type": "HowToStep",
      "text": "Enjoy immediately! Store in the refrigerator up to 1 week or in the freezer up to 1 month."
    }
  ],
  "recipeYield": "14",
  "sameAs": [
    "https://minimalistbaker.com/white-chocolate-peanut-butter-eggs"
  ],
  "totalTime": "PT45M",
  "updatedAt": "2022-12-05T20:36:39.869Z"
}
