{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "18",
    "ratingValue": "4.62"
  },
  "author": {
    "@type": "Person",
    "name": "Minimalist Baker"
  },
  "createdAt": "2022-12-06T02:43:08.546Z",
  "datePublished": "2016-04-30T05:00:47+00:00",
  "description": "10-ingredient vegan cheesecake infused with cocoa butter and macadamia nuts. Creamy and rich center with crunchy macadamia nuts throughout. A naturally sweetened dessert that's created entirely in the blender!",
  "image": [
    "https://minimalistbaker.com/wp-content/uploads/2016/03/White-Chocolate-Macadamia-Nut-Cheesecake-SQUARE.jpg"
  ],
  "keywords": "white chocolate cheesecake",
  "name": "White Chocolate Macadamia Nut Cheesecake",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "546 kcal",
    "carbohydrateContent": "46 g",
    "fatContent": "40 g",
    "fiberContent": "6 g",
    "proteinContent": "9.2 g",
    "saturatedFatContent": "8.9 g",
    "servingSize": "1 slices",
    "sodiumContent": "8 mg",
    "sugarContent": "31 g"
  },
  "prepTime": "PT360M",
  "recipeCategory": "Dessert",
  "recipeCuisine": "Gluten-Free",
  "recipeIngredient": [
    "1 cup packed medjool dates (pitted before measuring // ~20 dates per 1 cup)",
    "1 cup raw walnuts",
    "1/2 cup roasted unsalted macadamia nuts",
    "1/4 tsp sea salt (optional)",
    "1 1/2 cups raw cashews (soaked overnight in cool water, or in very hot water for 1 hour)",
    "1 1/2 tsp vanilla extract",
    "1/4 cup light or full-fat coconut milk (full fat for creamier texture)",
    "2 Tbsp olive oil (or sub melted coconut oil, though it will infuse coconut flavor)",
    "1/2 cup maple syrup, agave, or honey if not vegan (use less for a more tart cheesecake)",
    "1/3 cup cocoa butter",
    "1-2 tsp lemon juice (for “cheesy” tang // or sub apple cider vinegar)",
    "1/2 cup chopped roasted unsalted macadamia nuts",
    "Roasted unsalted macadamia nuts (chopped)",
    "Coconut whipped cream",
    "Toasted coconut flakes"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Soak cashews by adding to a small mixing bowl and covering with boiling hot water. Let sit uncovered for 1 hour."
    },
    {
      "@type": "HowToStep",
      "text": "In the meantime, add dates to a blender and mix until small bits remain or it forms into a ball. Remove and set aside."
    },
    {
      "@type": "HowToStep",
      "text": "Next, add walnuts, macadamia nuts, and salt (optional) and process into a meal. Then add dates back in and blend until a loose dough forms - it should stick together when you squeeze a bit between your fingers. If it's too dry, add a few more dates through the spout while processing. If too wet, add more nuts."
    },
    {
      "@type": "HowToStep",
      "text": "For serving dishes you have several options - muffin tins, ramekins (like these), or a springform pan of your choice. With whatever option you choose, be sure to line with parchment paper for easy removal."
    },
    {
      "@type": "HowToStep",
      "text": "For the ramekins shown above, cut out parchment paper into circles the shape of your ramekins, as well as two thick strips of parchment paper per ramekin and lay them in an \"X\" shape at the base. Top with circle shape. This creates little tabs that make removing the cheesecakes easier to pop out once set."
    },
    {
      "@type": "HowToStep",
      "text": "Divide crust among ramekins and carefully press with fingers to distribute. To pack it down, use a small glass lined with parchment paper (or the back of a spoon) to and really press it down, allowing some crust to come up the sides. Set in the refrigerator or freezer to firm up."
    },
    {
      "@type": "HowToStep",
      "text": "Add soaked drained cashews, vanilla extract, coconut milk, olive oil, maple syrup, melted cocoa butter, lemon juice, and sea salt (optional) to the blender and mix until very smooth - up to 2-3 minutes - scraping down sides as needed. If it won't come together, add a touch more lemon juice, maple syrup/agave or a splash more coconut milk as the liquid should help it blend better."
    },
    {
      "@type": "HowToStep",
      "text": "Taste and adjust flavor/sweetness as needed, adding more melted cocoa butter for chocolate flavor, lemon juice for brightness, salt for flavor balance, or maple syrup for sweetness."
    },
    {
      "@type": "HowToStep",
      "text": "Add a small handful of macadamia nuts to the crust ramekins (see photo), then divide filling evenly among the ramekins (or other serving dish). Tap a few times to release any air bubbles, then top with a few more macadamia nuts and cover loosely with plastic wrap."
    },
    {
      "@type": "HowToStep",
      "text": "Freeze until set - about 4-6 hours depending on size of dish. Once set, run a butter knife along the edge and gently remove by tugging on the tabs in an upward motion. They should pop right out. If they aren't quite set, pop them in the freezer for 15-20 minutes and they should come out easily."
    },
    {
      "@type": "HowToStep",
      "text": "To serve, slice and enjoy as is, or top with a touch of coconut whipped cream, toasted coconut, macadamia nuts, and fresh berries."
    },
    {
      "@type": "HowToStep",
      "text": "Store leftovers in a well-covered dish in the refrigerator up to a few days or in the freezer up to 2-3 weeks."
    }
  ],
  "recipeYield": "8",
  "sameAs": [
    "https://minimalistbaker.com/white-chocolate-macadamia-nut-cheesecake"
  ],
  "totalTime": "PT360M",
  "updatedAt": "2022-12-06T02:43:08.545Z"
}
