{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Customer  wambam31"
  },
  "cookTime": "PT75M",
  "createdAt": "2022-11-22T21:27:26.730Z",
  "datePublished": "2022-09-26",
  "description": "Delicious and easy twist on a family classic.",
  "image": {
    "@type": "ImageObject",
    "height": 1300,
    "mime": "image/jpeg",
    "url": "https://foodhub.scene7.com/is/image/woolworthsltdprod/cv7y6u8bdsddwdsdduwn:Square-1300x1300",
    "width": 1300
  },
  "keywords": "Chicken dishes,Chicken,Seafood free,Roast chicken,Wheat free",
  "name": "Whole Roast Butter Chicken Recipe | Woolworths",
  "prepTime": "PT15M",
  "recipeCategory": "Dinner",
  "recipeCuisine": "Australian",
  "recipeId": "a0K2y0000017AlSEAU",
  "recipeIngredient": [
    "1 whole chicken (I got macro chicken from woolworths)",
    "1 handful dried cranberries",
    "1 pkt butter chicken sauce (i grabbed the passage to india packet)",
    "2 carrots",
    "0.5 head cauliflower",
    "5 baby potatoes (1 per person plus an extra)",
    "1 can chickpeas",
    "1 bunch coriander",
    "2 tbs sour cream",
    "1 lemon",
    "1 drizzle olive oil",
    "1 pinch salt (to season)",
    "1 pinch pepper (to season)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Preheat oven to 180°C. Cut the baby potatoes in half, and trim the cauliflower florets to approx. the same size as the potato pieces."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cut carrots into sticks (any shape really so long as they are a good size to cook in the same time as the other vegetables, I prefer sticks). Drain and rinse the chickpeas. Then mix 2 tablespoons of the butter chicken sauce through the chick peas and set aside."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Tip out any water/juices from inside the chicken. and pat dry with paper towel. Put some of the butter chicken sauce inside the chicken and coat the chicken skin (both top and underneath) in the butter chicken sauce. Get into all the little crevices. Season with salt and pepper."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Place the chicken directly on the top rack of your oven. Add a drizzle of olive oil to a baking tray. Then add your potato, cauliflower, carrots, and chickpeas. Mix to coat and to ensure that the vegetables are mixed evenly."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Top vegetables with a handful of coriander leaves, and salt and pepper and place in oven directly under the chicken so it catches any drips from the chicken."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Cook for approx 1 hour depending on the size of your chicken. Mine took 1 hour and 15 minutes. At the halfway point, turn the vegetables and check chicken. At this point the wings were getting a bit toasted so I covered in foil."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "When the chicken and vegetables are cooked, place the vegetables onto a serving dish and place the chicken on top. Let the chicken rest for 5 minutes. The resting juices will fall into your vegetables below."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "While the chicken is resting, mix sour cream and lemon juice together to make a sauce. Add salt and pepper to taste."
    },
    {
      "@type": "HowToStep",
      "HowToTip": {},
      "text": "Top the entire dish (chicken and vegetables) with a drizzle of the sour cream sauce, some more coriander leaves and the dried cranberries. Carve and serve at the table"
    }
  ],
  "recipeNameId": "whole-roast-butter-chicken",
  "recipeYield": "5",
  "sameAs": [
    "https://woolworths.com.au/shop/recipes/whole-roast-butter-chicken"
  ],
  "totalTime": "PT90M",
  "updatedAt": "2022-11-22T21:27:26.729Z",
  "url": "https://www.woolworths.com.au/shop/recipes/whole-roast-butter-chicken"
}
