{
  "@type": "Recipe",
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingCount": "14",
    "ratingValue": "4.72"
  },
  "author": {
    "@type": "Person",
    "name": "Beth - Budget Bytes"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T20:38:41.816Z",
  "datePublished": "2013-06-16T17:34:18+00:00",
  "description": "This salad has everything you need in one bowl - greens, beans, and vegetables. Serve it as a side or a larger portion for a hearty vegan meal.",
  "image": [
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Kale-Lentil-Salad-big-1.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Kale-Lentil-Salad-big-1-500x480.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Kale-Lentil-Salad-big-1-500x375.jpg",
    "https://www.budgetbytes.com/wp-content/uploads/2013/06/Kale-Lentil-Salad-big-1-480x270.jpg"
  ],
  "name": "Wilted Kale and Lentil Salad",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "355.63 kcal",
    "carbohydrateContent": "42.08 g",
    "fatContent": "15.95 g",
    "fiberContent": "7.48 g",
    "proteinContent": "13.85 g",
    "servingSize": "1 Serving",
    "sodiumContent": "292.93 mg"
  },
  "prepTime": "PT30M",
  "recipeIngredient": [
    "1 medium sweet potato ( $0.91)",
    "1 medium red onion ($1.49)",
    "1/4 cup olive oil, divided ($0.64)",
    "salt & pepper to taste ($0.05)",
    "1 cup brown lentils ($0.31)",
    "1 bunch curly leaf kale ($1.19)",
    "1 clove garlic ($0.08)",
    "1 tsp ground cumin ($0.05)",
    "1/2-1 Tbsp apple cider vinegar ($0.06)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Preheat the oven to 400 degrees. Peel the sweet potato and then cut it into one-inch cubes. Cut the red onion into thick strips."
    },
    {
      "@type": "HowToStep",
      "text": "Place the sweet potato cubes and red onion slices onto a baking sheet covered with foil. Drizzle 2 tablespoons of olive oil over top and then toss the vegetables to coat. Sprinkle a small amount of salt and pepper over top. Roast the vegetables for 45 minutes, or until they are tender and the edges are slightly brown."
    },
    {
      "@type": "HowToStep",
      "text": "Meanwhile, bring a medium sauce pot of water to a rolling boil over high heat. Measure out one cup of brown lentils and then sort through them to remove any stones or debris. Once the water reaches a full boil, add the lentils. Allow the pot to come back up to a boil, then reduce the heat to medium low and let it continue to simmer for 20 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Use a fork to retrieve a couple lentils and then taste them to make sure they are tender. Once they are tender, drain the lentils in a colander. You can return the lentils to the pot, with the heat turned off, until ready to use."
    },
    {
      "@type": "HowToStep",
      "text": "Pull the kale leaves from their woody stems and tear them into bite-sized pieces. Rinse the kale well in a colander."
    },
    {
      "@type": "HowToStep",
      "text": "Mince a clove of garlic and add it to a large pot along with the remaining 2 tablespoons of olive oil. Cook the garlic over medium-low heat for about two minutes, or until it is slightly softened. Add the rinsed kale leaves and saute just until the kale is about half way wilted (or wilted to your liking)."
    },
    {
      "@type": "HowToStep",
      "text": "Once the kale is wilted to the point that you like, turn the heat off. Add the drained lentils and the roasted sweet potato and red onion. Toss until everything is combined."
    },
    {
      "@type": "HowToStep",
      "text": "Either add a dijon vinaigrette or add the cumin, cider vinegar, and some salt and pepper to taste. Start with just a half tablespoon of cider vinegar and add more if desired. Toss the salad to distribute the dressing or seasonings, and then serve."
    }
  ],
  "recipeYield": "4",
  "sameAs": [
    "https://budgetbytes.com/wilted-kale-and-lentil-salad"
  ],
  "totalTime": "PT75M",
  "updatedAt": "2022-12-02T20:38:41.815Z"
}
