{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Kittee Berns"
  },
  "cookTime": "PT45M",
  "createdAt": "2022-12-02T05:41:55.213Z",
  "datePublished": "2015-03-15T16:02:38+00:00",
  "description": "Ye'difin Misser Alicha - Lentils in Garlic-Ginger Sauce. Easy Ethiopian Lentils. Vegan Gluten-free Soy-free Recipe",
  "image": [
    "https://www.veganricha.com/wp-content/uploads/2015/03/teff-love-6845-300x449-1.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/03/teff-love-6845-300x449-1-300x375.jpg",
    "https://www.veganricha.com/wp-content/uploads/2015/03/teff-love-6845-300x449-1-300x270.jpg"
  ],
  "name": "Ye'difin Misser Alicha - Lentils in Garlic-Ginger Sauce Recipe.",
  "nutrition": {
    "@type": "NutritionInformation",
    "calories": "369 kcal",
    "carbohydrateContent": "32 g",
    "fatContent": "21 g",
    "fiberContent": "14 g",
    "proteinContent": "12 g",
    "saturatedFatContent": "3 g",
    "servingSize": "1 serving",
    "sodiumContent": "198 mg",
    "sugarContent": "1 g"
  },
  "prepTime": "PT15M",
  "recipeCategory": "Soup",
  "recipeCuisine": "ethiopian",
  "recipeIngredient": [
    "1 cup dried green or brown lentils",
    "6 cups water",
    "1/4 onion (minced ( 1/2 cup)",
    "3 tablespoons Ye’qimem Zeyet (page 25 or extra-virgin olive oil)",
    "1/2 teaspoon salt (plus more if desired)",
    "6 cloves garlic (pressed or grated (1 tablespoon)",
    "2 teaspoons peeled and grated fresh ginger",
    "6 fresh basil leaves (optional)",
    "1/2 teaspoon ground turmeric",
    "1 1/2 cups reserved lentil cooking water or Sleepy Vegetable Stock (page 38, plus more if desired)",
    "1 to 2 jalapeno chiles (seeded, veined, and sliced into thin half-moons)"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Put the lentils and water in a large saucepan and bring to a boil over high heat. Stir to keep the lentils from sticking to the bottom of the pot. Decrease the heat to medium-high and simmer, skimming off and discarding any foam that forms with a large spoon. Cook uncovered, stirring occasionally, until the lentils are tender but still firm, 10 to 12 minutes. Drain the lentils and reserve 2 cups of the cooking water."
    },
    {
      "@type": "HowToStep",
      "text": "While the lentils cook, put the onion, Ye’qimem Zeyet, and salt in a large saucepan and cook over medium heat, stirring frequently, until soft and translucent (don’t let the onion brown), about 7 minutes. Add the garlic, ginger, optional basil, and turmeric and cook, stirring almost constantly, for 3 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Stir in the drained lentils and 1 1/2 cups of the reserved cooking water. Increase the heat to high and bring to a boil. Decrease the heat to medium and simmer uncovered, stirring frequently, until the lentils are very soft but not mushy and the liquid has reduced and thickened, 10 to 15 minutes. Add the jalapeno chiles during the last 5 minutes of cooking. If the mixture is too thick, add up to 1/2 cup additional lentil cooking water as needed to thin. Season to taste with additional salt if desired. Discard the basil before serving."
    }
  ],
  "recipeYield": "2",
  "sameAs": [
    "https://veganricha.com/yedifin-misser-alicha-lentils-in-garlic-ginger-sauce"
  ],
  "totalTime": "PT60M",
  "updatedAt": "2022-12-02T05:41:55.212Z"
}
